	{
		"id": 100 ,
		"titulo": "caracterização de cavidade ressonante fotônica",
		"autor": "jorge l. bezerra da silva, janderson r. rodrigues, liangrid lutiani silva, william s. fegadolli e vilson r. almeida",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2016/st/ST_03_1.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 2,
		"resumo": "Este artigo apresenta os resultados experimentais de uma cavidade ressonante em anel integrada de 10 μm de raio. Usou-se um laser sintonizável para traçar a resposta espectral dessa estrutura e medir suas principais figuras de mérito, tais como o FSR (Free Spectral Range – Faixa Espectral Livre) e o fator de qualidade Q para determinadas ressonâncias. Mediu-se, ainda, a variação de fase e, por conseguinte, o atraso de grupo, de 111 ps, de um sinal de RF modulante de 1 GHz em uma ressonância óptica em 1553.5 nm. Esses resultados foram devidamente comparados com os modelos teóricos descritos no corpo deste artigo, bem como com simulações computacionais.",
		"texto": " I. INTRODUÇÃO Uma das principais buscas no campo da fotônica atualmente é pela capacidade de integração de elementos, sejam estes passivos ou ativos, em circuitos integrados (chips). Tal integração potencializa as já consagradas características dos sistemas fotônicos, como a grande largura de banda (da ordem de terahertz - THz), baixa sensibilidade à interferência eletromagnética e grande capacidade de sintonia e reconfiguração. Uma das tecnologias que permitem uma grande densidade de integração é a conhecida SOI (Siliconon-Insulator), que provê um forte confinamento óptico devido ao grande contraste nos índices de refração entre silício (nSi = 3,48) e dióxido de silício SiO2 (nSiO2 = 1,46) [1]. Outra característica importante, sobretudo em se tratando de tecnologias espaciais, diz respeito ao baixo consumo de energia. Um trabalho recente reporta uma cavidade ressonante sintonizável com um consumo de 3,4 pJ em uma área de integração de apenas 1600 μm² [2]. Cavidades ressonantes são estruturas que podem ser utilizadas como filtros ou como linhas de retardo [3][4]. Suas funções de transferência apresentam uma faixa de seletividade na ressonância, a qual é quantificada pelo fator de qualidade Q. Existem diversos tipos de arquitetura de cavidades ressonantes fotônicas, sendo as principais as que se constituem de um guia de onda dielétrico reto e um circular (all pass filter – filtro passa tudo), ou com dois guias retos e um circular (channel drop filter – filtro rejeita faixa). Os sistemas WDM (Wavelength Division Multiplexing – Multiplexação por Divisão de Comprimento de Onda) e DWDM (Dense Wavelength Division Multiplexing – WDM denso) são exemplos de sistemas que necessitam de filtros fotônicos para funcionarem satisfatoriamente. Nesses sistemas, o espectro óptico é dividido em canais espaçados de aproximadamente 0,8 nm para o WDM, e de apenas 0,1 nm para o DWDM [5]. Uma filtragem eficiente, portanto, é fundamental para que não ocorra interferência entre canais contíguos nesses sistemas de telecomunicações. Outros campos que têm procurado se beneficiar da fotônica são os sistemas Radar e de antenas de varredura eletrônica (PAA – Phased Array Antenna). Recentemente, tem havido muitos esforços de pesquisa no conceito do Radar Fotônico [6], buscando-se uma plataforma multifunção, em que a filtragem faz parte de seu processamento. A principal característica desses Radares será a capacidade de gerar sinais para diferentes necessidades, como busca, aquisição e acompanhamento, onde a necessidade operacional determinará a faixa de frequência a ser utilizada (Fig. 1). Quanto às PAA, a tecnologia fotônica veio para solucionar os danos do efeito Squint [7], um clássico limitador da largura de banda desses sistemas, causado pelas linhas de retardo eletrônicas convencionais, que apresentam alta dependência com a frequência de RF. O presente trabalho apresenta os estudos de uma cavidade ressonante integrada composta de um guia de onda reto acoplado a outro guia de onda circular, conforme Fig. 2. Na seção II, será feita uma breve revisão sobre a teoria que envolve as cavidades ressonantes em anel integradas, suas funções de transferência e parâmetros físicos relevantes. Em seguida, na seção III, serão apresentadas simulações computacionais utilizando o método FDTD (FiniteDifference Time-Domain), traçando-se as curvas de resposta do dispositivo. Ainda na seção III, serão apresentados os resultados experimentais dos espectros de ressonâncias dos modos quasi-TE (Transverse Electric – Transversal Elétrico) e quasi-TM (Transverse Magnetic – Transversal Magnético), bem como a medida de atraso de grupo de um sinal de RF modulante de 1 GHz. Por fim, na seção IV, serão emitidas considerações sobre a cavidade ressonante testada. II. TEORIA DAS CAVIDADES EM ANEL A estrutura e os parâmetros básicos de uma cavidade em anel ressonante estão representados na Fig. 2. Constam da mesma os campos de entrada, Eent, e de saída, Esai. O campo Esai_2 é proveniente de parte do campo de entrada Eent_1, que é acoplado do guia reto para o guia em anel, e de parte do campo Eent_2 que é realimentado no próprio anel. O campo Esai_1 é a composição do sinal efetivamente transmitido devido a Eent_1 com parte do sinal acoplado do guia em anel, Eent_2. Os coeficientes de transmissão e de acoplamento de campo são assinalados como τ e κ, respectivamente, sendo representados na notação adotada como números reais positivos. O estudo analítico do coeficiente de acoplamento não será tratado neste trabalho, contudo o mesmo depende de parâmetros constitutivos dos guias e do substrato (índices de refração e constante de decaimento), de parâmetros geométricos, como a distância entre os centros dos guias, e da frequência e potência dos sinais [9]. Ressalta-se que a dependência de κ com a distância entre os guias é de aproximadamente uma exponencial descendente Partindo-se da premissa de que apenas um único modo unidirecional do ressonador esteja propagando nos guias, e de que as perdas de acoplamento sejam desprezáveis, então [10] (1) As perdas de propagação na cavidade em anel são representadas pelo coeficiente de atenuação α. Essas perdas podem acontecer devido a diversos fatores como espalhamento, vazamento para o substrato, absorção, acoplamento contra-direcional ocasionado pela rugosidade das paredes do guia, bem como devido a perdas por curvatura. A onda acoplada Esai_2 percorre a circunferência do anel dada por 2πR, onde R é a distância do centro do anel ao centro do guia circular. Nesse caminho óptico, a onda sofre um deslocamento de fase dado por (2) onde é a constante de propagação do guia em curva para um determinado modo , que por sua vez é dada porsendo o índice de refração efetivo do guia em curva, o número de onda no vácuo e o comprimento de onda no vácuo. Foi considerado o índice de refração do silício (nSi = 3,48) para o guia reto e para o circular. Esses guias estão completamente envoltos por sílica (nSiO2 = 1,46). Os índices de refração efetivos foram calculados usando o método de Marcatili [11][12] para um guia de onda de perfil retangular, com largura de 400 nm e altura de 220 nm, conforme especificações de fabricação do chip caracterizado. Seus valores em função do comprimento de onda estão plotados na Fig. 3. A condição para que essa estrutura entre em ressonância é que , onde é um número inteiro que representa um modo da cavidade. Após uma volta no anel, tem-se As amplitudes dos campos da Fig. 2 se relacionam com os coeficientes de transmissão e acoplamento, por meio da matriz de acoplamento A solução das duas equações advindas da matriz acima com a equação (4) resulta em Objetivando-se a simplificação da função de transferência que será deduzida, foi considerado o valor unitário para A potência normalizada de saída corresponde à razão do quadrado do módulo do campo de saída pelo quadrado do módulo do campo de entrada, ou seja, Após as operações algébricas necessárias em (7), chega-se a A Fig. 4 representa em função do comprimento de onda para uma cavidade em anel ressonante de 10 μm de raio, 0,9. O gráfico acima mostra um caso particular, quando  = , chamado de condição de acoplamento crítico. Nesse caso, as perdas internas se igualam à atenuação de acoplamento e, na ressonância, não há potência transmitida. A função de transferência, portanto, possui característica de um filtro rejeita faixa, centrado nos comprimentos de onda das ressonâncias. Outro caso particular a ser observado é quando as perdas internas são consideradas desprezíveis ( , implicando em uma resposta de potência constante e unitária, havendo somente variação da resposta em fase nas ressonâncias. Considerando-se os valores de índice de refração da casca e do núcleo, as perdas por curvas (bending loss) no caso da estrutura em estudo/análise não são relevantes, haja vista o raio da mesma (10 µm), conforme pode ser constatado na Fig. 5. A curva que mais se aproxima das condições físicas da estrutura em estudo neste trabalho indica que, ainda que o anel ressonante possuísse um raio de 0,8 µm, as perdas correspondente seriam de apenas 10 %. Como será visto na próxima seção, a profundidade dos vales das ressonâncias varia consideravelmente na janela de espectro observada. Isso acontece devido às características físicas e imperfeições de fabricação do guia óptico, que influenciam nos valores dos coeficientes de atenuação, acoplamento e transmissão. Quando se busca utilizar uma cavidade ressonante como linha de retardo, convém utilizar uma ressonância com um vale pouco acentuado, de forma a minimizar a atenuação da amplitude do sinal. A Fig. 6 mostra o espectro de para a mesma cavidade em anel ressonante, mas com = 0,997 e = 0,983. A ressonância em 1553,567 nm possui um fator de qualidade Q = 28.770. A Fig. 7 apresenta o gráfico de resposta em fase em função do comprimento de onda do sinal de saída plotado na Fig. 6, referente à ressonância de 1553,567 nm. Observa-se que, em torno da ressonância, a fase sofre uma mudança abrupta de 360º. Esse comportamento é particularmente desejável se o interesse for explorar características de atraso de grupo e dispersão por atraso de grupo. O atraso de grupo pode ser calculado por meio da seguinte relação [4] onde é a fase do campo elétrico na porta de saída e a velocidade da luz no vácuo. A Fig. 8 mostra o atraso de grupo relativo à ressonância da Fig. 7. Verifica-se um atraso teórico de 115,19 ps na ressonância. III. MATERIAIS E MÉTODOS Simulação da cavidade em anel integrada As características físicas, como as dimensões e índices de refração dos materiais, da cavidade em anel estudada foram inseridas no simulador FDTD da Lumerical. Foi utilizado como material dos guias o silício e os dois guias foram envoltos por sílica. A largura e altura do perfil retangular dos guias foram, respectivamente, de 400 nm e 220 nm. A distância entre o guia reto e o guia circular (gap) foi de 250 nm. A Fig. 9 é o resultado da varredura do modo quasi-TE, de 1500 nm a 1600 nm. O fator de qualidade verificado na simulação do modo quasi-TM não saiu de acordo com o do experimento, provavelmente devido a alguma discrepância nos parâmetros de configuração inicial do software, contudo seu FSR foi compatível com os dados experimentais. Até o envio deste artigo, essa simulação ainda não havia sido refeita. Caracterização Espectral e Modal O primeiro experimento realizado foi organizado conforme esquema da Fig. 10. Utilizou-se um laser sintonizável, um controlador de polarização, uma fibra de acoplamento, um nanoposicionador, uma lente colimadora, um polarizador e um medidor de potência óptica. A fibra de acoplamento é uma fibra especial com uma extremidade moldada para servir como lente focalizadora (Fig. 11). Sua utilização é fundamental para que ocorra um acoplamento eficiente da luz no guia. A luz do laser foi acoplada ao guia nº 10 do chip com o auxílio do nanoposicionador. O controle piezoelétrico do posicionamento XYZ do chip facilitou muito o procedimento de acoplamento, tendo em vista um potencial ajuste com resolução de 20 nm em um curso total de 20 μm. A Fig. 12 mostra a imagem da cavidade em anel ressonante caracterizada no experimento. Pode-se observar os heaters (aquecedores) acoplados à estrutura do anel, contudo, para a caracterização reportada neste artigo, essa funcionalidade não foi utilizada. O primeiro procedimento a ser realizado após o acoplamento da luz é o ajuste da polarização. Neste experimento, foram realizadas medidas tanto para o modo quasi-TE (Fig. 13), quanto para o modo quasi-TM (Fig. 14). Caso se queira minimizar efeitos indesejados de reflexão ou espalhamento causados por imperfeições na fabricação do guia, deve-se optar pela polarização quasi-TM, pois a rugosidade existente nas paredes laterais do guia é muito maior do que nas paredes superior e inferior [14]. Após o ajuste da polarização, foi aplicado o sinal do laser sintonizável no guia (6 dBm), varrendo-se seu comprimento de onda de 1500 nm a 1600 nm. Os espectros foram normalizados com o espectro obtido de um guia de referência do próprio chip, sem elementos passivos ou ativos, com o objetivo de se eliminar variações causadas por absorções/atenuações, acoplamento, bem como por flutuações da amplitude do laser sintonizável durante a varredura. O resultado dessas varreduras abaixo é mostrado na Fig. 14. Pode-se identificar claramente as ressonâncias espaçadas de aproximadamente 9 nm para o modo quasi-TE e de 13 nm para o modo quasi-TM, em virtude da diferença dos índices de grupo de cada modo. Essa diferença está compatível com o modelamento matemático apresentado na seção II e com a simulação em FDTD. Observa-se, também, que os fatores de qualidade dos dois modos se mostram bastante diferentes. Enquanto o modo quasi-TE apresenta Q  30.000, o do modo quasi-TM é de Q  600, ou seja, cerca de 50 vezes menor. Isso acontece devido à diferença dos coeficientes de atenuação, de acoplamento e de transmissão dos dois modos. Medida de Retardo de Grupo para Aplicação em Linha de Retardo Fotônica O objetivo do segundo experimento foi medir o atraso de um sinal de RF causado por uma ressonância da cavidade em anel presente no guia nº 10 do mesmo chip, para o modo quasi-TE. Para isso foi montado o setup da Fig. 15. O sinal proveniente do Laser DFB foi modulado em intensidade por um sinal de RF de 1 GHz em um modulador de intensidade comercial do tipo Mach-Zehnder. Esse sinal modulado foi acoplado no mesmo guia caracterizado no experimento anterior, sendo captado por um fotodetector rápido (25 GHz) na saída. As medidas de fase do sinal de RF foram realizadas com o analisador de sinais. A lente e o fotodetector foram montados em dois microposicionadores. Isso se fez necessário para direcionar o foco da luz coletada pela lente na pequena área ativa do fotodetector. Foi escolhido um laser DFB cujo comprimento de onda central (1553,34 nm) estivesse próximo de uma ressonância em análise (1553,5 nm). A sintonia do laser foi realizada mediante variação da temperatura pelo controlador do laser. A variação da faixa possível de temperatura do laser permitiu uma variação de pouco mais de 1 nm no comprimento de onda do mesmo, ou seja, o suficiente para se analisar o comportamento da fase do sinal de RF em torno da ressonância da cavidade. Com os dados correlacionados de temperatura e comprimento de onda, foi confeccionado o gráfico de fase por comprimento de onda da Fig. 16. Analisando-se o gráfico acima, constata-se que o sinal de RF sofreu um atraso de fase máximo de 40º, para 1 GHz, o que significa um atraso de grupo de aproximadamente 111 ps. Esse valor está de acordo com o previsto na seção II. Foram realizados experimentos preliminares a uma frequência de RF de 10 GHz, que mostraram atraso de fase de aproximadamente 400º, ou seja, correspondendo aos mesmo 111 ps, e demonstrando robustez ao efeito Squint. Medições experimentais subsequentes estão sendo realizadas, no intuito de realizar uma análise extensiva do potencial dessas cavidades ressonantes em anel integradas. IV. CONCLUSÃO Este trabalho apresentou a caracterização de uma cavidade ressonante em anel integrada em um chip fotônico. Foi verificado, por meio de um estudo analítico e simulações com software fotônico específico, que os dados adquiridos nos experimentos são compatíveis com a teoria. Foi confirmado, ainda, o potencial das cavidades em anel integradas como elementos causadores de retardo em sinais de RF e, por conseguinte, em aplicações de direcionamento de feixes em antenas de varredura eletrônica, com a vantagem de possuírem dimensões e pesos reduzidos e maior largura de banda. Ressalta-se, também, o fato da tecnologia de fabricação SOI ser a mesma da tecnologia CMOS (Complementary Metal Oxide Semiconductor) e, portanto, compatível com a infraestrutura existente para fabricação de chips eletrônicos."
	}
