{
    "id": 102,
    "titulo": "operação remota do sistema gerador de cenários de guerra eletrônica excalibur drs associada à transmissão de sinais radar em fibra óptica",
    "autor": "felipe streitenberger ivo, pedro carlos da silva euprhásio, olympio luchini coutinho e lester de abreu faria ",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2016/st/ST_03_3.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 2,
    "resumo": "A Força Aérea Brasileira (FAB) tem utilizado sistemas simuladores de sinais radar para avaliar e certificar o desempenho de receptores embarcados de guerra eletrônica em campanhas de avaliação operacional (AVAOP) embarcados em suas plataformas aéreas. Um fator crítico nesse tipo de campanha é a necessidade de montagem de todo o arranjo experimental de Rádio Frequência (RF) estar situado próximo à aeronave, que, em geral, estão posicionadas em locais abertos, sujeitas a condições climáticas adversas, tais como grandes variações de temperatura e umidade. Visando superar tais limitações, este artigo apresenta uma nova abordagem experimental de geração e transmissão remota de sinais radar, baseada em transmissão de sinais de RF em fibra óptica e acesso remoto de instrumentação eletrônica. Nesse conceito proposto, o gerador sinais radar é mantido em laboratório climatizado, sendo a sua operação e o acesso aos sinais de RF feitas em uma posição remota e próxima à aeronave sob avaliação. É usado um enlace analógico a fibra óptica para transmitir sinais radar programados no gerador de sinais Excalibur DRS até uma posição remota situada a 1 km de distância, de onde também é feita toda a operação remota do equipamento via internet.",
    "texto": " I. INTRODUÇÃO A Força Aérea Brasileira utiliza simuladores de sinais radar para testar e avaliar receptores de guerra eletrônica, embarcados em suas plataformas aéreas, através da realização de campanhas de Avaliação Operacional (AVAOP) [1-3]. Um dos principais objetivos de tipo de AVAOP é validar o comportamento dos receptores de guerra eletrônica (GE) e certificar quanto à coerência entre desempenhos especificados e os obtidos operacionalmente durante os testes [2-3]. Adicionalmente, a AVAOP permite mensurar e avaliar a resposta dos equipamentos GE quando submetidos a condições eletromagnéticas adversas, a partir de testes conduzidos de forma controlada [1-3]. Além disso, estas campanhas tem favorecido o treinamento das equipes de mantenedores e programadores destes sistemas [1], bem como tem possibilitado à FAB a economia de horas de voo das plataformas, considerando a realização dos testes com a aeronave em solo [3]. Os geradores de sinais radar e a instrumentação eletrônica de medição de RF, em especial na área de guerra eletrônica, possuem um alto valor agregado [4], principalmente quando projetados para desempenhar funções de avaliação de receptores embarcados de sinais radar de aeronaves ou navios [4]. Estes sistemas empregam geradores de sinais complexos capazes de reproduzir cenários eletromagnéticos de guerra eletrônica de interesse com alta fidelidade e confiabilidade [1-5]. Os sinais gerados podem ser acoplados diretamente ao receptor por meio de teste conduzido, onde os sinais são injetados diretamente nas entradas de RF receptor. Pode-se ainda, realizar testes irradiados, onde os sinais são transmitidos em espaço livre em direção a plataforma de teste. Em geral, estes equipamentos operam na faixa de 0,5 a 40 GHz e precisam ser acondicionados em locais controlados e climatizados, em função da garantia da estabilidade e do alto custo envolvido [6]. Um dos equipamentos atualmente utilizados pela FAB como ferramenta para geração de sinais radar em campanhas de AVAOP em solo é o sistema Excalibur DRS, instalado no Laboratório de Guerra Eletrônica (LAB-GE) do Instituto Tecnológico de Aeronáutica (ITA) [8]. O Excalibur DRS é um gerador arbitrário de sinais radar programável de alto custo, capaz de gerar sinais radar complexos na faixa de 0,5 a 18 GHz [3-4]. Possui 16 saídas de RF com 3 metros de cabos coaxial cada uma, para interliga-las aos sistemas sob teste [4]. O Excalibur pode ser empregado tanto para testes irradiados quanto para testes conduzidos. No caso de teste irradiado, precisa ser acrescentado um conjunto de amplificadores e antenas [3]. A restrição de comprimento dos cabos coaxiais, além da baixa potência irradiada, limita a distância entre o Excalibur DRS e a aeronave sob avaliação operacional, a qual geralmente está estacionada em local aberto e sujeito a intempérie durante o teste de AVAOP em solo [5-6]. Uma área de pesquisa em atual estágio de maturidade e cujo princípio de operação fundamenta-se na interação entre sinais ópticos e de RF está sendo referenciada no Brasil como RF em Fotônica, traduzida do termo em idioma inglês Microwave Photonics [8]. Atualmente esta área tem se consolidado como uma alternativa para transmissão de sinais de RF a longas distâncias, principalmente devido às baixas perdas de potência das fibras ópticas, da ordem 0,2 dB/km, e ampla largura de banda de RF dos dispositivos de modulação e detecção ópticos [8]. Isto tem viabilizado soluções de engenharia tanto para setor militar quanto para o civil [8-9]. No setor militar, foco deste trabalho, destacam-se o emprego desta tecnologia em modernização de sistemas de controle e defesa do espaço aéreo, sistema radar, antenas remotas e antenas phased array [6,8,9]. A condução de experimentos e testes automatizados e controlados via web é uma tendência atual em pesquisa na área de engenharia, referenciados neste trabalho pela terminologia de laboratório remoto [10-12]. Os laboratórios remotos se apresentam atualmente como soluções confiáveis para o compartilhamento de recursos a distância entre centros de pesquisa, geralmente envolvendo instrumentação de alto custo [10]. Estes laboratórios remotos são concebidos a partir de uma arquitetura de software de controle do experimento através de um computador via internet [11-12]. Este artigo apresenta o emprego de enlaces à fibra óptica com propósito de transmissão remota dos sinais radar gerados pelo sistema Excalibur RDS. Além disso, implementa o conceito laboratório remoto para operar à distância o simulador de radar, via internet. Por meio do controle à distância do sistema Excalibur DRS e o emprego da transmissão dos sinais de RF em fibra óptica, apenas amplificadores e antenas necessitam estar posicionados próximos à aeronave sob avaliação operacional, podendo o estágio de geração estar localizado em um laboratório distante, em ambiente controlado. Ainda, as equipes de operação e coordenação da AVAOP poderão controlar remotamente a programação do gerador de sinais, permitindo alterar os parâmetros dos emissores radar a partir do próprio local do ensaio. Este artigo está organizado da seguinte forma: na seção II é apresentado o equipamento Excalibur DRS; na seção III é apresentada uma breve explicação de enlace analógico à fibra óptica para transmissão de sinais de RF; na seção IV é apresentado um breve conceito de laboratório remoto; na seção V são apresentados alguns resultados experimentais; e na seção VI são tecidas as considerações e conclusões deste trabalho. II. SIMULADOR DE SINAIS RADAR EXCALIBUR DRS O gerador de ameaças radar Excalibur DRS é um gerador de sinais arbitrários programáveis usados para implementação de cenários de ambiente eletromagnético radar dentro de uma banda de frequência de 0,5 a 18 GHz [5]. O Excalibur DRS emprega uma diversidade de tecnologias complexas, tanto na área de geração de sinal (hardware) como na área de controle (software). O software de controle e programação do equipamento é denominado de Threat Builder e possui 08 diferentes aplicativos. Estes aplicativos possibilitam gerenciar e programar biblioteca de sinais, calibrar o sistema e controlar a geração de sinais radar. O hardware consiste de dois conjuntos de geradores de micro-ondas programáveis, composto de dezesseis portas de saída de RF cobrindo a faixa de frequência de 0,5 a 18 GHz. A potência máxima de saída é limitada a 0 dBm na saída de cada porta. O Excalibur DRS pode ser empregado em duas configurações de teste: irradiado ou conduzido [1]. Para que o equipamento opere no modo irradiado, é necessária a conexão adicional de um amplificador e de um conjunto de antenas. Neste modo, os sinais são irradiados na direção da plataforma sob teste [1]. Já o modo conduzido é caracterizado pela variação de amplitudes dos sinais de RF gerados em cada uma das 16 portas do simulador de radar [1]. Esta variação se dá em função da posição relativa entre o emissor e receptor dentro do cenário de guerra eletrônica programado, além do movimento e da velocidade relativa entre estas plataformas. Desta forma, os sinais de cada uma das portas de RF de saída do gerador simulam a direção de chegada de um emissor em relação ao receptor GE sob teste [2-4]. O Excalibur DRS permite a geração simultaneamente de uma grande diversidade de sinais de radar complexos dentro da banda de frequência do sistema [4]. Um sinal de radar complexo é definido como um sinal que possui características de pulso e irradiação de um emissor, entre elas a taxa de repetição, largura e modulação intrapulso do pulso radar, além dos diagramas de radiação e padrão de varredura da antena do emissor radar. A Fig. 1 ilustra o sistema Excalibur DRS. Nesta figura podem ser observados o computador de programação de cenários GE, o hardware de geração de sinais e as conexões de saída de RF. III. ENLACE ANALÓGICO A FIBRA ÓPTICA No contexto deste trabalho, o enlace analógico a fibra óptica é definido como um conjunto de componentes ópticos necessários para transmitir um sinal elétrico de RF, a partir de uma portadora óptica que se propaga na fibra óptica [6]. Este trabalho considera a implementação de um enlace a fibra óptica por meio da utilização de um dispositivo de modulação externo que modula a intensidade de um laser em operação contínua (CW) a partir de um sinal elétrico de RF. O modulador usado é um modulador interferométrico de MachZehnder (MZM). O sinal óptico modulado é então transmitido por fibra óptica até a entrada de um fotodetector localizado remotamente, onde o sinal elétrico de RF é recuperado a sua forma original [6,8,9]. No contexto deste trabalho, a fonte elétrica de sinal é o gerador de sinais radar Excalibur DRS [5]. A Fig. 2 apresenta o diagrama esquemático do sistema de transmissão remota proposto. Considerando que o foco principal deste trabalho é a demonstração experimental do conceito de transmissão remota de sinais radar por meio de enlaces analógicos a fibra óptica, uma abordagem teórica detalhada vai além do escopo pretendido. Entretanto, o leitor consultar tal abordagem na referência [9], onde é mostrada de forma sistemática a formulação matemática do modelo do enlace óptico aqui apresentado. IV. LABORATÓRIO REMOTO Experimentos automatizados controlados via web são tendências atuais de pesquisa na área de engenharia [11-13]. Os laboratórios remotos se apresentam como soluções confiáveis para o compartilhamento de recursos à distância entre centros de pesquisa, geralmente considerando equipamentos de alto custo [11-13]. Estes laboratórios são concebidos a partir de uma arquitetura de software de controle do experimento, feita através de um computador conectado via internet em uma topologia do tipo clienteservidor [12-13]. Seguindo esta topologia, o computador servidor atua diretamente sobre as variáveis do experimento, de forma modificar parâmetros, adquirir dados ou comandar atuadores/sensores [13]. Uma vez que o servidor está conectado à internet, os terminais clientes podem acessar o servidor de forma a interagir diretamente sobre o experimento [13]. Isto permite manipular as variáveis do experimento e coletar dados à distância [14-15]. Desta forma o experimento é controlado pelo servidor localmente, que é acessado remotamente por um computador cliente [14-15]. O conceito de laboratório remoto é implementado neste trabalho configurando o computador de controle do Excalibur DRS como um servidor. Isto possibilita que o usuário cliente, localizado a quilômetros de distância do laboratório, se conecte remotamente via rede internet e controle a operação e programação do gerador de sinais, de acordo com as necessidades dos testes de avaliação operacional em andamento e em tempo real [14-15]. A Fig. 3 ilustra o conceito de acesso remoto via rede internet ao sistema Excalibur DRS. O software utilizado neste artigo para demonstrar esse conceito de controle e gerenciamento remoto do Excalibur DRS é a uma versão gratuita do aplicativo TeamViewer. O TeamViewer é uma solução para acesso remoto através de uma ligação virtual entre o computador servidor e o cliente via rede internet [16]. Esta conexão é realizada através de um login e uma senha, específicos para cada máquina na rede, sendo renovados a cada nova inicialização dos computadores [16]. O TeamViewer possibilita ainda o controle de todas as funções do computador servidor por meio do compartilhamento remoto da sua área de trabalho [16]. V. RESULTADOS EXPERIMENTAIS A demonstração experimental do conceito de operação remota do sistema gerador de cenários de guerra eletrônica Excalibur DRS associada à transmissão de sinais radar em fibra óptica é realizada a partir da geração remota de 3 emissores radar simultâneos usando o equipamento Excalibur DRS, com as características mostradas na Fig. 4. Os 3 emissores radar cobrem a faixa de frequência de 2 a 18 GHz. Estes sinais são avaliados a partir de medidas no domínio da frequência e no domínio do tempo, obtidas diretamente na saída de RF do gerador de sinais e comparadas com as medidas feitas na posição remota. Na Fig. 5 é mostrado o arranjo experimental usado para a realização das medidas diretamente na saída de RF do gerador de sinais Excalibur DRS. No domínio da frequência, os emissores radar são medidos diretamente através de um analisador de espectro, enquanto que no domínio do tempo utiliza-se um detector de RF acoplado a um osciloscópio. A potência de pico na saída do gerador de sinais foi ajustada para 0 dBm. A Fig. 6 mostra o resultado obtido no domínio da frequência. Os pulsos detectados estão apresentados no domínio do tempo nas Fig. 7, 8 e 9. O arranjo experimental montado para a realização das medidas remotas dos sinais radar está mostrado na Fig. 10. O sistema Excalibur DRS, assim como seu computador de controle, foi posicionado em uma sala com ambiente controlado, dentro do LAB-GE. A saída de RF do gerador foi acoplada na entrada de modulação do modulador MZM. A saída óptica do modulador MZM foi conectada a uma das extremidades de um carretel de fibra óptica com 1 km de extensão. A outra extremidade foi posicionada em outra sala, também dentro do LAB-GE, de onde foram realizadas as medidas dos emissores gerados remotamente e transmitidos por fibra óptica. O controle do gerador de sinais Excalibur DRS foi realizado a partir de um computador cliente, conectado à rede internet disponível na sala remota. A Fig. 11 mostra a disposição dos equipamentos teste e do computador cliente na sala remota. Para a implementação experimental do enlace a fibra óptica usado para a transmissão distante dos sinais de RF, foi usado um laser DFB com comprimento de onda de 1551,72 nm, com ruído de intensidade relativa igual a -159,01 dB/Hz. O modulador MZM usado possui tensão de meia onda Vπ = 3,7 V na frequência de 1 GHz, tem perdas ópticas de inserção de 2,4 dB e opera em uma faixa de frequência de 0 a 20 GHz. A impedância da linha de alimentação do modulador é casada em 50 Ω. Foi usado um carretel de fibra óptica monomodo com 1 km de extensão, com perdas 0,3 dB/km. O fotodetector empregado tem responsividade de 0,6 A/W, com capacidade de operar na faixa de frequência de 0 a 20 GHz e impedância paralela casada com a carga de saída em 50 Ω. As medições foram realizadas com o diodo laser ajustado para uma potência óptica de 32 mW e com o modulador MZM operando no ponto de quadratura. Além dos componentes básicos do enlace analógico a fibra óptica, foi inserido um estágio de pós-amplificação de RF inserido após o fotodetector, com ganho de 38 dB e largura de faixa de 0,5 a 18 GHz. Para a realização do teste remoto, a potência de pico na saída do gerador de sinais foi ajustada para 0 dBm. A Fig. 12 mostra as medidas de frequência dos emissores radar na posição remota, realizadas na saída estágio de pósamplificação de RF. Os pulsos radar detectados, são apresentados nas figuras 13, 14 e 15. VI. Discussão e Conclusões Este trabalho demonstra experimentalmente o conceito de operação remota do sistema de geração de emissores radar Excalibur DRS associado à transmissão de RF em fibra óptica. Este conceito torna viável a realização de experimentos de avaliação de sistemas de Guerra Eletrônica embarcados em aeronaves posicionadas a quilômetros de distância do sistema de geração de sinais radar, o que seria impossível se considerada apenas a transmissão de sinais por meio de cabos coaxiais. A demonstração experimental é realizada a partir da geração remota de 3 emissores radar simultâneos usando o equipamento Excalibur DRS, cobrindo a faixa de 2 a 18 GHz. Resultados das medições realizadas diretamente na saída de RF do gerador de sinais são confrontados com as medidas obtidas na posição distante, após a transmissão dos sinais através de 1 km fibra óptica. Nas medidas realizadas no domínio da frequência, Fig. 5 e Fig. 12, observa-se que os níveis de sinais de RF medidos estão dentro da faixa de tolerância 3 dB de diferença. A Fig. 12 mostra ainda que há um pequeno sinal na frequência de 6 GHz. Este sinal é o 2° harmônico do primeiro radar, com frequência de 3 GHz, provavelmente gerado pelo enlace a fibra óptica. Uma justificativa plausível para o aparecimento deste harmônico é um provável desvio da polarização do modulador MZM, a partir do ponto de quadratura. Este harmônico está a 40 dB abaixo da potência dos emissores gerados. Tal desvio do ponto de operação do modulador MZM pode ser facilmente corrigido a partir da inserção de um controle automático da tensão de polarização do modulador, reduzindo drasticamente a amplitude dos sinais harmônicos espúrios da saída do enlace. Comparando as medidas no domínio do tempo realizadas diretamente na saída do equipamento, figuras de 7 a 9, com as realizadas na posição remota localizada a 1 km de distância, figuras 13 a 15, pode-se observar que os pulsos detectados dos 3 emissores radares não sofrem alterações significativa. Ademais, os resultados apresentados mostram que o controle e gerenciamento remoto de instrumentos via rede internet possibilita comandar à distância o gerador de sinais radar Excalibur DRS. Isto permite que o gerador de sinais radar esteja instalado em condições controladas de laboratório, seguindo suas especificações técnicas, diferente das condições adversas onde estão sendo realizados os testes de avaliação dos sistemas de Guerra Eletrônica embarcados na aeronave. "
}