{
    "id": 103,
    "titulo": "estudo experimental da dinâmica e dos parâmetros de efeito de sopro da onda de mach",
    "autor": "caio barbosa amorim, koshun iha, wandeclayt martins de melo e filipe r. de s. moreira",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2016/st/ST_04_2.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "A onda de Mach é um fenômeno decorrente da interação entre onda de choque e superfície. Ela resulta da fusão entre a onda incidente e a refletida, possuindo parâmetros de efeito de sopro mais intensos. Isso pode ser muito útil para otimizar o uso de uma carga explosiva num determinado cenário. Foram realizadas detonações para obtenção de curvas de pressão e de imagens em alta velocidade da propagação dessa onda com o objetivo de entender melhor sua dinâmica de surgimento e crescimento. Também foi avaliado o seu desempenho em relação a uma onda de choque resultante de uma detonação ao ar livre ou de uma carga apoiada diretamente sobre o solo. Como resultado, descobriu-se que a onda de Mach é consideravelmente mais intensa que os demais casos analisados, possuindo parâmetros de sopro uniformes ao longo de sua extensão, e que sua dinâmica de crescimento é razoavelmente bem descrita pela literatura.",
    "texto": "I. INTRODUÇÃO A partir de determinado ângulo de incidência, o resultado da interação entre uma onda de choque e uma superfície deixa de ser uma outra onda, a chamada onda refletida, para formar uma nova frente de onda única: a onda de Mach. Surge, então, o ponto triplo, lugar onde se encontram a onda incidente, a refletida e a onda de Mach. A onda de Mach possui características especiais. A primeira é que ela cresce em altura à medida que se propaga. Além disso, ela tem maior poder de destruição que a onda incidente, conforme detalhado na literatura [1]. Esse poder é, inclusive, maior do que o oriundo de uma detonação com a carga ao nível do solo, situação em que a reflexão da onda de choque na superfície sobre a qual a carga está apoiada reforça a sua intensidade, o qual foi estudado e modelado no estudo [2]. Nesse caso, o problema é que boa parte da energia da detonação é gasta na deformação da superfície sobre a qual o explosivo está posto. Além disso, o poder destrutivo da onda de Mach varia conforme a altura de detonação e a distância entre a carga e o ponto de análise. Como consequência direta desses fatos decorre a possibilidade de se determinar a altura de detonação de uma carga para que um ponto suficientemente próximo à superfície seja atingido com um efeito de sopro otimizado. Essa possibilidade de otimização da intensidade dos parâmetros de sopro é de grande utilidade na área de defesa. Um bom exemplo de aplicação é no caso de um míssil antirradiação. Sendo possível aferir a distância entre o míssil e o alvo e tendo sido realizado um estudo de otimização de sua cabeça de guerra, é possível iniciá-la na altura em que ela causa o maior dano possível, reduzindo a massa de explosivo necessária. Essa redução de massa, por sua vez, se traduz em menores efeitos colaterais e numa redução do peso do míssil ou no alívio das restrições de peso de outros subsistemas dele, o que pode uma considerável diferença no seu desempenho. Nesse artigo é apresentada uma análise experimental da dinâmica e dos parâmetros de efeito de sopro de uma onda de Mach. Os dados experimentais são comparados e confrontados com o que está disponível na literatura da área para análise e realização das observações pertinentes. II. BASE TEÓRICA Os ensaios foram planejados a partir da teoria contida em [3]. Primeiramente, foi calculado o ângulo βmáx, definido a partir do ângulo β da Fig. 1, no qual na onda de Mach se desprende do chão. O cálculo de βmáx é feito de forma interativa. Inicialmente, atribui-se um valor a essa variável, que fica em torno de 45º, e calcula-se a distância entre a carga e o ponto em consideração (D) através de (1). Depois, calcula-se por (2) a distância escalonada (Z) equivalente ao ponto em questão usando D e a massa de explosivo detonado em equivalente TNT (mTNT). Após isso, obtém-se o valor da razão do pico de sobrepessão (PSO) pela pressão atmosférica (P0) no ponto sob análise através de (3). Em seguida, usa-se (4) para se obter o número de Mach da onda incidente nesse ponto (Mx). Por fim, calcula-se βmáx por meio (5) e o ciclo recomeça até obter-se um valor suficientemente acurado. Como βmáx deve estar próximo a 45º, não são necessárias muitas interações. Após isso, emprega-se (6) para encontrar a componente horizontal da distância da carga ao lugar em que a onda de Mach se forma (d0). Uma interação desse cálculo, cuja estimativa inicial já é o valor para o qual βmáx converge, para duas alturas de detonação próximas é apresentada na Tabela I usando mTNT = 0,160g. A Tabela I também contém valor de d0 calculado a partir do valor final de βmáx. De acordo com as literaturas [3] e [4], a onda de Mach cresce com o quadrado da distância horizontal percorrida. Assim, o crescimento em altura da onda de Mach (hM) quando esta percorre uma determinada distância horizontal (d) se dá em função da altura de detonação da carga (HOB) conforme (7).O valor das alturas da onda de Mach para os mesmos valores de HOB e d0 da Tabela I, nas distâncias de interesse para esse trabalho — 1,5 m, 2,0 m, e 2,5 m —, são apresentadas na Tabela II. Os valores de HOB usados nas tabelas foram escolhidos de acordo com o que foi empregado nos ensaios, sendo bem próximos para avaliação da sensibilidade dos parâmetros teóricos a mudanças na altura de detonação. Não foi encontrada qualquer formulação teórica para prever a intensidade dos parâmetros de sopro da onda de Mach. Em especial, isso decorre da dependência desses parâmetros com a altura de detonação. Havia, ainda, a desconfiança de que eles pudessem ser diferentes para pontos a diferentes alturas da frente de onda de Mach, de modo que quanto mais próximo ao solo maior seria o potencial desta em causar danos. III. MATERIAIS E MÉTODOS Inicialmente, foram medidos os parâmetros de sopro referentes a uma onda incidente proveniente de uma detonação ao ar livre, quando a onda se propaga esfericamente, e de uma onda hemisférica proveniente da detonação de uma semiesfera apoiada sobre o solo. Após isso, foram detonadas esferas a uma mesma altura do solo, analisando-se a formação e o crescimento da onda de Mach, e aferindo-se os parâmetros de sopro dessa onda para algumas distâncias à carga e para várias alturas em relação ao solo em cada uma dessas distâncias. O explosivo utilizado foi PBX com 80% de HMX. Tanto as esferas quanto as semiesferas possuíam massa de 142 ± 6 g. A iniciação da explosão das esferas foi feita pelo centro usando espoletas sismográficas modelo RJ-040, enquanto a iniciação das semiesferas foi realizada pelo centro da base delas, usando-se para isso um reforçador R-18 e uma espoleta comum nº 8 elétrica. Os instrumentos de medida utilizados foram uma câmera de alta velocidade e 6 (seis) sensores piezoelétricos de pressão. Colocou-se estacas com marcas de altura para facilitar o processamento das imagens e a avaliação do crescimento da onda de Mach por meio dessas. Realizaram-se 17 detonações. Em cada uma delas foi feita a filmagem em alta velocidade e a medida dos parâmetros de desempenho da onda de choque com os sensores de pressão. Em geral, os sensores foram ajustados em 3 posições diferentes, obtendo-se por ensaio 2 amostras da medida dos parâmetros da onda de choque para cada posição. Foram realizados pelos menos 3 ensaios por configuração de medida, o que resultou na obtenção de cerca de 6 medidas de pressão para cada ponto em análise, considerado suficiente para a realização de uma análise estatística razoável. Os vídeos foram gravados a uma taxa de 5kfps, tempo de exposição menor ou igual a 100 µs, distância focal superior a 100mm, e linha de visada perpendicular ao plano de medição para evitar distorções. Cada quadro de vídeo foi processado utilizando sobreposição ao primeiro quadro capturado (quadro de referência). Para isso, foi utilizado o modo de mesclagem denominado diferença do software Adobe Photoshop CS6. Os quadros resultantes apresentam realçados apenas os pixels modificados com relação ao frame de referência, evidenciando-se assim as frentes de onda. Uma camada de ajuste de níveis foi adicionada para incrementar o contraste no vídeo processado. IV. CONFIGURAÇÕES ENSAIADAS Foram escolhidas as distâncias entre a carga e os sensores de 1,5 m, 2,0 m e 2,5 m para esse ensaio. A sequência de configurações de ensaio foi: a. Carga esférica a 1,5 m de altura e sensores posicionados a 1,5 m, 2,0 m e 2,5 m; b. Carga hemisférica sobre o chão e sensores posicionados a 1,5 m, 2,0 m e 2,5 m; c. Carga esférica a 0,5 m de altura e sensores a 1,5 m posicionados em três alturas diferentes; d. Carga esférica a 0,5 m de altura e sensores a 2,0 m posicionados em três alturas diferentes; e. Carga esférica a 0,5 m de altura e sensores a 2,5 m posicionados em três alturas diferentes; Os setups de ensaio para as configurações a, b e c, d e e são apresentados nas Fig. 2, 3 e 4, respectivamente. V. SIMULAÇÃO BOOTSTRAP NÃO PARAMÉTRICA Devido à limitação de instrumentação, não foi possível coletar muitas amostras do perfil de pressão gerado pela passagem da onda de choque em cada um dos pontos desejados. Além disso, a distribuição de probabilidade dos valores de pico de sobrepressão também é desconhecida. Assim, a análise estatística foi feita por meio de um recurso computacional adequado a essas condições de contorno: a Simulação Bootstrap não paramétrica, cuja fundamentação teórica é apresentada em [5]. Os dados obtidos experimentalmente geraram uma amostra original de valores de pico de sobrepressão para cada cenário de ensaio. A partir dessa amostra original, foram criadas 200 novas amostras por reamostragem com reposição, na qual a ocorrência de cada elemento da amostra original foi considerada equiprovável. Criou-se, então, um vetor para registrar o valor médio de cada uma dessas amostras. Em seguida, esse vetor foi ordenado em ordem crescente de valores. Tomando-se os elementos que limitam os 2,5% maiores e menores valores desse vetor ordenado, obteve-se uma estimativa de um intervalo de confiança (IC) bilateral, com 5% de significância, para o valor médio do pico de sobrepressão em cada cenário ensaiado. A simulação foi feita em Matlab, sendo o código utilizado reproduzido abaixo: function [ic_min, ic_max] = bsp(amostras) n=length(amostras); tam = 200; %quantidade de conjuntos reamostrados mrand = rand(n, tam); %escolha aleatória equiprovável do elemento da amostra original a ser escolhido mrand = ceil(n*mrand); mfinal = zeros(n,tam); for i=1:tam for j=1:n mfinal(j,i) = amostras(mrand(j,i)); % reamostragem end end mfinal = ones(1,n)*mfinal/n; %cálculo da média de cada conjunto mfinal = sort(mfinal); %ordenação do vetor de médias alfa = 0.05; %intervalo de confiança de (1-alfa)*100% ic_min = mfinal(alfa/2*tam); %limite inferior do IC ic_max = mfinal((1-alfa/2)*tam); %limite superior do IC VI. RESULTADOS EXPERIMENTAIS — SENSORES DE PRESSÃO Para verificar se nos pontos medidos já havia sido formada ou não a onda de Mach, foram analisadas as curvas de pressão obtidas pelos sensores. A partir dessas curvas, é possível detectar se o ponto encontra-se na região de Mach ou não pela ausência ou presença, respectivamente, de um pico secundário proveniente da chegada da onda refletida no solo. Também é possível avaliar a intensidade do pico de sobrepressão e verificar se o efeito de sopro está sendo mais intenso no ponto em questão ou não. Em cada ensaio foram utilizados 2 sensores para cada altura. Na Fig. 5 são apresentadas as curvas de um dos ensaios conforme a configuração c, cujas alturas nas quais cada sensor de pressão foi posicionado se encontram descritas na legenda. A partir da Fig. 5 pode-se perceber que a 30 cm de altura o pico de pressão é menor e aparece um outro pico após o primeiro, resultado da onda refletida, o que revela que este ponto se encontra acima do ponto triplo. Já a 20 cm parece haver uma transição, o que pode ser percebido pelo perfil de pressão que não apresenta um pico inicial. Isso aparenta ser resultado de uma situação limite onde o ponto em questão está perto do ponto triplo. A 10 cm de altura, porém, o pico de sobrepressão é maior e o perfil de pressão é mais similar ao esperado pela passagem de uma única onde de choque, significando que ali já está bem estabelecida a onda de Mach. Na Fig. 6 são apresentados os perfis de pressão medidos a diferentes alturas para um ensaio da configuração d, cujas alturas nas quais cada sensor de pressão foi posicionado se encontram descritas na legenda. Analisando a Fig. 6, percebe-se tanto pelo pico bem mais baixo quanto pela chegada da onda refletida após o primeiro pico que o ponto triplo tem altura menor que 60 cm a uma distância à carga de 2,0 m. Já a 40 cm, um dos gráficos mostra uma subida pouco após o primeiro pico, o que permite inferir que o ponto triplo encontra-se próximo a essa altura. A 20 cm tem-se um pico elevado, o que caracteriza que ali a onda de Mach está bem estabelecida. Por fim, na Fig. 7, são apresentadas as curvas dos sensores de pressão para um ensaio na configuração e, cujas alturas nas quais cada um foi posicionado se encontram descritas na legenda. Nesse ensaio foi utilizado apenas um sensor para cada altura. Na Fig. 7 é possível detectar a chegada da onda refletida nos sensores a 100 e 80 cm do solo, o que ocorre aproximadamente em t = 0,2 e t = 0,5 ms, respectivamente. Isso ratifica que a posição deles está acima do ponto triplo. De 60 cm para baixo, porém, a onda de Mach parece já estar bem estabelecida. Considerando o erro devido a desníveis do terreno onde foi realizado o ensaio, que são da ordem de centímetros, os dados obtidos pelos sensores de pressão quanto a altura da onda de Mach estão em boa concordância com os valores da Tabela II. A aparente discrepância que há à distância de 2,5 m pode ser explicada pela relativamente grande sensibilidade do valor da altura do ponto triplo com relação a variações no valor de HOB na distância em questão. Isso é mostrado na própria Tabela II, na qual se percebe que uma pequena variação de HOB já faz com que o resultado teórico seja aderente ao experimental. Os resultados para as medidas de pico de sobrepressão dos ensaios foram compilados após tratamento estatístico e são apresentados na Tabela III. Analisando a Tabela III pode-se chegar às seguintes conclusões:  A onda de Mach tem força consideravelmente maior que uma detonação equivalente ao ar livre e de uma carga detonada sobre o solo, e;  Quando a onda de Mach está bem estabelecida, como no caso dos pontos a 20, 40 e 60 cm do ensaio a 2,5 m, a pressão pouco varia com a altura. VII. RESULTADOS EXPERIMENTAIS — CÂMERA DE ALTA VELOCIDADE O resultado do tratamento das imagens obtidas pela câmera de alta velocidade é apresentado na Fig. 8, na qual fica evidenciada a onda choque pela nuvem de pontos brancos e a evolução do ponto triplo está marcada com pontos amarelos. A partir das imagens da câmera de alta velocidade é possível estimar a posição do ponto triplo à medida que a onda de Mach cresce. Essa metodologia está sendo desenvolvida para posterior comparação com (8), mas já é possível verificar de antemão que o lugar geométrico do ponto triplo se assemelha a uma reta ou uma parábola de concavidade suave. VIII. CONCLUSÕES A análise experimental realizada confirma o ganho de desempenho que a onda de Mach tem por resultar da união entre a onda refletida e a incidente. Também foi verificado que a onda de Mach aparenta possuir valores de pico de sobrepressão constantes com a altura para uma mesma distância à carga. A análise prévia da evolução da altura da onda de Mach durante sua propagação mostrou que ela tem forma similar àquela da previsão teórica retirada de [3], e os dados experimentais estão de acordo com essa previsão. Durante a realização dos cálculos usando a formulação da literatura supracitada para a determinação da dinâmica do ponto triplo, destacou-se a crescente sensibilidade da sua previsão teórica em relação a altura de detonação à medida que a onda de Mach se propaga e cresce. Pretende-se, ainda, aprimorar essa análise para que essa proximidade seja avaliada de forma mais apurada."
}