	{
		"id": 106,
		"titulo": "interoperabilidade de comando e controle: barramento de comunicação soa",
		"autor": "tomás de a. t. botelho, manoel pedro sá, jorge eduardo calvelli, patrick b. a. de lara",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2015/st/ST_4_2.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 2,
		"resumo": "O projeto Interoperabilidade de Comando e Controle foi iniciado em 2013 e tem o escopo de construir um middleware de comunicação, em arquitetura SOA, que permita a troca de mensagens entre os sistemas de Comando e Controle das Forças Singulares e o Sistema de Planejamento Operacional Militar, no nível operacional, particularmente, nas Operações Conjuntas. A equipe do projeto superou desafios tecnológicos e operacionais para desenvolver um Barramento de Serviços Corporativo que atendesse aos requisitos especificados pela Subchefia de Comando e Controle da Chefia de Operações Conjuntas do Estado-Maior Conjunto das Forças Armadas. O Barramento utiliza o modelo JC3IEDM para o intercâmbio de dados e mensagens do método ADEM para tramitação das informações entre sistemas. Este artigo tem por objetivo apresentar o projeto INTERC2, a arquitetura do Barramento e a Interface de Comunicação, mostrando as principais tecnologias empregadas na sua construção.",
		"texto": " I. INTRODUÇÃO A evolução tecnológica do século XXI aumentou os desafios para o cumprimento de missões militares, especialmente nas Operações Conjuntas (OpCj) e multinacionais. O dinamismo dessas operações requer uma aceleração do ciclo decisório de comando e controle conhecido como ciclo OODA (Observar, Orientar-se, Decidir e Agir). Uma das formas de acelerar o ciclo OODA é utilizar sistemas computacionais interoperáveis, permitindo ampliar a troca de informações entre as Forças Componentes de uma OpCj e o Comando Operacional. Essa almejada interoperabilidade contribui, também, para a obtenção de uma consciência situacional compartilhada entre os decisores dos níveis estratégico e operacional. No ano de 2011, o Ministério da Defesa (MD) firmou com as Forças Singulares Contratos de Objetivos, estabelecendo que a interoperabilidade entre os Sistemas de Comando e Controle (C2) das Forças Singulares (FS) e o Sistema de Planejamento Operacional Militar (SIPLOM) do MD, seria calcada em três vetores basilares: protocolo IP, modelo de dados Joint Consultation, Command and Control Information Exchange Data Model (JC3IEDM) [1] e adoção da Arquitetura Orientada a Serviços (SOA – Service Oriented Architecture). A interoperabilidade entre os citados sistemas de C2 pode ser alcançada pela construção de um barramento de comunicação que permita a troca de mensagens. O Barramento de Comunicação, desenvolvido pelo projeto Interoperabilidade de Comando e Controle (INTERC2) e o SIPLOM são Sistemas de Tecnologia da Informação que constituem parte do Sistema Militar de Comando e Controle (SISMC2) [2]. Este artigo tem por objetivo apresentar o projeto INTERC2 e a arquitetura do Barramento de Comunicação, mostrando as principais tecnologias empregadas na sua construção, em atendimento aos requisitos de alto nível definidos pela Subchefia de Comando e Controle da Chefia de Operações Conjuntas do Estado-Maior Conjunto das Forças Armadas do Ministério da Defesa (SC1/CHOC/EMCFA/MD). Para isto, a seção II apresenta conceitos sobre interoperabilidade, o modelo de dados JC3IEDM, e o método ADEM [2] para a troca de mensagens entre sistemas de C2. A seção III apresenta o projeto INTERC2 e a seção IV mostra a estrutura arquitetural do sistema e seus principais módulos. A seção V discute, com detalhamento técnico, as soluções encontradas para a troca de mensagens na arquitetura orientada a serviços criada. Por fim, na seção VI são feitas as considerações finais e esboçados alguns trabalhos futuros. II. INTEROPERABILIDADE DE C2 A Doutrina para o Sistema Militar de Comando e Controle [3] dá à interoperabilidade a seguinte definição: É a capacidade de os sistemas, unidades ou forças, intercambiarem serviços ou informações, ou aceitá-los de outros sistemas, unidades ou forças, e os empregarem, sem o comprometimento de suas funcionalidades. Para que a interoperabilidade possa ser vista de forma mais abrangente, deve compreender, além do nível técnico, o nível organizacional, como pode ser observado na Fig. 1 a seguir, extraída da referência [3]. Nessa figura pode ser observada a convergência dos níveis organizacionais e técnicos, constituindo a interoperabilidade de forma precisa, no que tange aos sistemas de C2. Para que tal convergência seja possível, é necessário estabelecer um modelo de intercâmbio de dados que unifique e padronize conceitos entre os sistemas e dispor de um padrão para a construção das interfaces e dos pontos de contato (endpoint) que permitam a troca de mensagens. A abordagem para atender ao requisito apresentado é a utilização de um modelo de dados comum, o JC3IEDM, desenvolvido pelo fórum multinacional conhecido como Multilateral Interoperability Program (MIP) e adotado pela Organização do Tratado do Atlântico Norte (OTAN), com o objetivo de viabilizar a integração entre sistemas de C2. Esse modelo representa a visão de alto nível da informação em termos de conceitos gerais, como ações, organizações, material, pessoal, recursos, instalações, locais e afins, representados em entidades. As propriedades ou características dessas entidades são referidas como atributos, que tornarão explícitos os dados a serem gravados para cada conceito de interesse. Para o contexto das operações realizadas em conjunto pelas nações que adotam o modelo JC3IEDM, o MIP definiu o Data Exchange Mechanism (DEM), que especifica como os sistemas de informação de C2 dessas nações devem realizar o intercâmbio de dados no modelo JC3IEDM. A complexidade inerente do JC3IEDM e suas diversas regras de negócio tornam complexa a implementação da especificação DEM. De forma a contornar os problemas de implementação do DEM, o MIP elaborou a especificação Alternate Development and Exchange Method (ADEM), que define um método para o intercâmbio de dados focado na Situação Corrente, utilizando a semântica do JC3IEDM e que oferece uma mudança de paradigma para troca de informações. Com o ADEM é possível realizar o intercâmbio de informações de forma simples e extensível, usando padrões abertos, facilitando a comunicação com as Comunidades de Interesse (Communities of Interest–COI), que podem não estar dispostas ou não serem capazes de implementar a especificação DEM. A expectativa é preencher a lacuna existente entre a comunidade MIP e as COIs, de forma a melhorar o compartilhamento de informação entre os diversos componentes de uma Operação Militar. O ADEM tem como proposta disponibilizar vários padrões de intercâmbio de dados, utilizando tecnologias comumente empregadas pelos desenvolvedores de sistema, incluindo, mas não se limitando a: Publish/Subscribe, Request/Response, Compartilhamento de Arquivos, Serviços de Dados Distribuídos (DDS), Webservices, entre outros. A simplificação da troca de informações no padrão JC3IEDM, pelo ADEM, concentra-se em pequenas estruturas discretas de informação, que têm valor operacional como objetos de batalha, eventos e associações entre eles. Este conjunto de estruturas de informação não é finito, podendo a COI estender essas estruturas de informação com conteúdo específico. Essa possibilidade de extensão dá flexibilidade ao uso do ADEM e permite que cada um dos sistemas de C2 possa adotar extensões para os tipos de objetos não contemplados pelo JC3IEDM. III. O PROJETO INTERC2 Em cumprimento ao Termo de Compromisso firmado com a SC-1/CHOC/EMCFA/MD, o Centro de Análises de Sistemas Navais (CASNAV) realizou, em 2014, a análise e o mapeamento do Processo de Comando e Controle nas OpCj, envolvendo as três etapas do PPC (Exame de Situação; Elaboração de Planos e Ordens e Controle da Operação Planejada (COP)), como parte dos estudos necessários à implementação de um barramento de comunicação SOA, visando à interoperabilidade entre os sistemas de comando e controle do MD e das FS. A partir dos processos levantados usando a técnica Business Process Management (BPM) e, com foco na etapa do COP, ficou estabelecido o faseamento do projeto, para levantar os requisitos, realizar a modelagem e construir uma primeira versão do Barramento de Comunicação, que demonstrou a possibilidade de estabelecer um serviço de troca de dados com o Sistema Naval de Comando e Controle (SISNC2). A escolha do SISNC2 foi baseada na proximidade das equipes de desenvolvimento, ambas no Rio de Janeiro, e na diferença de tecnologia. O SISNC2, desenvolvido em DELPHI, foi capaz de se conectar ao Barramento, construído com tecnologia Java. Essa característica de distintas tecnologias se conectarem, aumenta a possibilidade de conexão futura com os sistemas de C2 do Exército Brasileiro (EB) e da Força Aérea Brasileira (FAB), mesmo que sejam construídos com tecnologia distinta, ratificando a correta escolha de SOA para o Barramento. A Fig. 2 apresenta o diagrama esquemático da interoperabilidade visualizada entre os diversos sistemas de C2. No ano de 2015 está sendo testado o cadastramento e a troca de dados de posição dos meios, fatores fixos e feições de controle adjudicados a uma operação conjunta, bem como a atualização da hostilidade e da situação operacional dos meios e instalações. O Barramento de Comunicação com tecnologia SOA é um sistema intermediário (middleware) baseado no JC3IEDM que permite a troca de dados automática entre sistemas por meio de mensagens ADEM. O seu funcionamento eficaz depende da construção de interfaces em cada um desses sistemas, para que eles se comuniquem com o Barramento, enviando e recebendo informações dos serviços disponibilizados. O sucesso do projeto dará continuidade ao processo de interligação e interoperabilidade entre os centros de C2 que compõem o Sistema Militar de Comando e Controle (SISMC2), conforme consta na Política do SISMC2 [4]. Nas OpCj já ocorre a integração das etapas de Elaboração de Planos e Ordens e do COP, na prática. Essa integração precisa ser acompanhada pela interoperabilidade entre os sistemas de C2 das FS e o SIPLOM. Finalmente, a construção do Barramento de Comunicação contribui para o atendimento de uma das capacidades desejadas para as Forças Armadas, constante na Estratégia Nacional de Defesa [5], que possui como uma de suas diretrizes a Interoperabilidade nas OpCj. IV. ARQUITETURA DO BARRAMENTO De modo a garantir a interoperabilidade presente e futura, a arquitetura do INTERC2 segue padrões de entidades com autoridade normativa. Dentre esses, podemos destacar: · MIP: JC3IEDM e ADEM; e · W3C e OASIS: XML, XSD, WSDL. A tecnologia na qual está baseada a implementação da camada central da arquitetura do Barramento é Java. As principais justificativas para essa escolha são a sua maturidade, portabilidade, ausência de custo de licenciamento (baixo custo de aquisição) e disponibilidade de múltiplos fornecedores. O modelo de operação do software do Barramento, eminentemente baseado em intercâmbio de informação por meio de troca de mensagens, determina a sua forma de organização. Essa organização favorece ao padrão arquitetural de um processamento em estágios encadeados [6]. Mensagens são recebidas pelo sistema, verificadas, processadas e encaminhadas ao destinatário. Essa forma de organização condiz com a Arquitetura Orientada a Serviços. O fundamento da SOA é o desacoplamento entre as partes que se comunicam, permitindo flexibilidade para adaptação a novos requisitos ou integração a novos sistemas [7]. Essa modalidade de arquitetura é o alicerce do Barramento. De modo a não incorrer em custo de implementação da infraestrutura, o projeto INTERC2 adotou um Barramento de Serviços Corporativo (Enterprise Service Bus – ESB) com base em SOA. A equipe do projeto INTERC2 realizou uma análise comparativa entre seis produtos ESB de software livre e decidiu empregar o Apache ServiceMix [8]. O ServiceMix é formado, principalmente, por quatro projetos Apache: Karaf – a plataforma OSGi [9], ActiveMQ – os componentes de mensageria, CXF – os componentes WS-*, e Camel – Domain Specific Language (DSL) e componentes de integração. Esses módulos realizam as funções de comunicação – webservices, filas para mensagens, acesso e transformação de dados. O padrão OSGi, facilita a implementação de componentes versionados com interfaces bem definidas e dependências explícitas. A possibilidade de coexistência de componentes em versões distintas torna possível tanto a evolução dos componentes quanto das interfaces de serviços. Os artefatos finais, específicos ao âmbito do Barramento, constituem componentes OSGi. A configuração e integração destes componentes ocorre por meio de blueprints XML que fazem referência a webservices, filas e componentes de persistência. Os componentes favoreceram o emprego da linguagem DSL Apache Camel para sua implementação. As vantagens do uso da DSL são clareza e facilidade para implementação das regras de C2. Os casos de maior complexidade foram codificados em Java. O diagrama de arquitetura da Fig. 3 apresenta uma visão funcional em módulos com os ativos de software utilizados. Os webservices do Barramento, baseados no ADEM, são descritos em Web Services Description Language (WSDL) e empregam a API Java JAX-WS para serviços. Há serviços de solicitação e resposta que podem ser tratados em portas distintas. Os webservices empregam nas mensagens objetos ADEM normatizados, com algumas extensões específicas aos sistemas de C2 do MD. Todas as mensagens do Barramento são mapeadas e persistidas em um banco de dados baseado no JC3IEDM. O JC3IEDM é inteiramente relacional, motivo pelo qual emprega-se um SGBD relacional para sua implementação. O SGBD escolhido foi o PostgreSQL [10]. O SO utilizado é o CentOS [11], uma distribuição estável e livre do Linux para projetos corporativos. De modo a garantir o baixo acoplamento entre os módulos, a tolerância a falhas e o processamento estável durante um período de intercâmbio intenso, o Barramento emprega filas de mensagens persistentes do tipo Java Message Service (JMS) [12]. O JMS é uma interface de programação de aplicações (API) na plataforma Java Enterprise Edition (Java EE), para middleware orientado à mensagens. Por meio da API JMS, duas ou mais aplicações podem se comunicar por mensagens. O fator de segurança para a arquitetura está presente em todas as camadas, havendo destaque para o aspecto de comunicação do Barramento. A segurança ponto a ponto das Máquinas Virtuais (VM) é realizada pelo firewall já presente no kernel do Sistema Operacional Linux. A possibilidade de conexão ocorre apenas nos endereços de IP conhecidos e nas portas autorizadas. Os firewalls estão baseados no Apache HTTP Server, configurado em modalidade proxy. A separação das funções por camadas permite que o Barramento adote a virtualização, onde múltiplas VM podem ser especializadas por função. Esse arranjo permite, se necessário, que seja adotado clustering de serviços. A versão 1.0 do Barramento emprega uma VM para dados, uma para integração e outra para monitoramento. O monitoramento dos serviços e da situação operacional das outras VM está centrado no Zabbix [13]. O Zabbix é o software para aplicações corporativas, projetado para o monitoramento em tempo real de métricas coletadas a partir de servidores, máquinas virtuais e dispositivos de rede, sendo de licença Open Source. V. A INTERFACE DE COMUNICAÇÃO Com o objetivo de divulgar a forma de conexão entre os sistemas foi publicada, em março de 2015, a interface para intercâmbio de dados do Barramento de Comunicação entre o sistema de C2 do Ministério da Defesa e os sistemas de C2 das FS, visando à interoperabilidade, com enfoque no levantamento de necessidades de informações para a tomada de decisão, nos níveis operacional/estratégico. O ADEM decompõe o JC3IEDM, mantendo a sua semântica em pequenas mensagens discretas que podem ser utilizadas individualmente ou agregadas, permitindo a troca de um conjunto mínimo de informações. Cada uma das mensagens discretas é completa em si e não depende de informações previamente trocadas ou fornecidas no futuro. Assim, as informações das mensagens ADEM são atemporais e podem ser mapeadas em entidades JC3IEDM. Como exemplo, uma mensagem que tramita informação sobre uma Unidade (Unit), inclui informação sobre as seguintes entidades JC3IEDM: UNIT, UNIT-TYPE, LOCATION, ORGANISATION-STATUS, OBJECT-ITEM-HOSTILITY, OBJECT-ITEM, OBJECT-TYPE, AFFILIATION-GEOPOLITICAL, REPORTING-DATA, REPORTING-DATA-ABSOLUTE-TIMING, SECURITY-CLASSIFICATION. O subconjunto de mensagens ADEM escolhido para a atual versão do Barramento de Comunicação permite ao SIPLOM receber informações dos sistemas de C2 das FS sobre a Unidade e seu tipo (UNIT e UNIT-TYPE), a localização (LOCATION), hostilidade (OBJECT-ITEMHOSTILITY) e a situação operacional (ORGANISATIONSTATUS) dos objetos de batalha nas OpCj. As mensagens transmitidas pelos sistemas de C2 das FS e recebidas pelo barramento adotam os esquemas XML (XSD) padronizados pelo ADEM na versão 1.0.2. Esses esquemas representam o modelo segundo o qual as informações deverão ser codificadas como mensagens XML. Essas mensagens serão dirigidas para os Serviços Web. Os esquemas XML são disponibilizados como arquivos individuais.  Mensagens válidas são registradas no arquivo de 'Log'. As informações necessárias são armazenadas no Banco de Dados do Barramento e retransmitidas para o SIPLOM. Mensagens inválidas geram um recibo de não conformidade que será devolvido para o sistema de C2 de cada FS. Como já mencionado, o ADEM utiliza a semântica do JUMEDM, porém, devido à sua natureza informacional, cujo objetivo é o intercâmbio da situação corrente, alguns tipos de objetos definidos pelo JCSHEDM não são contemplados pela especificação do ADEM. Como a possibilidade de extensões é prevista na especificação do ADEM, esse recurso é utilizado, garantindo, assim, a troca de informações adaptada à realidade brasileira. A comunicação entre o Barramento e os sistemas de CS é padronizada por contratos de serviços baseados em documentos no formato Web Services Description Language (WSDL). Os WSDLs empregados pelo Barramento estão baseados no método ADEM, do mesmo modo que os esquemas XML das mensagens. Os documentos WSDL são disponibilizados individualmente para cada uma das Forças e para os sistemas de C2 do MD. A modalidade de conversação empregada é a Request-Response. Há quatro endpoints (pontos de entrada para um serviço) específicos para cada FS: O Endpoint de Operações, onde o sistema de C2 do MD informa sobre as Operações Conjuntas e os sistemas de C2 das Forças informam sobre as Operações Singulares. O Endpoint de Objetos de Batalha, onde é realizado o registro para identificação e uso posterior do objeto. O Endpoint de Associação, onde é realizada a adjudicação do Objeto de Interesse à Operação. O Endpoint de Atualização, onde é realizada a atualização dos Objetos de Batalha. O sistema de C2 de cada FS possui o mesmo conjunto de serviços, porém apresentado em um número de IP e uma Porta distintos, por questões de Segurança da Informação. A Fig. 4 apresenta o Barramento em execução, mostrando uma tela com informações de uma mensagem na fila JMS. Destaca-se no cabeçalho, logo na primeira linha, a origem da mensagem (source = MB), indicando que foi gerada pelo SISNUZ e, logo na linha seguinte, o servidor hospedeiro da fila JMS (localhost). Ainda no cabeçalho, na quarta linha, pode-se ler o tipo do meio como navio de superfície (SurfaceVessel). Mais abaixo, no corpo da mensagem, lê-se a entidade ReportingLateTime, indicando a data e hora. Em seguida, várias linhas iniciando com =>je3, mostrando o nome do meio (Fragata Constituição), a hostilidade (amigo - FR) e o estado operacional do meio (operacional = OPR). Em seguida, aparece o indicativo de casco (F42) e, logo abaixo, a nacionalidade 'BRA', indicando ser um meio do Brasil. Na Fig. 5 apresenta-se o diagrama de sequência para a troca de mensagens em uma OpC. Inicialmente o Barramento informa o período da Operação para os sistemas de C2 das FS. A partir desse momento as FS iniciam o cadastramento dos meios (objetos de batalha) que serão empregados (adjudicados) na Operação Militar. Ao início da OpC3) esses meios passam a ser acompanhados e podem ser realizadas atualizações nos seus atributos, particularmente, na posição geográfica do objeto que passa a ser chamado de Acompanhamento. VI. OBSERVAÇÕES FINAIS A busca pela interoperabilidade entre os sistemas de C2 das FS e o SIPLOM, particularmente no nível operacional em OpCj, está alicerçada na utilização de protocolo IP, modelo de dados JC3IEDM e a adoção de uma arquitetura orientada a serviços. O projeto INTERC2 está realizando a construção do Barramento de Comunicação que possibilita o estabelecimento de serviços de troca de dados entre os sistemas de C2 das FS e o SIPLOM. O Barramento contribui para ampliar a obtenção de uma consciência situacional compartilhada intra Comando Operacional em uma Operação Conjunta. Como projeto-piloto foi escolhido o Sistema Naval de Comando e Controle (SISNC2), para os testes de exequibilidade. A escolha do SISNC2 foi baseada na proximidade das equipes de desenvolvimento, ambas no Rio de Janeiro, e na diferença de tecnologia. O SISNC2, desenvolvido em DELPHI, foi capaz de se conectar ao Barramento, construído com tecnologia Java. O sucesso dos testes realizados com sistemas construídos com distintas tecnologias amplia a possibilidade de integração futura com os sistemas do Exército Brasileiro e da Força Aérea Brasileira, mesmo que sejam construídos com tecnologias diferentes das elencadas para a construção do Barramento. A escolha da arquitetura SOA, também, contribui para a integração, uma vez que um de seus fundamentos é o desacoplamento entre as partes que se comunicam, permitindo flexibilidade para adaptação a novos requisitos ou integração de novos sistemas. O Barramento de Comunicação é desenvolvido com software livre, modelo de dados JC3IEDM, realizado com um SGBD relacional, e webservices baseados no ADEM. Essa padronização garante um modelo comum de intercâmbio de dados e mensagens. O padrão OSGi garante a coexistência de componentes em versões distintas, o que torna possível tanto a evolução dos componentes, quanto das interfaces de serviços. O emprego de filas JMS garante a tolerância a falhas e processamento estável durante um período de intercâmbio intenso de dados. Uma Interface de Comunicação foi concebida e divulgada para a área tecnológica de cada uma das FS e para o projeto SIPLOM, com o objetivo de padronizar a forma de conexão entre os sistemas de C2 e o Barramento. Nessa primeira etapa, o objetivo a ser alcançado pelo projeto INTERC2 é possibilitar a tramitação das informações de localização, hostilidade e situação operacional dos meios empregados em uma Operação Conjunta. Entretanto, as necessidades de interoperabilidade entre o MD e as FS vão além dessas informações. Atualmente, já é realizada a troca de mensagens com o SISNC2 e os próximos passos são a interoperabilidade com o SIPLOM e com o sistema de C2 do Exército Brasileiro. Visualiza-se que, no decorrer do desenvolvimento das próximas versões, seja possível implementar os serviços que permitam tramitar dados da Matriz de Sincronização, informações sobre capacidades, serviço de simbologia e a integração com outros sistemas de interesse do MD."
	}
