{
    "id": 110,
    "titulo": " caracterização do óculos de visão noturna em missão de busca de alvos ativos",
    "autor": "cristiano link, ernesto cordeiro marujo e denise beatriz ferrari",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2015/st/ST_7_2.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 3,
    "resumo": "Este trabalho descreve os testes realizados para a caracterização de um Equipamento de Visão Noturna em missões de busca de alvos ativos. O planejamento de experimentos seguiu o Design Split-Plot. Investigou-se como a distância de detecção é afetada pelo tipo da fonte luminosa, altura de voo, cobertura de vegetação, período (classe da noite) e suas interações de segunda ordem. Um modelo de regressão foi ajustado pelo método REML (Restricted Maximum Likelihood). As hipóteses intuitivamente esperadas foram aceitas, exceto a hipótese de que a distância de detecção diminui com o aumento da altura de voo, que foi rejeitada.",
    "texto": " I. INTRODUÇÃO No início da aviação no Brasil, as atividades de Busca e Salvamento (SAR) já eram levadas a efeito para atender a eventuais situações de perigo. Porém, de forma improvisada, já que não se dispunha de recursos apropriados nem de pessoal especializado. Busca e Salvamento é definida em [1] como: a Ação que consiste em empregar meios de Força Aérea para localizar e salvar pessoas em perigo na terra e no mar. A Força Aérea Brasileira (FAB) conta com diversas aeronaves para a realização dessa Ação, destacando-se os C-105 Amazonas, que estão em operação desde 2006, como parte do programa de modernização da frota de aeronaves de transporte. As duas últimas aeronaves deste tipo foram adquiridas com uma configuração especial para missões de Busca e Salvamento. Neste contexto, ressalta-se que as aeronaves Amazonas foram projetadas para ter capacidade para realização de missões com Óculos de Visão Noturna (NVG – Night Vision Goggles). Entretanto, em função da escassez de doutrina estabelecida, realizou-se uma Avaliação Operacional para que questões críticas fossem devidamente respondidas. Dentre essas questões, este trabalho busca responder uma delas: Quais os fatores que afetam a distância de detecção de alvos ativos com o uso do NVG?  II. BUSCA E SALVAMENTO Segundo os Manuais [2] e [3], os fatores que afetam a capacidade de detecção podem ser representados por quatro expressões matemáticas inter-relacionadas e que podem simplificar o emprego das unidades de busca. Os termos para essas expressões matemáticas, junto com as suas siglas, são: a) probabilidade de detecção (POD); b) largura de varredura (W); c) espaçamento (S); e d) fator de cobertura (C). A probabilidade de detecção (POD) é essencial para o planejamento e avaliação das missões de Busca, e está estritamente vinculada ao fator de cobertura. A configuração de busca em rotas paralelas tende a maximizar a POD se estas forem realizadas com perfeição. A deterioração das condições, devido ao mau tempo, erro de navegação da aeronave SAR, ou ambos, afetam negativamente a POD. Além disso, a largura de varredura pode diminuir à medida que pioram as condições, e a área de detecção pode variar a ponto de reduzir a vantagem da detecção obtida pela utilização da varredura paralela. Podem ser utilizados valores intermediários se as condições não forem ideais nem normais. Entende-se que condições normais abrangem quaisquer situações significativamente inferiores às condições ideais.  Largura de Varredura (W) é uma medida relacionada com a facilidade ou a dificuldade de detectar um determinado objeto da busca, com um determinado sensor, em determinadas condições ambientais. Os manuais fornecem tabelas de valores não corrigidos de largura da varredura, baseados no objeto da busca e na visibilidade meteorológica para tempo bom, e fatores de correção baseados no objeto da busca e nas condições do tempo (fw). A multiplicação do valor não corrigido da largura da varredura (WU) pelo fator de correção apropriado para as condições do tempo produz a largura da varredura corrigida (WC). A maioria dos padrões de busca consiste em trajetórias retas e paralelas, igualmente espaçadas, cobrindo uma área retangular. A distância entre trajetórias adjacentes é chamada de Espaçamento Entre Trajetórias (S).  Cobertura (C) é a razão entre a largura da varredura corrigida (WC) e o espaçamento entre trajetórias (S). A cobertura recomendada (C) para a maioria das situações é 1:0, o que significa que o espaçamento recomendado entre trajetórias (S) na maioria das situações é igual à largura da varredura corrigida (WC). Durante as missões, podem ocorrer mudanças nas condições do tempo, no número de embarcações ou de aeronaves participando da busca, fazendo com que seja prudente alterar o espaçamento entre trajetórias (S). Todos os navios e aeronaves que participam da busca devem manter distâncias seguras entre si e seguir precisamente as trajetórias de busca que lhes forem designadas.  A Largura de Varredura, segundo [2], pode ser afetada isoladamente ou de forma combinada pelos seguintes fatores:  Tipo do objeto, como exemplo uma pessoa ou veículo/embarcação; Visibilidade meteorológica; Tipo do terreno ou estado do mar; Altura; Posição do sol; Eficácia dos observadores; e Fatores diurnos e noturnos. A eficácia dos observadores pode ser alterada com o uso de equipamentos óticos, tais como binóculos, câmeras ou, no caso desta pesquisa, o NVG.  Apoiado na teoria de busca de [4] e nas características do NVG, investigamos as seguintes hipóteses:  O aumento da altura de voo diminui a distância de detecção; A classe da noite não afeta a distância de detecção; e O aumento da cobertura de vegetação diminui a distância de detecção. Neste Trabalho investigamos o seguinte modelo em sua forma mais geral: III. PROJETO DE EXPERIMENTOS – SPLIT-PLOT DESIGN Para obter dados passíveis de análise estatística significativa, é necessário planejar os experimentos. Segundo [5], o Split-Plot Design é uma generalização do Factorial Design utilizado quando não é possível aleatorizar completamente a sequência de corridas do experimento. Os fatores que não podem ser alterados com facilidade podem ser chamados de Whole Plot ou fatores principais. Cada Whole Plot será dividido em partes, chamadas Subplots ou split-plots. O Split-Plot Design começou na indústria agrícola, segundo [6]. Nesses casos, um dos fatores do experimento é geralmente um fertilizante ou método de irrigação, que somente pode ser aplicado a uma grande faixa de terra chamada Whole Plot. Desta forma, como vimos anteriormente, o fator associado à faixa de terra é chamado de Whole Plot Factor. Dentro do Whole Plot, outro fator, como a variedade das sementes, é aplicado em seções menores, que foram obtidas pela divisão da seção maior em subplots. Esse fator, portanto, será referido como subplot factor. Outros bons exemplos podem ser encontrados em [6]. Muitas vezes, o experimentador não reconhece a estrutura específica do Split-Plot Design. Ao identificar um ou mais fatores de difícil mudança, ele monta um modelo fatorial padrão e, em seguida, reordena as corridas para minimizar as alterações deste fator. Assim, nesses casos, cria-se um Split-Plot Design inadvertido; porém, analisam-se os dados como se fossem um fatorial padrão. Normalmente, em um Split-Plot Design inadvertido, há tendência de se incorrer no erro tipo I nos fatores associados aos Whole Plots (considerando fatores que não são importantes como importantes) e erro tipo II nos fatores associados aos Subplots (falhando na identificação de fatores significativos). IV. MÉTODO DE ANÁLISE A análise dos dados de um Split-Plot Design deve ser realizada utilizando um modelo misto (5), envolvendo as variáveis (X) de efeitos fixos e variáveis (Z) de efeito aleatório. O software JMP©R possui dois métodos para análise de modelos mistos: o método REML (Máxima Verossimilhança Restrita) e o método EMS (Expected Means Squares), também conhecido como método dos momentos. [7] A abordagem REML iniciada por [8] e atualmente a metodologia mais utilizada, substituindo o tradicional método dos momentos. O REML é consideravelmente mais generalizado em termos de aplicabilidade do que o método EMS. Veja também [9] e [10]. A metodologia REML produz a estimativa de máxima verossimilhança de uma função de verossimilhança restrita que não depende dos parâmetros de efeitos fixos. O método produz estimativas dos componentes de variância que serão utilizados para obter as estimativas dos efeitos fixos. Mesmo quando tivermos dados desbalanceados, o REML produz estimativas, testes e intervalos de confiança eficientes. O método EMS restringe as análises a dados balanceados, pois foi desenvolvido antes da disponibilidade de computadores poderosos. Esse método é disponibilizado pelo JMP©R para estudos iniciais de modelos com efeitos aleatórios, usados em várias referências como [10], [11] e [12]. As estimativas produzidas de dados balanceados são idênticas para os dois métodos. Porém, de maneira diferente do EMS, o REML também é eficiente com dados desbalanceados. V. EXPERIMENTO Para a caracterização do perfil de detecção de diferentes alvos ativos em diferentes condições, assim como identificação dos fatores que influenciam na distância máxima de detecção de alvos ativos para a posterior avaliação da aplicabilidade do NVG em buscas noturnas, julgou-se apropriado selecionar o flash visível, flash infravermelho e fogueira. É válido chamar a atenção para o fato de que a cobertura de vegetação é um aspecto operacional relevante, já que um sobrevivente, por exemplo, deve recolher-se em torno de uma fogueira em condições de abrigo. Pretende-se determinar a distância máxima de detecção com o NVG. Além disso, posteriormente, a comparação com as medidas realizadas em buscas diurnas propiciarão à FAB uma medida quantitativa do atual desempenho da busca noturna com NVG para diferentes níveis de luminosidade, bem como um parâmetro de degradação/melhoria operacional decorrente do uso do NVG. A seguir, apresentaremos a descrição técnica geral do experimento. As seguintes características foram consideradas: a) Resposta: Distância de Detecção; b) Fatores: i. Fonte Luminosa (Fogueira / Flash IR / Flash Visível) ii. Altura (1000ft / 2000ft) iii. Cobertura (15% / 65% / >80%) iv. Período (Noite 1(Escura) / Noite 2 (Intermediária) / Noite 3 (Clara)) c) Número de Whole Plots: 18; d) Total de rodadas: 36 (2 rodadas por plot); e e) Ortogonalidade: Quase ortogonal. O referido experimento foi realizado no Campo de Provas Brigadeiro Velloso por equipagens operacionais em missões de Busca e Salvamento. Foram utilizadas aproximadamente 10 horas de voo da aeronave SC-105 Amazonas.  VI. ANÁLISE DOS DADOS A análise inicial dos dados utilizando o método EMS, disponibilizado pelo software JMP©R, mostrou-se, como esperado, ineficiente. No caso em questão, gerou parâmetros viesados ou zerados, devido ao desbalanceamento dos dados, e não foi possível realizar testes para verificar a significância dos fatores e das interações de segunda ordem. Utilizando o método REML, foi possível realizar alguns testes, conforme Tabela I. Apesar de não ser possível realizar os testes para todas as interações, a interação AlturaCobertura apresentou um P-valor elevado, indicando que tal interação não parece ser significativa para explicar a distância de detecção. A seguir, retiramos a interação AlturaCobertura do modelo, o que permitiu a realização dos testes das demais interações. Prosseguimos retirando uma a uma todas as demais interações que não pareciam ser significativas para o modelo. Ao final do processo, consideramos o modelo a seguir: Os valores do R Square e R Square Adj, apresentados na Tabela III, do modelo final são elevados, indicando que o modelo é aceitável. O efeito do Período, como era esperado, não é significativo. Porém, o mesmo não foi retirado do modelo, pois os resíduos começaram a apresentar um comportamento sistemático. Na Fig.1, pode-se avaliar as diferenças entre os resíduos referentes às Fontes Luminosas (Fogueira - pontos pretos / Strobo - pontos cinzas). A análise desses comportamentos dependerá de estudos mais aprofundados. A altura apresentou efeito contrário ao esperado, possivelmente devido à não identificação de algum fator ou condição de contorno na especificação inicial do modelo. Suspeita-se que essa falha tenha relação com a limitação do horizonte visual. Podemos observar, na Fig.2, o efeito da Fonte Luminosa na distância de detecção. No caso da fonte ser uma fogueira, a distância de detecção prevista é de 5,16 a 8,98 NM, considerando um intervalo de confiança de 95%, ou seja, uma previsão da distância de detecção média de 7,07 NM. Se a fonte luminosa for o strobo visível, podemos ver que a distância será menor. VII. CONCLUSÃO Este trabalho procurou caracterizar os Óculos de Visão Noturna em Missões de Busca de Alvos Ativos. Para tanto, apresentaram-se conceitos básicos necessários ao entendimento geral do processo e do sistema estudado, consideraram-se algumas abordagens adotadas por autores-referência na área e, por fim, partiu-se para as ações práticas. Foram pesquisados os fatores que seriam relevantes na previsão da distância de detecção de alvos ativos. Foi empregado o método de planejamento de experimentos conhecido como Split-Plot, devido à dificuldade de aleatorização do período (classe da noite), conforme o abordado por [5]. Subsequentemente, foram analisados os dados obtidos nos experimentos realizados, conforme esse planejamento. Utilizando o método REML para a análise desses dados, obtivemos as seguintes conclusões:  A hipótese de que o aumento da altura de voo diminui a distância de detecção foi rejeitada. Porém, foi identificada uma possível falha de especificação do modelo ou falta de definição de condição de contorno, o que dependerá de estudos mais aprofundados; A hipótese de que a classe da noite não afeta a distância de detecção não foi rejeitada; e A hipótese de que o aumento da cobertura de vegetação diminui a distância de detecção também não foi rejeitada. A não confirmação da hipótese 1 sugere que novos estudos devam ser realizados, com o propósito de identificar a possível falha de especificação ou falta de definição das condições de contorno. Outras sugestões são a realização de estudos para a detecção de alvos passivos e o reconhecimento de alvos passivos e ativos.  "
}