{
    "id": 111,
    "titulo": "geração de sinais por técnicas fotônicas de conversão de frequência utilizando moduladores mach-zehnder",
    "autor": "romildo henrique de souza, olympio. l. coutinho, vilson r. almeida, josé edimar barbosa oliveira",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2014/st/ST_2_3.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 2,
    "resumo": "A promissora área de RF em Fotônica tem possibilitado atender a demanda por largura de banda e velocidade de transmissão dos sistemas de telecomunicações analógicos e digitais. Suas aplicações estendem-se desde o enlace para transporte de dados até a geração de sinais em microondas e ondas milimétricas com alta estabilidade e baixo ruído de fase. Nesse contexto, diversos métodos que empregam técnicas fotônicas constam na literatura científica para obtenção de sinais em altas frequências a partir de um sinal elétrico de mais baixa frequência. Em particular, o emprego de moduladores eletro-ópticos na configuração paralela (DPMZM) tem atraído atenção pela sua simplicidade e funcionalidade. A disponibilização de uma solução analítica exata, recentemente publicada, para as componentes espectrais da corrente elétrica, contrapondo-se às soluções aproximadas até então apresentadas, permite uma análise mais ampla, não se limitado ao caso de pequenos sinais. Este artigo propõe uma aplicação direta desta abordagem com base em um dispositivo disponível comercialmente.",
    "texto": "I. INTRODUÇÃO O advento das comunicações digitais introduziu técnicas de modulação que permitiram obter melhor eficiência espectral, elevando assim as taxas de transmissão de informação. Com a crescente demanda por largura de banda para suprir as necessidades das aplicações atuais, novos conceitos podem ser incorporados a métodos bem fundamentados. É o caso de RF em Fotônica (RF Photonics ou Microwave Photonics): um campo de pesquisa multidisciplinar que utiliza técnicas da área de fotônica para desenvolver funcionalidades nos sistemas de radiofrequência (RF) [1]. Um dos exemplos de maior impacto consiste nos sistemas de micro-ondas e ondas milimétricas, com grande largura de banda, que se baseiam na transmissão de sinais analógicos, utilizando técnicas de RF, pelo meio óptico. Como sinais analógicos, entenda-se sinal analógico em banda base ou sinal digital modulado em RF. Dentre as aplicações mais comuns, pode-se citar sinais de radar, telefonia celular de voz e dados, TV a cabo (CATV) [2]. A fibra óptica como meio de transmissão permite dispor as antenas e/ou conversores a uma longa distância da central de comando e controle, devido às suas características de baixa atenuação, imunidade a interferências eletromagnéticas, robustez, peso e flexibilidade, além de aproveitar a rede óptica e a metodologia já implantada para as comunicações digitais. No cenário de Guerra Eletrônica, a localização diferenciada entre as antenas de radar e as centrais de geração e processamento de sinais torna-se uma estratégia operacional adequada e viável com a utilização de RF em Fotônica [3]. Observando o caráter dual para aplicações civis e militares [4], as linhas de pesquisa têm sido diversificadas, englobando tanto o desempenho da fibra óptica no enlace, quanto as arquiteturas de formatação de feixe (beamformers) de antenas phased array [5] e o projeto dos dispositivos e componentes do sistema [6]. No que se refere ao transmissor, pode-se optar pela modulação direta ou externa, desde que as variações de amplitude e de fase (chirping), inerentes a ambas, sejam consideradas, uma vez que a dispersão cromática da fibra ocasiona a conversão entre modulação de amplitude e modulação de fase (AM-PM), e vice-versa [7]-[8]. Quando a modulação externa é empregada, por meio de um MZM (Mach Zehnder Modulator), sua função característica permite com que ele possa ser considerado como o maior responsável pelas não-linearidades do enlace, o que restringe a faixa dinâmica possível, desde que a potência da fonte óptica seja limitada de tal forma que as não-linearidades da fibra e do fotodetector não se pronunciem [9]. A dispersão cromática da fibra óptica também acarretará uma penalidade na relação C/N (carrier-to-noise), que limitará o comprimento do enlace óptico, no caso de modulação de intensidade/detecção direta (IM/DD), além do aumento do ruído de fase, em sistemas ópticos coerentes [10]. Tais efeitos ocorrem tanto para as típicas transmissões DSB (Dual Side Band) e SSB (Single Side Band) [11]-[12], quanto para transmissões com subportadoras para modulação digital, por exemplo, QAM (Quadrature Amplitude Modulation) [13]. Sistemas radar utilizam vários formatos de compressão de pulsos, de acordo com os seus requisitos quanto à sensibilidade ao efeito Doppler, aos níveis dos lóbulos laterais, à velocidade do alvo e à capacidade de processamento de sinais, entre outros [14]. Outro fator determinante para o desempenho do radar está na sua faixa de frequência de operação, ou seja, a frequência da portadora do sinal radar, havendo aplicações desde a faixa de HF (High Frequency) até a de ondas milimétricas, isto é, acima de 40 GHz. A necessidade de obter sinais com tal alta frequência, que apresente boa estabilidade e baixo ruído de fase, resulta em promissores temas de estudo, tanto por meio do desenvolvimento de novas técnicas puramente eletrônicas [15], quanto pela abordagem híbrida eletrônica-fotônica. Esta última também se constitui em uma das áreas estratégicas de RF em Fotônica, sendo o objeto do presente artigo. No contexto de geração de sinais elétricos por meio de técnicas fotônicas, visando aplicações em alta frequência e com elevada largura de banda, diversos métodos estão descritos na literatura, incluindo resultados experimentais [16]-[22]. Dentre eles, destacam-se sistemas conversores de frequência que se baseiam na obtenção de sinais com o dobro, quádruplo [17]-[20], sêxtuplo [20] ou óctuplo [20]- [22] da frequência do sinal original. Porém, historicamente, a análise deste tipo de técnica tem sido realizada por meio de formulações que utilizam aproximações que se restringem ao caso de pequenos sinais, limitando o índice de modulação a valores arbitrariamente reduzidos. Uma solução analítica exata para um quadruplicador de frequência foi demonstrado por [23], o qual apresenta uma configuração que será aqui explorada do ponto de visto técnico. Para tanto, este artigo está dividido da seguinte forma: a Seção II expressa os fundamentos e formulações para geração de sinais elétricos com o dobro e o quádruplo da frequência original utilizando, respectivamente, um MZM operando em modo Dual Drive (DD-MZM) e um dispositivo integrado em configuração Dual Parallel (DP-MZM). Discussões e resultados são apresentados na Seção III, enquanto a Seção IV analisa as características técnicas de um dispositivo integrado adequado para tal funcionalidade, com base nas informações constantes nos catálogos de dois modelos disponíveis comercialmente. Por último, seguem-se as conclusões na Seção IV. II. TÉCNICAS DE CONVERSÃO DE FREQUÊNCIA A. Configuração DD-MZM O modulador eletro-óptico Mach-Zehnder operando no modo Dual Drive possui entradas de RF individuais alimentando seus dois caminhos ópticos diferentes, bem como tensões de polarização (bias) respectivas. Sua entrada óptica está conectada a uma fonte óptica, por exemplo um Laser, por meio de um polarizador óptico ou por um cabo de fibra polarizada, visando garantir acoplamento adequado com a entrada do MZM. A possibilidade de configurar diversas combinações de sinais de RF e tensões de polarização torna o DD-MZM um dispositivo versátil para aplicações variadas, desde a conversão de sinais elétricos em sinais ópticos para transmissão por um enlace de fibra, até a geração de sinais com frequências superiores ao sinal RF de entrada. Esta última característica pode ser obtida por meio da configuração apresentada no diagrama esquemático da Fig. 1, que disponibiliza novamente o sinal elétrico após o fotodetector (PD). Para este caso particular, os sinais RF de entrada em cada um dos braços possuem mesma amplitude máxima VRF e a mesma frequência ωRF, porém estão defasados por um ângulo θ1: O valor de θ1 será considerado π RAD, para que o espectro óptico seja DSB, visando atender os objetivos deste estudo. A tensão de polarização do braço inferior Vb2 será nula, de modo que apenas a tensão de polarização do braço superior Vb1 defina o ponto de operação na curva característica do modulador. Para efeitos de conversão em frequências superiores, trabalha-se na região não-linear dessa curva, podendo ser no ponto de máxima transmitância (MATB) ou no ponto de mínima transmitância (MITB), os quais são obtidos respectivamente, com θ2=0 e θ2=π RAD, sendo:O parâmetro VπDC é a tensão de meia-onda em DC, característica do MZM. Da mesma forma, o MZM apresenta uma tensão de meia-onda em RF, chamada VπRF, que dependendo da amplitude do sinal de entrada VRF, estabelece um índice de modulação m definido por: Postulando um laser ideal, i.e., largura espectral nula e sem ruído de fase, com potência óptica Po, amplitude de campo elétrico óptico Eo e frequência ωo, o campo elétrico na saída do DD-MZM, operando em MATB, é expresso por: Uma vez que a potência óptica é proporcional ao quadrado do módulo do campo elétrico de (5), utiliza-se a expansão de Jacobi-Anger para se determinar a componente espectral de potência óptica na saída do DD-MZM na frequência ωo+n.ωRF : A potência óptica total é o somatório de (6), para n de -∞ a +∞. Por outro lado, aplicando a expansão de Jacobi-Anger em (5) e após algumas manipulações algébricas, tem-se: Para um detector quadrático, a sua corrente de saída é proporcional ao produto do campo elétrico incidente em sua entrada (7) pelo seu complexo conjugado. Contudo, esta multiplicação envolve o produto de dois somatórios, o que levou muitos autores a truncar a série em uma determinada ordem, conduzindo a soluções aproximadas para a corrente do fotodetector. Seguindo os procedimentos em [12], que utilizam o Teorema da Adição de Graf para expressar esse duplo somatório como apenas um, chega-se a uma solução exata da corrente elétrica no fotodetector, em que cada componente espectral é dado por: considerando  como a responsividade do fotodetector. Uma análise de (6) permite visualizar o espectro óptico, enquanto (8) relaciona-se ao espectro eletrônico. Caso a formulação tivesse sido desenvolvida para MITB, i.e., θ2=π RAD, a expressão para as componentes espectrais de corrente elétrica seria idêntica ao caso MATB de (8), enquanto a componente espectral de potência óptica seria dada por (9) abaixo: Diante dos resultados obtidos em (6), (8) e (9), conclui-se que o espectro óptico é composto pela portadora óptica e por termos pares de n, quando a operação é DSB com MATB (Fig. 2(a)), e por termos ímpares de n com a portadora suprimida, em DSB com MITB (Fig. 2(b)). Em ambos os regimes de polarização, o espectro eletrônico possui apenas harmônicos pares da frequência fundamental ωRF (Fig. 2(c)). Com essa configuração, é possível obter um sinal com o dobro da frequência do sinal original RF, desde que o valor de m seja adequadamente escolhido, de tal forma que os harmônicos superiores à quarta ordem possam ser considerados desprezíveis em relação aos de segunda. B. Configuração DP-MZM Para geração de sinais com alta estabilidade em frequências mais elevadas, por exemplo, na faixa de ondas milimétricas (> 40 GHz), a configuração DD-MZM pode não ser suficiente. Uma alternativa é a configuração DP-MZM ilustrada na Fig. 3, que permite obter sinais com frequências quatro vezes maiores que a frequência fundamental sem a necessidade de utilização de filtros ópticos [17]-[19]. Esta configuração é formada por dois DD-MZM’s, idênticos àqueles descritos na subseção anterior, conectados em paralelo, ou seja, o sinal óptico proveniente do laser é dividido entre os dois moduladores e são recombinados após cada uma de suas saídas, indo o sinal óptico resultante para a entrada do fotodetector. Porém, nesta abordagem, as fases entre os sinais RF aplicados nos dois braços de cada MZM agora é π /2 RAD, e entre os moduladores superior (I) e inferior (II) é π RAD. Apenas os braços inferiores de cada modulador são polarizados com valores iguais à da tensão de meia-onda DC: Nestas condições, o campo elétrico do sinal óptico na saída do conjunto DP-MZM é [23]: Recorrendo à expansão de Jacobi-Anger e manipulando (10), obtém-se: onde o coeficiente an é representado por: Seguindo os mesmos passos da análise anterior feita para o DD-MZM, toma-se o produto de (11) pelo seu complexo conjugado para se obter a corrente elétrica no fotodetector. Novamente, tem-se um produto de dois somatórios em que o Teorema da Adição de Graf pode auxiliar na simplificação do resultado, fornecendo diretamente uma solução analítica: onde H(n) é uma função auxiliar representada por: Para visualizar o espectro óptico, verificamos que (12) só assume valores não-nulos quando n pertence ao conjunto {...-10, -6, -2, +2, +6, +10...}. Isto conduz às componentes espectrais mostradas na Fig. 4(a), onde a portadora é suprimida. Por sua vez, (13) é não-nula apenas quando n é múltiplo de quatro, o que revela o espectro eletrônico de amplitude (Fig. 4(b)). A configuração DP-MZM fornece componentes espectrais da corrente no fotodetector com espaçamento quatro vezes maior que a frequência fundamental. Escolhendo o índice de modulação m de tal forma que a harmônica de quarta ordem seja adequadamente superior às demais harmônica possibilita um quadruplicador de frequência. Sendo o espaçamento entre componentes duas vezes maior que no caso DD-MZM, tanto no espectro óptico quanto no espectro eletrônico, filtros podem ser dispensados quando se deseja realizar a conversão para mais altas frequências.Com isso, melhora-se a relação sinal-ruído do sistema, uma vez que não há mais perdas devido aos filtros ópticos ou eletrônicos, resultando em sinais gerados mais estáveis e puros. III. DISCUSSÃO E RESULTADOS As equações (8) e (13), deduzidas por [23], permitem pela primeira vez, até onde se sabe, obter resultados exatos para as componentes espectrais de corrente elétrica para um sistema com configuração DD-MZM e DP-MZM, respectivamente, sem que haja restrição do valor do índice de modulação m. Com esses resultados, a análise de sistemas de geração de sinais não se torna limitada a pequenos sinais, como tem sido apresentado na literatura [17]-[19]. Simulações presentes em [23] indicam que a semelhança entre os métodos aproximados e a solução exata ocorre apenas para pequenos valores de m e diferem drasticamente para grandes sinais, basicamente quando m>8 RAD. Como parâmetro de desempenho de tais sistemas, utilizase principalmente a taxa de extinção de bandas laterais em RF (RFSSR – RF Sideband Suppression Ratio) definida como a razão entre componentes de ordens diferentes p e q: A Fig. 5 exibe gráficos da RFSSR4,8 e da RFSSR4,12 de um DP-MZM, em função do índice de modulação m. As soluções aproximadas e exatas são similares para índice de modulação por volta de 7 RAD. Após este valor de m, as curvas diferem consideravelmente. Assim, para um determinado índice de modulação de operação, toma-se aquela componente desejada (n=4, 8, 12...) que resulte numa RFSSR com valor considerado satisfatório para o sistema a qual se deseja aplicar o sinal gerado. A inserção de um enlace de fibra óptica monomodo entre o modulador e o fotodetector permite aumentar o grau de liberdade para definição do harmônico desejado. O efeito da dispersão cromática da fibra faz com que a intensidade dos componentes espectrais da potência óptica agora também dependa da fase do sinal de saída da fibra, a qual por sua vez varia com o comprimento do enlace, frequência fundamental e parâmetro de dispersão da fibra utilizada. IV. ESTUDO DE CASO: DP-MZM COMERCIAL A implementação de um conversor para frequências mais altas utilizando a configuração DP-MZM, conforme descrita na Fig. 3, pode ser realizada por meio de um dispositivo integrado disponível comercialmente [24], que internamente contém dois sub-MZM’s casados e interligados em paralelo como um terceiro MZM. Este fabricante também inseriu, em particular, um modulador de fase em um dos braços, como ilustrado na Fig. 6, extraída do catálogo do dispositivo [24]. Opera com sinais ópticos de comprimentos de onda na faixa de 1528 a 1564 nm, com até 16 dBm de potência óptica. Quanto aos sinais elétricos, a máxima potência é de 24 dBm, caracterizado para sinais com até 20 GHz de frequência, mas para operação preferencial até 12 GHz. De acordo com os parâmetros presentes no referido catálogo, o índice de modulação m pode alcançar o valor máximo de aproximadamente 8,1 RAD. A título de comparação, outro modelo de dispositivo com MZM’s na configuração Dual Parallel integrado, porém sem modulador de fase, é comercializado por outra empresa [25]. Seus parâmetros são diferentes do anterior, operando na faixa de 1530 a 1580 nm, com até 20 dBm de potência óptica, para sinais RF com até 28 dBm e 20 GHz, apesar de ter sido caracterizado até 40 GHz. V. CONCLUSÃO Este artigo analisou a solução analítica exata para geração de sinais em micro-ondas ou ondas milimétricas, por meio de um processo de upconversion utilizando configuração paralela de dois moduladores Mach-Zehnder (DP-MZM), conforme apresentado em [23]. Comparações com soluções aproximadas presentes na literatura [17]-[19] foram realizadas, demonstrando que a abordagem exata não necessita da restrição de pequenos sinais, imposta arbitrariamente por outros autores. Dispositivos comerciais com a configuração Dual Parallel integrada num mesmo encapsulamento possibilitam a realização experimental para conversão de frequências de sinais RF em ondas milimétricas com alta pureza, i.e., alto RFSSR, e baixo ruído de fase. Essas características encontram aplicação direta como portadora de sistemas radar em frequências elevadas, por exemplo, para rastreio (seeker) de alvos pequenos como mísseis e munições. Outras aplicações incluem: enlaces ponto-a-ponto com grande largura de banda, em que as antenas necessitam ter dimensões restritas; sistemas de segurança em aeroportos e bancos, devido à propriedade de certos materiais serem translúcidos a essas ondas; astronomia; sensoriamento remoto; equipamentos médicos; dentre várias outras.  "
}