	{
		"id": 112,
		"titulo": "uma arquitetura de baixa potência com clock pausável para mefs síncronas particionadas",
		"autor": "duarte l. oliveira, tiago curtinhas, lester a. faria, leonardo romano",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2014/st/ST_10_3.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 1,
		"resumo": "Um dos grandes desafios no projeto de sistemas digitais na atualidade está em conceber circuitos de baixo consumo potência, tendo em vista o emprego de baterias como fonte de energia e a geração de calor. Máquinas de Estado Finito (MEF) tem um importante papel na implementação destes sistemas digitais. Para solucionar este problema de consumo de potência varias técnicas são utilizadas, dentre elas está o particionamento ou decomposição de uma MEF em sub-MEFs. As sub-MEFs particionadas operam com um sinal de clock global, gerando taxas de clock sub-ótimo para as sub-MEFs menores. Este artigo propõe uma nova arquitetura para MEFs particionadas, onde cada sub-MEF tem o seu próprio clock, o que leva a cada sub-MEF a ter uma taxa de clock ótima. A nova arquitetura usa controle assíncrono para efetuar o acionamento de cada sub-MEF e este controle tem menor área, quando comparado com outros controles assíncronos da literatura.",
		"texto": " I.-INTRODUÇÃO O aumento da complexidade dos projetos de sistemas digitais embarcados e que são alimentados por bateria, tem no consumo de potência, o principal alvo dos projetistas, portanto estes projetos exigem um baixo consumo de potência [1]. Uma arquitetura muito utilizada para implementar um sistema digital é formada por uma rede de controladores e datapaths (ver Fig. 1) [2,3]. Os controladores geralmente são representados por máquinas de estado finito (MEF) e são especificados por Grafos de transições de estado (GTE) [4]. A dissipação de potência em sistemas digitais na tecnologia CMOS é composta pelas potências estática, dinâmica, de curto circuito e potência de fuga. Estudos demonstram que a maior parcela, cerca de 80%, é referente à potência dinâmica [5] e que a atividade do relógio em sistemas digitais contribui com um alto percentual no consumo de potência (15% a 45%) total do sistema [6,7]. Objetivando a redução da potência dinâmica consumida, varias técnicas voltadas para baixa potência são utilizadas nas diversas etapas de um projeto de sistemas digitais [5,8]. Em relação às MEFs pode-se destacar o controle de inibição do sinal do relógio (clock) [4,9], decomposição [10-15], utilização de Flip Flop acionado nas duas bordas do sinal do clock [16,17], assinalamento de estados [18], minimização lógica e mapeamento tecnológico [19]. O método de decomposição, também conhecido por particionamento, tem demonstrado resultados significativos na redução de potência dinâmica. Ele consiste na divisão de uma MEF original ou monolítica em N sub-MEFs. Quando uma das sub-MEF está operando, as outras ficam em estado de repouso (não consumindo potência). Assim que o ciclo de operações termina outra sub-MEF é acionada, até que todas tenham sua operação realizada. Um circuito de controle do sinal do clock geralmente chamado de Bloco de Controle do Clock (BCC) é utilizado para efetuar a comutação entre as sub-MEFs, permitindo que uma única sub-MEF opere de cada vez, promovendo, assim a redução da potência dinâmica consumida. Diferentes BCCs foram propostos, dentre os quais as propostas interessantes de [4] [20-22]. Podemos classificar os BCCs em dois modos de atuação, que são: BCC síncrono [4] e BCC assíncrono [20-22]. Estudos realizados por Oelmann et al. [20] mostram que a versão assíncrona traz importante redução no consumo de potência em relação à versão síncrona, mas tem como desvantagem um aumento na área utilizada pelo circuito e um maior tempo de ciclo. Os métodos de particionamento de MEFs que adotam o controle síncrono são [10-12] e que adotam o controle assíncrono são [13-16] [23]. Sistemas digitais de alta integração na tecnologia DSMMOS (Deep-Sub-Microm – MOS) operam com múltiplos clocks e não com um simples clock global. Portanto, um subsistema pode trabalhar com diferentes clocks ou fases diferentes ou até usando clock local. Em um sistema digital heterogêneo um módulo pode operar ou com clock local, ou com clock externo. Das diferentes arquiteturas propostas para MEF particionadas, todas têm em comum o uso do clock externo, operando como clock global. Como o clock global é definido pela sub-MEF com o pior caminho crítico, portanto para as outras sub-MEFs a taxa de clock é sub-ótima. Uma decomposição muito comum nas propostas de particionamento é ter sub-MEFs grandes, mas com probabilidade de pouco processamento e sub-MEFs pequenas, mas com alta probabilidade de processamento. Esta estratégia que permite uma maior redução de potência tem como limitação o uso de uma taxa de ciclo média sub-ótima. Neste artigo propomos uma arquitetura voltada para MEFs particionadas, onde cada sub-MEFs tem o seu próprio clock, portanto cada sub-MEF tem a sua própria taxa de clock (ver Fig. 2). A nova arquitetura permite que todas as subMEFs operem com a taxa de clock ótima. Este clock pode ser local ou externo. Neste artigo propomos o uso do gerador de clock pausável (com pausa) que é robusto à metaestabilidade. A ativação e a desativação das sub-MEFs na nossa arquitetura é realizada por um controle assíncrono que é especificado no modo burst [24]. A especificação do controle está relacionada com a interação entre as sub-MEFs. II.-TRABALHOS RELACIONADOS A. Circuito de controle síncrono Benini et al. [4] propôs uma comunicação síncrona entre as sub-MEFs. Um sinal de relógio global realiza a comutação entre as sub-MEF particionadas, portanto há um sincronismo entre essas sub-máquinas. Fig. 3 apresenta a versão síncrona proposta em [4], onde o circuito de comunicação entre as sub-MEF é ativado com o sinal do relógio. Os blocos Fa_1 e Fa-2 são circuitos combinatórios e devem ser projetados em função da interação das sub_MEFs particionadas. B. Circuito de controle assíncrono Oelmann et al. em [20] propôs o circuito de controle do relógio na versão assíncrona, proporcionando uma redução no consumo de potência em relação a versão síncrona. Como limitação há um aumento de área e o tempo de ciclo do controle pode afetar a taxa do relógio. Fig. 4 apresenta a versão assíncrona proposta em [20], onde o circuito de controle entre as sub-MEF não utiliza o sinal do relógio para acionar o circuito de controle do relógio. Fig. 5 apresenta o circuito do BCC na versão assíncrona [20]. O controle possui dois sinais de entrada res_1 e go_2 e um sinal de saída disp_1. Este circuito deve ser utilizado para o controle de cada sub-MEF particionada. A primeira vantagem do circuito de controle assíncrono em relação ao circuito de controle síncrono é que esta célula proposta é fixa, ou seja, não depende da interação entre as sub-MEF, enquanto na configuração síncrona o circuito deve ser projetado em função da interação entre as sub-MEF. Ambas as propostas são utilizadas nas arquiteturas onde as MEF particionadas possuem dois sinais de controle, sendo que um sinal é utilizado para acionar o circuito de controle do clock da outra sub-MEF e outro sinal desativa o sinal do clock da sub-MEF em analise. C. Circuito de controle assíncrono modo-burst Oliveira et al. [21] propôs uma variante do BCC assíncrono que usa BCCs fixos [20]. Na proposta em [21] a especificação do BCC está relacionado com interação entre as sub-MEFs, o que acarreta como vantagem uma redução de área e de potência e como desvantagem um custo maior de projeto [22]. Esta vantagem é obtida, porque o BCC somente necessita de um único sinal de saída, para cada sub-MEF (ver Fig. 6). Como ilustração, Fig. 7 mostra o GTE do benchmark DK25 particionado em duas partições pela ferramenta LSPart [23]. Fig. 8 mostra a especificação modo burst do controle e Fig. 9 mostra o circuito lógico sintetizado pela ferramenta Minimalist [25], onde a variável de estado (sv) foi introduzida para eliminar os conflitos. D. Método de particionamento O método de particionamento adotado neste artigo foi proposto em [23]. Ele insere dois estados em cada partição e um sinal que indica qual sub-MEF vai ser ativada. Fig. 10 mostra um particionamento que acarreta em duas partições e Fig. 11 mostra as duas sub-MEFs resultantes do particionamento com a introdução de dois estados e do sinal go_x. III.-ARQUITETURA COM CLOCK PAUSÁVEL PROPOSTA Este artigo propõe uma nova arquitetura para MEFs síncronas particionadas. Diferente das arquiteturas propostas na literatura que usam um clock global para todas as subMEFs, a nova arquitetura tem como característica o uso de múltiplos clocks, isto é cada sub-MEF tem o seu próprio clock, que é gerado localmente. Fig. 2 mostra a arquitetura proposta com duas sub-MEFs, onde as duas sub-máquinas possuem os seus geradores de clock pausável (GCP). Os GCPs são controlados por um controle assíncrono, que é especificado no modo burst e que descreve a interação entre as sub-MEFs. O controle assíncrono proposto usa somente um único sinal (go_x) para definir qual a sub-MEF que será ativada. Fig. 12 mostra o GCP proposto em [26] e usado em nossa arquitetura.IV.-METODOLOGIA PARA SÍNTESE DO BCC ASSÍNCRONO VOLTADA PARA ARQUITETURA DE CLOCK PAUSÁVEL A síntese do BCC assíncrono voltada para a arquitetura de clock pausável tem quatro passos e é baseada em [21,22]: 1) Capturar a descrição da MEF a ser particionada. 2) Determinar o número de partições através de um espaço de projeto e obter as sub-MEFs utilizando a ferramenta de particionamento, LSPart [23]. 3) Obter as interações entre as sub-MEFs e descrever o BCC assíncrono utilizando a especificação modo burst [24]. 4) Utilizar a ferramenta SAGAAs [27] sintetizar o BCC assíncrono. Para demonstrar a metodologia da síntese do BCC proposto será utilizada a MEF DK25, que foi particionada em 2, 3 e 4 partições pela Ferramenta LSPart. A. Duas partições Fig. 7 mostra a MEF DK25 com a identificação de duas partições. Fig. 13 mostra a especificação modo burst e Fig. 14 mostra o circuito lógico que foi sintetizado na ferramenta SAGAAs que controla duas sub-MEFs. A Fig. 15 apresenta o GTE da MEF DK25 com a identificação de três partições. A Fig. 16 apresenta a especificação modo burst do BCC assíncrono que controla as três sub-MEFs. C. Estudo de caso: quatro partições A Fig. 17 apresenta GTE da MEF DK15 com a identificação de quatro partições. A Fig. 18 apresenta a especificação modo burst do BCC assíncrono que controla quatro sub-MEFs. V.-SIMULAÇÃO & RESULTADOS A arquitetura proposta é simulada para duas sub-MEFs na ferramenta ALTERA QUARTUS II [28]. Fig. 19 mostra o diagrama de simulação da arquitetura proposta e que satisfaz a especificação do controle. O circuito mostrou ser livre de hazard conforme o esperado. Nesta seção vamos fazer uma comparação de área dos BCCs de [20] e [21,22] e com a nossa proposta. Esta comparação é realizada para 2, 3, e 4 partições, que envolve o benchmark DK25 e que foi o nosso estudo de caso. Os BCCs obtidos são livres de hazard. A tabela I mostra que o nosso BCC obteve uma redução de 66% no número de produtos; uma redução de 63% no número de literais e uma redução de 53% no número de transistores, quando comparado com [20]. Quando comparado com [22] obteve uma penalidade de 50% no número de produtos e uma redução de 20% no número de literais. A tabela II mostra que o nosso BCC obteve uma redução de 66% no número de produtos; uma redução de 72% no número de literais e uma redução de 50% no número de transistores, quando comparado com [20]. Quando comparado com [22] obteve uma redução de 40% no número de produtos; uma redução de 50% no número de literais e uma redução de 38% no número de transistores. A tabela III mostra que o nosso BCC obteve uma redução de 66% no número de produtos; uma redução de 72% no número de literais e uma redução de 41% no número de transistores, quando comparado com [20]. Quando comparado com [22] obteve uma redução de 20% no número de produtos; uma redução de 33% no número de literais e uma redução de 33% no número de transistores. VI.-CONCLUSÃO Particionar uma MEF em sub-MEFs é interessante para reduzir a complexidade da síntese, principalmente para MEF de grande porte. Um interesse maior do particionamento em subMEFs está no grande potencial de economizar energia. O motivo é que enquanto uma sub-MEF está processando, as outras estão em repouso, isto é, sem consumir energia. Um controle eficiente para ativar e desativar sub-MEFs é o controle assíncrono. As arquiteturas propostas para MEFs particionadas envolve um sinal de clock global, o que leva sub-MEFs a operar com taxas de clock sub-ótimo. Este artigo propõe uma nova arquitetura para MEFs particionadas, onde cada sub-MEF opera com a taxa de clock ótima. Para esta arquitetura um novo controle assíncrono é proposto. Ele leva a uma redução de área e potencialmente a uma redução de potência dissipada, quando comparado com outras propostas para controle do clock. Como trabalho futuro, pretendemos realizar uma avaliação envolvendo: área, potência dissipada e tempo de ciclo da nova arquitetura. Também se pretende aplicar a nossa arquitetura em sistemas embarcados baseados em rede de controladores e implementar em dispositivos programáveis."
	}
