	{
		"id": 114,
		"titulo": "avaliação de propriedades convectivas e térmicas de elemento emissor de infravermelho usado em alvo aéreo",
		"autor": "joão paulo dias, francisco sircilli e francisco d. rocamora jr",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2014/st/ST_6_1.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 1,
		"resumo": "Alvo aéreo não manobrável é um dispositivo lançado a partir de uma aeronave, que voa sob influência da força da gravidade e das forcas aerodinâmicas de arrasto devidas principalmente à interação do paraquedas com a atmosfera. O componente principal do alvo aéreo é um objeto metálico aquecido à temperatura apropriada para emitir radiação na banda do infravermelho do espectro eletromagnético. A assinatura a infravermelho do corpo metálico pode ser usada para avaliar o desempenho de dispositivos detectores que operam nessa banda, tais como autodiretores de mísseis. Neste trabalho, são apresentados os resultados da avaliação de propriedades convectivas e térmicas de um elemento metálico com formato de tubo cilíndrico. Apresenta-se, inicialmente, uma avaliação resolvendo-se a equação diferencial de transferência de calor por condução, unidimensional, com as condições de contorno apropriadas; em seguida, é usado um software comercial para cálculo com maior acurácia. Essas avaliações são auxiliares no desenvolvimento de um alvo aéreo que atenda às especificações do projeto.",
		"texto": " I. INTRODUÇÃO Alvo aéreo não manobrável (Fig. 1) é um dispositivo lançado a partir de uma aeronave de asas fixas ou rotativas composto por um elemento metálico aquecido a certa temperatura e dispositivos associados, tais como o sistema de aquecimento e controle do aquecimento do corpo metálico, bóia de flutuação e paraquedas. O alvo aéreo voa sob a influência da força de gravidade e das forças aerodinâmicas originadas principalmente pela interação entre paraquedas e a atmosfera. Este corpo metálico, quando aquecido, irradia nas diversas faixas do espectro eletromagnético. Em especial, o espectro infravermelho (IR) irradiado pelo corpo metálico, um cilindro, neste estudo, pode ser usado para avaliar o desempenho de dispositivos detectores que operam nessa faixa do espectro eletromagnético, estando eles no ar ou em solo, tais como autodiretores de mísseis. Neste trabalho, são apresentados os resultados da avaliação de propriedades convectivas e térmicas de um elemento metálico com formato geométrico de uma casca cilíndrica, levando-se em consideração os efeitos de transferência de calor por convecção devida ao fluxo de ar durante a queda do alvo e de transferência por irradiação de infravermelho. Apresenta-se, inicialmente, uma formulação de engenharia, baseada na resolução da equação diferencial unidimensional de transferência de calor por condução, em coordenadas cilíndricas, com condições de contorno, em que se têm expressões empíricas para perda de calor por convecção, em que o coeficiente de convecção é função da velocidade de queda do alvo aéreo (correlações empíricas), e radiação na superfície externa do cilindro. Em seguida, é usado um software comercial de CFD (Computational Fluid Dynamics) para cálculos com maior acurácia, considerando-se os casos de convecção forçada nos regimes laminar e turbulento e convecção natural e salientando que o software não resolve o caso de transição entres esses dois regimes do escoamento. Na seção II são apresentados alguns aspectos teóricos necessários para o entendimento do dispositivo e do fenômeno de emissão de radiação no infravermelho. Na seção III são apresentados os resultados dos cálculos e na seção IV as conclusões desse trabalho. II. ASPECTOS TEÓRICOS Nesta seção, são apresentados alguns aspectos relevantes para o entendimento do fenômeno e da solução dada para o cálculo da temperatura da casca cilíndrica metálica. Curva de velocidade de queda Uma curva típica de velocidade de queda de um paraquedista é apresentada na Fig. 2 [1]. Para um alvo aéreo baseado em paraquedas espera-se comportamento similar. Neste estudo, é considerado somente movimento vertical de queda em direção ao solo, ou seja, não é considerado movimento na direção horizontal. Na Fig. 2, o primeiro estágio da queda, que vai até 42 segundos, representa o movimento do instante inicial quando a carga é desacoplada da aeronave com velocidade zero, e é acelerada até atingir uma velocidade terminal. No instante 42 segundos, o paraquedas é aberto, com a carga passando a sofrer uma forte desaceleração até atingir uma velocidade terminal diferente da velocidade terminal atingia no primeiro estágio. No primeiro estágio, no instante t = 0 segundos em que a carga é lançada da aeronave, a sua velocidade é igual a zero, o que implica que a resistência do ar é zero, ou seja, nesse instante há somente a força da gravidade atuando na carga e a força resultante é igual a ela; nessa situação, a velocidade passa a aumentar rapidamente a medida que a carga cai em direção ao solo. Com o aumento da velocidade há aumento da resistência do ar devido a forca de arrasto, função da velocidade de queda, da área de interceptação com o ar e da densidade do ar. A velocidade aumenta até que a resistência do ar iguala-se à gravidade e a força resultante é igual a zero; nessa situação, a aceleração é zero e, assim, a velocidade é constante: essa é a velocidade terminal 1 mostrada na Fig. 2. Em t = 42 segundos, no caso da Fig.2, inicia-se o segundo estágio: nesse instante o paraquedas é aberto, aumentando drasticamente a área perpendicular ao movimento de queda e a carga é rapidamente desacelerada porque a força de resistência do ar torna-se muito maior do que a força de gravidade. À medida que a velocidade de queda diminui, a resistência do ar também diminui, até que é atingida a velocidade terminal 2 da Fig. 2. No caso do alvo aéreo ser lançado de forma enganchada, obviamente não ocorrerá exatamente o perfil de velocidade apresentado na Fig. 2, já que o paraquedas se abre assim que a carga é lançada da aeronave. Parâmetro de convecção Uma figura de mérito amplamente utilizada na avaliação de fenômenos de convecção, e usada nesse trabalho relacionado à convecção de ar originada pelo movimento do alvo aéreo na direção do solo, é o chamado Número de Reynolds (Re), que representa a importância relativa entre as forças de inércia e viscosa agindo sobre o corpo em queda. Matematicamente, Re é dado por: em que u é a velocidade do fluido na corrente livre, L é uma dimensão característica e  é a viscosidade cinemática do fluido, que varia com a temperatura do fluido [2]. O número de Reynolds é usado para avaliar o tipo de escoamento, que pode ser laminar ou turbulento. Para os valores de velocidades terminais da Fig. 1, por exemplo, têmse valores de Re entre para comprimento característico de 0,75 metros. Como se pode assumir que a transição do regime laminar para o turbulento de um escoamento de ar em uma placa plana ocorre quando Re = 5.105[2], adotando-se que esse valor é válido para uma casca cilíndrica, devem ser considerados esses dois tipos de escoamento no estudo de queda da Fig. 2. Além disso, a convecção pode ser forçada, quando o fluido tem velocidade, como no caso da queda, ou pode ser natural, como no caso de ensaio em solo no qual o fluido não tem velocidade induzida pelo movimento relativo de queda do alvo aéreo. Outra figura de mérito adimensional usada em avaliação de convecção é o chamado número de Prandtl (Pr). Ele representa a importância relativa do momento em relação ao transporte de energia durante os processos de difusão [2]. Para gases, por exemplo, tem-se Pr ≈ 1, que significa que as transferências de momentum e energia devidas ao processo de difusão são comparáveis. O número de Prandtl é dado por   Pr  , onde  é a viscosidade cinemática do fluido e  a difusividade molecular. Essas propriedades do ar são encontradas em forma de tabela, sendo uma boa estimativa avaliá-las em uma temperatura média Tm entre a temperatura da parede e a temperatura do fluido longe da parede. O número de Nusselt, Nu, outra figura de mérito usada nesse trabalho, pode ser interpretado como a razão entre as transferências de calor por convecção e condução através de uma camada de fluido de espessura L. Matematicamente, k h L Nu , em que h é o coeficiente de convecção e k é a condutividade térmica do fluido. Avaliação de Engenharia Durante a queda, a energia fornecida ao elemento emissor de radiação eletromagnética é transformada em 2 tipos: aquecimento da camada de ar próxima à casca cilíndrica devido à convecção e emissão de radiação eletromagnética. A seguir, apresenta-se como é feita a avaliação desses dois tipos de energia. A avaliação de engenharia, assim denominada nesse artigo, refere-se à modelagem por equação diferencial unidimensional, em coordenadas cilíndricas, da condução de calor na direção radial da casca cilíndrica emissora de IR, sem geração interna de calor, em regime permanente, com as condições de contorno de fluxo de calor prescrito na superfície interna da casca cilíndrica e perdas de calor por convecção e por emissão de radiação como corpo negro na superfície externa. A equação de condução de calor na casca cilíndrica é dada por: em que k é o coeficiente de condução de calor do material da casca cilíndrica (aço), r é o raio e T é a temperatura ao longo da espessura da casca cilíndrica. As condições de contorno são dadas na superfície interna e externa, respectivamente, em [W/m2], por: em que ri é o raio da superfície interna da casca cilíndrica e é a fonte de calor transmitida para a superfície interna da mesma, e por: em que h é o coeficiente de película, T é a temperatura ambiente,  é a constante de Stephan-Boltzmann e Te e re são respectivamente a temperatura e o raio da superfície externa da casca cilíndrica. O coeficiente de película é determinado por: em que Nu é o Número de Nusselt e é a condutividade térmica do ar. O Número de Nusselt, considerando o fluxo de calor uniforme na superfície externa da casca cilíndrica, para escoamentos laminar e turbulento do ar, é dado, respectivamente, por [3]: em que Pr é o Número de Prandlt, e por: Essa formulação tem algumas limitações. Dentre elas, têm-se o uso do coeficiente de película que é um valor médio da relação entre a quantidade de calor por convecção e a diferença de temperatura entre a superfície e um fluido que escoa por uma superfície. Ainda, para determinação deste coeficiente de película foram considerados propriedades do ar constantes para a temperatura de 300K. Além disso, desconsideram-se perdas de calor no sentido axial da casca cilíndrica e considera-se que a mesma irradia energia eletromagnética na mesma taxa que absorve (corpo negro). Essa formulação é resolvida numericamente no software de elementos finitos FlexPDE [4]. É possível, ainda, realizar uma análise simplificada, considerando a condição de contorno na superfície externa como função da sua temperatura, para uma dada velocidade de ar e dado regime (laminar ou turbulento), em que se terá a temperatura crítica a partir da qual a energia dissipada por convecção se sobressai em relação à energia emitida por radiação (perda de calor útil para o alvo aéreo). Avaliação numérica com o programa FLUENT O software FLUENT resolve as equações de conservação pelo método dos Volumes Finitos [5]. Estas equações em regime permanente são: a) Continuidade: b) Momento: c) Energia: em que As equações de Navier-Stokes englobam o termo de empuxo de Boussinesq para o caso de convecção natural e, no caso do escoamento ser turbulento, o tensor de Reynolds utiliza o modelo k  , razoável para a obtenção da viscosidade turbulenta. O modelo de radiação utilizado foi o DTRM (Discret Transfer Radiation Model), considerando a emissividade  da parede como emissividade de corpo negro (=1). Assim, o termo  gi na Eq. (9) fica: em que o fluxo radiativo da parede é dado por qw   Te 4 . Nesse estudo usando o FLUENT foi considerada a geometria apresentada na Fig. 3, onde a casca cilíndrica de diâmetro diam sofre aquecimento com taxa q (W/m2) no sentido radial indicado na Fig. 4. No caso de convecção forçada, o dispositivo é submetido a um fluxo de ar com velocidade var. Nesse trabalho, foi considerada uma razão entre o diâmetro da casca cilíndrica igual a aproximadamente 3; velocidades de queda entre 5 m/s e 15 m/s foram avaliadas, assim como aquecimento de 18.000 W/m2 a 80.000 W/m2. III. RESULTADOS Nesta seção são apresentados os resultados obtidos na avaliação de engenharia e na avaliação usando o software comercial FLUENT. Avaliação de Engenharia Na avaliação de engenharia foram considerados para temperatura do ar ambiente de 298K, os casos com velocidade do ar de 5, 10 e 15 m/s, para obtenção de uma temperatura de 700 oC na superfície externa da casca cilíndrica e foram obtidas as quantidades de calor necessárias para serem fornecidas na superfície interna da mesma. Na Fig. 6 tem-se a temperatura ao longo da espessura para um fluxo de calor de 55.000 W/m2: observa-se que a temperatura obtida na superfície externa é de 973 K. Para esse caso, obteve-se que o percentual de calor perdido por convecção e por radiação é de aproximadamente 8,5% e 91,5%, respectivamente, ou seja, grande parte do calor fornecido à casca cilíndrica está se transformando em energia na forma de radiação eletromagnética, como desejado. Na Fig. 7 são apresentadas as curvas de fluxo de calor na parede externa da casca cilíndrica em função velocidade do ar (de queda do alvo aéreo), para que seja obtida a temperatura de 700 º C na superfície externa da casca cilíndrica. A Tabela 1 apresenta o fluxo de calor que necessita ser fornecido à casca cilíndrica para se chegar à temperatura de 700 oC e com que eficiência, isto é, com que grau o calor fornecido é transformado em radiação. Nota-se que a eficiência varia de 62% a 92 %, dependendo do regime e velocidade do escoamento do ar. Na Fig. 8 apresentam-se os percentuais entre os processos de transferência de calor por convecção e radiação em função da temperatura da superfície externa da casca cilíndrica para os casos da Tabela 1, em que os coeficientes de película são 6,9 e 46 W/(m2.K). Nota-se que quanto maior a temperatura da superfície externa da casca cilíndrica mais eficiente torna-se a transferência de calor por radiação. Na Fig. 8, enquanto, para h = 6,9 W/(m2.K) tem-se sempre uma maior parcela da perda de calor por radiação, com a convecção atingindo seu pico a 406 K (menos que 35%) e reduzindo com o aumento da temperatura, para h = 46 W/(m2.K) o calor é perdido majoritariamente por convecção até 800 K, apesar dela estar reduzindo a partir de 400 K. Avaliação com o software FLUENT Como não há disponibilidade de software que resolve a transição entre os fluxos laminar e turbulento, fez-se avaliação nos dois regimes separadamente. Os perfis e curvas apresentadas nas Fig. 9 a Fig. 13 referem-se ao caso de convecção natural e fluxo de calor q = 39.000 W/m2. Na Fig. 9 é apresentada uma curva típica de temperatura, normalizada, ao longo da casca cilíndrica submetida ao fluxo de calor q mostrado na Fig. 4. Observa-se que há variação da temperatura ao longo da casca; assim, as temperaturas referenciadas no artigo tratam-se da média aritmética simples dos nós definidos na malha apresentada na Fig. 5. Para o caso da Fig. 9, por exemplo, a temperatura média é algo em torno de 99,7% da temperatura máxima. Na Fig. 10 são apresentados os perfis de velocidade na entrada e saída de ar da área simulada, mostrada na Fig.4. Como esperado, a velocidade aumenta a partir da superfície, atinge um máximo na região bem próxima a ela e depois decai lentamente na direção de atingir zero m/s. Ainda como esperado, as maiores velocidades são observadas na saída da região simulada. Na Fig. 14 são apresentadas as curvas de fluxo de calor em função da velocidade de queda do alvo aéreo necessário para que a temperatura da casca cilíndrica em voo seja mantida na temperatura de referência Tref = 1, tanto para o caso de fluxo turbulento quanto para o caso de fluxo laminar. Apresenta-se, também, a temperatura resultante na convecção natural (velocidade de queda igual a zero) em função do fluxo de calor a que é submetida a casca cilíndrica. Nas Fig.11 a Fig. 13 são apresentados campos típicos de pressão, velocidade e temperatura, respectivamente. Observase que estes campos estão, qualitativamente, de acordo com o esperado para a geometria em estudo. Observa-se, na Fig. 14, que, para manter a temperatura da casca cilíndrica em Tref é necessário fornecer fluxo de calor maior à medida que a velocidade de queda aumenta, sendo as ordens de grandeza desse fluxo maiores para o caso de fluxo turbulento. Como o software não resolve o caso de transição entre fluxos laminar e turbulento, pode-se afirmar que, se o regime de fluxo estiver nessa região de transição, o fluxo de calor necessário para manter a temperatura desejada está entre essas duas curvas: para velocidade de queda de, por exemplo, 10 m/s, será necessário fluxo de calor entre 42.000 W/m2 e 60.000 W/m2. Para esses fluxos de calor, tem-se, da Fig. 14, que a temperatura a ser obtida no ensaio em solo deve estar entre aproximadamente 102% e 120% da Tref para os casos laminar e turbulento, respectivamente, a fim de que a casca cilíndrica voe à Tref quando estiver em queda de 10 m/s. Da curva de convecção natural da Fig. 14 tem-se, ainda, que para atingir-se essa temperatura no ensaio em solo, devese fornecer fluxo de calor de 38.000 W/m2. Na Fig. 15 são apresentadas as curvas de fluxo de calor em função da velocidade de queda do alvo aéreo necessário para que a temperatura da casca cilíndrica seja Tref quando se considera somente a perda de energia por convecção, ou seja, negligencia-se a perda por irradiação. Para esse caso, tem-se que a temperatura em solo deve estar aproximadamente entre 100% e 320% da Tref ; para o caso de fluxo turbulento, devese, portanto, obter valores bem maiores de temperatura em solo de que quando se considera as perdas por convecção e irradiação (entre 102% e 120%). IV. CONCLUSÕES Observou-se que, para a geometria e condições de convecção e irradiação consideradas neste trabalho, a emissão por radiação é consideravelmente maior que a dissipação por convecção, sendo ela a transferência de calor predominante nas condições de velocidade de queda e temperatura da casca cilíndrica consideradas. Ou seja, variações na velocidade de queda do alvo aéreo em relação à especificação não são cruciais quanto a atingir-se a temperatura em voo. Embora a Fig. 7 não possa ser diretamente comparável à Fig. 14, uma vez que as temperaturas de referência são diferentes para os dois casos, observa-se que as curvas apresentam o mesmo comportamento e as mesmas ordens de grandeza. Para geometria e condições diferentes das avaliadas nesse trabalho isso pode não ocorrer (para outra relação diâmetro/comprimento da casca cilíndrica, por exemplo). Comparando-se a importância relativa entre a dissipação por convecção e radiação obtidas na avaliação de engenharia (da Fig. 8), com os dados obtidos na avaliação com FLUENT, tem-se que o coeficiente de película ideal para as condições simuladas está entre 6,9 W/(m2.K) e 46 W/(m2.K), uma vez que a emissão por radiação é bem maior que a por convecção. Obteve-se que, para atingir temperatura de referência no ensaio em solo, deve-se fornecer fluxo de calor de 38.000 W/m2 e, ainda, que a temperatura a ser obtida no ensaio em solo deve estar entre, aproximadamente, 102% e 120% da temperatura desejada para que a casca cilíndrica apresente a temperatura de referência quando estiver em queda de 10 m/s. Para manter a temperatura desejada na queda, o fluxo de calor deve estar aproximadamente entre 40.000 W/m² e 54.000 W/m² (média de 47.000 W/m²). Como se tem que em solo a temperatura desejada é atingida para 38.000 W/m², precisa-se de ~124% do fluxo de calor fornecido no ensaio em solo a fim de se conseguir a temperatura desejada durante a queda do alvo."
	}
