{
    "id": 115,
    "titulo": "estudo de um método de baixo custo para identificação paramétrica de pequenas aeronaves",
    "autor": "guilherme n. barufaldi, marcus h. victor jr., takashi yoneyama, luis c. s. góes, maurício a. v. morales",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2014/st/ST_4_3.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "O crescimento do mercado de veículos aéreos não tripulados estimula a pesquisa para este tipo de aeronave. Entretanto, para muitos destes veículos, as pequenas dimensões e a pequena capacidade de carga paga disponível tornam muito difícil a instalação de sistemas embarcados, o que dificulta também a medição de parâmetros em voo. A partir da reconstrução dos ângulos aerodinâmicos, é possível, desenvolver um sistema de aquisição de dados baseado em poucos sensores, o que torna prática a sua utilização para a identificação paramétrica da aeronave. Este trabalho descreve um estudo para verificar a factibilidade de uma metodologia de reconstrução dos ângulos aerodinâmicos, a partir dos dados inerciais da aeronave. Simulações foram feitas utilizando-se modelos de aeronaves baseados em derivadas de estabilidade. Verificou-se, então, a eficácia do método na ausência de ruído.",
    "texto": " I. INTRODUÇÃO O mercado de Veículos Aéreos Não Tripulados (VANTs) encontra-se em franca expansão, ocupando uma parcela significativa da pesquisa aeronáutica atual. Desde a década de 1980, quando os primeiros VANTs tornaram-se operacionais, a presença desse tipo de aeronave vem crescendo, especialmente no contexto militar. A evolução da teoria de controle e dos computadores de voo, bem como a miniaturização de componentes eletrônicos, tornou real a possibilidade de pequenas aeronaves autônomas ou telecomandadas. Atualmente, existem veículos bastante avançados como o MQ-9 Reaper ou o Global Hawk, ambos desenvolvidos nos Estados Unidos da América (EUA) para fins militares. O Global Hawk é capaz de realizar voos de longo alcance completamente autônomos, em que não há a necessidade de controle à distância por um piloto em terra. O MQ-9 pode realizar desde vigilância até ataque ao solo e caça. No meio acadêmico, os pequenos VANTs tornaram-se comuns devido à sua atraente capacidade de ser uma ferramenta de pesquisa e desenvolvimento, atrelada a custos relativamente baixos de construção e menor infra-estrutura de operação exigida. Assim, boa parte dos VANTs é composta de veículos relativamente pequenos, muitas vezes lançados a mão. Devido às pequenas dimensões, este tipo de aeronave frequentemente sofre com problemas relacionados à qualidade de voo, diferentes dos enfrentados por aeronaves maiores. As dimensões reduzidas e o regime de voo, o qual frequentemente ocorre em baixas velocidades, tornam estes veículos mais suscetíveis a rajadas de vento. Além disso, pelo fato de não serem tripulados, estes veículos são concebidos de forma menos conservadora, não sendo raras as adoções de soluções mais ousadas para a diminuição do peso estrutural ou a melhora das qualidades aerodinâmicas, como empenagem em V ou redução do volume de cauda. Deste modo, não é incomum observar VANTs com qualidade de voo e controlabilidade deficitárias durante sua fase de desenvolvimento, o que torna a sua pilotagem potencialmente difícil. Em VANTs de tamanho reduzido, é difícil o embarque de sistemas de controle automático ou de aquisição de dados mais sofisticados, no que tange ao uso de sondas e dispositivos de consideráveis volume e peso. O excedente de massa devido ao sistema de aquisição, via de regra, penaliza o desempenho de tal classe de aeronaves. O presente trabalho propõe estudar a factibilidade de um método de baixo custo para se identificar os parâmetros de uma aeronave desse tipo, bem como para estimação de estados, necessários para a implementação de sistemas de controle automático, guiamento e navegação. Contextualizados os usos dos VANTs, bem como a aplicação de aeronaves de pequeno porte e suas restrições e benefícios, este trabalho não pretende investigar a fundo os métodos apresentados, nem exaurir as possibilidades para estudos compreendendo ruído ou perturbações exógenas, mas sim analisar a possível utilização de um sistema passível de ser implementado em tais aeronaves, dotadas de sistemas de aquisição de dados com características de processamento e armazenamento modestas. II. MÉTODO A análise de qualidade de voo de pequenas aeronaves vem tomando vulto no meio acadêmico, mas ainda não há muito consenso sobre padrões. Andrisani e Peters [1] investigaram as características do modo de período curto para pequenas aeronaves, equipando um aeromodelo com instrumentação adequada e comparando os dados medidos com previsões teóricas. O trabalho aponta que os padrões de qualidade de voo para pequenas aeronaves são bastante diferentes daqueles considerados ideais para grandes aeronaves. Em especial, concluíram que frequências e amortecimentos maiores são desejáveis para que este tipo de avião mantenha um padrão de controlabilidade aceitável. Cotting [2] separou aeronaves grandes e pequenas em classes comparáveis, analisando o número de Reynolds e o peso máximo de decolagem, a fim de iniciar um trabalho de correção para padrões de qualidade de voo. No campo da análise de experimentos, Morelli [3] propõe metodologias de redução de dados no domínio da frequência, para se obter parâmetros modais e aerodinâmicos de aeronaves em tempo real e com pouco processamento, utilizando-se o próprio computador de bordo do avião. Ainda na mesma linha de pesquisa, Morelli propõe em [4] a identificação de parâmetros em tempo real, sem a medida do escoamento em torno da aeronave, reconstruindo os ângulos aerodinâmicos a partir de dados inerciais. Adaptando-se a metodologia apresentada em [4], é possível realizar, a partir de um sistema de aquisição de dados embarcado relativamente simples, a identificação de parâmetros de uma aeronave. A simplicidade do sistema reside no fato de que ele necessita de menos variáveis medidas e, portanto, menos sensores. Com isto, além da disponibilidade de sensores de custo e tamanho reduzido, é possível construir um sistema de aquisição de dados a partir de um micro controlador de baixo custo [5]. Variáveis medidas – A redução no número de variáveis deve-se ao fato de que, no coração do método estudado, não se medem os ângulos aerodinâmicos. Os ângulos de ataque α e de derrapagem β em geral não podem ser medidos diretamente, visto que os tipos de sonda utilizados para este fim são tipicamente pesados e caros para as aplicações em pequenos VANTs. Assim, é interessante obter os ângulos aerodinâmicos de maneira indireta. As equações cinemáticas [6] para a translação da aeronave, no referencial do corpo, são dadas por (1), (2) e (3). Em que nx, ny e nz são os fatores de carga medidos pelos acelerômetros; u, v e w são as componentes da velocidade no referencial do corpo; p, q e r são as componentes da velocidade angular no referencial do corpo, medidas pelos girômetros; θ e φ são os ângulos de Euler entre os referenciais do corpo e da Terra, suposto inercial, e g é a aceleração da gravidade. Então, a velocidade aerodinâmica verdadeira (TAS), o ângulo de ataque e o ângulo de derrapagem podem ser calculados por (4), (5) e (6), respectivamente. Considera-se que as manobras feitas para os ensaios em voo são manobras de pequenas perturbações, em torno de uma condição de equilíbrio de voo reto nivelado (regime permanente), e com pouco vento, de forma que os ângulos aerodinâmicos sejam pequenos. Essas hipóteses de pequenos ângulos e perturbações permitem simplificação de (4), (5) e (6), resultando em (7), (8) e (9). Desse modo, conforme proposto por Morelli [4], (7), (8) e (9) podem ser utilizadas para simplificar (2) e (3), obtendo-se (10) e (11). As equações (10) e (11) fornecem uma nova dinâmica, aproximada, para α e β, e podem, portanto, ser usadas para a reconstrução destas duas variáveis de estado ao longo do tempo, por meio de integração. Para a condição de equilíbrio de voo reto nivelado sem derrapagem, tem-se as condições iniciais dadas por (12) – (17). Tem-se ainda que, para a condição inicial de referência, o ângulo de ataque é dado por (18). Os ângulos φ e θ também podem ser obtidos diretamente da Unidade de Medidas Inerciais (IMU), caso esta possua giroscópios ou um algoritmo interno para a estimação destes estados. Entretanto, as unidades de medidas inerciais de dimensões reduzidas comercialmente disponíveis disponibilizam, em geral, apenas as componentes da velocidade angular no referencial do corpo, isto é, p, q e r. Neste caso, é possível utilizar os dados inerciais disponíveis para se obter φ e θ por meio das dinâmicas representadas em (19) e (20). Tipicamente, os dados provenientes das IMUs, em especial os das comercialmente disponíveis, são assaz ruidosos, o que levaria a um erro acumulativo no tempo no processo de integração das dinâmicas. Para se tratar esse problema, é necessário projetar um sistema de aquisição de dados, bem como as estruturas que o suportam e o conectam à aeronave, inerentemente insensíveis a ruídos mecânicos. Além disso, são necessários métodos de filtragem e estimação. Porém, o tratamento e a análise dos efeitos do ruído fogem ao escopo deste trabalho. Para se avaliar a viabilidade do método, optou-se por implementar uma rotina de simulações em MATLAB® utilizando-se uma função dinâmica construída a partir de um modelo de aeronave, colocando-se como saídas tanto os estados necessários ao modelo, quanto os ângulos aerodinâmicos reconstruídos com a dinâmica aproximada apresentada em (10) e (11) – os ângulos aerodinâmicos verdadeiros são calculados a partir das variáveis de estado, por meio das equações (5) e (6). Para a integração das equações, utilizou-se o Simulink®. III. RESULTADOS O estudo foi conduzido utilizando-se os modelos de duas aeronaves bastante distintas: o AT-26 Xavante e um pequeno VANT de motor elétrico, construído no Centro de Desenvolvimento de Pequenas Aeronaves (CDPA) do ITA. O modelo para o AT-26 é real, identificado em voo [7]. Para se obter o modelo da pequena aeronave, mostrada na Fig. 1, utilizou-se o Athena Vortex Lattice (AVL) [8] para se calcular as derivadas de estabilidade e controle e a posição do ponto neutro, e um modelo em CATIA® para a obtenção das propriedades de inércia e também do centro de massa do avião. Para ambas as aeronaves, utilizaram-se entradas tipo dublê, aplicadas em primeiro momento no profundor e, em segundo, no leme, para se excitar separadamente os modos de período curto e dutch roll. Partindo-se da condição de equilíbrio em voo reto e nivelado, avaliou-se a resposta dos estados de interesse para os respectivos modos, bem como os ângulos aerodinâmicos reconstruídos. Os períodos das entradas dublê foram calculados como aproximadamente iguais aos períodos de cada modo. O resultado para o AT-26 Xavante, em voo reto e nivelado a 38000 pés de altitude com velocidade TAS de 200 m/s é mostrado nas Fig. 2 a Fig. 4. A Fig. 2 exibe a resposta do modo curto de período da aeronave. A entrada na deflexão do profundor dp é exibida ao alto, seguida da taxa de arfagem, do ângulo de ataque real e do ângulo de ataque reconstruído. Pode-se notar que este modo é bem amortecido. Nota-se também que a evolução do ângulo reconstruído é praticamente idêntica à do ângulo real. Para avaliar a evolução do ângulo de derrapagem, excitou-se o modo de dutch roll também por meio de uma entrada tipo dublê no leme. A resposta da aeronave é mostrada na Fig. 3, na qual a entrada no leme dl é exibida ao alto, seguida da taxa de guinada, do ângulo de derrapagem real e do ângulo reconstruído. É possível observar que o amortecimento do modo dutch roll é muito menor do que o do modo de curto período nesta condição de voo. Ressalta-se que o AT-26 é conhecido pela qualidade de voo pobre para este modo nas referidas condições. Nota-se novamente que a evolução do ângulo reconstruído é praticamente igual à do ângulo de derrapagem real. Outro gráfico bastante comum no estudo deste modo oscilatório é o retrato de fase da resposta, exibido na Fig. 4. Nota-se que o sistema é estável, sendo o ponto de equilíbrio um foco. Entretanto, muitas oscilações ocorrem devido ao fraco amortecimento. Observa-se também, na Fig. 4, que o retrato de fase feito a partir do ângulo de derrapagem reconstruído é praticamente idêntico àquele feito com o ângulo real. Os resultados para o pequeno VANT, em voo reto nivelado a 300 pés de altitude e velocidade TAS de 15 m/s, são mostrados nas Fig. 5 a Fig. 7. A Fig. 5 exibe a resposta do modo de curto período à excitação dublê no profundor, de maneira análoga à da Fig. 2. Nota-se que a resposta na taxa de arfagem é bastante acentuada, provavelmente devido ao grande profundor e aos pequenos momentos de inércia. Notase também que o amortecimento é bastante acentuado, consideravelmente maior do que no modo de curto período do AT-26. Novamente, a evolução do ângulo reconstruído é praticamente idêntica à do ângulo real. Fig. 6 exibe a resposta do modo dutch roll do pequeno VANT à uma entrada tipo dublê no leme. Imediatamente, é possível observar que este modo é bem amortecido no pequeno VANT, diferentemente do que ocorre para o AT-26. A Fig. 7 mostra o retrato de fase da resposta deste modo oscilatório, tanto para o ângulo de derrapagem real quanto para o ângulo reconstruído. Nota-se, na Fig. 6 e na Fig. 7, que a evolução do ângulo reconstruído é praticamente idêntica à do ângulo real. Nota-se também que, de forma geral, os modos do pequeno VANT possuem maiores frequências e maiores amortecimentos do que os modos do AT-26, como era esperado, devido às diferenças entre as aeronaves [1]. IV. DISCUSSÃO Observando-se os resultados, nota-se que a reconstrução dos ângulos aerodinâmicos foi bem sucedida para os casos simulados, incluindo até mesmo condições além da região de linearidade do sistema, com altas variações nos controles e nos ângulos reais. A validade do método ressalta a sua utilidade prática. Dois motivos importantes devem ser levados em conta para se explicara o sucesso do método. Primeiro, o modelo de forças e momentos utilizados para descrever o comportamento físico das aeronaves foi baseado em derivadas de estabilidade. Deste modo, embora as equações para a dinâmica de corpo rígido da aeronave representem um sistema não linear, o modelo físico por trás delas é essencialmente linear. Se um modelo de forças e momentos mais completo, não linear, fosse utilizado para as simulações, muito provavelmente a reconstrução dos ângulos aerodinâmicos não seria tão exata para deflexões muito grandes das superfícies de comando, já que os estados do sistema seriam levados amplitudes maiores, fora do regime onde a hipótese de linearidade é válida. Em segundo lugar, não foram considerados, em nenhum momento, efeitos de ruído e desvios nos estados, os quais certamente estariam presentes caso (10) e (11) fossem calculadas a partir da fusão dos dados de sensores. Estes efeitos são cumulativos em integrações, e poderiam provocar desvios nas reconstruções, o que tornaria o método menos eficaz. Para este caso, seria necessário utilizar métodos de filtragem e estimação de estados, como por exemplo um filtro de Kalman. Além disso, o próprio projeto do sistema de aquisição de dados deveria levar em conta a presença de ruído, de maneira que sua arquitetura seja concebida para ser menos suscetível a ruídos, tanto os de origem mecânica, como vibrações, quanto os de origem eletromagnética. Entretanto, o sucesso das simulações estimula a continuidade da pesquisa. Embora haja outros formatos de equações que possibilitem a reconstrução de α e β, (10) e (11) possuem um formato em que os dados de sensores são diretamente relacionados, e não se utilizam derivadas calculadas previamente o que certamente diminui a sensibilidade do método aos efeitos do ruído. Além disto, o método deve se tornar menos sensível à medida que a velocidade da aeronave cresce, devido ao fato de que, em ambas as equações, efetua-se uma divisão pela norma do vetor velocidade TAS, VT, cujo valor numérico é bastante superior ao medido pelos outros sensores, e cuja medição é um pouco menos suscetível a ruídos. O formato apresentado também torna mais fácil a implementação de um filtro de Kalman. V. CONCLUSÃO É possível concluir que o método é válido e os resultados das simulações encorajam a continuidade dos trabalhos. Foi possível observar que, na ausência de ruído, a reconstrução dos ângulos aerodinâmicos foi bem sucedida, de forma que a implementação do método apresentado para a identificação paramétrica de pequenas aeronaves é factível. Deste modo, pode ser possível, a custo reduzido, a obtenção empírica de um modelo físico para as aeronaves, i.e., a identificação da planta em malha aberta, quase inexistente para esta classe de aeronaves, o que melhoraria o estudo deste tipo de veículo, além de tornar possível a implementação de sistemas de navegação e guiamento, os quais tipicamente necessitam do conhecimento prévio do sistema. Sugere-se para trabalhos futuros o estudo dos efeitos de ruído, na reconstrução, bem como maneiras para trata-los."
}