{
    "id": 117,
    "titulo": "absorvedores de micro-ondas à base de filmes ultrafinos de cobre depositados sobre pet",
    "autor": "daniel de souza costa, samuel machado leal da silva, newton adriano dos santos gomes, evandro luiz nohara, mirabel cerqueira rezende,",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2014/st/ST_8_3.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "O estudo de materiais absorvedores de radiação eletromagnética cada vez mais leves, finos e flexíveis tem ganhado crescente importância nos últimos anos, tanto no setor militar, possibilitando a redução de peso e volume de plataformas, como no setor civil, permitindo a confecção de dispositivos eletrônicos com projetos cada vez mais inovadores. Nesse sentido, o presente trabalho se dedicou a estudar filmes ultrafinos de cobre depositados sobre substrato de PET. A energia absorvida pelos materiais foi calculada a partir dos valores das energias refletida e transmitida, determinados pela técnica de linha de transmissão em guia de ondas na banda X. Estes valores foram comparados com a absorção calculada a partir de um circuito elétrico equivalente. Os resultados obtidos mostram uma boa concordância entre os resultados experimentais e os calculados.",
    "texto": "I INTRODUÇÃO Ao longo dos anos, os Materiais Absorvedores de Radiação Eletromagnética (MARE) vêm sendo empregados no setor civil da sociedade, com o objetivo de solucionar problemas de EMI (electromagnetic interference) e no setor militar, voltado à tecnologia furtiva (stealth) [1]. Este tipo de tecnologia vem se aprimorando desde os primeiros trabalhos com os absorvedores denominados de Salisbury screen e Jaumann, passando por mantas impregnadas com ferritas e espumas impregnadas com negro de fumo, até os trabalhos mais recentes com a incorporação de nanotubos de carbono em compósitos, produção de polímeros condutores e filmes finos metálicos [1]–[4]. Apesar de ser uma tecnologia bem consolidada, com inúmeras aplicações nos setores civil e militar, os MARE continuam a atrair um grande interesse da comunidade científica, concentrando, na última década, um elevado número de publicações no tema radar absorbing material [5]. Esse interesse crescente dos pesquisadores por esta área é atribuído ao acelerado avanço tecnológico nos setores de telecomunicações, tecnologias aeroespaciais e componentes eletrônicos sem fio, que têm contribuído para o aumento da vulnerabilidade de interferências eletromagnéticas [6], [7]. Tipicamente, os setores militar e aeroespacial possuem um grande interesse em MARE leves, finos e flexíveis, que possibilitem a confecção de peças complexas com a redução de peso e volume [1], [8], [9]. Materiais que possam atender essas exigências têm se destacado no mercado, dentre os quais têm-se os filmes ultrafinos de metais depositados sobre substrato polimérico. Dentro desse escopo, este trabalho tem por objetivo a obtenção de filmes de cobre ultrafinos, na escala de nanômetros, avaliando os seus desempenhos quanto à atenuação da radiação eletromagnética na faixa de microondas (8 a 12 GHz). Os resultados experimentais de energia absorvida obtidos foram comparados com valores calculados utilizando um modelo de circuito equivalente, o qual foi alimentado com dados experimentais de resistividade elétrica em quatro pontas. II FILMES ULTRAFINOS Nos últimos anos, tem sido observado um número cada vez maior de publicações dedicadas ao estudo de propriedades eletromagnéticas de filmes ultrafinos de metal (10-100 nm) [10]. Em geral, o estudo das propriedades eletromagnéticas desses materiais se concentra em torno das suas energias refletidas S11 e energia transmitida S21 [10], [11]. A porcentagem de energia absorvida dos filmes finos pode ser obtida por meio da equação A = 100 – (R+T), onde R é a energia refletida e T é a energia transmitida pelo material em porcentagem [11], [12]. O processo de absorção dos filmes ultrafinos está relacionado com a resistência elétrica oferecida à uma corrente induzida pela radiação eletromagnética incidente no material, a qual é convertida em calor por efeito Joule [13]. A radiação eletromagnética possui uma profundidade de penetração δ (Skin Depth), na qual é gerada a corrente elétrica induzida [10], [12], [13]. Trabalhos anteriores mostram que filmes com espessuras menores que δ podem apresentar absorção de até 50%, como demonstrado a seguir [11], [12], [14]. Considerando-se que a espessura do filme é muito menor que δ, pode-se escrever um circuito equivalente para os filmes ultrafinos em um sistema de linha de transmissão, como mostrado na Fig. 1 [15]. A linha de transmissão de tensão, que representa um campo elétrico transversal, constante dos dois lados do circuito equivalente, pode ser escrita de forma aproximada por: onde: σ é a condutividade elétrica do filme e L é a espessura do filme. Agora, de forma simplificada, pode-se escrever a fração da potência de rádio-frequência (rf), que é absorvida pelo circuito equivalente Req, como descrito a seguir. onde:  A absorção do filme pode ser relacionada com a espessura do filme, que é normalizada por um fator de comprimento de escala (scale length), que pode ser escrito, Desta forma,  Se L=s tem-se que ξ é igual a 1, assim obtém-se o valor máximo de absorção de um filme fino, que é igual a 50%. Agora considerando o circuito elétrico equivalente apresentado na Fig. 2, pode-se observar que em uma das extremidades do circuito equivalente Req≫Z0 e na outra extremidade R eq≪Z0. Nestes limites, Req se comporta tanto como um circuito aberto como fechado, não podendo assim absorver potência rf significativa. III MATERIAIS E MÉTODOS Foram depositados 9 filmes de cobre sobre um substrato polimérico à base de PET (poli(tereftalato de etileno)), com espessuras variando de 20 a 100 nm, com intervalos de 10 nm. Os filmes ultrafinos de cobre foram depositados pela técnica Magnetron Sputtering utilizando um alvo de cobre com 99,999% de pureza e diâmetro de 152,4 mm. Primeiramente, o sistema foi evacuado para uma pressão base de 0,05 mTorr, em seguida foi inserido gás argônio até uma pressão de trabalho de 50 mTorr. A distância do alvo para o substrato foi de 300 mm. Foi empregado uma corrente de 3 A e uma tensão de 520 V e taxa de deposição de 1,5 nm/s. Para que todos os filmes fossem depositados sobre a mesma condição foi utilizado um porta-amostra com um sistema quase contínuo, permitindo a deposição de diversos filmes, sem a necessidade de abrir a câmara para a troca de amostras. A espessura dos filmes foi monitorada em tempo real por meio de um cristal de quartzo ressonador, onde o material evaporado é depositado simultaneamente no substrato e no cristal. A condutividade elétrica dos filmes foi analisada pela técnica de quatro pontas, utilizando um modulo eletrônico de medida Jandel RM 300 e um sistema universal de medidas de 4 pontas Jandel, à temperatura ambiente. Os parâmetros S (energia refletida S11 e energia transmitida S21) foram obtidos pela técnica de linha de transmissão, utilizando um guia de ondas na banda X. As perdas por reflexão (Reflect Loss) dos filmes ultrafinos foram obtidas por meio da inserção de uma placa metálica atrás do filme, gerando um curto circuito. As medidas eletromagnéticas foram feitas por meio da utilização de um Network Analyzer Agilent N5230C, na faixa de frequências de 8,2 a 12,4 GHz. IV RESULTADOS E DISCUSSÕES A Fig. 3 apresenta os resultados de condutividade elétrica dos filmes ultrafinos de cobre em função da espessura. É possível observar que as menores espessuras (20, 30 e 40 nm) possuem pouca dependência da condutividade elétrica em relação à espessura. Estes filmes também apresentam os menores valores de condutividade elétrica. Este comportamento é esperado, já que para estas espessuras os filmes ainda não são contínuos, como já relata a literatura [10], [16]. As espessuras de 50 e 60 nm apresentam um aumento nas condutividades elétricas dos filmes, indicando a formação de filmes mais uniformes. O filme de 70 nm possui a maior condutividade elétrica medida, sugerindo um maior ordenamento dos filmes, comportamento este descrito na literatura, que prevê um aumento da condutividade elétrica com a espessura dos filmes [10], [13], [16]. Os filmes com espessuras entre 80 a 100 nm apresentam um comportamento anômalo de condutividade elétrica, com a diminuição desta propriedade com o aumento da espessura dos filmes. Este comportamento também já foi relatado na literatura, em um estudo envolvendo filmes finos de terras raras, que associa mudanças na cristalinidade e/ou na microestrutura dos filmes finos [17]. As Fig. 4 e 5 apresentam as energias refletida (S11) e transmitida (S21) em porcentagem, na faixa de frequências de 8 a 12 GHz. A correlação dos dados da Fig. 3 com os da Fig. 4 mostra que a reflexão da onda eletromagnética pelos filmes de Cu apresenta uma correlação com a condutividade elétrica dos mesmos. Desta forma, os filmes ultrafinos de cobre podem ser divididos em 3 grupos, o primeiro grupo representa os filmes mais condutores (50, 70, 80 e 90 nm), que possuem os maiores valores de energia refletida. O Grupo 2 que representa os filmes com energias refletidas intermediárias (60 nm), possuindo também condutividade intermediária. E o Grupo 3, que representa os filmes com menor energia refletida (20, 30, 40 e 100 nm), que são os filmes com menores condutividades elétricas. A energia absorvida pelos filmes (Fig. 6) é calculada pela equação A = 100 – (R+T). Desta forma, seu comportamento é dado pela soma dos comportamentos das curvas de energias refletida e transmitida. Portanto, as curvas de energia absorvida podem ser novamente divididas em 3 novos subgrupos. Porém, com distribuição diferente, onde o Grupo 1A (20 nm) possui a menor energia absorvida, de aproximadamente 15%. Isso ocorre devido à baixa condutividade elétrica deste filme e uma elevada quantidade de energia transmitida, mostrando uma baixa interação do filme com a onda incidente. O Grupo 2A (30, 40 e 100 nm), também possui baixa condutividade elétrica; no entanto, são mais espessos, possibilitando uma maior interação com a onda eletromagnética incidente, como demonstrado em (2). Este Grupo 2A apresenta valores de energia absorvida entre 25 e 35%. O Grupo 3A (50, 60, 80, 70 e 90 nm) apresenta os maiores valores de energia absorvida, entre 32 e 48%. Esses valores de energia absorvida mais elevados, próximos do limite teórico de 50% [14], são atribuídos a um adequado casamento dos parâmetros condutividade elétrica e espessura dos filmes, como demonstrado em (2). O gráfico da Fig. 7 apresenta os valores experimentais médios de energia absorvida dos filmes de cobre e a absorção calculada por (2). É possível observar que a curva experimental e a curva calculada apresentam a mesma tendência, e uma variação média de aproximadamente 10% entre os valores calculados e os obtidos experimentalmente. Este resultado mostra que os filmes ultrafinos de cobre possuem um comportamento que pode ser descrito pelo circuito equivalente, como ilustrado na Fig. 1. A Fig. 8 apresenta os valores de perda por reflexão (Reflect Loss) para os filmes ultrafinos de Cu. Como previsto pela teoria [15], filmes finos não apresentam absorção significativa em um sistema de curto circuito (como ilustrado na Fig. 2). V. CONCLUSÃO Filmes ultrafinos de cobre, com espessuras entre 20 e 100 nm, foram depositados pela técnica de magnetron sputtering sobre um substrato polimérico de PET. A condutividade elétrica dos filmes foi determinada pela técnica de 4 pontas, que mostrou a dependência da condutividade elétrica com a espessura. Filmes com espessura até 70 nm apresentam comportamento esperado, tendo um aumento da condutividade com a espessura. Os filmes acima de 70 nm mostram comportamento de condutividade elétrica anômalo, ou seja, a diminuição da condutividade elétrica com o aumento da espessura. Também foi possível observar que as energias refletida e transmitida apresentam uma relação direta com a condutividade elétrica dos filmes. Os gráficos de energia absorvida mostram que os filmes de cobre possuem um comportamento de absorção de banda larga. Os filmes com espessuras entre 50 e 90 nm apresentam os melhores valores de energia absorvida, entre 32 e 48%. Também é verificado que o comportamento eletromagnético dos filmes ultrafinos de cobre podem ser descritos por um circuito elétrico equivalente, com boa concordância entre as tendências observadas experimentalmente e calculada. Este resultado mostra que o uso da condutividade elétrica permite predizer o comportamento de filmes ultrafinos, previamente às suas caracterizações eletromagnéticas.  "
}