{
    "id": 118,
    "titulo": "estudo sobre enlaces à fibra óptica visando aplicações em sistemas radar com antenas remotas",
    "autor": "robson ribeiro carreira e josé edimar barbosa oliveira",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2013/st/P_2.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Este artigo apresenta um estudo preliminar sobre Enlaces à Fibra Óptica (Fiber Optic Link – FOL) com o objetivo de posicionar remotamente módulos de um sistema radar em relação as suas antenas. Os parâmetros aqui apresentados são justificados baseando-se num experimento com FOL instalado num radar AN/SPQ-9B Advanced Development Model (ADM), conduzido no NRL Chesapeake Detachment, em Chesapeake Beach, Maryland, Estados Unidos. Na primeira parte são citadas as vantagens do uso da fibra óptica em relação aos condutores metálicos (cabo coaxial e guia de ondas). A segunda parte apresenta características gerais de um FOL. A terceira aborda aspectos específicos deste teste e resultados obtidos. Por fim são sugeridos estudos a serem desenvolvidos em alguns sistemas de microondas nos meios de superfície da Marinha do Brasil.",
    "texto": " I. INTRODUÇÃO No combate moderno é imprescindível a detecção dos contatos a uma distância cada vez maior e, preferencialmente, antes do oponente, a fim de serem tomadas as ações devidas em tempo hábil. Desta forma os sistemas em RF embarcados em navios de superfície são de grande importância para o sucesso de uma operação naval. Radar e MAGE são dois dos sistemas que contribuem para um alarme antecipado de uma ameaça. Para obterem suas melhores performances, eles operam sob requisitos técnicos rigorosos. Isto implica em posicionar seus módulos em locais tais que seja possível controlar a temperatura e umidade (interior do navio) e, ao mesmo tempo, cujas distâncias até suas antenas não provoque excesso de perda de sinal. Essa atenuação se dá pelo fato de serem usados guias de onda metálicos para a transmissão do pulso radar, meios estes que possuem altas perdas por unidade de comprimento, dependendo da frequência de operação. O caso do MAGE é mais crítico, pois como o sinal recebido possui um baixo nível de potência, suas unidades de processamento não devem ser instaladas muito afastadas das suas antenas. Como se deseja que estas antenas estejam posicionadas nas partes mais elevadas dos navios, normalmente nos topos dos mastros, a fim de se obter o melhor horizonte radar, obrigatoriamente os módulos do sistema precisam ser instalados nos conveses mais elevados. Porém nos compartimentos mais altos1 (localizados na superestrutura do navio, acima do convés principal) são encontradas as maiores dificuldades de controle da temperatura, devido à maior área de exposição à luz solar, prejudicando a obtenção de dados consistentes. Tal disposição é representada esquematicamente na Fig. 1. Fig. 1. Representação Esquemática da Disposição das Antenas e da Localização dos Compartimentos Radar e MAGE a bordo de um navio A fibra óptica possui vantagens sobre os condutores metálicos para a transmissão de sinais de frequência rádio. Ela possui baixa perda, permite maior largura de banda e é imune a interferências eletromagnéticas [1]. Dentre as suas desvantagens destaca-se a não transmissão de potência, apenas de sinal, assunto este que será objeto de estudo em documento oportuno. Os valores dos coeficientes de atenuação para fibras ópticas monomodo são da ordem de 0,2 a 0,5 dB/Km [2]. A título de comparação, um cabo coaxial RG-213 possui atenuação variando de 3,5 a 98,6 dB/100 m para faixas de frequência entre 30 e 5800 MHz [3]. Os guias de onda, apesar de possuírem atenuação menor do que os cabos coaxiais, para determinadas faixas de frequência, também ficam em desvantagem quando comparados à fibra. Essa propriedade faz da fibra óptica o meio ideal para afastar módulos de sistemas de microondas, tais como os transmissores e receptores (TR) radares ou as unidades de processamento MAGE de suas antenas. Da perspectiva da microonda, afastar uma antena do seu transmissor não é uma tarefa fácil. Um típico módulo TR necessita de vários watts de potência, o que significa que um link de fibra óptica (FOL) deve ser capaz de lidar com alta potencia de RF sem saturação. Adicionalmente, sistemas radares modernos possuem requisitos rigorosos de ruído de fase. Portanto qualquer ruído de fase adicional que for introduzido pelos componentes fotônicos pode degradar a sensibilidade do radar. Estas questões tem levantado o questionamento se a tecnologia fotônica é apropriada para afastar módulos de radares modernos com high dynamics range [4]. II. PRINCÍPIO DE OPERAÇÃO A Fig. 2 é a representação esquemática simplificada de um link fotônico. Nela o laser é externamente modulado por um sinal de RF utilizando um Modulador Mach-Zehnder (MMZ). O sinal modulado atravessa um comprimento L de fibra óptica e é detectado por um fotodiodo (FD). Este responde linearmente à intensidade fotônica incidente, resultando em uma fotocorrente de RF de onde o sinal de modulação é restabelecido. Fig. 2. Representação Esquemática Simplificada de um Enlace Fotônico à Fibra Óptica. MMZ – Modulador Mach-Zehnder; L – Comprimento da Fibra Óptica; FD – Fotodetector. A. Modulador Mach-Zehnder Os moduladores à óptica integrada aqui considerados funcionam com o princípio linear do efeito eletroóptico [5]. Grande parte dos novos dispositivos à óptica integrada são feitos de Niobato de Lítio (LiNbO3) por causa do seu alto coeficiente eletroóptico e da alta qualidade do cristal [5]. Outro material utilizado para a confecção destes dispositivos é o Tantalato de Lítio (LiTaO3). Dentre os moduladores eletroópticos (Electro-Optic Modulator –EOM) os mais comuns são os de fase, os de amplitude e os ressonantes [5]. O Modulador Mach-Zehnder é um EOM de amplitude cuja construção é baseada no interferômetro Mach-Zehnder. A entrada do guia de onda óptico é dividida em dois caminhos que depois são recombinados. Entre estes caminhos existe um eletrodo comum ou central e nos lados oposto eletrodos laterais, no total de dois. Ao ser aplicado um sinal de RF no eletrodo central e aterrando-se os eletrodos laterais (configuração push-pull), geram-se dois campos eletromagnéticos com polarizações opostas, um sobre cada caminho [5] da Fig. 3. O campo elétrico nas duas saídas do MMZ pode ser calculado utilizando a matriz de Jones [6] e [7], conforme abaixo: Onde EMZ1(t) e EMZ2(t) são os campos elétricos na junção Y de saída do modulador ilustrado na Fig. 3 e E(t) é o campo elétrico óptico de entrada, proveniente do laser, representado por: Onde ω0/2π é a frequência central do laser, P0 é a potência do laser e q é a constante relacionando o campo elétrico óptico e a potência. Postulando que não há perdas, substituindo (2) em (1), tem-se: Definindo o campo EMZ1(t) como sendo o campo a ser detectado pelo fotodetector, tem-se: Substituindo (3) em (4), tem-se: Onde It é a fotocorrente total e R a responsividade do fotodetector. Postulando-se que a voltagem de controle do modulador Vdrive é dada por: Onde Vb é a voltagem DC de bias e VRF é a voltagem do sinal na frequência f=Ω/2π. Considerando um MMZ com a configuração push-pull (balanceado), o sinal de controle produz um deslocamento de fase, em cada caminho do modulador, dado por: Onde ϕb é a mudança de fase ocasionada pelo sinal de bias e ϕ0 é uma característica do MMZ de dependência de frequência [6]. Seus valores são dados por: Onde Vπ é a tensão de meia onda, aquela necessária para produzir um deslocamento de fase de π. Considerando ϕb=π/2, tem-se em (5): Onde Jm é a função de Bessel de primeira espécie de ordem m. Nota-se que (11) possui um termo DC, IDC=RP0/2, e termos de RF centrados na frequência fundamental Ω/2π. É importante ressaltar que (11) é apenas para um MMZ ideal, ou seja, sem perdas [6]. B. Fotodetector Os fotodetectores são dispositivos capazes de detectar os fótons neles incididos. Para um FOL é usual a utilização de fotodiodos, os quais tem a propriedade de liberar elétrons, gerando corrente elétrica, por meio do efeito fotoelétrico. Várias técnicas são empregadas para se construir um fotodiodo, de forma a eles terem o melhor desempenho em potência e frequência de RF. A título de ilustração, será apresentado o do tipo p-i-n. Ele é capaz de responder linearmente à incidência de fótons, resultando em uma fotocorrente de RF, da qual o sinal de modulação é restabelecido [6]. Postula-se um circuito de casamento de impedância associado com um detector, conforme a Fig. 4. Este tipo de construção costuma aumentar a largura de banda do detector, mas limita sua potência de RF de saída. Para este sistema, apenas metade da corrente IRF gerada é fornecida à carga AC acoplada, enquanto é possível medir toda a corrente IDC, usando, por exemplo, um resistor em série [6]. Fig. 4. Representação Esquemática Simplificada de um Fotodetector com casamento de impedância para uma resistência de carga AC acoplada. A corrente DC flui na direção do caminho tracejado em azul enquanto a corrente de RF flui pelo caminho pontilhado em verde. A corrente DC é medida por meio de um resistor em série de 10 Ω [6]. III. DESCRIÇÃO DO TESTE O radar AN/SPQ-9B ADM é um radar pulsado, com processamento Doppler, da banda X e com o horizonte radar projetado para operar em navios de superfície. Sua principal função é a detecção de aeronaves em baixas altitudes e mísseis sea-skimming. A detecção destes tipos de alvos é difícil porque suas presenças são camufladas pelo forte espalhamento da água do mar e pelo clutter de terra. Por meio da utilização de componentes de RF com baixo ruído de fase, este sistema alcança mais do que 90 dB de cancelamento de clutter [4]. O sistema pode ser dividido em seis módulos principais: uma antena, um excitador, um transmissor, um receptor, um amplificador de baixo ruído (LNA) e um processador. A antena é parabólica, gira a 30 rpm, possui um ganho de 44 dBi e uma largura de feixe de 1,25º em azimute; O excitador opera na banda X, com uma potência de saída máxima de +36 dBm e uma relação sinal-ruído (SNR) maior do que 75 dB sobre uma largura de banda de ruído de 1,3 MHz; O receptor possui um ganho de 17 dB, uma figura de ruído (noise figure – NF) de 22 dB e um ponto de compressão de entrada de 1-dB (1-dB input compression point – Pin 1-dB) de -8,5 dBm; O LNA possui um ganho de 22,5 dB, uma figura de ruído de 6,6 dB e um ponto de compressão da entrada de 1-dB de +0,4 dBm. Todos estes ganhos e figuras de ruído incluem todas as perdas relativas à linha de transmissão e outros componentes de RF [4]. A Fig. 5 mostra o local de instalação do FOL no sistema AN/SPQ-9B ADM. Esta localização foi escolhida por aproximar-se do requisito de posicionamento de um típico módulo TR. Esta configuração pode permitir a instalação tanto do receptor quanto do transmissor em conveses abaixo, onde restrições de tamanho e peso diminuem de importância [4]. No interior do navio também é possível um controle mais adequado do ambiente, diminuindo os efeitos da temperatura externa e da umidade. A temperatura ambiente é um fator importante a ser considerado, principalmente em Marinhas que operam, predominantemente, em climas tropicais. Foi escolhida a distância de 40 metros para a demonstração, embora afastamentos maiores sejam possíveis [4], por ser este um valor que permitiria abrigar os módulos do radar no interior do navio. A Tabela I apresenta a especificação necessária para o FOL. Os valores de ganho, figura de ruído e compressão de 1-dB foram escolhidos para preservar os do excitador e do receptor. Já o ruído de fase foi determinado pela medida do ruído de fase do oscilador local estabilizado (stabilized local oscillator – STALO), compartilhado pelo excitador e pelo receptor. A Fig. 6 mostra os FOL do transmissor e do receptor, projetados para afastar os módulos do radar de sua antena. Os links remotos consistem de uma linha de retardo de fibra óptica (FODL) seguida e/ou precedida por amplificadores e atenuadores de microondas. Os amplificadores foram usados para compensar a perda de RF de 30-40-dB do FODL. O FODL que será considerado é o baseado na modulação externa (XMOD) de um laser de estado sólido [4]. Fig. 6. Representação Esquemática Simplificada da Linha de Retardo de Fibra Optica (FOLD) baseado na modulação externa (XMOD) [4]. No FODL XMOD, o sinal de RF alimenta a entrada de um modulador óptico Mach-Zehnder (MMZ) de LiNbO3. O MMZ de amplitude modula um laser diode-pumped fiberpigtailed solid-state operando em 1,319 µm. Embora este laser forneça mais potência óptica que o necessário para esse experimento, ele foi escolhido por seu baixo ruído de intensidade relativo (relative intensity noise – RIN) de -165 dB/Hz. Das considerações básicas da figura de ruído para um link fotônico, pode ser mostrado que níveis baixos de RIN são necessários para alcançar as especificações de figura de ruído da Tabela I. O sinal óptico modulado por RF foi guiado por meio de 40 m de fibra óptica do tipo SMF-28 para simular a distância de afastamento desejada. O sinal de RF é recuperado usando um fotodetector (FD) de 10 mW 15 GHz. A potência óptica do laser foi ajustada para produzir uma corrente de quadratura de 5 mA no FD [4]. Os testes consistiram em monitorar o feixe da antena radar sobre um alvo estacionário e medir os dados de distância/doppler com e sem o FOL. O alvo selecionado foi um cone refletor a uma distancia de 15,6 Km do radar localizado na ilha Tilghman. As Fig. 7(a) e 8(a) mostram as medidas de distância/doppler para a linha de transmissão. O pico na célula de distância nove corresponde ao cone refletor. Adicionalmente um pico secundário, representando terra, pode ser claramente distinguido. Assim como a Fig. 8(a) é consistente com a medida de referência na Fig. 7(a), observase uma relação similar entre as Fig. 8(b) e 7(b). Fig. 7. Medidas de distância/doppler sem o FOL (a) Linha de transmissão (b) Linha de recepção [4]. Fig. 8. Medidas de distância/doppler com o FOL (a) Linha de transmissão (b) Linha de recepção [4]. O teste concluiu que o FOL obteve um desempenho condizente com as especificações do radar. Portanto os componentes fotônicos podem atender as especificações rigorosas dos radares modernos [4]. III. CONCLUSÃO O teste em questão se valeu de um sistema radar de alta complexidade e operando com margens de tolerância reduzidas. Mesmo com tamanha exigência, foi possível posicionar remotamente, com sucesso, os módulos transmissor e receptor de tal equipamento da sua antena. Pode-se retirar desse experimento elementos que justifiquem estudos específicos no âmbito da Marinha do Brasil de forma a abrigar em conveses abaixo módulos mais sensíveis, não só dos sistemas radar, mas como também dos sistemas MAGE. Tais estudos poderiam ser realizados na maioria das classes de navios. "
}