{
    "id": 119,
    "titulo": "controle preditivo de um sistema de resfriamento empregando células de efeito peltier",
    "autor": "josé roberto colombo junior, roberto kawakami harrop galvão, edvaldo assunção e ricardo tokio higuti",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2013/st/P_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 2,
    "resumo": "Neste trabalho é apresentado um controlador de temperatura para um sistema de resfriamento utilizando duas células de efeito Peltier. O sistema é fixado em uma base de alumínio, que atua como suporte mecânico e condutor de calor. A lei de controle utilizada é o controle preditivo tipo Dynamic Matrix Control (DMC), que foi implementado em computador. Desenvolveu-se um conversor D/A que faz uso de um único pino do microcontrolador, utilizando modulação por largura de pulso e um filtro passa-baixas, de forma a obter o valor médio do sinal. Também foi colocado um display LCD que mostra a temperatura da planta e do dissipador, além de uma interface USB, responsável pela comunicação entre o sistema remoto e o computador. Como resultado, constatou-se que o controlador conduz a temperatura ao valor desejado, mesmo na presença de eventual falha em uma das células de efeito Peltier.",
    "texto": "I. INTRODUÇÃO A eficiência e o funcionamento da maioria dos dispositivos eletrônicos são significativamente afetados pelas condições de temperatura a que são submetidos [1] Um exemplo comum da influência da temperatura se dá em dispositivos fabricados a partir de materiais semicondutores que, quando submetidos a temperaturas mais altas do que foram projetados para operar, apresentam um aumento significativo na sua corrente de fuga que, por conseguinte, podem levar o componente à fadiga. Neste trabalho é apresentado um sistema de controle de temperatura para dispositivos laser, que são muito sensíveis às variações de temperatura [2]. A elevação da temperatura do diodo laser é diretamente proporcional à sua potência de operação nominal. Em experimentos científicos, muitas vezes faz-se necessário que este dispositivo permaneça ligado por várias horas e assim, é necessário o uso de um controlador de temperatura que seja capaz de mantê-lo à sua temperatura ideal de operação. O atuador do sistema térmico proposto é a célula de efeito Peltier, também conhecida como TEC (TermoElectric Cooler). Neste tipo de elemento, ao ser aplicada uma corrente em seus terminais, há o surgimento de um gradiente de temperatura entre as suas junções, ou seja, um dos lados da célula resfria enquanto o outro é aquecido. O sentido do fluxo de calor não é preestabelecido pelas características construtivas do dispositivo, isto é, o sentido do fluxo pode ser alterado simplesmente invertendo-se o sentido da corrente que percorre o termo elemento. O uso deste tipo de termoelemento é especialmente útil em aplicações onde o emprego de dispositivos convencionais para controle de temperatura seja de difícil implementação ou tenha custo proibitivo. Exemplos incluem a instalação em sistemas miniaturizados, ambientes suscetíveis a vibrações ou ainda aplicações diversas em que seja necessária uma resposta rápida e com uma boa precisão [3]. É importante salientar que nos experimentos realizados, por se tratar ainda de um trabalho preliminar, não se utilizou um diodo laser por questões de segurança de operação no laboratório. Como alternativa, utilizou-se um resistor de potência, alimentado por uma fonte regulável de corrente contínua, como dispositivo a ser resfriado. O controle de temperatura foi realizado em malha fechada, utilizando a técnica de controle preditivo Dynamic Matrix Control (DMC). Tal técnica não requer um modelo matemático do sistema a ser controlado, sendo suficiente adquirir a resposta a degrau da planta em malha aberta. O Controle Preditivo Baseado em Modelo (Model-based Predictive Control, MPC), ou simplesmente Controle Preditivo, surgiu ao final dos anos 70, com aplicações na indústria química e petrolífera, tendo posteriormente tornado-se popular em vários outros campos [4]. O DMC foi uma das primeiras formulações a serem desenvolvidas e até hoje é utilizado em diversas aplicações [5], [6] e [7]. Nesta abordagem, o controle é obtido como solução de um problema de otimização com custo quadrático, que penaliza tanto o erro de rastreamento quanto o sinal de controle. Este artigo está organizado da seguinte forma: na Sub-seção I.1, apresenta-se a notação adotada no restante do texto. Na Seção 2, resume-se a formulação DMC empregada. Na Seção 3, apresenta-se o sistema de controle de temperatura desenvolvido para uso neste trabalho. Nas Seções 4 e 5, descrevem-se o experimento realizado e os resultados obtidos. Comentários finais são apresentados na Seção 6. I.1 Notação usada neste artigo k: Instante atual (índice de tempo discreto); u(k), y(k): Sinais de controle e saída da planta no instante k; ∆u(k) = u(k) − u(k-1): Incremento de controle; ∆û(k + i | k): Valor futuro do incremento de controle no instante k + i, dentro de um horizonte de predição de N passos iniciado no instante k; ˆ(ky + ki )| : Valor predito da saída no instante k + i com base nas informações disponíveis até o instante k, supondo aplicação da sequência de incrementos de controle ∆û(k + j | k), j = 0, 1,..., i − 1; yref (k + i): Sinal de referência; ∆û*(k + i | k): Valor ótimo de ∆û(k + i | k); g(n): Resposta da planta em malha aberta no n-ésimo instante de amostragem após a aplicação de um degrau de entrada unitário; f(k + i | k): Resposta livre da planta no instante k + i, considerando que o controle seja mantido constante após o instante k; I: matriz identidade com dimensões apropriadas. II. FORMULAÇÃO DMC EMPREGADA Na formulação DMC, o controle a ser aplicado à planta no k-ésimo instante de amostragem é obtido por meio da minimização de uma função de custo da forma sendo o peso ρ > 0 um parâmetro de projeto. Alternativamente, o custo J pode ser reescrito como Como detalhado em [8], a relação entre ∆û e yˆ pode ser expressa na forma da Eq. (3): sendo ( k|i+kf ) a resposta livre da planta, apresentada na Eq. (4): Vale salientar que a equação de predição (3), com resposta livre calculada por meio de (4), confere ação integral à lei de controle resultante, ou seja, é capaz de corrigir efeitos de uma perturbação de saída suposta constante [8]. Supondo a planta estável em malha aberta, tem-se que ( i+ng ) − ng )( ≅ 0 para n suficientemente grande. Desse modo, pode-se truncar a somatória apresentada em (4) após um certo número Ns de parcelas, como mostrado na Eq. (5): A equação (3) pode ser reescrita em forma compacta, como mostrado na Eq. (6): A minimização da função de custo (2) sujeita ao vínculo (6) entre yˆ e ∆û resulta em Empregando uma estratégia de horizonte retrocedente, apenas o primeiro elemento da sequência de controle ótima é aplicado à planta, isto é, faz-se ku )( (ku= −1)+∆ uˆ*( k|k ) . No próximo instante de amostragem, utiliza-se y(k + 1) em lugar de y(k) para cálculo da resposta livre, emprega novamente a expressão (9) e faz-se ( +ku 1) ku= )( +∆ uˆ*( 1 +k|+k 1) . II. DESCRIÇÃO DO SISTEMA Estrutura do sistema A planta a ser controlada consiste de um cubo de alumínio, duas células de efeito Peltier e dois dissipadores de calor. Entre os dois dissipadores de calor está o cubo de alumínio, que fornece sustentação mecânica para o dispositivo a ser resfriado (diodo laser ou, como usado neste trabalho, resistor de potência) Para cada um dos dissipadores há uma célula de efeito Peltier, que drena o calor produzido pelo diodo laser para os dissipadores. A planta é apresentada na Figura 1. Adicionalmente, há uma chave manual para selecionar se as duas células estão operando ou se uma delas encontra-se inativa. Com isso, pode-se avaliar, na prática, a capacidade do sistema de controle em acomodar eventuais falhas que resultem na perda de uma das células Peltier. O objetivo é controlar a temperatura do dispositivo de interesse, mantendo-a dentro de uma faixa aceitável para o bom funcionamento do mesmo. Há também a placa com o circuito eletrônico, que realiza o link entre a planta e o computador. Nesta há um microcontrolador gerenciando todo o hardware, porém, operando como escravo. Isso porque a implementação do controlador DMC é feita em computador, de forma que a plataforma remota opera como terminal, recebendo comandos através da porta de comunicação USB. Esta disposição é bastante interessante pois permite modificar o controlador apenas editando o programa no computador, sem a necessidade de transferir o novo controlador para a plataforma remota. Com o grande poder de processamento disponível nos computadores, é possível testar leis de controle bastante complexas, de forma a extrair o melhor desempenho possível da planta. A placa de circuito eletrônico é apresentada na Figura 2. Nesta planta, a corrente aplicada às células Peltier é a variável manipulada u para fins de controle, como será detalhado mais adiante. Duas variáveis de saídas são medidas, a saber a temperatura sobre o resistor de potência e a temperatura sobre um dos dissipadores. Dessa forma, é possível alternar entre o caso SISO (Single Input Single Output) e o caso SIMO (Single Input and Multiple Outputs) por motivos de utilização didática, ilustrando esses dois casos. Além da comunicação entre o computador e a plataforma remota, há também um display LCD, para exibir as temperaturas do dissipador e do resistor de potência. Neste display também é apresentada a corrente que circula pelo resistor de potência. Enfim, o sistema de controle de temperatura desenvolvido pode ser exposto sob a forma de diagrama de blocos, como mostrado na Figura 3: Sensor de temperatura utilizado O sensor utilizado para medir a temperatura é um termistor NTC modelo B57861S0103F040, fabricado pela empresa EPCOS [9], mostrado na Figura 4. Os termistores são resistores termicamente sensíveis, cujas características exibem grandes mudanças na resistência com uma pequena mudança da temperatura do corpo. Para os termistores do tipo Negative Temperature Coefficient (NTC), a variação positiva da temperatura faz com que sua resistência diminua. O manual do termistor empregado apresenta alguns pontos de operação relacionando a temperatura ζ com a resistência η. Utilizando-se estes pontos interpolouse um polinômio de terceira ordem, para caracterizar o comportamento deste sensor. Para isso, a abscissa e a ordenada foram tomadas como sendo a resistência do termistor (r, dada em Ω) e a temperatura (t, dada em ºC), respectivamente. A faixa de temperatura a ser representada por este polinômio varia de forma que a menor temperatura medida seja 5ºC e a maior temperatura seja 40ºC. A expressão resultante é apresentada na Equação (10): É importante ressaltar que a faixa 5ºC − 40ºC compreende o intervalo de variação de temperatura nos experimentos realizados. Desse modo garante-se que a determinação de temperatura foi realizada dentro da faixa de ajuste do polinômio (10), não tendo sido realizadas extrapolações. Conversor D/A e estágio de potência de saída A modulação por largura de pulso utiliza uma onda retangular com razão cíclica que depende da variação do sinal modulado. Considerando-se uma onda quadrada f(t) com valores mínimos e máximos ymin e ymax respectivamente, razão cíclica D e ton o tempo em que a função permanece no valor ymax, o valor médio da forma de onda no intervalo [0,T] será dado por No caso do sinal modulado passar por um filtro passa-baixas, será extraído o seu valor médio. Dessa forma, pode-se utilizar o PWM como um conversor Digital para Analógico. Isso é bastante vantajoso pois um conversor D/A típico ocuparia pelo menos oito pinos do microcontrolador, enquanto que por modulação PWM, ocupa apenas um único pino. Esse conversor D/A pode ser posto sob a forma de diagrama de blocos, como mostrado na Figura 5: É necessário projetar um filtro passa-baixas com frequência de corte suficientemente baixa. Isso porque é desejado manter apenas as componentes de baixa frequência do sinal PWM, que estão associadas às variações do sinal de entrada. No entanto, quanto menor a frequência de corte maior será seu período transitório. Neste projeto, adotou-se que o período transitório do filtro em questão tenha duração máxima de 10 ms (0,5% do período de amostragem escolhido). Para implementar o filtro, escolheu-se utilizar um filtro ativo de segunda ordem com ganho unitário [10]. Considerando que a topologia KRC (ganho K, resistor R e capacitor C) representa um filtro ativo de segunda ordem, é possível obter uma estimativa inicial da frequência de corte fo com a equação do tempo de estabelecimento: na qual ωn é a frequência natural não amortecida, ξ é o coeficiente de amortecimento e t e é o tempo de estabelecimento. A frequência de corte é a frequência na qual o ganho cai 3 dB em relação ao ganho DC do filtro. Dessa forma, é desejável que a frequência acima escolhida esteja dentro da banda de passagem do filtro, ou seja: Substituindo-se a Equação (13) em (12), tem-se: assim, substituindo ξ = 1 e te = 0,010 na Equação (14): Na saída do filtro passa-baixas, adicionou-se um potenciômetro a fim de regular a tensão máxima na saída do filtro. Como o sinal PWM possui amplitude máxima de 5 V, a maior tensão na saída do filtro será 5 V sem o potenciômetro. Como será visto, o amplificador operacional de potência é capaz de fornecer até 3 A. Portanto, o potenciômetro servirá para ajustar a máxima corrente que o amplificador de potência poderá fornecer: 2,5 A, deixando uma pequena margem de folga. Para que o circuito de controle aplique tensões negativas sobre a célula de efeito Peltier, foi inserido um circuito subtrator de tensão [11]. Desta forma, quando é necessário aplicar uma tensão negativa sobre a planta, o microcontrolador acionará o subtrator, que decrementará a amplitude máxima do sinal do PWM. Assim, é possível aplicar tensões negativas sobre a planta. A resistência elétrica de uma célula de efeito Peltier varia com a diferença de temperatura sobre ela. Portanto este dispositivo é melhor excitado a partir de uma fonte de corrente do que com fonte de tensão. Faz-se necessário então um circuito que converta a tensão de saída do filtro em corrente. Para isso utilizou-se um amplificador operacional de potência, o OPA548 [12], que é capaz de fornecer até ±3 A. O circuito eletrônico da fonte de corrente controlada por tensão é apresentado na Figura 6. É importante ressaltar que na Figura 6 o nó PWM_DC representa a componente DC do sinal PWM. O funcionamento do circuito mostrado na Figura 6 pode ser descrito de maneira simples. A tensão aplicada ao pino 1 é teoricamente igual à tensão aplicada no pino 2, utilizando o conceito de curto-circuito virtual. Então, a tensão sobre o resistor R302 é igual à tensão aplicada no pino 1, que é a saída do filtro. Como o valor do resistor é 1 Ω, a tensão nele aplicada é numericamente igual à corrente. Logo, esse circuito é um conversor de fonte de tensão para fonte de corrente. Tendo em vista que a célula de efeito Peltier pode tanto aquecer ou refrigerar a planta, faz-se necessário convencionar qual o sinal da tensão que aplicada ao atuador do sistema corresponderá ao processo de aquecimento ou resfriamento. Portanto, convenciona-se que tensões negativas correspondem ao processo de resfriamento e tensões positivas ao processo de aquecimento. III. EXPERIMENTOS REALIZADOS Implementação do controlador DMC Inicialmente, foi adquirida a resposta da planta para um degrau de corrente unitário no comando u do circuito de alimentação do atuador do sistema (célula de efeito Peltier). Foram realizados dois ensaios, um para o sistema operando em condições nominais (duas células Peltier em operação) e outro para o sistema na presença de falha (apenas uma célula Peltier em operação). São apresentadas na Figura 7 as respostas a degrau unitário de corrente para a planta em malha aberta, após a remoção do offset de temperatura inicial. É importante ressaltar que mesmo que neste gráfico aparentemente a temperatura esteja aumentando com o passar tempo ela está de fato diminuindo. Esse efeito visual é causado pela normalização com respeito à corrente aplicada (u = −1 A). Com este experimento verificou-se que o sistema aproxima-se bastante da linearidade, pois o ensaio com apenas uma célula de efeito Peltier resulta um ganho que é aproximadamente a metade do ganho da planta quando opera com duas células de efeito Peltier. Além disto, verifica-se um tempo de estabelecimento de cerca de 45 minutos, para ambos os ensaios. O tempo de subida para o sistema com uma célula de efeito Peltier foi 112 segundos, e o tempo de subida para o sistema com duas células de efeito Peltier foi 148 segundos. O controlador DMC foi sintonizado utilizando as regras de sintonia propostas por [13], sendo o horizonte de predição calculado pela expressão: sendo t60 60% do tempo de subida do processo em estado estacionário, t95 95% do tempo de subida do processo em estado estacionário e T o período de amostragem utilizado. O horizonte de controle é calculado utilizando-se a seguinte expressão: O período de amostragem utilizado é T = 2 s. Portanto, utilizando as Equações (16) e (17) os horizontes de predição e controle são calculados como sendo: N = 113 e M = 43. O peso de controle foi escolhido como ρ = 10. III. RESULTADOS E DISCUSSÃO É apresentado na Figura 8 o resultado de um ensaio de operação em malha fechada realizado com o controlador DMC implementado com a sintonia proposta. A temperatura de referência foi fixada em 23 oC. Neste caso, verificou-se que o tempo de estabelecimento foi de 50 s (utilizando o critério de estabelecimento de 1%), com sobressinal desprezível em face do ruído de medida. Também realizou-se um ensaio do sistema operando com apenas uma célula de efeito Peltier, desde o início da execução do processo. A título de comparação, os ensaios com o sistema nominal e o sistema com falha foram colocados em um mesmo gráfico, como mostrado na Figura 9. Verifica-se um aumento do amortecimento, diminuindo a variação da temperatura e um aumento do tempo de estabelecimento, que aumentou para 100 s (utilizando o critério de 1%). Para compensar a perda de uma das células Peltier, o controlador automaticamente aumentou a corrente (em módulo) aplicada à célula restante. Para ilustrar que o controlador DMC é capaz de corrigir o efeito introduzido pela falha, foi realizado um último experimento no qual o controle é inicialmente realizado em condições nominais, com falha aplicada durante a operação. O resultado é apresentado na Figura 10. Verifica-se que, antes da ocorrência da falha em t = 200 s, o sinal de controle foi mantido em cerca de u = 0,4 A. Após a ocorrência da falha o controlador levou cerca de 60 s para corrigir o efeito introduzido pela falha. IV. CONCLUSÕES O controlador de temperatura desenvolvido neste trabalho mostrou-se capaz de regular a temperatura do resistor de potência utilizado como fonte de calor para este experimento. Dos resultados obtidos, verificou-se que o controlador DMC é capaz de corrigir o efeito introduzido pela falha considerada (a desabilitação de uma das duas células de efeito Peltier), desde que os limites físicos de operação do atuador sejam respeitados. Trabalhos futuros poderiam empregar leis de controle MPC que levassem em conta as restrições sobre o sinal de controle u na determinação do controle ótimo. Desse modo, as limitações físicas do atuador poderiam ser consideradas de modo a melhorar o desempenho durante o período transitório. Adicionalmente, poderiam ser estudados problemas de controle para o caso SIMO, explorando a medida de temperatura também no dissipador.   "
}