{
    "id": 121,
    "titulo": "propriedades de transmissão de linhas lc duplamente periódicas",
    "autor": "ana flávia g. greco, joaquim j. barroso e josé o. rossi",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2013/st/P_13.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Em uma formulação geral descrita por um sistema de equações diferenciais ordinárias no domínio do tempo, o presente trabalho investiga os processos de transmissão e filtragem em linhas de transmissão LC duplamente periódicas. A formulação desenvolvida permite incluir um número arbitrário de seções pares e ímpares que serão identificadas por dois conjuntos de elementos reativos {L2, C2} e {L1, C1}, respectivamente. As linhas assim sintetizadas com elementos concentrados exibem forte dispersão espacial em que cada nó da linha apresenta um espectro distinto de frequência. Resultados numéricos considerando elementos reativos com valores típicos de 1 mF e 1 mH em linhas de 200 seções e excitadas com pulsos retangulares de 5ms de largura são analisados e discutidos, destacando-se o caráter de filtragem espacial das linhas.",
    "texto": "I. INTRODUÇÃO Devido ao rápido avanço da tecnologia de circuitos eletrônicos demandando um contínuo aumento na velocidade de sinais, interconexões entre dispositivos eletrônicos podem se comportar como linhas de transmissão. Atrasos não intencionais de sinais, tensões de crosstalk, reflexões e sobretensões de sinais nas terminações dos componentes prejudicam a correta operação de circuitos eletrônicos. Para confrontar tais problemas em processamento digital de alta velocidade, há necessidade de reduzir o atraso de propagação de sinais entre os elementos do circuito [1]-[2]. Nesse sentido, para o projeto e testes de tais componentes, técnicas acuradas e eficientes de simulação são requeridas, e tais análises devem ser realizadas no domínio do tempo. Este requisito torna-se importante em linhas de transmissão de sistemas de potência para a avaliação de processos transitórios, excitados sejam por campos eletromagnéticos externos, por emissão de radares de alta potência ou por descargas de raios. Linhas de transmissão são amplamente usadas na conexão de rádio transmissores e receptores com antenas e também na distribuição de sinais entre sistemas de comunicação. Além disso, apresentando a habilidade de manipular e conformar sinas de alta potência com a finalidade de concentrar e liberar pulsos intensos de energia utilizando sistemas compactos e de dimensões reduzidas, linhas de transmissão de potência pulsada constituem uma tecnologia de interesse para o sistema de defesa. A diferença essencial entre linhas de transmissão e circuitos de elementos concentrados refere-se ao comprimento elétrico. Análise de circuitos considera que as dimensões físicas de uma rede de circuitos sejam muito menores que o comprimento de onda elétrico, enquanto linhas de transmissão podem ter uma extensão de muitos comprimentos de onda. Desta forma, uma linha de transmissão é uma rede de elementos distribuídos onde a tensão e a corrente variam em magnitude e fase em toda a sua extensão e, assim, conexões com fios devem ser tratadas como linhas de transmissão quando o seu comprimento elétrico torna-se comparável ao comprimento de onda. Por outro lado, numa rede periódica de elementos concentrados pode ser considerada uma linha de transmissão homogênea (ou contínua) quando o comprimento elétrico de cada célula unitária satisfaz βd < π/2, onde β é o número de onda gerado e d o comprimento físico de cada célula, ou equivalentemente d < λ/4. Esta condição também assegura a ausência de ressonâncias de Bragg ao longo das descontinuidades da linha [3]-[4], que se comporta como uma linha de transmissão contínua uma vez que o comprimento de onda, λ, é apreciavelmente maior que a escala discreta dos elementos do circuito elétrico. No outro limite, em que as frequências são suficientemente altas tal que o comprimento de onda é comparável ao tamanho da seção unitária, o sinal propaga-se como uma onda ao longo da linha porque a tensão e corrente não podem variar instantaneamente em todos os nós da rede discreta e, portanto, não se podem desprezar as propriedades capacitivas e indutivas dos fios. Deve-se destacar que o comportamento de uma linha de transmissão é descrito por equações diferenciais parciais da classe hiperbólica, enquanto as equações de circuitos de elementos concentrados, com tensões em cada nó e correntes fluindo nos ramos, são equações diferenciais ordinárias sistematizadas pelas leis de Kirchhoff [5]. Do exposto, o presente trabalho trata da análise no domínio do tempo de linhas de transmissão com elementos concentrados. A topologia da linha considerada é estruturada por células LC formando uma rede com um número qualquer de seções N, seja N = 10 ou N = 400. O sistema de equações diferenciais ordinárias para a análise no domínio do tempo é escrito em uma formulação geral para que a cada elemento discreto em uma seção particular i, possam ser atribuídos valores arbitrários Li e Ci. O estudo aqui desenvolvido concentra-se na investigação das características de propagação de linhas duplamente periódicas onde cada seção ímpar compõe-se de um par de elementos L1 e C1, enquanto as seções pares incluem um indutor L2 e um capacitor C2. Na atribuição dos valores dos elementos do circuito dois casos são considerados. No primeiro, a linha de transmissão discreta é constituída com L1C1 = L2C2, tal que o tempo de trânsito d = LC é o mesmo em cada seção da linha duplamente periódica. No segundo caso, faz-se L1/C1 = L2/C2 e com isso cada seção apresenta a mesma impedância característica L / C . Várias situações são examinadas, variando-se o número de seções e a largura do pulso retangular que excita a linha. Verifica-se que a linha de transmissão duplamente periódica apresenta importantes características, sobretudo em relação aos aspectos de filtragem de frequência em que se manifesta uma propriedade de filtragem espacial, a ser discutida nas seções seguintes e que constitui a principal contribuição deste trabalho. II. EQUAÇÕES DE CIRCUITO a) Linha LC Periódica e Duplamente Periódica sem Carga A Fig. 1 mostra uma linha LC generalizada sem carga, onde as variáveis de estado consideradas são a corrente Ik no indutor da seção k e a correspondente carga Qk armazenada no capacitor da seção k. De importância do ponto de vista numérico, foram adotadas estas variáveis de maneira que as equações diferenciais para esta linha sejam todas de primeira ordem. Considera-se ainda uma linha com perdas, onde cada indutor tem uma resistência associada rL,k , cada capacitor tem uma resistência rC,k e o gerador tem uma resistência rs. Vamos nos referir inicialmente a uma linha com apenas três seções, conforme ilustrada na Fig. 2. Considerando cada uma das unidades de seção LC (Fig. 2), a partir das leis de Kirchhoff para tensão e corrente, obtemos as seguintes equações para esta linha. onde V1 (t), V2 (t) e V3 (t) representam as tensões em cada nó e I1 (t), I2 (t) e I3 (t) representam as correntes que circulam nas malhas. Sendo que E combinando (1) e (2) é possível escrever o seguinte sistema de equações diferenciais ordinárias de primeira ordem, para a corrente Ik e para a carga Qk.  Ao generalizar as equações para um número qualquer de seções optou-se por escrever as equações para três categorias de seções: inicial, intermediárias e final. Cada uma destas seções corresponde a duas equações, conforme apresentado a seguir:  Seção Inicial: onde k = 1 e Vs representa a tensão de entrada, podendo ser um sinal senoidal, ou uma forma arbitrária de pulso (trapezoidal, triangular, etc.)  Seção Intermediária: Seção Final:  b) Linha LC Periódica e Duplamente Periódica com Carga A Fig. 3 mostra uma linha LC generalizada com carga, onde são consideradas as mesmas variáveis de estado adotadas para LC sem carga. Considerando inicialmente uma linha LC com quatro seções, conforme ilustrada na Fig.4. Considerando ainda cada uma das células LC (Fig. 4), a partir das leis de Kirchhoff para tensão e corrente chega-se às seguintes equações: onde V1 (t), V2 (t), V3 (t) e V4 (t) representam as tensões em cada nó e I1 (t), I2 (t), I3 (t) e I4 (t) representam as correntes que percorrem os indutores. Sendo que, e combinando (7) e (8) escreve-se o seguinte sistema de equações diferenciais ordinárias de primeira ordem, para a corrente Ik e para a carga Qk. Ao generalizar as equações para um número qualquer de seções as equações são especificadas para quatro categorias de seções: inicial, intermediária, semi-final e final (carga), conforme apresentado a seguir: Seção Inicial:  onde k = 1 e Vs representa a tensão de entrada, podendo ser um sinal senoidal, ou uma forma arbitrária de pulso (trapezoidal, triangular, etc.) Seção Intermediária: Seção Semi-Final: Seção Final (Carga): III. RESULTADOS Para examinar a resposta em frequência e as características de filtragem, consideram-se inicialmente linhas LC de baixas perdas (rL = rC = 0,001 Ω, rs = 0,1 Ω) com 10 seções sendo excitadas por sinais puramente senoidais com 1V de amplitude. A linha periódica simples (convencional) possui L1 = 1 µH e C1 = 1 µF e as duplamente periódicas são especificadas em dois casos: {L2 = 2 µH; C2 = 0,5 µF} e {L2 = 2 µH; C2 = 2 µF} nas seções pares e {L1 = 1 µH; C1 = 1 µF} nas seções ímpares. A resposta em frequência da linha LC simples é ilustrada na Fig. 5(a), onde se nota claramente que a linha, como esperado, comporta-se como um filtro passa baixa, em que a frequência de corte ~320 kHz é determinada por 1 1 1 L C fc p = (= 318,3 kHz). A curva de resposta evidencia claramente o caráter discreto (ou descontínuo) da linha de 10 seções, destacando-se os dez picos ressonantes, sendo que os picos se comprimem e se estreitam à medida que a frequência tende a fc. No extremo à esquerda da faixa de frequência (f < 50,0 kHz), as ondulações tornam-se suaves indicando que a rede periódica comporta-se como uma linha homogênea. Analisando as Figs. 5(b)-5(e), constata-se que a resposta das linhas duplamente periódicas difere da resposta encontrada para a linha simples. Verifica-se uma faixa proibida, separando cinco picos à direita e cinco à esquerda. No caso em que L1C1 = L2C2 [Figs. 5(b) e 5(d)], surge uma nova frequência crítica em (~225,0 kHz) no final da primeira banda de passagem, com a segunda faixa estendendo-se até ~340,0 kHz. No segundo caso [Figs. 5(c) e 5(e)], em que L1/C1 = L2/C2, a frequência central na banda proibida é identificada por (~160,0 kHz). Foram examinadas também as características de propagação e de reflexão de um pulso retangular de 40µs de largura que se propaga em linhas com 200 seções de baixas perdas (rL = rC = 0,001 Ω, rs = 0,1 Ω) . Inicialmente, para a linha simples e sem carga na terminação final, o tempo de trânsito em cada seção é L1C 1 =1,0ms . Observa-se na Fig. 6(a) que o pulso refletido retorna ao nó #2 decorridos 400µs, correspondendo a um percurso de ida e volta (200 seções x 2 x 1,0µs). O pulso distorcido deve-se ao fato da linha não estar casada, o que ocasiona certo grau de ruído no espectro correspondente mostrado na Fig. 6(b). As Figs. 7-8 mostram pulsos progressivos e regressivos nos nós #100 e #200, onde os pulsos refletidos na terminação da linha preservam a forma do pulso incidente, enquanto na entrada da linha os pulsos sofreram reflexão negativa (terceiro pulso na Fig. 7 e segundo pulso na Fig. 8). Neste exemplo sem carga resistiva, a terminação da linha sendo puramente reativa o coeficiente de reflexão é de módulo unitário. Assim, com a energia não dissipada, o pulso é completamente refletido com a mesma magnitude inicial, havendo, contudo uma reflexão de fase invertida associado à terminação reativa, pois o coeficiente de reflexão é -1. Introduzindo-se uma carga 1 Ω, cujo valor é próximo ao da impedância da linha, nota-se nas Figs. 9-10 que as reflexões são essencialmente eliminadas na linha periódica simples. As Figs. 11-12 ilustram que a presença de uma carga de 2Ω produz um certo grau de reflexão nos pulsos. Investigando-se no que segue a propagação do pulso retangular de 40 µs de largura em linhas duplamente periódicas em que L1C1 = L2C2 = 1, verifica-se na Fig. 13(a) que para uma carga resistiva de 1Ω, cujo valor é muito próximo da impedância característica da linha simples, acarreta a reflexão de pulsos. Na Fig. 14(a), em que a carga é de 2Ω, nota-se que os pulsos refletidos têm polaridade inversa aos pulsos da Fig. 13(a). Mas ambos os casos, uma vez que L1C1 = L2C2, o tempo de trânsito até o nó #200 [Figs. 13(b) e 14(b)] é ~200,0µs. Na condição em que L1/C1 = L2/C2 = 1[Fig. 15(a)] a presença de uma carga de 1Ω elimina essencialmente os efeitos de reflexão, mas neste exemplo o tempo de trânsito torna-se mais longo, sendo da ordem de 282µs para o nó #200, por exemplo [Fig. 15(b)]. Para investigar as propriedades de filtragem da linha duplamente periódica considera-se agora na entrada da linha um pulso retangular estreito, de 5µs de largura o que corresponde a um lóbulo central de 200 kHz de largura em seu espectro de frequência como ilustrado na Fig. 16(a). Nota-se então na sequência de espectros que o sinal em cada nó da linha (L1C1 = L2C2) apresenta uma determinada característica. Vê-se, por exemplo, nas Figs. 16(b) e 16(c), correspondente aos nós #10 e #100, uma faixa isolada de frequência compreendida entre 280 e 350 kHz comprimida no segundo lóbulo. A amplitude do sinal associada à faixa de frequência decresce progressivamente com a ordem do nó, sendo extinta na posição #200 [Fig. 16(d)]. Pode-se interpretar tal fenômeno como um efeito local em cada nó, podendo ser caracterizado como um processo espacial de controle e filtragem de frequência. Tal mecanismo também se manifesta na linha com L1/C1 = L2/C2 (Fig. 17), mas neste caso o lóbulo principal referente ao intervalo 0 – 200 kHz [Figs. 17(b)-(d)] fica bruscamente interrompido em 160 kHz, o que corresponde à frequência de  IV. CONCLUSÃO Foram investigados fenômenos de propagação em linhas de transmissão constituídas de células LC periódicas e LC duplamente periódicas. Usando a corrente no indutor e a carga armazenada no capacitor como variáveis de estado, um sistema de equações de primeira ordem no domínio do tempo foi deduzido para estas duas topologias. A formulação das equações diferenciais permitiu que a cada elemento discreto em uma seção particular i, pudessem ser atribuídos valores arbitrários Li e Ci. Para examinar a resposta em frequência e as características de filtragem, foram consideradas inicialmente linhas LC de baixas perdas e com 10 seções sendo excitadas por sinais puramente senoidais com 1V de amplitude. A resposta em frequência da linha LC simples mostrou que a linha comporta-se como um filtro passa baixa. Em contrapartida, na linha duplamente periódica, verificou-se uma faixa proibida, separando cinco picos à direita e cinco à esquerda. Ao examinar as características de propagação e de reflexão de um pulso retangular de 40µs de largura que se propaga em linhas periódicas com 200 seções de baixas perdas, verificou-se que sem carga resistiva, o pulso é completamente refletido com a mesma magnitude inicial, havendo, contudo um desvio de fase de 180° associado à seção final com carga reativa. Em seguida, introduzindo uma carga resistiva de 1Ω, cujo valor é próximo da impedância da linha, notou-se que as reflexões são essencialmente eliminadas na linha periódica simples. Em linhas duplamente periódicas em que L1/C1 = L2/C2, verificou-se reflexão de pulsos, para uma carga resistiva de 1Ω, e para uma carga de 2Ω notou-se que os pulsos refletidos têm polaridade inversa aos pulsos encontrados para a carga de 1Ω. Ao investigar as propriedades de filtragem da linha duplamente periódica, constatou-se que a amplitude do sinal associada à faixa de frequência decresce progressivamente com a ordem do nó, sendo extinta na posição #200 (último nó). Tal fenômeno pode ser caracterizado como um processo espacial de controle e filtragem de frequência. Contudo, verificou-se que a linha de transmissão duplamente periódica apresenta importantes características, sobretudo em relação aos aspectos de filtragem de frequência em que se manifesta uma propriedade de filtragem espacial. "
}