{
    "id": 123,
    "titulo": "uso do fluxo óptico para detecção de objetos móveis em imagens aéreas",
    "autor": "rodrigo augusto rebouças, mateus habermann e elcio hideiti shiguemori",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2013/st/P_16.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "O presente artigo aborda a comparação entre duas técnicas de processamento de imagens que buscam localizar objetos móveis em uma sequência de imagens aéreas para aplicação de veículos aéreos não tripulados. Uma das técnicas empregada faz uso do Speeded Up Robust Features (SURF) e a outra faz uso da análise do Fluxo Óptico, ambas visam a compensar o deslocamento da câmera. Para detecção de objetos em movimento calcula-se o Fluxo Óptico. Esta análise visa a técnica menos custosa computacionalmente para aplicações que requerem processamento em tempo-real e embarcado.",
    "texto": "I. INTRODUÇÃO O uso de imagens digitais tem crescido nos últimos anos devido, principalmente, ao avanço tecnológico e computacional, como o aumento da capacidade de armazenamento, processamento de dados e o crescente número de pesquisas nas áreas de Visão Computacional e Processamento de Imagens [1] [2]. Seu emprego possui aplicações em diferentes áreas como: sensoriamento remoto [3], segurança [4], navegação autônoma aérea [5], medicina [6] e esportes [7]. Dentre as aplicações do uso de imagens digitais destacam-se as que utilizam imagens aéreas por possibilitarem o monitoramento de uma grande área geográfica. Neste estudo aborda-se o problema de reconhecimento de objetos móveis [8]-[13], onde diferentes trabalhos tratam esse problema, como a que faz uso do algoritmo SIFT [9] [14] para compensar o deslocamento da câmera e operações morfológicas para identificação de veículos em movimento, em outra abordagem calcula-se o fluxo óptico com uso de Unidade de Processamento Gráfico (GPU) [10], em [11] faz-se uso do fluxo óptico, onde são segmentados diversos objetos móveis ao mesmo tempo e é construído o mapa do ambiente, em [12] faz-se uso do fluxo óptico adaptado para objetos semitransparentes, neste caso, a suposição de intensidade constante não é mais válida e em [13] faz-se uso do fluxo óptico para detecção de objetos móveis considerados rápidos. Especificamente, neste trabalho aborda-se o problema de identificação de objetos móveis em imagens aéreas, tendo como objetivo o desenvolvimento de um método que possibilite a identificação de veículos em movimento com uso de técnicas de reconhecimento de padrões [15], que pode ser empregado como base para a implementação de ferramentas de extração de informação e monitoramento de grandes áreas. São consideradas imagens de uma videografia realizada em uma área contendo veículos em movimento, na cidade de São José dos Campos - SP. Duas técnicas de processamento de imagens são empregadas e comparadas: o Speed Up Robust Features (SURF) [16] para detecção de pontos característicos e o Fluxo Óptico com o método de Lucas-Kanade [17] para formação de vetores de deslocamento. Em ambas as técnicas visa-se compensar a diferença das posições de captura do primeiro e segundo frame. Em seguida, calcula-se o fluxo óptico para a detecção dos veículos. Este projeto é desenvolvido para aplicação no projeto PITER (Processamento de Imagens em Tempo-Real), que tem como objetivo realizar pesquisas que envolvam o processamento de imagens em tempo real obtidas por um VANT (Veículo Aéreo Não Tripulado) para aplicação na navegação aérea autônoma. II. METODOLOGIA O objetivo do estudo é a identificação de objetos móveis em imagens aéreas. São utilizadas imagens de uma videografia realizada em São José dos Campos - SP. As principais técnicas empregadas neste estudo fazem uso do SURF [16] e do Fluxo Óptico para compensar a movimentação da câmera. Em seguida, para analise do deslocamento dos veículos, são usadas técnicas baseadas no Fluxo Óptico. Estas duas abordagens são ilustradas na Fig. 1. Na Fig. 1 (a), é feita a captura entre dois frames consecutivos nos tempos e . Em seguida é aplicada a técnica SURF [16] para detecção de pontos característicos. Com esta informação é feito o corte em ambas as imagens para se compensar o deslocamento da câmera do VANT. Em seguida, são estimados vetores do Fluxo Óptico com o método de Lucas-Kanade [17] para identificação dos objetos móveis entre os tempos e . Na Fig. 1 (b) substitui-se o SURF e faz-se uso do Fluxo Óptico. III. SURF Por serem utilizadas imagens aéreas obtidas em diferentes instantes de tempo, faz-se necessário compensar o movimento da câmera. São utilizadas diferentes técnicas para o registro de imagens [18], uma delas com uso do descritor SURF [16] bastante utilizada na literatura por apresentar desempenho computacionalmente superior, quando comparada com outros descritores [19]. O SURF [16] é uma técnica para extrair, descrever e casar pontos-chaves ou pontos de interesse de imagens invariantes a sua iluminação, rotação e escala. Basicamente, ele é dividido em 4 partes: criação da imagem integral, extração dos pontos de interesse, descrição dos pontos de interesse e casamento de padrões (Template Matching) desses pontos [20]. A extração dos pontos de interesse é feita com uso do determinante da matriz Hessiana , Fast-Hessian, como é mostrado em (1). onde é a convolução da derivada da Gaussiana de segunda ordem com a imagem no ponto , com as coordenadas e é a escala da imagem. E o determinante , por custo computacional, é descrito em (2) [16]. onde é a segunda derivada em relação à . Para se reduzir o custo computacional, o processo é calculado em imagens integrais da própria imagem. Em cada um desses pontos é construído um vetor de características com uso de sua vizinhança, formando os descritores. Na Fig. 2 são apresentados os pontos de interesse com o raio de acordo com a sua vizinhança [16]. Em seguida, é feita a correspondência dos descritores dos pontos de interesse e com as coordenadas e . Um ponto de interesse no tempo é comparado com cada ponto de interesse no tempo por meio da distância euclidiana entre os seus vetores de descrição, como é apresentado em (3) [16]. Se a distância for menor que a distância do vizinho mais próximo, então atribui-se como casamento, senão segue para o ponto seguinte. Isso é feito com todos os pontos no tempo para o tempo [16]. Na Fig. 3 é apresentado um resultado do casamento, porém, para melhor visualização, é apresentado apenas 11% desses casamentos. As linhas que conectam as duas imagens indicam os pontos correspondentes. III. FLUXO ÓPTICO A segunda técnica utilizada neste trabalho para compensar o movimento da câmera faz uso do Fluxo Óptico com o método de Lucas-Kanade [17], que tem sido utilizada para detecção de movimento [10]-[13]. O Fluxo Óptico é obtido pelo movimento aparente do padrão de brilho na imagem quando a informação varia de acordo com seus pontos de contraste [21], onde calcula-se o deslocamento de objetos de acordo com o movimento relativo entre a câmera e a cena. Tal cálculo é realizado em sequências de imagens, no sentido de que a velocidade instantânea pode ser calculada entre dois frames consecutivos. Assim, esses dois frames são analisados nos tempos e . Como a luminosidade na cena se mantém constante no decorrer do tempo, tem-se para um objeto em movimento [21]: Onde é a intensidade da imagem no píxel na posição e no tempo , podendo ser expandida a (4) pela série de Taylor, como apresentada em (5) [21]. Em que representa os termos de ordem superior. Então resulta que [21]: Ou Em que e são as componentes de velocidade nos eixos e , respectivamente [21]. Assim, tem-se que: Ou ainda: Então é empregado o método de Lucas-Kanade [17], no qual píxeis da vizinhança , ,..., são considerados, como foi mostrado em [13]. Dessa forma, tem-se: E pode-se resolver assim: Em que , e E a solução, então, fica: O vetor do fluxo óptico é calculado em cada ponto com uso da diferença entre suas coordenadas nas imagens nos tempos e e dividido pelo tempo de captura entre elas. Como a imagem inteira se movimenta, então são construídos vetores de deslocamento na cena inteira, como é apresentada na Fig. 4. IV. IDENTIFICAÇÃO DE DESLOCAMENTO Ambas as técnicas podem ser usadas para estimar o deslocamento da câmera, como foi apresentado em [8]-[9]. Ou com o SURF [16], onde é feita a diferença das posições de todos os pontos de interesses, ou com uso do Fluxo Óptico com o método de Lucas-Kanade [17], com o cálculo da mediana também para obter a informação de deslocamento no tempo , para o tempo . Em seguida é feito o corte em ambas as imagens, como é apresentada na Fig. 5, a fim de identificar apenas os objetos móveis desejados, neste caso, os veículos. Para extração de informações desses veículos é calculado outro Fluxo Óptico com o método de Lucas-Kanade [17], como é apresentada na Fig. 6, para extração dos vetores de deslocamento dos veículos Fig. 6 (c) no tempo Fig. 6 (a), para o tempo Fig. 6 (b). V. RESULTADOS As imagens obtidas dos vídeos podem sofrer degradações, devido à movimentação da câmera, pois são detectados borrões e distorções. Esses ruídos podem ser, erroneamente, considerados em movimento juntamente com os veículos. Na Fig. 7 (a) é apresentada uma imagem capturada do vídeo com os vetores de deslocamento já extraídos, porém como é mostrada na Fig. 7 (b) o recorte da Fig. 7 (a), podem ser visualizados vários vetores de deslocamento que não são veículos. Para compensar a movimentação da câmera, apenas foi considerada como deslocamento a diferença dos vetores de fluxo óptico com pontos com maior deslocamento, como é apresentada na Fig. 7 (c), com o objetivo de identificar apenas os objetos móveis. O quadrado apresentado na Fig 7 (b) e (c) destaca o veículo em movimento. Com os resultados obtidos no estudo, avaliou-se o desempenho das técnicas em relação à Precisão (P) e Sensibilidade (S) [22], como é mostrada em (13) e (14).São considerados os Veículos em Movimento (VM), os Verdadeiros Positivos (VP), os veículos identificados corretamente, Falsos Positivos (FP), objetos identificados que não são veículos e Falsos Negativos (FN), os veículos que não são identificados. Os frames foram extraídos da videografia realizada em São José dos Campos - SP em intervalos de 0,066 segundos. Ambas as técnicas apresentam os mesmos resultados, ou seja, obtiveram-se as mesmas coordenadas para o corte dos frames, então sua sensibilidade e precisão são uma só, como mostrado na Tabela I, considerando os 10 primeiros frames. Para uma melhor análise dos resultados, na Tabela II são apresentados os melhores e piores casos da aplicação em relação à Sensibilidade e Precisão [22], considerando as mesmas variáveis e intervalos da Tabela I. Os resultados são ilustrados nas Fig. 9 à Fig. 14 da seguinte maneira: Os círculos e elipses representam os VP; os triângulos representam os FP; e os quadrados e retângulos representam os FN. Na Fig. 9, 10 e 11 são mostrados os melhores casos em relação à taxa de sensibilidade e precisão mostrada na Tabela II. Na Fig. 12, 13 e 14 são apresentados os piores casos em relação à taxa de sensibilidade e precisão mostrada na Tabela II. Para comparação das duas abordagens os métodos foram implementados em um computador com o processador Pentium Dual E2180 2GHz, 2GB de memória RAM no Windows XP SP3. Com os resultados apresentados nas Tabelas I e II, as técnicas apresentam os mesmos resultados, porém os tempos de processamento são diferentes. Na Tabela III são apresentados os tempos de processamento das técnicas SURF e do Fluxo Óptico nos 10 primeiros frames em intervalos de 0,066 segundos. Com a análise dos resultados, pode-se observar que alguns veículos não foram localizados. Suspeita-se que essas falhas se devem às influências das variações na velocidade, na cor ou tamanho dos veículos. Um outro problema encontrado foi que alguns veículos são detectados por mais de um vetor de deslocamento, principalmente, veículos de grande porte ou que se movimentam em alta velocidade. VI. CONCLUSÃO Os resultados obtidos até o momento mostram que as abordagens com uso da técnica SURF [16] para casar pontos característicos e do Fluxo Óptico com o método de LucasKanade [17] para construção dos vetores de movimento são adequadas para compensar o deslocamento da câmera. Os tempos de processamento para obtenção dos resultados com uso do Fluxo Óptico mostraram-se aproximadamente 20 vezes mais rápidos do que com uso do SURF [16]. Assim recomenda-se o método de Lucas-Kanade [17] é mais indicado que com o uso do SURF para aplicações em que se requerem o processamento em tempo-real. Em seguida é feito outro cálculo do Fluxo Óptico para identificação de movimentos dos objetos móveis utilizados neste estudo mostram-se promissoras. As técnicas e métodos utilizados para o processamento de imagens digitais apresentam resultados que indicam que estas abordagens podem ser empregadas, porém ressalta-se que este estudo ainda está em desenvolvimento e outras abordagens devem ser estudadas a fim de melhorar a sensibilidade, precisão e velocidade do sistema e obter mais informações sobre os objetos móveis.    "
}