{
    "id": 124,
    "titulo": "transmissão de sinais radar com modulação intrapulso em enlaces ópticos analógicos",
    "autor": "romildo henrique de souza, josé edimar barbosa oliveira, olympio lucchini coutinho",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2013/st/P_7.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Atualmente, a utilização de micro-ondas para controlar as características de sinais na faixa óptica do espectro eletromagnético constitui a fundamentação de uma nova e ampla área científica e tecnológica, a qual tem sido referenciada como microwave photonics ou RF photonics. Nesta publicação, adota-se a denominação RF em fotônica. Nesta área, os enlaces analógicos que utilizam fibra óptica para transmissão de sinais de micro-ondas possibilitam a implementação de funcionalidades, tais como geração e processamento de sinais de micro-ondas. Por exemplo, no âmbito de aplicações operacionais de interesse da Defesa nacional, o emprego de enlace a fibra óptica possibilita a utilização de modulação intrapulso em radares com redes de antenas remotas, e, desta forma, enseja a definição da codificação do sinal radar visando obter-se elevado desempenho em alcance e resolução. Este trabalho insere-se no esforço desenvolvido pelo ITA, com o objetivo de desenvolver modelos e técnicas de caracterização para enlaces a fibra óptica, levando em consideração as não-linearidades do modulador eletro-óptico Mach-Zehnder, e, assim, possibilitar a análise de modulações intrapulso de tipo LFM e NLFM em enlace óptico analógico, em desenvolvimento no LAB-GE do ITA.",
    "texto": "I. INTRODUÇÃO Necessidades militares contribuem para a aceleração do desenvolvimento tecnológico em diversas áreas, como historicamente tem sido observado. A transição destas aplicações inicialmente militares para os meios civis é inerente, uma vez que tal conhecimento proporciona facilidades cada vez mais requeridas pelos setores público e privado da sociedade. Neste sentido, uma área de estudo com implicações promissoras é a aplicação de técnicas de Rádio Frequência (RF) em fotônica, ao unir conceitos de enlaces ópticos com engenharia de micro-ondas. Dentre as aplicações para a área civil está a utilização em redes de dados de alta velocidade e redes de telecomunicações para telefonia celular e TV a cabo, cuja demanda de largura de banda cresce vertiginosamente. Como exemplo, redes híbridas fibra-rádio foram utilizadas nos Jogos Olímpicos de Sidney, em 2000, e na Copa do Mundo da Alemanha, em 2006 [1]. Para o caso militar, a principal aplicação desta tecnologia está na possibilidade de distribuição remota de antenas de radar, distantes dos centros de controle, o que resulta em uma estratégia de defesa imprescindível para as Forças Armadas [2]. Observa-se que a integração de duas áreas da engenharia permite utilizar os conceitos bem estabelecidos para ambas e conhecer as limitações impostas em cada uma delas. Com isso, toda a experiência de transmissão de dados digitais por enlaces de fibra óptica e as técnicas de modulação de sinais analógicos de rádio podem ser combinadas para entender a propagação de sinais analógicos de micro-ondas em enlaces de fibra óptica, determinando assim as penalidades envolvidas para obtenção de um alto desempenho do sistema [3]. Este artigo propõe uma contextualização de RF em fotônica, visando aplicações militares, por meio de um estudo preliminar da propagação de sinais analógicos caracterizados por diferentes formas de onda, enfatizando o embasamento inicial para experiências a serem desenvolvidas no Laboratório de Guerra Eletrônica (LAB-GE) do Instituto Tecnológico de Aeronáutica (ITA). À luz do objetivo acima delineado, inicialmente, caracteriza-se o cenário operacional para o emprego de tal tecnologia no âmbito das Forças Armadas, bem como o modelo esquemático do enlace óptico e seus principais componentes. É dada ênfase para o modulador eletro-óptico do tipo Mach-Zehnder e as não-linearidades introduzidas por ele no enlace óptico. A seguir, são descritos dois tipos de formatos de modulação linear – Linear Frequency Modulation (LFM) – e não-linear – Nonlinear Frequency Modulation (NLFM), os quais são utilizados na compressão de pulsos de sinal radar, amplamente empregados nos equipamentos radar comerciais, e as penalizações advindas de cada um deles. Por fim, apresentam-se as figuras de mérito empregadas para análise do sistema e discute-se a proposta de projeto a ser conduzido. II. CENÁRIO OPERACIONAL Em termos gerais, um radar é constituído por um conjunto de subsistemas cuja finalidade é a localização de alvos, por meio da emissão de sinais e da detecção de suas reflexões nestes alvos. Por exemplo, o controle de tráfego aéreo e a defesa aeronáutica e marítima utilizam os dados gerados por radares para identificação e localização de aeronaves, embarcações e mísseis, sendo, portanto, um elemento essencial para a soberania brasileira. Uma forma de garantir a integridade do sistema radar é posicionar as várias antenas do conjunto em locais diferentes e enviar estes sinais para uma central, responsável pelo processamento dos dados, como pode ser observado na Fig. 1. Dessa forma, caso alguma antena seja avariada por uma força de ataque, sua perda não compromete a operação de todo o sistema. Os enlaces a fibra óptica surgem como a solução adequada para interligar antenas e central, por vários motivos: grandes distâncias, baixo custo, baixa atenuação, imunidade a interferências eletromagnéticas externas, robustez, entre outros. Enlaces digitais em fibra são uma realidade bastante consolidada em muitos setores, principalmente nas redes de telecomunicações usuais. Porém, é necessário realizar uma conversão analógica-digital do sinal antes da transmissão e a conversão inversa na recepção, o que onera os custos e introduz perdas e ruídos ao enlace. Quando as frequências de trabalho são altas, como no caso de sinais micro-ondas de radar, exigem-se ainda conversores de frequência de descida e subida, além de equipamentos mais sensíveis às variações do sinal, com consequente aumento de espaço físico e custo. Referência [4] apresenta um protótipo de um sistema de RF em fotônica desenvolvido para as forças armadas americanas, com capacidade para 23 antenas a até 7 km de distância da central, em que foram medidos ganhos acima de 40 dB e figura de ruído abaixo de 10 dB, na faixa de 1 a 10 GHz. O processamento e a transmissão de sinais RF em sistemas fotônicos oferecem vantagens para as aplicações militares, tais como: menor tamanho, maior largura de banda e menor dissipação de potência dos sistemas RF. Há o aproveitamento de diversos dispositivos já desenvolvidos para transmissões digitais de sinais em fibra óptica e a incorporação de técnicas de engenharia de micro-ondas para melhorar o desempenho do enlace óptico analógico. Por exemplo, um enlace fotônico funcional está representado na Fig. 2(a), composto por: modulador, que realiza a conversão eletro-óptica do sinal RF; fibra óptica, como meio de transmissão; e receptor, para transformar o sinal óptico novamente em elétrico, de modo a ser processado ou visualizado em um display. Cada um destes blocos básicos pode ser constituído por diferentes tipos de dispositivos. A Fig. 2(b) apresenta uma implementação com modulação externa do tipo Mach-Zehnder e com detecção direta por fotodiodo, como ilustração. Apesar deste esquema conter modulação externa, caracterizado pelo uso do modulador eletro-óptico, existem diferentes configurações de modulação direta que poderiam ser empregadas, reduzindo o custo, mas ainda mantendo uma boa faixa dinâmica [5]. III. MODULADORES ELETRO-ÓPTICOS E NÃO-LINEARIDADES Particularmente, a elevada largura de banda do modulador externo, em comparação à modulação direta, torna os moduladores externos preferíveis em enlaces ópticos, apesar do custo relativamente mais alto. Dentre estes, o mais comum é o modulador Mach-Zehnder (MZM), com substrato de niobato de lítio, o qual é baseado no efeito eletro-óptico para controle dinâmico da fase do feixe óptico que se propaga em pelo menos um dos braços do interferômetro. Outra técnica de modulação que pode ser empregada é a que recorre ao modulador por eletroabsorção (EAM), que funciona devido ao confinamento quântico por efeito Stark (QCSE). Com o objetivo de modelar adequadamente o enlace quanto à distorção do sinal de RF, deve-se considerar os efeitos não-lineares inseridos por alguns dispositivos que constituem o enlace. Para minimizar os efeitos provenientes da fibra óptica, pode-se operar em comprimentos de onda que resultem em dispersão nula da fibra, além de reduzir a potência óptica [6]. Fotodetectores e amplificadores também possuem função de transferência não-linear. Contudo, a limitação de potência do laser garante trabalho na região requerida para não sofrer influência considerável desta característica. O modulador MZM passa a ser, então, o maior responsável pelas não-linearidades do enlace, o que limita a faixa dinâmica possível, mas permite outro tipo de aplicação para o MZM, como misturador ou multiplicador de sinais eletrônicos [7]. A função de transferência para um enlace com MZM pode ser descrita pela corrente na saída do fotodetector i(t): onde I(t) é a corrente de entrada do modulador, R é a responsividade do fotodetector, Γo é a fase estática para o ponto de polarização (bias), Vπ é a tensão de meia-onda, e v(t) é a tensão do sinal RF de modulação. Nota-se claramente que a função de transferência é não-linear, o que acarreta a criação de sinais espúrios em frequências diferentes do sinal aplicado e o consequente espalhamento da energia pelo espectro. Por exemplo, a fim de evitar termos de segunda ordem, utiliza-se polarização (bias) de quarto de onda para o modulador, ou seja, escolhem-se os seus parâmetros de modo que Γo=π/2. Nesse caso, os produtos de terceira ordem serão os espúrios dominantes. IV. MODULAÇÃO INTRAPULSO DE SINAIS RADAR Neste trabalho, consideram-se sinais de radar codificados em forma de pulsos de largura T e potência P, modulados em frequência ou fase, de maneira a se obter uma largura de banda B. A frequência modulada pode estar numa ampla faixa, desde HF até ondas milimétricas. Por sua vez, as técnicas de modulação também são bem diversificadas. No que concerne às operações militares, há interesse em estudar sinais analógicos em micro-ondas com modulação em frequência, particularmente para os casos de frequência linear (LFM) e não-linear (NLFM), apesar da possibilidade de outros códigos serem utilizados, como pulsos codificados em fase e pulsos codificados simultaneamente na frequência e no tempo [8]. O esquema básico de um radar é apresentado na Fig. 3. Após a amplificação dos pulsos modulados, a antena transmite e recebe o sinal refletido nos alvos a serem identificados. Como a antena de transmissão e recepção é a mesma estrutura física, deve haver um duplexer para direcionar os sinais transmitidos e recebidos. Este último, após ser amplificado pelo LNA (Low Noise Amplifier) e deslocado para a frequência FI, é então inserido no filtro de compressão de pulsos, composto por um filtro casado (matched filter), para obter máxima SNR, e por um filtro ponderador (weighting filter), para reduzir o nível dos lóbulos laterais. Contudo, tais filtros inserem perdas no sistema e provocam o alargamento do lóbulo principal. Por último, há um detector de envoltória e um amplificador para permitir a visualização do sinal na tela do operador. A escolha do tipo de pulso será balizada principalmente pelos requisitos do radar quanto à sensibilidade ao efeito Doppler, aos níveis dos lóbulos laterais, à velocidade do alvo e à capacidade de processamento de sinais. LFM – Linear Frequency Modulation O pulso LFM é definido como: sendo f0 a frequência da portadora, A a amplitude do pulso e α a inclinação LFM, dada pela razão ±B/T. A frequência instantânea varia linearmente com o tempo: Apesar de fornecer um lóbulo central com largura estreita, os lóbulos laterais resultantes geralmente apresentam um nível de apenas 13 dB abaixo do pico central. Por este motivo, utilizam-se filtros ponderadores, sendo o filtro de Taylor o mais comum, cuja resposta em frequência é dada em função dos coeficientes de Taylor Fm: Outras janelas usualmente empregadas são Hamming e cosine-squared-plus-pedestal. Cada técnica reduz o nível dos lóbulos laterais, mas, em contrapartida, alarga o lóbulo central e insere mais perdas ao sistema. NLFM – Nonlinear Frequency Modulation O pulso NLFM é definido como: Nesse caso, há vários métodos para formular a fase φ(t), que será uma função não-linear do tempo. Isto também resulta numa frequência instantânea com variação não linear, como um dos exemplos apresentados em [8]: onde β é definido como tan-1(α). A utilização de pulsos NLFM elimina a necessidade de filtro ponderador, uma vez que a escolha apropriada da função φ(t) consegue reduzir os níveis dos lóbulos laterais ao aumentar a taxa de variação da frequência nas extremidades do pulso e ao diminuí-la na região central. Esta característica pode ser observada pela Fig. 4, em comparação com os sinais LFM. O resultado é uma melhoria da relação sinal-ruído, em relação aos sinais LFM. Porém, os sinais NLFM são menos tolerantes ao efeito Doppler, que causa o aumento do nível dos lóbulos laterais. Isso pode ser evitado adicionando mais filtros casados. Devido a essa sensibilidade, os pulsos NLFM são utilizados em sistemas de rastreamento em que a frequência Doppler é estimada e o deslocamento Doppler pode ser compensado pelos filtros. IV. ANÁLISE E DISCUSSÃO Diante da diversidade de métodos para codificação de pulsos que podem ser empregados nos sistemas radar, tornase premente o estabelecimento de métricas que indiquem o desempenho do enlace óptico utilizado para interligação de seus equipamentos. A análise dos parâmetros dos sinais analógicos e dos filtros ponderadores adequados soma-se às diferentes configurações do enlace óptico com a definição do modulador óptico (direto ou indireto), amplificadores ópticos, tipo de fibra utilizada e fotodetector. Isto constitui diferentes escolhas para o projeto do sistema completo e para a definição dos requisitos necessários. O estudo do comportamento de sinais radar com esquemas modernos de modulação intrapulso, quando transmitidos ou processados com tecnologia de micro-ondas em fotônica, será desenvolvido por meio de experimentos realizados no Laboratório de Guerra Eletrônica (LAB-GE) do Instituto Tecnológico de Aeronáutica (ITA). Recentemente, foi adquirido pelo Comando da Aeronáutica um moderno gerador de sinais radar, instalado no LAB-GE, com objetivo de emprego em ensino e pesquisa na área de Guerra Eletrônica e na prestação de assessoria técnico-científica ao setor operacional da Força Aérea Brasileira. Portanto, o tema deste trabalho insere-se adequadamente no contexto para o desenvolvimento tecnológico militar. As figuras de mérito utilizadas são aquelas bem definidas para o enlace óptico, tais como: ganho do enlace, figura de ruído, faixa dinâmica, ponto de interseção de terceira ordem. Estudos conduzidos por [9]-[10] baseiam-se nestas métricas para analisar o efeito das não-linearidades introduzidas pelo modulador Mach-Zehnder (MZM) na propagação de pulsos LFM e NLFM de sinais radar num enlace óptico analógico, sob diferentes cenários. Neste sentido, a função de transferência do enlace óptico deve retratar os componentes do enlace até uma determinada ordem que seja suficiente para analisar os efeitos pretendidos. No caso em questão, limitam-se aos efeitos de terceira ordem introduzidos pelo MZM, baseados na técnica de faixa dinâmica livre de espúrios (SFDR – Spurious Free Dynamic Range) [7]. Esta faixa tem o extremo inferior definido pelo valor de potência do sinal de entrada que resulta em um sinal na frequência fundamental na saída cuja potência é igual à potência de ruído. Por sua vez, o extremo superior da SFDR é a potência do sinal de entrada que produz um sinal de intermodulação de terceira ordem na saída cuja potência é igual à potência de ruído. Serão propostos cenários para modelar os sinais radar, visando determinar o tipo de codificação do sinal que seja mais propício a cada um deles, de acordo com a definição dos alvos, geografia do ambiente, condições climáticas. A partir daí, pretende-se mensurar as penalidades e obter subsídios para o projeto do sistema, de forma a se ter um contraste satisfatório da imagem sintetizada do radar. Este objetivo encontra aplicações em operações militares, uma vez que o desempenho do sistema radar, incluindo o enlace óptico, deve fornecer informações adequadas e precisas quanto à diferenciação e à identificação de alvos. V. CONCLUSÃO RF em fotônica desponta como uma técnica essencial para aplicações militares. À medida que sua difusão no meio civil vem sendo estabelecida, a economia de produção em escala faz com que seu custo tenha uma tendência a diminuir, proporcionando uma melhor aceitação para os projetos de Defesa. A utilização de recursos otimizados para o enlace óptico envolve a análise do tipo de sinal transmitido por ele. Neste sentido, a codificação do sinal radar pode influenciar o desempenho do sistema, devendo, portanto, ser um fator cuidadosamente considerado na definição dos parâmetros do projeto. A utilização da infraestrutura existente no LAB-GE do ITA permite a implementação completa do enlace óptico analógico e a variação de seus parâmetros para a transmissão de diferentes sinais radar com modulação intrapulso. Dessa forma, poderão ser estudados os efeitos que diferentes tipos de sinais sofrem nessa transmissão, fornecendo embasamento técnico para as futuras aplicações operacionais da Força Aérea Brasileira. Os resultados de tais experimentos poderão compor temas para futuros artigos e teses.  "
}