{
    "id": 125,
    "titulo": "caracterização de capacitores cerâmicos na faixa de sub-ghz para aplicações em fontes de rf de alta potência",
    "autor": "silva neto, l. p., rossi, j. o., barroso j. j.",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2013/st/IX_2.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 2,
    "resumo": "Materiais dielétricos com baixas perdas e alta permissividade são componentes essenciais que são utilizados em linhas de transmissões não lineares capacitivas (LTNLs) na geração de RF. LTNLs possuem grande potencial para gerar ondas de sólitons de alta potência na faixa de micro-ondas com aplicações em plataformas móveis de defesa e satélites de comunicação. Neste trabalho foram caracterizadas as propriedades dielétricas de um capacitor piezelétrico (PZT) à base de chumbo zircônia e titânio e três capacitores cerâmicos comerciais feitos à base de titanato de bário (BaTiO3). A caracterização consiste na medida da constante dielétrica relativa (real e imaginária) em função da tensão e frequência aplicada. Os resultados mostraram que o capacitor PZT apresentou um melhor desempenho comparado ao capacitor à base de BaTiO3 para aplicações em LTNLs com relação às perdas do dielétrico. Outra limitação para operar em altas frequências é a frequência de ressonância do capacitor devido à indutância parasita.",
    "texto": "I. INTRODUÇÃO Cerâmicas dielétricas encontram importante aplicação na construção de linhas de transmissões não lineares (LTNLs) para a geração de sinais de alta potência e na faixa de microondas para serem aplicadas em radares, sensoriamento remoto, interrupção da comunicação em campos de batalhas e veículos espaciais [1]. Na área espacial, LTNLs têm sido estudadas com o propósito de substituir os conhecidos amplificadores de onda progressiva (TWTA) e os amplificadores de potência de estado sólido (SSPA) usados em satélites para a transmissão de dados, imagens, e também em telemetria e comunicação. A razão disso é que LTNLs são mais compactas e não necessitam de fonte de alta tensão auxiliar nem de filamento. Em estudos pioneiros, Ikezi et al. [2] demonstraram a geração de um sinal de alta potência na faixa de frequência de 250-400 MHz utilizando blocos cerâmicos ferroelétricos à base de BaTiO3 (BT). A perda no dielétrico é um fator de limitação para se conseguir grandes amplitudes das oscilações na saída da linha. Recentemente, French et al. [3] construíram uma LTNL usando uma cerâmica piezoelétrica à base de chumbo manganês e nióbio (PMN), como meio não linear para geração de RF, mas os resultados não foram encorajadores, devido ao forte amortecimento das oscilações na saída da linha, causado pelas altas perdas na cerâmica dielétrica PMN. Cerâmicas do tipo ferroelétricas possuem um comportamento não linear, sendo consequência da variação da permissividade relativa em função da tensão aplicada, o qual é um requisito primordial para a geração de sólitons na faixa de micro-ondas ou RF. Sólitons são oscilações descritas por uma função secante hiperbólica quadrática gerada em LTNLs devido à variação da permissividade relativa do dielétrico com a tensão do pulso aplicado na entrada da linha. Estas oscilações podem ser utilizadas como sinais de microondas. Em princípio, LTNLs podem gerar sinais na faixa de sub-microondas com picos de potência da ordem de algumas dezenas de megawatts com taxa de repetição entre 0,1 e 1 kHz utilizando cerâmicas com alta rigidez dielétrica (BDdezenas de kV/cm) e baixa tangente de perdas (<1%). Como mostrado em outros trabalhos [4], [5], capacitores com dielétricos à base de PZT e BT possuem rigidez dielétrica da ordem de 50 kV/cm e 100 kV/cm respectivamente. No entanto, a tangente de perdas destes materiais na faixa de subGHz não são fornecidos pelos fabricantes. Com o objetivo de utilizar um capacitor com baixas perdas dielétricas este trabalho propõe pela primeira vez o uso de PZTs em LTNLs de alta potência, uma cerâmica piezoelétrica que normalmente é utilizada como sensor e transdutor em aplicações industriais. Para reduzir as perdas do dielétrico o material foi despolarizado para aplicações em LTNLs. Para a caracterização em frequência foi utilizado um PZT do tipo 4 e um analisador de espectro na faixa de frequência entre 0,01 GHz à 1 GHz para avaliar o desempenho do material em LTNLs. Este também foi caracterizado em função da tensão DC como mostrado na seção IV. Capacitores cerâmicos comerciais do tipo BT também foram caracterizados para comparação de resultados. A constante dielétrica complexa do material é calculada pela medida do coeficiente de reflexão (S11) utilizando o analisador de espectro. Maiores detalhes sobre as medidas do S11 e cálculos da permissividade complexa e perdas no dielétrico são apresentados na seção III. II. MATERIAIS E MÉTODOS Utilizaram-se três capacitores cerâmicos comerciais e um capacitor PZT despolarizado adquirido da empresa ATCP do Brasil com eletrodo na forma quadrada para a caracterização dielétrica em microondas. Na Tab. I são fornecidas as dimensões do dielétrico e as principais características elétricas dos capacitores caracterizados. Os capacitores C#1 e C#2 adquiridos da empresa Murata possuem dielétricos na forma de disco e os terminais dispostos radialmente. Já o capacitor C#4 tem o dielétrico na forma retangular para montagem superficial SMD (surface mounting device). O capacitor PZT é identificado como C#3 e o fabricante não fornece sua máxima tensão de trabalho. O dielétrico dos capacitores cerâmicos comerciais é baseado em uma mistura cerâmica na qual o principal composto é o titanato de bário (BaTiO3). Os dielétricos dos capacitores da classe I (do tipo NPO de acordo com o padrão EIA) utilizam agentes dopantes como o titanato de cálcio e titanato de magnésio para controlar a gradiente de temperatura e assim estabilizar a permissividade relativa. Os fabricantes não fornecem a exata formulação da composição dos dielétricos devido à composição sofrer variações para um tipo de capacitor em relação a outro, mesmo para tipos similares de diferentes fabricantes, visto que se trata de segredo industrial. Como regra geral, dielétricos estáveis em temperatura são também estáveis em tensão e frequência [6]. Este é o caso para os capacitores C#2 e C#4 que apresentam capacitâncias estáveis, sendo úteis para aplicações em alta frequência. Para deixar a capacitância mais estável os fabricantes aumentam a concentração de material paraelétrico na composição, o que resulta numa redução da permissividade, não ultrapassando a faixa dos 600 e ficando com capacitâncias na faixa de pF. Com isto, estes capacitores possuem uma alta frequência de ressonância associada à indutância parasita. Infelizmente, estes materiais não são adequados para aplicações em LTNLs devido à alta estabilidade de sua capacitância, porquanto se deseja que a capacitância varie com a tensão aplicada. Por outro lado, os capacitores C#1 e C#3 têm como característica uma grande variação da capacitância com a tensão, temperatura e frequência o que os torna favoráveis para aplicação em LTNLs. Isto se deve a uma maior concentração de cerâmica ferroelétrica na composição do dielétrico, o que torna o dielétrico fortemente não linear. O composto predominante utilizado no dielétrico do capacitor C#1 é o BT enquanto o do capacitor C#3 é o PZT. Ao contrário dos capacitores C#2 e C#4, a capacitância dos capacitores C#1 e C#3 podem ser encontradas na faixa de nF e com isto possuem uma baixa frequência de ressonância, sendo um fator limitante com relação à faixa de frequência de operação das LTNLs geralmente < 150 MHz. Os capacitores da classe III que utilizam dielétrico do tipo Y5V como C#1 e C#3 têm tangentes de perdas (entre 1 e 5 %) maiores do que os capacitores da classe I (<1 %), sendo outro fator limitante para operações em altas frequências. O circuito utilizado para a medida da permissividade relativa εr em função da tensão DC é apresentado na Fig. 1. Os dielétricos sob testes (DUT) são carregados por uma fonte DC de alta tensão (Gamma HV – modelo RR10-6R) via uma resistência de 20 MΩ para limitar a corrente de entrada. Quatro bancos de capacitores de 0,25 μF são conectados em série para isolar o capacímetro da fonte de alta tensão e um resistor de 1 MΩ é usado para descarregar o banco de capacitores após o desligamento da fonte. A capacitância total da associação do banco de capacitores deve ser pelos menos 10 vezes maior do que a capacitância da amostra sobre teste para não causar interferência na medição. Como a amplitude do sinal do capacímetro é muito menor do que a tensão da fonte DC, o medidor fornecerá exatamente a medida da capacitância diferencial das amostras sobre testes com um erro menor do que 1%. A permissividade relativa εr do capacitor sobre testes é calculada por onde C é a capacitância medida, d a espessura do dielétrico, A área da superfície dielétrica e ε0 a permissividade do vácuo. A medida da caracterização dielétrica foi feita utilizando o analisador de espectro da Agilent modelo E8364B em uma larga faixa de frequência compreendida entre 0,01GHz a 1,0 GHz. Neste trabalho, utilizou-se o método do cabo coaxial de 50 Ω para medir o coeficiente de reflexão S11 de um capacitor na forma de filme fino com dielétrico à base de PZT por meio de uma estrutura microstrip (MS) e um guia de onda coplanar (CPW) [7], [8]. Entretanto, ao invés de utilizar uma ponta específica para análise de filmes finos foi utilizado um porta amostra com uma estrutura micro-strip conforme mostrado na Fig. 2 (a) e um cabo coaxial de 50 Ω para fazer a conexão com o analisador. Com largura da trilha W = 1,1 mm e espessura T = 0,01524 mm, o dielétrico utilizado para a construção da micro-strip foi o Duroid 6010 baseado em um composto polimérico de espessura H = 1,38 mm e constante dielétrica relativa εr = 10,7. O porta amostra possui várias trilhas para fazer a devida calibração de aberto-curto-carga antes de efetuar a medida da amostra desejada, como mostrado na Fig. 2 (b). Foram utilizados conectores SMA para fazer a interface de ligação entre a micro-strip e o cabo coaxial de 50 Ω conectado ao analisador. Para cada teste, os terminais dos capacitores foram soldados entre as trilhas, fazendo a ligação do sinal e o plano de terra conforme mostra a Fig. 2 (b). O analisador fornece diretamente para cada medida a parte real (permissividade relativa) e imaginária (perdas) do parâmetro S11, que são utilizadas para calcular a permissividade complexa e as perdas no dielétrico, como mostra a próxima seção. III. CÁLCULO DA PERMISSIVIDADE E DAS PERDAS DO DIELÉTRICO A permissividade pode ser expressa na forma complexa de acordo com [7] onde ε' = εr é a parte real da permissividade relativa e ε'' a parte imaginária, a qual representa as perdas do dielétrico. As perdas do dielétrico são tipicamente quantificadas em termos da razão entre as partes imaginária e real definida como tangente de perdas, , (3) onde δ é o ângulo da tangente de perdas no plano ε'- ε''. A impedância do dielétrico com perdas é dada por , (4) onde ω é a frequência angular. Para o cabo coaxial de 50 Ω conectado entre o analisador e o porta amostra a impedância do dielétrico pode ser calculada através da medida do coeficiente de reflexão S11 como (5) Igualando (4) com (5) tem-se, (6) Usando (5) e (6) para determinar a permissividade relativa complexa e as perdas do dielétrico obtém-se [8] , (7) , (8) onde S11’ e S11’’ são respectivamente as partes real e imaginária de S11 e k = d/(ωε0Z0A) com Z0 = 50 Ω. IV. RESULTADOS A correspondente curva εrxV medida em temperatura ambiente para os capacitores C#1, C#2 e C#3 é mostrada na Fig. 3, exceto para o capacitor SMD (C#4) devido à sua baixa tensão de trabalho (ver Tab. I). Para o capacitor C#1 (470 pF), em linha verde, εr diminui de 3300 para 1700 aproximadamente, com uma variação da permissividade relativa de 50%, próxima da máxima tensão de trabalho dada pelo fabricante de 3 kV. Como esperado para o capacitor C#2 (100 pF), em linha vermelha na Fig. 3, praticamente não se tem há variação de εr (≈200), confirmando que o dielétrico é da classe I (NPO). Para o capacitor C#3 com dielétrico à base de PZT, a permissividade relativa diminui de 1300 para 750 aproximadamente, com uma redução de 50% em 3,2 kV, sendo favorável o uso deste dielétrico em LTNLs por causa da não linearidade apresentada. Fig. 3. Variação da permissividade em função da tensão DC aplicada. Com relação à caracterização em frequência, as Figs. 4 e 5 mostram as medidas das partes real e imaginaria de S11 para os capacitores apresentados na Tab. I. No caso ideal, o capacitor é um circuito aberto em baixa frequência, com Re[S11] inicialmente igual a um e Im[S11] igual a zero (|S11| = 1, Φ = 0). Com o aumento da frequência, Re[S11] e Im[S11] diminuem simultaneamente com o decréscimo da reatância capacitiva, até o ponto em que a parte real passa por zero e a parte imaginária alcança um pico negativo (entre 0 e -1). Em alta frequência, o capacitor comporta-se como um curto circuito (|S11| =1, Φ = π) e, portanto, Re[S11] diminui para -1 e Im[S11] tende assintoticamente para zero. Observando as Figs. 4 e 5 é possível verificar que somente o capacitor SMD (C#4) está de acordo com o padrão previamente descrito, embora sua parte real não tenha alcançado -1 devido a sua alta reatância nesta faixa de frequência. Este resultado indica que a indutância parasita deste capacitor é desprezível nesta faixa de frequência e com uma frequência de ressonância muito maior que 1 GHz. Este é o comportamento esperado para capacitores tipo SMD de baixa capacitância (1 pF), projetados para operar em altas frequências. Para os capacitores C#1 (470 pF) e C#3 (PZT), a parte Re[S11] cai repentinamente de 1 para -1 (como em um curto circuito) e Im[S11] passa por zero nas frequências próximas de 0,1/0,2 GHz, ficando positiva acima destas frequências, indicando que estes capacitores tem uma frequência de ressonância dentro da faixa de frequência de 0,1 e 0,2 GHz. O efeito da ressonância pode ser claramente visto na Fig. 6 com a permissividade relativa se tornando negativa na curva ε’×f, pois a parte imaginária Im[S11] se torna positiva acima da frequência de ressonância, como mostrado na Fig. 5. O mesmo efeito é observado para o capacitor de 100 pF, como mostram as Figs. 5 e 7. Entretanto para o capacitor SMD a permissividade relativa é sempre positiva em torno de 500 e não apresenta o pico de ressonância, ou seja, não apresenta Im[S11] > 0. Uma importante observação para os outros capacitores (470 pF, PZT e 100 pF) em baixas frequências é que eles apresentam, respectivamente, permissividade inicial da ordem de 2700, 1000 e 200, praticamente as mesma obtidas para valores não-polarizados obtidos na medida de ε×V, conforme mostrado na Fig. 3. Fig. 6. Permissividade relativa medida em função da frequência (capacitor de 470 pF e do tipo PZT). Fig. 7. Permissividade relativa medida em função da frequência (capacitores de 100 pF e SMD). As perdas no dielétrico ou tangente de perdas dos capacitores podem ser calculadas usando (7), (8) e (3). Os resultados são mostrados na Fig. 8, onde se pode observar que as perdas no dielétrico são significativamente baixas e longe do pico de ressonância do capacitor. Na frequência de ressonância a curva apresenta um pico de perdas, indicando que a reatância do capacitor esta próxima de zero, devido à indutância parasita associada. Para os capacitores lineares (100 pF e SMD) as perdas são menores do que os capacitores não lineares (470 pF e PZT), principalmente em frequências abaixo de 0,3 GHz. Para comparação, na Tab. II são apresentadas as tangentes de perdas (tan δ) dos dielétricos acima do pico de ressonância (alta frequência- AF) e abaixo do pico (baixa frequência- BF). Para o capacitor SMD C#4 (1 pF) as perdas variaram de 0,03 até 0,005 abaixo de 0,3 GHz, apresentando um melhor desempenho com relação aos outros capacitores, principalmente acima de 0,3 GHz em que as perdas são mantidas entre 0,005 e 0,06. IV. DISCUSSÃO DOS RESULTADOS Como visto anteriormente, capacitores possuem frequência de ressonância devido às indutâncias parasitas associadas aos eletrodos ou terminais. Com a aproximação da frequência de ressonância do capacitor, tem-se um aparente aumento da permissividade (ver Figs. 6 e 7). No entanto a capacitância efetiva CE próxima da frequência de ressonância apresenta ser maior do que a capacitância nominal do capacitor dada por [9] , (9) onde C0 é a capacitância nominal, f é a frequência de operação, e fr é a frequência de ressonância do capacitor calculada por (10) onde L s é a indutância parasita. O efeito da ressonância pode ser entendido analisando-se o modelo do capacitor em alta frequência, como apresentado na Fig. 9. O capacitor real pode ser modelado com uma capacitância ideal C0 em série com Ls. A indutância parasita depende de vários fatores: forma geométrica do capacitor, processos de fabricação, disposição dos terminais e solda de conexão. R p representa a resistência dielétrica em baixas frequências devido a corrente de fuga no capacitor e RES é a resistência equivalente série, que inclui as perdas no dielétrico e a resistência dos contatos ôhmicos. Normalmente R p é desprezado devido ao seu valor estar na faixa de GΩ e a resistência dos contatos ôhmicos ser muito baixa em torno de miliohms para um dielétrico com baixas perdas (tan δ < 1%). Na faixa de frequência de medição, o efeito pelicular também pode ser desprezado. Rp e Ls afetam a capacitância efetiva e o fator de qualidade Q do capacitor podendo ser expresso como [9] , (11) onde XL e XC são respectivamente a reatância indutiva e a reatância capacitiva. Fig. 9. Modelo do capacitor para operação em alta frequência. Como R p >> RES na frequência de ressonância, a reatância equivalente é igual a zero e o capacitor se transforma em uma resistência pura igual a RES. Nesta condição a capacitância é indefinida e o capacitor é utilizado geralmente para aplicações de desacoplamento, caso em que RES está na faixa de alguns mΩ. Acima da frequência de ressonância o capacitor passa a ser um indutor e a permissividade relativa fica negativa (ver Figs. 6 e 7). Portanto LTNLs devem ser projetadas para operarem com uma frequência f0 abaixo de fr. Quando se aplica um pulso retangular de amplitude V na entrada da LTNLs, estas são capazes de gerar oscilações sólitons em sua saída com frequência de operação dada pela metade da frequência de corte da linha como onde L é a indutância da célula unitária da LTNL e Cvmax é a capacitância mínima da correspondente seção para uma amplitude de tensão máxima (Vmax ) do pulso, uma vez que permissividade do dielétrico não linear diminui com a tensão aplicada (ver Fig. 3). Assim limitando a frequência da LTNLs para f0 = fr/2, obtém-se que . (13) Utilizando-se (13) para determinar L em função de Ls e admitindo-se uma diminuição da capacitância em torno de 50 % (isto é, C0/CVmax = 2), obtém se que L = 8 Ls para os capacitores C#1 e C#3. Utilizando (10) para estimar Ls por meio da medida da frequência de ressonância (ver Figs. 6 e 7), a indutância L para cada seção das LTNLs é obtida para cada capacitor não linear, conforme apresentado na Tab. III. Observe que somente a indutância parasita Ls foi estimada para o capacitor C#2, pois este é um capacitor linear como C#4. Para o capacitor SMD C#4, Ls não foi estimado uma vez que sua frequência de ressonância não é alcançada na faixa de frequência medida (fr > 1 GHz). Outro parâmetro importante que pode comprometer o desempenho da LTNL refere-se às perdas no dielétrico devido aos altos valores de RES. Como apresentado em [3] simulações no software Spice demonstraram que capacitores com RES > 2 Ω conduz a um forte amortecimento das oscilações na saída com desprezíveis amplitudes das oscilações de saída. No caso dos capacitores de 470 pF e do tipo PZT, os valores calculados para RES são respectivamente da ordem de 1,8 Ω e 1,27 Ω << 2 Ω, considerando as correspondentes tangentes de perdas iguais a 0,2 e 0,06 na faixa de BF conforme apresentado pela Tab. II para CVmax = 0,5 C0. Isto explica o motivo de LTNLs terem sido construídas com sucesso com capacitores comerciais não lineares à base de BT operando na faixa de frequência de 0,01 a 0,1 GHz como apresentado em [10]. IV. CONCLUSÕES Neste trabalho foram caracterizados capacitores cerâmicos comerciais com dielétrico à base de BT e de PZT na faixa de frequência 0,01 até 1,00 GHz. Mostrou-se que somente capacitores com forte dependência da capacitância com a tensão são adequados para aplicações em LTNLs tais como os capacitores à base de BT (470 pF) e à base de titanato zirconato de chumbo (PZT). Dependendo da mistura utilizada na composição do dielétrico, eles são estáveis e apresentam características lineares, como é o caso dos capacitores de baixa capaitância (100 pF) ou tipo SMD para RF (1 pF). Os capacitores de 470 pF e tipo PZT apresentaram uma diminuição de 50% da capacitância com a tensão DC, com o capacitor a base de PZT apresentando menores perdas do dielétrico. Por exemplo, para este capacitor na faixa de frequência até 100 MHz foi medida uma tangente de perdas menor do que 1 com resistência RES calculada da ordem de 1,25 Ω, enquanto que para o capacitor C#1 até a faixa de 0,075 GHz obteve-se tan δ > 0,1 com RES em torno de 1,8 Ω. Outro ponto importante é que a frequência de ressonância dos capacitores limita o seu emprego em aplicações para frequências até 0,1 GHz, dependendo do tipo de capacitor utilizado. Nestas condições, os capacitores tipo SMD são mais indicados, porém no mercado é difícil encontrar capacitores deste tipo com alta rigidez dielétrica (> 1 kV), baixa estabilidade e de alta frequência de ressonância acima de 0,2 GHz. Portanto, blocos cerâmicos (do tipo PZT ou BT) usados como dielétricos não lineares em linhas de transmissões de placas paralelas (como proposto por Ikezi) tem sido a solução usada para minimizar os efeitos da indutância parasita para operação da LTNL em alta frequência (> 200 MHz). No entanto, os materiais cerâmicos usados até o momento (PZT, BT ou PMN) possuem frequência de relaxação não mais do que 0,8 GHz, que seguramente representa uma fator de limitação para LTNLs operarem acima de 1 GHz. "
}