{
    "id": 127,
    "titulo": "tecnologias para comunicações militares: análise comparativa entre enlaces a fibra óptica e comunicações ópticas no espaço livre",
    "autor": "alessandro roberto dos santos e josé edimar barbosa oliveira.",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2013/st/P_6.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Este trabalho enfatiza a necessidade de novas tecnologias a fim de sanar a falta de faixas de frequências em RF, para as comunicações militares, em decorrência da grande quantidade de equipamentos de comunicações, vigilância e controle que utiliza grandes faixas do espectro eletromagnético. Atualmente, observa-se a expansão do emprego de enlaces a Fibra Óptica, bem como Comunicações Ópticas no Espaço Livre (Free Space Optical Communication) em vários países. Esta opção tem proporcionado larguras de banda adequadas, além de oferecer segurança e elevada velocidade na transmissão de dados. Neste contexto, este trabalho apresenta um estudo comparativo sobre dois métodos de comunicações ópticas, a saber: enlace a Fibra Óptica e enlace utilizando Espaço Livre. Em ambos os enlaces, empregam-se moduladores externos, tipos eletroópticos e de eletro-absorção. Adicionalmente, o estudo recorre a alguns dados experimentais disponibilizados por outros centros de pesquisa, tais como: níveis de potência óptica e de RF, resposta em frequência da transmissão, perda por inserção, distorção harmônica, relação sinal-ruído e faixa dinâmica. Por fim, a partir deste estudo comparativo apresentase considerações básicas sobre o potencial destas tecnologias para aplicação militar em redes de comunicações ópticas, a fim de atender as mais diversas demandas nesta área.",
    "texto": " I. INTRODUÇÃO A necessidade de implantação em de novas tecnologias para suprir a falta de faixas em Rádio Frequência (RF) para as comunicações militares, é objeto de estudo por muitos centros e institutos ligados à área de telecomunicações, inclusive em nosso país. Dentro deste estudo, uma linha de pesquisa é a utilização da Fotônica para o transporte de dados através de enlaces de Fibra Óptica e das Comunicações Ópticas no Espaço Livre (Free Space Optical Communications- FSO). Basicamente, as duas tecnologias de enlaces ópticos possuem as mesmas estruturas de dispositivos de transmissão e recepção, sendo sua diferença o modo de propagação, onde o FSO utiliza a atmosfera para propagar-se. Mas devido a as influências atmosféricas (atenuação, turbulência e cintilação) e do equipamento de transmissão e recepção (lentes, conexões, etc.), esta modalidade de enlace tem uma desvantagem em relação à Fibra Óptica. Em compensação, o FSO possui a vantagem de fácil instalação, mobilidade, segurança na transmissão (imune a bloqueios e interceptação) e grande velocidade na transferência de dados. Estas características é o que desperta a atenção para a pesquisa e desenvolvimento de enlaces de FSO, por grupos de pesquisas voltados para a tecnologia militar, com a finalidade de projetarem redes de comunicações ópticas, dentro da concepção da Guerra Centrada em Redes (GCR ou NCW - Network Centric Warfare). II. A NECESSIDADE DE NOVAS TECNOLOGIAS PARA AS COMUNICAÇÕES MILITARES Com o crescimento de novas tecnologias que utilizam a Rádio Frequência (RF), pode-se considerar que o Espectro de Eletromagnético nesta faixa está ficando pequeno para comportar tantos equipamentos que trabalham com grande largura de faixa de frequência, além da difícil utilização em virtude das regulamentações governamentais sobre o referido espectro. Com este cenário, as comunicações militares também sofrem esta dificuldade: com a criação de novos equipamentos que requerem maiores larguras de banda e a concorrência comercial que deseja utilizar estas frequências estão corroborando a reduzir este espectro na faixa de RF para as comunicações nesta área [1]. Estima-se que 5% a 10% das bandas de frequências são utilizadas para as comunicações militares, sendo que em uma operação militar, esta pequena parcela da banda é totalmente empregada em pouco tempo [2]. Outro problema é a utilização de equipamentos militares em outros países. Mesmo havendo uma padronização entre os países membros da União Internacional de Telecomunicações (UIT), ainda surgem problemas sobre a utilização de alguns equipamentos de que empregam a RF no que tange a ocupação do espectro de freqüências. Logo em um período onde as operações militares conjuntas entre países estão tornando rotineiras, este entrave está sendo frequente. Além deste conjunto de dificuldades citadas, estas novas tecnologias para as comunicações militares têm que deter o requisito da mobilidade [3], atendendo os interesses de cada força armada [4] sobre este tema. III. USO DA FAIXA DO IR PARA AS COMUNICAÇÕES No espectro eletromagnético, a faixa de RF está em sua grande parte alocada para fins comerciais e sob o controle de agências governamentais reguladoras, conforme citado no item anterior. A faixa do infravermelho é pouco utilizada para a atividade de comunicações e o que facilita sua utilização é a inexistência de uma regulação governamental nesta faixa do espectro eletromagnético para sua utilização, exceto as regulações de segurança. Com isso, o emprego da faixa do infravermelho é um caminho viável para as comunicações, por meio de enlaces de Fibra Óptica e FSO sendo para as comunicações militares um horizonte para aumentar suas capacidades de transmissão de dados. IV. DISPOSITIVOS DE COMUNICAÇÕES ÓPTICAS Os dispositivos eletroópticos voltados para comunicações, controle e vigilância, são representados principalmente pelos enlaces de Fibra Óptica e FSO. Estes equipamentos estão sendo amplamente pesquisadas e empregadas por alguns países como Estados Unidos, Alemanha e França. O interesse destes países por esta tecnologia é devida as grandes vantagens que proporcionam para as comunicações, sendo que a maioria de das características são necessidades fundamentais das Forças Armadas nesta área. V. ENLACE A FIBRA ÓPTICA Nos dias atuais, a Fibra Óptica está amplamente aplicada na área de comunicações e vigilância onde seu emprego visa à comunicação a longas distâncias, principalmente para lugares remotos oferecendo uma alta velocidade e grande taxa de dados. Um sistema de comunicações de Fibra Óptica, basicamente é composto de um modulador óptico, transmissor, a Fibra Óptica e receptor: A representação esquemática de um enlace de Fibra Óptica na Fig. 1, o sinal de RF é inserido no modulador óptico e modulado por uma portadora óptica (laser). Este sinal óptico com o sinal de RF caminha através da Fibra Óptica até o receptor, onde sofrerá a demodulação retornando para o sinal de RF na saída. Um dos parâmetros de desempenho de enlace a fibra é a característica de atenuação, em função do comprimento de onda, conforme apresentada na Fig. 2. A Fig. 2 revela que atenuação da ordem de 0,2 dB/Km pode ser obtida em torno do comprimento de onda de 1550nm, o qual por esta razão é amplamente utilizado em telecomunicações. Em síntese, é argumento comum que a vantagem do enlace a Fibra Óptica decorre da elevada imunidade eletromagnética, grande largura de banda e baixa atenuação. Além das características citadas, algumas literaturas sobre o assunto incluem como vantagem a fácil instalação e manutenção. Mas para aplicações de enlace de Fibra Óptica voltadas para as operações militares, esta característica é muito relativa, pois dependerá muito para o que e onde será empregada. Por exemplo, um sistema de comunicações com Fibra Óptica para forças militares que necessitam de mobilidade e não necessitam ficar por muito tempo em uma área, seria inviável o emprego deste sistema em virtude do tempo gasto para instalação e retirada levando em consideração o pouco tempo de permanência. VI. ENLACE COMUNICAÇÕES ÓPTICAS NO ESPAÇO LIVRE (FSO) O processo de funcionamento e a representação esquemática do FSO é semelhante ao da Fibra Óptica representada na Fig. 1: Observando a Fig. 3, o que diferencia o FSO é o sinal óptico que é modulado é irradiado na atmosfera. Quando o sinal óptico chega ao receptor, este sinal é detectado, amplificado e finalmente demodulado para o sinal de RF. Além de algumas características da Fibra Óptica, é importante citar a questão de mobilidade, rapidez na instalação e facilidade na manutenção, sendo requisitos importantes para uma operação militar. A literatura sobre FSO revela que uma das maiores limitações desta tecnologia decorre de dificuldades originadas pelas características da atmosférica [6]-[7], tais como: a) Atenuação; A lei de Beer-Lambert representa a fórmula de cálculo da propagação do enlace do FSO, onde atende ao modelo de propagação de um feixe óptico gaussiano em espaço limitado por perdas: onde: P(r) : Potência óptica em uma posição arbitrária r; P(0) : Potência óptica em uma posição inicial; e  : Valor médio da atenuação ( m1 ). O laser na atmosfera é atenuado pela absorção ou por meio de espalhamento por várias moléculas e gases existentes na atmosfera. A absorção é a transformação da energia do feixe eletromagnético em outros tipos de energia sendo os fatores contribuintes as várias moléculas e gases existentes na atmosfera. A intensidade a absorção irá depender do comprimento de onda, tamanho e índice de refração das partículas, apresentada na Fig. 4. O fenômeno do espalhamento é a redistribuição de energia luminosa, quando, ao atravessar a atmosfera terrestre, encontra em seu caminho moléculas de ar e partículas em suspensão. Desta forma a intensidade da luz é reduzida, ocasionado perdas para o sistema. O espalhamento pode ser determinado por [6]-[7]: - Espalhamento molecular ou Rayleigh: produzido por gases na atmosfera; - Espalhamento Mie: quando o tamanho das partículas espalhadoras é da mesma ordem de grandeza do comprimento de onda da radiação; e - Espalhamento não seletivo ou geométrico: ocorre quando o diâmetro das partículas é menor que o comprimento de onda. b) Turbulência A turbulência é causada pela variação aleatória de temperatura e pressão atmosférica onde ocorre à propagação do FSO. Devido a esta variação de temperatura e pressão na atmosfera, o índice de refração do ar mudará e desta forma, ocorrerá o desvio do feixe de luz [6]-[7]. c) Cintilação A cintilação ocorre quando há mudança na intensidade da luz, gerando uma variação no foco do feixe que chega ao receptor. Esta variação ocorre devido ao índice de refração do ar gerada pela turbulência [6]-[7]. Este fenômeno ocorre principalmente em dias mais quentes e podem ser calculadas: para pequenas variações de cintilação, através da variância 02 para uma onda plana [8]: nde: k2 : constante de propagação; 2n c : índice de refração da atmosfera (depende da temperatura de todo um dia); e L : distância de propagação. O índice de cintilação é calculado por meio da seguinte expressão [7]: Logo, a partir da equação (3.a), obtém-se o índice de cintilação [8]: onde:  D: Diâmetro de abertura do receptor.  Com a influência deste fator, o alcance dos sistemas de FSO fica restrito a distâncias que vão de algumas centenas de metros a algumas dezenas de quilômetros. VII.DESEMPENHODOS MODULADORES ÓPTICOS NOS ENLACES DE FIBRA ÓPTICA E FSO Os enlaces de Fibra Óptica e o FSO possuem características e estruturas semelhantes, porém possuem desempenhos bem diferentes quando utilizam moduladores eletroópticos Mach-Zehnder e de Eletro-Absorção. a. Modulador Mach-Zehnder O Modulador Mach-Zehnder empregado neste trabalho utiliza o efeito eletoóptico linear, também conhecido como efeito Pockels. Neste efeito, a ação de uma voltagem induz uma variação da permissividade elétrica ou do índice de refração no material. Quando a fase chega e 180º esta tensão é chamada de tensão de meia onda. Na Fig. 5, é apresentado uma representação esquemática do modulador MachZehnder. A Fig. 5 mostra que o modulador é constituído por um substrato eletroóptico no qual guias ópticos e eletrodos são fabricados por meio de técnicas empregadas na fabricação de circuitos integrados eletrônicos. O princípio de operação do modulador pode ser descrito da seguinte forma: inicialmente, o feixe laser é acoplado ao guia óptico posicionado no lado esquerdo do substrato do LiNbO3, o qual é decomposto em duas parcelas que se propagam nos dois braços do interferômetro; em segundo lugar, o campo elétrico de RF modifica as fases dois braços do interferômetro via efeito eletroóptico; finalmente, os sinais ópticos são recombinados na junção Y localizada no lado direito do substrato. A relação da potência de entrada com a potência de saída é definida por: onde: Pout: Potência óptica de saída; Pin: Potência de entrada no modulador Mach-Zehnder; u t ( ) : Sinal de RF; e Vn: Tensão de meia onda. Na tabela I, são mostras alguns valores de performance um modelo do Modulador Mach-Zhender [9]: b. Modulador de Eletro-Absorção Os moduladores de Eletro-Absorção, representado esquematicamente na fig.6, têm o princípio de funcionamento a partir do efeito de absorção (FranzKeldysh), onde a absorção do material varia de acordo com o campo elétrico aplicado no material [10]. Estes moduladores são amplamente usado devido sua baixa voltagem e larga largura de banda. A função de transferência do modulador de EletroAbsorção é representada por [10]: onde: Pin : Potência Óptica de entrada; Pout : Potência Óptica de saída; a1v : Efeito de Franz-Keldysh; 2 a2v : Efeito Stark com confinamento quântico; Na tabela II, apresenta alguns valores de performance de um modelo de Modulador de Eletro-Absorção: Para comparar os efeitos dos moduladores no desempenho de enlaces com a Fibra Óptica e o FSO utiliza-se amplamente um resultado experimental da referência [10]. Observa-se que o modulador de Eletro-Absorção possui um melhor desempenho que o March-Zehnder (fig. 6a e 6b), gerando maiores sinais de amplitude de saída para ambos os métodos de transmissão de sinais. Por outro lado, os sinais de amplitude de saída do FSO são maiores que o da Fibra Óptica. Desta forma, a utilização de moduladores de EletroAbsorção pode ser benéfica para a transmissão em FSO, com a finalidade de compensar as perdas. VIII. COMPARAÇÃO DE DESMEPENHO DO DOS ENLACES DE FIBRA ÓPTICA E FSO Outro dado experimental desenvolvido por um centro de pesquisa [12], foi verificar o desempenho dos enlaces de Fibra Óptica e FSO utilizando um receptor e um transmissor a uma distância de 3 metros para um comprimento de onda de 1550nm do laser. Para realizar a comparação da potência óptica, primeiro mediu-se a potência na saída do transmissor de laser gerando o gráfico da Fig.7a. Posteriormente, realiza-se esta mesma medida na entrada da Fibra Óptica e no FSO. Os resultados obtidos mostram uma perda de potência no sinal em cada um dos enlaces, (Fig.7b-7c), em comparação a primeira medida, onde o FSO obteve a maior queda. Os valores obtidos encontra-se na tabela III: As perdas ocorridas devem-se as conexões do transmissor laser com a Fibra Óptica e suas atenuações. Para o FSO, influência atmosférica e do próprio equipamento (lentes, conectores, etc), podem ter gerado estas grandes perdas. As Fig. 8a e Fig. 8b representam a resposta em freqüência de transmissão, observa-se que ao amplificar os sinais de RF a serem transmitidos através do enlace de FSO, ajudariam a evitar grandes perdas na transmissão, desta forma atingindo maiores alcances. Para a medida do retardo de grupo (Group Delay) (fig. 9a- 9b), os sinais de amplificados de RF ainda auxiliam na melhoria da transmissão do sinal FSO, proporcionando transmissão em distâncias mais longas. A relação sinal ruído (fig. 10a-10b), medida para os dois enlaces, apresenta uma vantagem para a Fibra Óptica para enlaces a grande distância, mas para curtas distâncias, o FSO também é viável. O resultado para a resposta de reflexão apresentada na Fig. 11 possui um mesmo valor para a Fibra Óptica e para o FSO devido à potência de RF de entrada e a potência de RF refletida serem as mesmas. Com estes resultados experimentais apresentados pelo artigo [12], observa-se um melhor desempenho da Fibra Óptica, em virtude da grande perda de potência de sinal pelo FSO, mas com a amplificação do sinal de RF, as perdas neste enlace são um pouco menores. Desta forma, em um enlace óptico com sinal de RF entre duas posições é viável a utilização do FSO. IX. REDES ÓPTICAS DE COMUNICAÇÕES A partir do conceito da GCR que visa interligar as forças em rede, criando sinergias que lhe permitam reduzir os efeitos da dispersão das forças no Campo de Batalha e aumentando-lhes o seu poder de combate [13], aumentou a necessidade de estudar a viabilidade de utilização de novas tecnologias e conceitos para ampliar as capacidades de transmissão e coleta de dados. A fim de atender o conceito da GCR, várias topologias de rede de comunicações ópticas neste segmento foram desenvolvidas. Resultados obtidos com enlaces de Fibra Óptica para atender o conceito da GCR, não é a concepção totalmente ideal, pois estes enlaces não possuem uma mobilidade e não conseguem atender as unidades mais isoladas, os chamados last mile e locais de difícil acesso. Com a aplicação do FSO, as unidades mais distantes teriam acesso aos dados que estão propagando pela rede de Fibra Óptica, sem a necessidade de estarem interligados fisicamente a cabos de Fibra Óptica representada na Fig. 12. A mobilidade é um requisito importante para as operações militares e aliados com a segurança, capacidade de transmissão e invulnerabilidade de bloqueios e localização eletrônica, o FSO seria uma solução para as comunicações em um teatro de operações. Na Fig. 13, tem-se um exemplo de aplicação do FSO nas Operações Navais. Com a finalidade de melhorar a capacidade de transmissão do FSO devido às perdas atmosféricas, estão sendo utilizados em prática, sistemas de FSO híbridos nas redes de comunicações ópticas. O funcionamento deste enlace é a partir da Relação Sinal Ruído quando chega a condições insatisfatórias. Assim, a fim de compensar esta perda, há a intervenção do sinal de RF para melhorar a qualidade da transmissão. Todo este enlace de comunicações ópticas voltada para a melhoria das comunicações militares pode ser convertida para o cenário civil. O emprego das redes de comunicações ópticas para o FSO é de grande valia para locais onde a utilização da Fibra Óptica seria inviável em virtude a grandes investimentos e emprego de uma grande logísitca. O FSO ainda é um objeto de pesquisa. O objetivo é chegar a um sistema que não perca o desempenho sob influências de efeitos atmosféricos. As pesquisas realizadas por alguns países podem ser apreciadas através da referência [14]. X. CONCLUSÃO Um método em desenvolvimento para sanar a escassez de faixa de frequência em RF por vários países foi à utilização dos dispositivos de comunicações ópticas que utilizam a faixa do IR. Devido às vantagens oferecidas como maiores larguras de banda, segurança contra interferências e localização, este assunto ainda continua em estudo e sendo a cada dia mais aprimorado. O enlace de Fibra Óptica ainda será uma das soluções para utilização do IR para as comunicações, mas devido a sua pouca mobilidade, grande logística para instalação e não atender a lugares de difícil acesso, este tipo de enlace não atende as comunicações militares. Por este fato, os estudos e pesquisas sobre o FSO a cada dia tomam maior vulto. Ainda o FSO não possui características iguais ou superiores que a Fibra Óptica, principalmente pela influência atmosférica que impede este desempenho. Alternativas para mitigar as perdas estão sendo utilizadas como, por exemplo, moduladores eletroópticos e Eletro-Absorção mais potentes, amplificação do sinal de RF e utilização de sistema híbrido de FSO. Mesmo com este desafio para vencer, ainda é vantajoso utilizar o FSO, em locais de difícil acesso e em pequenas redes de comunicações táticas como forças navais, forças terrestres e força aérea combinada que necessitam comunicações seguras, com grande largura de banda e velocidade. "
}