{
    "id": 128,
    "titulo": "aplicação de sensores de imagem no controle de tracking em enlace laser em satélites",
    "autor": "andré pierre mattei, elói fonseca, wagner chiepa cunha e onofre trindade",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2013/st/VI_2.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "O emprego de satélites em redes de comunicação leva a uma crescente demanda pela busca de enlaces de comunicação mais eficientes e seguros. O emprego do laser como meio de enlace de comunicação entre satélites ou com estações em terra é uma opção que agrega recursos relevantes como taxa de transmissão de dados e maior imunidade a interferências eletromagnéticas. Um requisito importante para a eficácia em um enlace laser é o controle de desvio de alinhamento em função da estreita abertura de feixe laser emitido. Este trabalho apresenta os experimentos em andamento no ITA para aplicação de sensores de imagem no controle de aquisição e manutenção de tracking em comunicações ópticas.",
    "texto": " I. INTRODUÇÃO Enlaces a laser com satélites começaram as suas atividades em 1977, quando a Agência Espacial Européia (European Space Agency, ESA) realizou contrato para moduladores para alta taxa de dados em portadora laser. No início das atividades, a ESA fez a opção por fontes a CO2, pois estavam disponíveis e eram bem conhecidas na Europa, mas o desenvolvimento de fontes a semicondutor nos anos 70 permitiu seu uso a partir da década seguinte. O programa SILEX (Semiconductor Laser Intersatellite Link Experiment) foi levado ao espaço através dos satélites GEO (Geostationary Orbit), chamado ARTEMIS (Advanced Relay and TEchnology Mission Satellite), e LEO (Low-Earth Orbit), chamado SPOT-4, para estabelecer enlaces diretos a taxas de 50Mbps. O SPOT-4 foi levado ao espaço em 1998 e o ARTEMIS em 2001, após uma série de dificuldades com o lançador que resultaram em atraso de lançamento e perda da maior parte de seu combustível. Desde 2003, foram acumuladas 377 h and 39 min de enlaces entre os dois satélites. [1], [2] Um outro exemplo de interesse é o enlace entre os satélites NFIRE e TerraSAR-X. Ambos foram lançados em 2007 em órbita baixa (LEO) e conseguiram taxas de 5,6 Gbps em distâncias de até 4.900 km. Com reduzido tempo de aquisição (30s) ambos satélites acumulam 16 mil segundos de enlaces em modulação BPSK que duram entre 50 e 650s. [1], [2] No caso de enlaces entre LEO e a terra, apesar das menores distâncias (300-1000km), a perturbação da atmosfera na frente de onda do feixe exigem menores aberturas no sistema óptico. A experiência acumulada com o enlace entre o satélite LEO NFIRE e a estação de solo no Havaí (Haleakala) permitiu perceber que, apesar das perturbação atmosféricas adicionais, taxas de 5,6Gbps foram atingidas com modulação BPSK, sendo que o enlace no sentido terra-espaço se mostrou com BER maiores (10-8). [2] A possibilidade de emprego de sistemas de comunicação óptica empregando o laser nos enlaces de dados entre satélites no espaço ou com aeronaves e estações de controle em terra tem gerado crescente interesse e diversos programas de desenvolvimento no âmbito internacional de pesquisa científica [3], [4]. As principais vantagens da comunicação óptica em espaço livre que justificam este interesse, em relação aos canais de comunicação de radiofreqüência, são [2], [5], [6], [7], [8]:  Redução em dimensões e peso;  Redução da potência necessária no transmissor;  Taxas de erro BER (Bit Error Rate) potencialmente menores que 10−11 em grandes distâncias;  Aumento de banda transmissão (maior que 1Gbps); e  Aumento da imunidade a interferências. As configurações mais comuns de redes de comunicação como Sistema Ponto a Ponto, Crosslink e Híbrido, ilustradas na Fig. 1, apresentam características e requisitos distintos, de abordagem ampla em função da estrutura física, lógica e complexidade do meio de propagação. A abordagem neste trabalho considera os satélites divididos em dois cenários de interesse: a. Satélites geoestacionários, com altitude da órbita aproximada de 36.000km; e b. Satélites de baixa órbita, com altitude aproximada de 100 - 1000km. Em ambos os cenários, considerando a necessidade de acoplamento direcional do feixe de laser transmitido, aliado à dinâmica envolvida num corpo celeste em movimento, as arquiteturas dos sistemas apresentam como ponto comum a necessidade de uma cadeia de controle otimizada que permita a aquisição do sinal do feixe de laser e a manutenção de tracking. O controle de alinhamento do enlace então pressupõe uma fase de aquisição do sinal proveniente do estreito feixe luminoso e posterior manutenção de tracking, empregando recursos mecânicos, ópticos e eletrônicos na consecução deste objetivo, sendo este controle denominado neste trabalho como PAT (Pointing, Aquisition, and Tracking). O projeto de um sistema integrado de aquisição e tracking pode ser delineado em várias configurações, uma forma otimizada e simplificada pode ser obtida quando se emprega o mesmo circuito para ambas as funções de aquisição e tracking, empregando sensores de imagem. Neste trabalho é apresentada uma proposta prática da aplicação de sensores de imagem já existentes no controle de aquisição e manutenção de tracking em comunicações entre satélites e estações de terra, abordando as características deste projeto como aplicação espacial embarcada no ambiente espacial e os requisitos inerentes ao mesmo. Fig. 1– Configurações de redes de Comunicação entre satélites. [8] II. CARACTERÍSTICAS DO ENLACE Através da simples comparação da capacidade de transferência de dados e margem de potência no receptor, a transmissão empregando laser no espaço livre representa uma opção promissora para comunicações, em relação a transmissão por radiofreqüência (RF), conforme ilustrado na TABELA 1 [8] e TABELA 2. Apesar das vantagens apresentadas, fatores como a imprecisão na órbita do satélite, efeitos doppler, vibrações devido a choque com micrometeoritos ou a turbulência atmosférica existente na constituição do meio de transmissão anisotrópico entre um satélite e a estação em terra, provocam flutuações na intensidade do sinal recebido e cintilações que podem provocar uma degradação considerável na confiabilidade do enlace de comunicação empregando laser. [2] Por simplicidade e quando possível, o projeto do sistema de comunicação pode ser desenvolvido considerando que ambos transmissor e receptor usem antenas similares, pelo menos para a função de tracking. As investigações científicas realizadas na análise de comportamento nos enlaces uplink e downlink apontam para limites de alinhamento a partir dos quais a perda em ambos os enlaces provoca comprometimento da confiabilidade na transferência de informações [8], [10]. Como a qualidade do sinal depende do alinhamento, dentre outros fatores como palinicidade da frente de onda, busca-se uma capacidade ideal de apontamento (beam steering) com resolução de velocidade angular e cobertura angular conforme apresentado na TABELA 3. A estrutura funcional simplificada de um sistema de comunicação de dados empregando laser pode ser vista na Fig. 2. Os módulos de transmissão e recepção são conectados à linha da antena (telescópio) através de um divisor do feixe (beam splitter), em função do compartilhamento da linha de antena, sendo Processador PAT responsável pelo processo de controle de direcionamento do conjunto da antena. O processo de transferência de dados pelo enlace fotônico é gerenciado pela Interface Integrada de Dados do Satélite, que recebe informação de acoplamento (tracking) do processador PAT.Para estabelecer um enlace óptico no espaço é necessário inicialmente dispor de informação que permita prever a direção e posicionamento prováveis dos dois terminais de comunicação no espaço. Devido à incerteza de posicionamento inicial das antenas e de posicionamento instantâneo do satélite, um feixe de maior abertura deve ser emitido para iluminar o satélite e permitir inicializar a etapa de apontamento e aquisição. Após a fase de aquisição, o sistema comuta suas funções para executar a fase de tracking, quando então o sinal de laser de menor abertura é monitorado pelo PAT na função de controle e compensação de posicionamento das antenas. Em uma primeira aproximação, a equação que define a potência recebida por um enlace direcional óptico é similar à conhecida de um enlace de microondas, como na equação 1 abaixo [9]. Os fatores e representam, respectivamente, o ganho da antena transmissora e receptora, a potência de saída gerada no transmissor, constitui a perda em espaço livre (free-space path loss) do sinal e .é a margem do enlace que permita ao receptor decodificar o sinal recebido de forma apropriada (respectivamente 74 e 5 dB para enlace óptico e RF no exemplo da TABELA 2). Para estabelecimento do enlace de comunicações óptico, é necessário seguir uma sequência de passos que permitam a detecção do sinal mesmo em condições de linha de visada contra o Sol. A Fig. 3 e a Fig. 4 apresentam respectivamente a sequência a ser seguida e uma representação da situação operacional. No tracking heterodino, a frequência do sinal recebido é misturado com um sinal gerado internamente com frequência diferente, gerando assim uma frequência intermediária. Na detecção óptica homodina, a frequência do sinal gerado internamente no oscilador local é idêntica à do sinal recebido, inclusive com compensação do efeito doppler. Em 2008, o DLR alemão fez uso com sucesso de detecção homodina combinada à demodulação de sinal BPSK. A transmissão de um sinal com uma portadora em 1064 nm (Nd:YAG) e com uso de um telescópio de 100mm de diâmetro, tem-se uma divergência de 10rad e, consequentemente, o eixo de transmissão e do receptor devem estar alinhados no eixo com precisão melhor que 0,5rad. [2] Somente durante a fase estável de tracking homodino são efetuadas as transmissões de dados, sendo mantido o ângulo entre a linha de visada e o feixe transmitido dentro dos limites previstos para este enlace óptico. O requisito de manutenção do alinhamento entre antena transmissora e receptora, apesar das velocidades relativas e eventuais vibrações mecânicas, realça a necessidade de elevada eficiência do sistema de controle tanto nos dispositivos mecânicos quanto nos circuitos eletrônicos e algoritmos empregados na predição de posicionamento em função velocidade relativa. III. ARRANJO EXPERIMENTAL Tipicamente, os sistemas embarcados de comunicação a laser possuem planos focais distintos para aquisição, tracking e recepção de dados, em função dos requisitos de campo de visada (FOV) próprios, além da característica de largura de faixa do detector empregado na recepção. Visando a redução de custo, peso, volume e consumo de energia nos mecanismos, tecnologias têm sido desenvolvidas para permitir um mesmo plano focal para operação simultânea de controle de aquisição/tracking e leitura do sinal pelo receptor do sistema. Alguns exemplos de modelos diversificados já propostos e implementados servem como base funcional da estrutura mecânica óptica a ser adotada. Nas Fig. 5 e Fig. 6, pode-se visualizar alguns destes modelos. Na Fig. 7 pode-se visualizar o modelo escolhido para as provas de avaliação do estudo. O projeto da etapa de controle PAT tem como ponto principal a escolha do sensor de imagem que cumpra os requisitos necessários do sistema, em especial a tolerância à radiação e aos ciclos térmicos. Foram selecionadas duas linhas de investigação possíveis: a. Charge Couple Device (CCD) e b. CMOS Active Pixel Sensor. Um resumo comparativo das duas tecnologias e suas características relevantes ao projeto proposto é apresentado na TABELA 4. Os sensores de imagem CCD são empregados em larga escala nos satélites nas funções de captura telescópica de imagens, sensores estelares de navegação (star track) e sensores solares desde os anos 70, em função de sua resolução elevada, compactação e qualidade da imagem. A busca de soluções que atendam aos requisitos de tolerância à radiação cósmica, além dos ciclos térmicos inerentes a órbitas LEO heliosíncronas, tem direcionado as pesquisas em andamento para a tecnologia CMOS Active Pixel Sensor [10]-[29]. Em relação ao CCD, esta tecnologia dispõe de consumo de potência mais reduzido, circuitos de interfaceamento mais simplificados e recursos de acesso à leitura que permitem a implementação de algoritmos otimizados de imageamento. Adicionalmente, os sensores CMOS são menos susceptíveis a centroid errors devido a impacto de partículas radioativas e smear variável, devido a sensibilidade em coluna a pontos de iluminação intensa. O sensor empregado no estudo, STAR- 1000 CYIISM1000AA-HFC [29], foi fabricado pela Cypress Semiconductor Corporation [11], e foi objeto de avaliação nos programas LCDSS (Low Cost Digital Sun Sensor) e OISL ( Optical Inter Satellite Link) [3], este sensor está qualificado para emprego espacial, sendo suas características apresentadas na TABELA 5 e é apresentado na Fig. 8. Em função de sua adequação pelas características apresentadas e disponibilidade de fornecimento, o sensor STAR-1000 CYPRESS foi selecionado para emprego neste projeto. Para permitir a avaliação de características, comportamento, além da realização de testes e desenvolvimento de interfaces adequadas ao emprego do sensor escolhido, a ferramenta apropriada é o evaluation kit desenvolvido pela própria empresa fabricante, apresentado na Fig. 9. Este kit disponibiliza, em um conjunto multifuncional, os recursos de seqüenciador para leitura, memória e acesso por interface firewire aos sinais de uma placa analógica contendo o sensor de imagem. IV. IMPLEMENTAÇÃO DO SISTEMA DE CONTROLE Na implementação do sistema de controle de aquisição e tracking do sinal laser de comunicação de dados, foi definida uma estrutura em blocos apresentada na Fig. 10, a qual incorpora os recursos necessários à realização das funções previstas pelo sistema. Fig. 10– Estrutura em blocos do sistema de aquisição. Tendo em vista a necessidade de integração e redução de consumo, a opção de implementação dos circuitos foi a construção de descrição empregando linguagem VHDL (Very High Speed Integrated Circuit Hardware Description Language) que permite a síntese de toda a etapa lógica de acesso ao Sensor CMOS STAR-1000 e de processamento da imagem em dispositivo FPGA (Field Programmable Gate Array), ou seja, os módulos de controle, endereçamento de linha/coluna, interfaces lógicas com sistemas mecânicos e com o receptor são traduzidas em descrições lógicas e sintetizadas. O módulo de conversão analógico / digital inicialmente foi designado como circuito independente externo, porém pode ser incorporado à síntese, caso seja substituído o FPGA utilizado. Os modos de operação empregados para o processamento das informações incluem time difference sampling (TDS), correlated double sampling (CDS) e correlated quadriple sample (CQS), sendo a imagem gerada por aquisição de frame completo de imagem ou janelas selecionáveis (windowing) conforme a fase em andamento. Um ponto crítico do projeto mecânico é o controle da estabilidade térmica de todo a estrutura focal, o qual é imprescindível para manter a margem de deslocamento focal e alinhamento do feixe dentro dos requisitos necessários, em função dos coeficientes de dilatação inerentes aos materiais empregados. A escolha dos materiais empregados, principalmente onde se mesclam lentes com suportes metálicos e materiais compostos é criteriosa dentro das características desejáveis de comportamento do conjunto. V. CONSIDERAÇÕES FINAIS O emprego de comunicações ópticas amplia muito as capacidades de transmissão de dados entre satélites e com a estação de solo, em relação às portadoras em RF. O uso de modulação BPSK homodina já foi comprovada operacionalmente, mas seu emprego requer capacidade de controle de apontamento de alta precisão (0,5rad). Este projeto apresentou um arranjo experimental, cujos resultados podem levar a um sistema capaz de aquisição e tracking, tendo em conta os requisitos de ambiente espacial e disponibilidade de mercado. Sensores de imagem CMOS Active Pixel Sensors estão sendo utilizados, pois possuem maturidade tecnológica suficiente e disponibilidade de componentes qualificados como hard-rad, como o STAR-1000 CYPRESS empregado neste trabalho. A descrição em linguagem VHDL permite que o sistema possua portabilidade para emprego na sua totalidade ou de forma modular em outros projetos, além da síntese não estar dependente de componentes específicos FPGA, mas aberto a alterações de componentes que se façam necessárias. Além da aplicação apresentada para transferência de dados entre satélites e com estações de terra, a linha de desenvolvimento abre perspectivas para seu emprego em comunicações seguras, nos cenários aeronáuticos e terrestres, entre veículos terrestres, navais ou aéreos, o que torna-se um recurso estratégico, face a necessidade de conceber, operar e defender as redes de comunicações para garantir a segurança e eficiência dos enlaces. "
}