{
    "id": 129,
    "titulo": "modelo empírico para a predição da distância de aquisição do seeker de um míssil",
    "autor": "bruno morato arnaut, denise b. ferrari, ricardo suterio",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2013/st/I_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Muitos problemas em engenharia requerem experimentação para a melhor compreensão dos fenômenos físicos. A partir daí, modelos matemáticos empíricos podem ser construí- dos para representação e análise do sistema de interesse. Este trabalho propõe um modelo empírico para a predição da distância de aquisição do seeker de um míssil, a partir de técnicas de projetos e análise de experimentos e de dados fornecidos pelo fabricante do míssil. A predição da distância de aquisição é realizada em função de três fatores: altitude do alvo, ângulo de aspecto e seção reta radar. O modelo obtido é analisado, mostrando-se adequado para a aplicação em simuladores de missões de defesa aérea.",
    "texto": "  I. INTRODUÇÃO O projeto e a análise de experimentos tem um papel relevante ao longo do ciclo de vida de sistemas de engenharia, auxiliando o desenvolvimento de produtos, a qualificação de processos produtivos e a melhoria das operações. Dentre os principais aspectos que caracterizam esta disciplina, pode-se destacar: (a) dispõe de um conjunto de técnicas e métodos científicos que permitem ao experimentador escolher as abordagens de planejamento e execução do experimento, bem como o emprego de ferramentas estatísticas para a análise dos dados obtidos; (b) favorece o entendimento dos fatores que podem influenciar ou não o desempenho do sistema, a fim de contribuir para as especificações de projeto e melhoria de produtos e processos; (c) por intermédio das ferramentas estatísticas de análise dos dados, apoia as decisões na defini- ção de requisitos e na escolha de soluções de projeto; (d) permite construir modelos matemáticos empíricos para o sistema de interesse, podendo-se inferir sobre seu comportamento, dentro dos limites do espaço amostral; (e) propicia, pela análise dos resultados obtidos a partir de modelos empí- ricos, validar os resultados de modelos teóricos. Além dos aspectos acima listados, os modelos empíricos gerados a partir de projetos de experimentos podem ser empregados em simulação. Maiores informações sobre modelos de simulação aleatórios e determinísticos podem ser obtidas nos trabalhos publicados por Kleijnen [6] e Sacks [7].A simulação de sistemas é geralmente empregada no desenvolvimento de novos produtos, na análise de ambientes operacionais e no treinamento de pessoal, reduzindo os custos de projeto e operações. O uso de modelo matemático empírico é particularmente útil quando a complexidade, o custo de simulação ou outros motivos específicos tornam inviável o desenvolvimento ou aplicação de modelo determinístico (modelo teórico ou mecanicista). A motivação do presente trabalho é aplicar técnicas de projetos e análise de experimentos em um problema específico de simulação do comportamento do seeker de um míssil, em que as únicas informações disponí- veis são as tabelas de dados fornecidas pelo fabricante do míssil. O presente estudo partiu de uma necessidade do Instituto de Estudos Avançados (IEAv), órgão diretamente subordinado ao Departamento de Ciência e Tecnologia Aeroespacial (DCTA), de estudar como transformar os dados de distância de aquisição do seeker de um míssil em uma função contínua para usar em um plugin da plataforma AEROGRAF – simulador que agrega um conjunto de funcionalidades, em um ambiente georreferenciado, para auxílio à decisão e avaliação de cenários táticos no planejamento de missões de defesa aérea [3]. Assim, este artigo tem como objetivo construir um modelo para predição da distância de aquisição do seeker de um míssil, em função das variações de altitude do alvo, ângulo de aspecto e seção reta radar. O artigo está organizado da seguinte maneira: primeiramente contextualiza-se o problema, identificando a necessidade do modelo empírico e caracterizando a aplicação do seeker em sistemas de armas de mísseis. Em seguida, os fundamentos de análise de variância (ANOVA) e o projeto fatorial para a construção de um modelo para a previsão da distância de aquisição do seeker são desenvolvidos. Por fim, os resultados obtidos são discutidos e algumas conclusões sobre o estudo são apresentadas. II. CONTEXTUALIZAÇÃO DO PROBLEMA Nos anos 90, o então projeto AEROGRAF foi criado com o objetivo de fornecer módulos de software para atender às necessidades da Aeronáutica em Inteligência (INT), Geoprocessamento (GEO), Planejamento de Defesa Aérea (PDA) e Planejamento de Missão Aérea (PMA) para auxiliar a decisão e avaliação de cenários táticos em ambiente georreferenciado. A partir de 2003, os módulos foram integrados em um único sistema (plataforma AEROGRAF), com a possibilidade de agregar funcionalidades por meio de plugins - programas onde são adicionadas funções a outros programas maiores, provendo alguma funcionalidade especial ou específica [3]. A necessidade do modelo matemático empírico que representasse a distância de aquisição do seeker do míssil em fun- ção dos fatores altitude do alvo, ângulo de aspecto e seção reta radar originou-se da necessidade de simular o comportamento deste sistema na plataforma AEROGRAF. O seeker é um elemento do míssil que tem um importante papel no seu guiamento. Ele tem como funções, dentre outras: prover as medidas de movimento do alvo requeridas pelos mecanismos de guiamento, seguir o alvo por meio de um sensor (e.g.: radar, infravermelho, laser ou ótico), rastrear o alvo continuamente depois da aquisição, medir a variação angular da linha de visada com o tempo, estabilizar o míssil em relação aos desvios de rotas [2]. Sioriuis [2] mostra alguns aspectos que indicam complexidade deste subsistema, destacando-se o problema de aberra- ção (ou refração) do erro angular, de característica não linear, e o parasitic attitude loop, que pode alterar a característica de resposta do míssil e, em consequência, aumentar a perda da distância de aquisição do alvo. Diante da complexidade associada ao desenvolvimento de um modelo físico para o seeker, aliada à inexistência de maiores informações a respeito do projeto do míssil, a aplicação de métodos de projeto e análise de experimentos se mostra uma alternativa racional para a construção de um modelo matemático empírico para representar a distância de aquisi- ção do seeker. Para tanto, conta-se com a disponibilidade de dados tabulados para a distância de aquisição, em função de níveis de altitude do alvo, ângulo de aspecto e seção reta radar. O modelo assim obtido pode ser prontamente utilizado em um plugin da plataforma AEROGRAF. III. ANOVA PARA OBTENÇÃO DE MODELO EMPÍRICO Análise de variância (ANOVA) é uma das técnicas mais utilizadas no campo da estatística indutiva (inferencial), sendo fundamental em projeto e análise de experimentos. Basicamente, essa técnica permite ao projetista ou experimentador verificar o quanto um ou mais fatores e suas correlações influenciam na resposta de um sistema ou processo. Quando o experimento envolve dois ou mais fatores, a literatura aponta como abordagem adequada a técnica Projeto Fatorial [1], por permitir avaliar a influência de todos os fatores e suas interações, simultaneamente, na resposta do sistema. Num projeto com três fatores, por exemplo, o modelo estatístico linear seria dado por: onde são as observações (medidas) da resposta do sistema, são as médias das observações para cada combinação de fatores e replicação  da medida, é uma constante que representa a média total das observações,  é a variável que indica o desvio da média devido ao nível do fator ,  é a variável que indica o desvio da média devido ao nível do fator é a variável que indica o desvio da mé- dia devido ao nível do fator e são os erros aleatórios (resíduos) associados às observações. Para determinar se há efeito dos fatores analisados e de suas interações sobre a resposta do sistema, são realizados testes de análise de variância (teste ANOVA). Para análise da influência do fator na resposta, por exemplo, tem-se o seguinte teste ANOVA: Teste para os efeitos principais dos outros fatores podem ser construídos de modo análogo. Para análise da interação entre fatores, por exemplo, e, tem-se: Por outro lado, o teste ANOVA é válido somente quando as seguintes premissas forem satisfeitas [1]:  i normalidade - resíduos normalmente distribuídos, com variáveis independentes, média zero e variância constante;  ii constância da variância - resíduos independentes em relação à resposta predita; e, numa menor gradação de importância,  iii independência - não existência de correlação entre os resíduos. A ANOVA, além de propiciar a análise da influência dos fatores e de suas interações na resposta do sistema, permite ainda, quando os fatores são quantitativos, com o uso de métodos de regressão linear, determinar uma equação que relaciona a resposta do sistema com os fatores (modelo matemático empírico). Assim, por meio do modelo matemático e dentro dos limites do espaço amostral estudado, pode-se predizer a resposta do sistema. As etapas de desenvolvimento de modelo matemático, a partir de dados experimentais quantitativos, são consagradas na literatura [1], sendo sumarizadas a seguir: 1.Obter as respostas do sistema de interesse (observações) para todas as combinações de níveis de fatores. 2.Realizar a análise de variância dos dados observados, determinando os seguintes parâmetros:  i soma dos quadrados da resposta do sistema devido às fontes de variação (fatores e suas interações);  ii grau de liberdade das fontes de variações;  iii grau de liberdade dos resíduos;  iv soma dos quadrados médios devido às fontes de variações e aos resíduos; e  v fatores / de cada fonte de variação para o teste da hipótese . 3.Identificar, pelo teste ANOVA, as variáveis que influenciam a resposta , determinando um modelo estatístico linear que melhor represente o comportamento do sistema. 4.Checar as hipóteses de normalidade dos resíduos do modelo obtido. 5. Caso o modelo estatístico de 1ª ordem não atenda às hipó- teses de normalidade, aplica-se, empiricamente, uma transformação de variável ou aumenta-se a ordem do modelo através de métodos de regressão linear, tendo por base os gráficos de interação dos fatores. Repete-se as etapas 3. e 4. até que as hipóteses de normalidade sejam satisfeitas. 6.Determinar o fator 0 para inferir sobre a significância dos fatores e de suas interações para o modelo. Essas etapas são, a seguir, aplicadas no desenvolvimento do modelo para a predição da distância de aquisição do seeker. Os cálculos e testes estatísticos são realizados com o apoio do software livre R [5], que é uma linguagem e um ambiente desenvolvidos para a computação estatística e gráfica. IV. MODELO EMPÍRICO PARA A PREDIÇÃO DA DISTÂNCIA DE AQUISIÇÃO DO SEEKER Deseja-se representar a distância de aquisição do seeker de um míssil (variável de resposta) como função de três fatores, a saber:  i altitude do alvo;  ii ângulo de aspecto; e  iii seção reta radar (012, do inglês radar cross section). Os dados utilizados na construção do modelo são obtidos do manual do fabricante, que dispõe de uma única medida da distância de aquisição do seeker, para cada combinação dos fatores listados acima. Ao todo, são coletadas 60 observações para a distância de aquisição do míssil. Visando descaracterizar os dados fornecidos pelo fabricante, os valores da distância de aquisição do seeker, em quilômetros, são, neste artigo, divididos pela maior distância de aquisição (valor considerado base). A Tabela I apresenta os níveis dos fatores considerados e os valores relativos de distância de aquisição correspondentes. Como há uma única observação da distância de aquisição para cada combinação de fatores (projeto fatorial sem replicação), não seria possível determinar os erros aleatórios (resíduos) e, portanto, o modelo estatístico linear de projeto fatorial com três fatores da Equação ( 1 ) não poderia ser realizado para a análise de variância. Para resolver o problema de projeto fatorial sem replicação, Montgomery [1], ao estudar a técnica Projeto Fatorial 2, propõe a redução do modelo estatístico linear, negligenciando os fatores e as interações de fatores que não sejam significativos na resposta do sistema. Assim, a partir do modelo reduzido, cria-se uma replicação oculta e passa-se a ter grau de liberdade para a análise de variância e, consequentemente, para a estimação do erro. Essa abordagem é aplicada a seguir, visando determinar o modelo estatístico linear reduzido que represente as observações da distância de aquisição, em fun- ção dos fatores considerados. A fim de verificar a significância dos efeitos dos fatores e de suas interações na distância de aquisição do seeker, pode-se utilizar a soma dos quadrados médios dos fatores e de suas interações para identificar termos negligenciáveis. A Tabela II apresenta os resultados obtidos para graus de liberdade   ), soma dos quadrados  2L e soma dos quadrados mé- dios  2LM para os fatores considerados e suas interações. Como pode ser verificado na Tabela II, o efeito da interação de terceira ordem entre os fatores Altitude, Ângulo e Seção Reta Radar  012 apresenta valor de quadrado médio na ordem de 10 vezes inferior à menor soma de quadrados, podendo, então, ser negligenciado. Ao eliminar o elemento de maior ordem, tem-se um modelo estatístico linear reduzido, dado por: com \t~\tQ 0, R independentes; \t = \t1, 2, 3, 4; \t = \t1, 2, 3, 4, 5; \t = \t1, 2, 3; e, consequentemente,  ~\tQS\t + N + O + 1 + NO + N1 + O1 + \t , R2T em que: : resposta (distância de aquisição do seeker) para o i- ésimo nível de altitude do alvo, com o j-ésimo nível para o ângulo de aspecto e k-ésimo nível para seção reta radar; : constante (distância de aquisição média); N: efeito da i-ésima altura do alvo; O: efeito do j-ésimo ângulo de aspecto; 1: efeito da k-ésima seção reta radar; NO\t;\t N1\t;\t O1: efeitos da interação entre os fatores; : erro aleatório (resíduo) para o i-ésimo nível de altitude do alvo, com o j-ésimo nível para o ângulo de aspecto e k- ésimo nível para seção reta radar. O próximo passo consiste em realizar a análise de variância para o modelo reduzido de 1ª ordem (Equação ( 2 ) ). Os testes de hipóteses são feitos para nível de significância V = 0.01. Os resultados obtidos encontram-se na Tabela III. Dos resultados obtidos e indicados na Tabela III, verifica-se que os efeitos de todas as fontes de variação são significativos, já que apresentam valores- Pr >F inferiores ao nível de significância 0.01. Antes de realizar inferência com base no modelo obtido, é preciso verificar se as hipóteses do modelo são válidas:  normalidade; e homoscedasticidade (variância constante) dos erros. A Fig. 1 mostra o gráfico de quantis para os resí- duos. Como pode ser observado, o modelo de 1a. ordem da Equa- ção ( 2 ) não representa bem os dados em análise, pois apresenta violações às hipóteses a respeito dos termos aleatórios, já que os resíduos apresentam desvios significativos em torno da reta e, assim, não possuem uma distribuição normal. Conclusão semelhante pode ser obtida através do teste ShapiroWilk [4] [5], para o qual se obteve o valor-\u001D\t = \t6.384E-06. Ainda, os gráficos de interações entre fatores, mostrados na Fig. 2., sugerem modelos matemáticos de ordem mais elevada. Levando-se em conta o número de graus de liberdade disponíveis, podem ser avaliados modelos de 2a. até 4a. ordem. Ao testar os modelo de 2a.e 3a. ordem, verifica-se também violação à hipótese de normalidade dos erros aleatórios, como pode ser constatado no gráfico da Fig.3. e da Fig. 4., respectivamente. Os resultados da ANOVA para o modelo de 4a. ordem, mostrados na Tabela IV, indicam significância dos efeitos principais para todos os fatores, bem como efeitos quadráticos para altitude e efeitos até 4a. ordem para o fator ângulo de aspecto, incluindo suas interações com os fatores altitude e seção reta radar. Assim, um modelo estatístico de 4a. ordem para predição da distância de aquisição do seeker, considerando o princípio da hierarquia, pode ser dado por: O gráfico de normalidade dos resíduos do modelo da Equa- ção ( 3 ) , apresentado na Fig. 5., não apresenta desvios significativos, de forma que a hipótese de normalidade não deve ser rejeitada. A mesma conclusão é obtida pelo teste ShapiroWilk, para o qual se obtém valor- = \t0.7502. O gráfico dos resíduos versus distância de aquisição predita, referente ao modelo da Equação ( 3 ) é mostrado na Fig. 6. Verifica-se que os resíduos distribuem-se em torno de zero, não apresentando nenhum padrão sistemático, indicando assim a homoscedasticidade do modelo. Conclusão semelhante pode ser obtida através do teste Bartlett [1] [4] [5], para o qual se obteve o valor-\t = 0.3231 referente à variância da distância de aquisição devido ao fator altitude, valor-\t = \t0.8594 devido ao ângulo de aspecto e valor-\t = 0.01307 devido à seção reta radar. Como as hipóteses de normalidade do modelo da Equação ( 3 ) estão satisfeitas, pode-se agora, por meio de técnicas de regressão linear [1], determinar o modelo matemático empírico para a predição da distância de aquisição do seeker do míssil. Os coeficientes do modelo regressão são determinados no software 0, de forma que a equação da distância de aquisição  , em função dos fatores altitude  N, ângulo de aspecto  O e seção reta radar  1, é dada por:   O modelo da Equação ( 4 ) apresenta 0 = 94,36%, ou seja, explica 94,36% da variabilidade observada na resposta. O 0 ajustado é igual a 92,93%, indicando a aderência do modelo. Algumas curvas de superfície do modelo obtido são apresentadas na Fig. 7. Elas seguem o comportamento inicialmente previsto nas curvas de interações de fatores da Fig. 1. A distância de aquisição do modelo de predição do seeker apresenta o seguinte comportamento: - a maior distância de aquisição ocorre para seção reta radar de 20\t, altitude de 20\txy' e ângulo entre 0\t*\t45° e 135\t*\t180°;  - a menor distância de aquisição ocorre para ângulos de aspecto em torno de 90°, altitude 0\txy' e seção reta radar de 2\t; - apresenta três concavidades tanto para variação do ângulo de aspecto versus seção reta radar quanto para variação do ângulo de aspecto versus altitude, com pontos máximos entre 0\t*\t45° e 135\t*\t180°, e um ponto de mínima distância de aquisição para ângulos em torno de 90°; - a distância de aquisição apresenta um aumento parabólico com o aumento da altitude do alvo e da seção reta radar. V. CONSIDERAÇÕES FINAIS O presente estudo partiu de uma necessidade do Instituto de Estudos Avançados (IEAv), órgão diretamente subordinado ao Departamento de Ciência e Tecnologia Aeroespacial (DCTA), de estudar como transformar dados tabelados de distância de aquisição do seeker de um míssil em uma função contínua para usar em um plugin da plataforma AEROGRAF. Técnicas de projeto e análise de experimentos foram utilizadas para determinação de um modelo matemático empírico. A metodologia mostrou-se eficiente para a solução do problema, tendo sido possível obter um modelo capaz de representar satisfatoriamente o comportamento do seeker do míssil em estudo. Pelo estudo, pode-se concluir que: - mesmo o experimento não possuindo replicações, é possí- vel, através da eliminação de fatores que não sejam significativos na resposta do sistema, realizar a análise de variância; - a análise das curvas de interações dos fatores e o entendimento do modelo teórico propiciou encontrar o modelo empí- rico que atende aos anseios do cliente; - as técnicas de projetos de experimentos contribuem para determinar um modelo empírico para um estimador da distância de aquisição do seeker do míssel de interesse, em que a complexidade do modelo e a falta de informações do projeto são restrições importantes para modelagem do sistema."
}