{
    "id": 134,
    "titulo": " simulação de antena radar em enlaces analógicos a fibra óptica",
    "autor": "felipe streitenberger ivo, olympio luchini coutinho, wilton ney do amaral pereira",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2013/st/VIII_3.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Sistemas de emulação de sinais radar têm sido utilizados pela Força Aérea Brasileira com a finalidade de testar receptores de guerra eletrônica embarcados. Dentre os diversos parâmetros radar simulados por esses sistemas, o tipo de varredura e diagrama de radiação da antena radar é uma importante funcionalidade a ser considerada, geralmente implementada por meio de atenuadores variáveis instalados na saída de radiofrequência (RF). Este trabalho apresenta uma nova técnica de simulação das características da antena radar, implementada através da variação do ganho de potência de um enlace analógico a fibra óptica, controlado por meio de um Instrumento Virtual (VI) construído em LabVIEW. O enlace a fibra óptica é utilizado com o objetivo de transmitir os sinais de RF emulados para uma antena remota. A comprovação desta técnica é realizada por meio de formulação teórica e uma demonstração experimental.",
    "texto": "  I. INTRODUÇÃO O emprego de equipamentos capazes de emular assinaturas de sinais de radar em campanhas de avaliação operacional (AVAOP) tem permitido à Força Aérea Brasileira (FAB) avaliar a eficiência de receptores embarcados de guerra eletrônica, principalmente sistemas de alerta radar (Radar Warning Receiver - RWR), com grande eficácia e baixo custo. Uma das principais características destes equipamentos é a simulação do diagrama de radiação e do tipo de varredura da antena, parâmetros estes relacionados diretamente com o tipo de aplicação do radar. Em geral, a simulação das características da antena é realizada a partir do controle de potência na saída de um gerador de RF, cujo sinal é irradiado através de um conjunto de antenas fixas em direção ao sistema receptor sob AVAOP [1]. Este trabalho apresenta uma nova técnica de simulação das características da antena radar, implementada através da variação do ganho de potência de um enlace analógico a fibra óptica, controlado por meio de um Instrumento Virtual (VI) construído em LabVIEW. O enlace a fibra é utilizado com o objetivo de transmitir os sinais de RF emulados para uma antena remota. A comprovação desta técnica é realizada por meio de formulação teórica e uma demonstração experimental. Este trabalho está organizado em sete seções. Na seção II são apresentados os principais parâmetros usados para classificação de um radar em receptores de guerra eletrônica. Na seção III, os aspectos teóricos do enlace analógico a fibra óptica com modulação externa são explorados, tendo como principal foco efetuar uma revisão da formulação do ganho de potência de RF do sistema e a influência da potência óptica da fonte laser no estabelecimento da potência de RF do sinal de saída. Na seção IV, a formulação matemática utilizada para simular os parâmetros da antena por meio do controle da potência da fonte óptica do enlace a fibra óptica é apresentada. Na seção V, é apresentada a interface do simulador de antena radar. Na seção VI, o experimento e os resultados encontrados para a demonstração de conceito são apresentados. Na seção VII, as conclusões são apresentadas. II. PARÂMETROS DE UM SIMULADOR DE AMEAÇA RADAR Um emulador de ameaça radar deve ser capaz de emitir um sinal de RF em direção a um receptor, cujas características devem ser as mais semelhantes possíveis do sinal radar que se deseja emular. Dentre os parâmetros do sinal radar que um emulador de ameaça deve ser capaz de gerar, destacam-se [01]: a) Modo de operação: dividem-se em radares de onda contínua (Continuous Wave - CW) ou pulsado (Pulsed Radar - PR). O radar CW caracteriza-se por emitir continuamente energia eletromagnética [02]. Já os radares pulsados utilizam um trem de pulsos para modular um sinal de portadora de RF. Na Fig. 01 está ilustrado um exemplo típico do sinal de modulação de um radar com largura de pulso e intervalo de repetição de pulso (IRP). b) Largura de pulso (τ): definido como o tempo em que o transmissor emite durante um ciclo de operação do radar. O ciclo de operação de um radar pulsado é o tempo gasto para o radar transmitir um pulso e aguardar o sinal de eco de recepção [02]. c) Intervalo de repetição de pulsos (IRP): corresponde ao intervalo de tempo entre a transmissão de dois pulsos consecutivos. A frequência de repetição de pulsos (FRP) é inversamente proporcional a este parâmetro e determina a velocidade de atualização dos sinais de ecos recebidos pelo radar [02]. d) Frequência de operação (FO): é a frequência de sintonia do oscilador de RF do transmissor do radar. e) Padrão de irradiação antena radar: indica a forma de distribuição espacial da energia irradiada pela antena do radar, e pode ser considerado o mesmo tanto para transmissão quanto para recepção, de acordo com o teorema da reciprocidade [03]. A Fig. 02 ilustra um diagrama de radiação de uma antena radar traçado em coordenadas retangulares, com a indicação das suas principais características [03]. Em um sistema radar típico, três características do diagrama de radiação são de interesse: a largura do lóbulo principal, o ganho da antena e sua relação com os lóbulos laterais e traseiro [02]. f) Tipo de varredura da antena: os radares movimentam o feixe de suas antenas nas direções horizontal, vertical ou ambas [02]. A velocidade e o tipo de varredura da antena são definidos de acordo com a aplicação do radar. Radares de busca utilizam uma varredura circular de baixa rotação. Neste tipo de varredura, a estrutura física da antena movimenta-se de forma circular, com a finalidade de cobrir todos os 360º em torno da posição onde está localizado o radar [04]. Uma rotação completa da antena significa que todo o diagrama da antena do radar passou pelo alvo. Quanto mais veloz for a varredura, mais rápida será a atualização da apresentação dos alvos na tela do radar [04]. De forma ilustrativa, apresenta-se na Fig. 03 a variação temporal da intensidade de sinal transmitido por uma antena radar com varredura circular com período de rotação da antena de 12 segundos e tempo de 0,1 segundos de iluminação do alvo com intensidade máxima, considerando uma direção de irradiação fixa [04]. O tempo de iluminação do alvo é aqui definido como o tempo em que um receptor radar posicionado nessa direção recebe o sinal transmitido proveniente do lóbulo principal da antena transmissora. O conjunto de todos estes parâmetros define o que comumente é chamado de assinatura radar [02]. III. TRANSMISSÃO DE SINAIS RADAR ATRAVÉS DE FIBRAS ÓPTICAS Um fator limitante nos simuladores de ameaça radar, assim como nos radares convencionais, é o fato dos estágios de geração de RF estarem restritos a uma pequena distância dos estágios de amplificação/antenas [05]. Este limite de distância deve-se ao fato dos cabos coaxiais apresentarem altas atenuações em frequências mais elevadas, tornando-se um fator crítico para sistemas que operam com frequências a partir de alguns GHz [05]. O uso de guias de ondas também limita essa distância, em função do custo e restrições de espaço físico. De forma ilustrativa, a Tabela 01 apresenta atenuações típicas para um cabo de RF com comprimento de 500 m, para as frequências de 1,1, 1,8 e 3 GHz [05]. Devido às características baixa atenuação das fibras ópticas e alta imunidade à interferência eletromagnética (EMI), os enlaces analógicos a fibra óptica (EAFO) tornamse uma opção atrativa quando se deseja transmitir sinais de micro-ondas em médias ou longas distâncias [01]. Valores típicos de atenuação em torno de 0,2 dB/km são verificados em fibras ópticas comerciais. Outro fator de destaque em EAFO é a ampla largura de banda dos dispositivos optoeletrônicos atualmente disponíveis no mercado de componentes para telecomunicações, que facilmente podem atingir dezenas de GHz [01]. A Fig. 04 apresenta o diagrama esquemático de um EAFO para transmissão de sinais radar. Na Fig. 04, o sinal de RF com potência \u0003\u0004\u0005\u0006 é disponibilizado na entrada do enlace por meio de uma linha de transmissão casada com a impedância de entrada de RF do modulador.  representa a potência óptica do laser,  o fator de perdas ópticas do modulador,  a potência óptica de saída do modulador, Vπ é a tensão de meia onda do modulador, a impedância da linha de transmissão interna do modulador, terminada em uma carga casada e  a tensão de polarização aplicada ao modulador. Ainda na Fig. 04,  representa o fator de perdas ópticas no trecho de fibra óptica,  a potência óptica que incide no fotodetector,  a responsividade do fotodetector,  a impedância paralela do fotodetector e  é a impedância de carga do enlace. O sinal de RF de saída do enlace é representado por . Considerando que o modulador está polarizado em torno do ponto de maior linearidade da sua função de transferência, ou seja, o ponto de quadratura, que a impedância  está casada com a linha de transmissão que a conecta ao fotodetector, e também que os níveis de potência óptica são tais que podem ser desprezados os efeitos não lineares no circuito óptico. Nestas condições, o ganho de potência é expresso de acordo com o modelo apresentado na referência [06] como (1). O efeito da dispersão cromática não é abordado nesta equação, porém sua implicação no ganho de potência do enlace é discutida em detalhes na referência [06].  Observa-se em (1) que o ganho de potência de RF do enlace pode ser modificado a partir do controle da intensidade óptica acoplada na entrada modulador, , que por sua vez depende da corrente de bombeio do laser. Esta corrente pode ser alterada com a aplicação de um nível de tensão na entrada de modulação do controlador de corrente do laser. A técnica de simulação do padrão de irradiação da antena radar apresentada neste artigo consiste em variar a tensão de modulação do controlador de corrente do laser com o objetivo de variar o ganho de potência do enlace, mantendo a potência de entrada de RF do enlace constante. Com a variação da potência óptica do laser e a consequente variação do ganho do enlace, pode-se variar a potência do sinal de RF de saída. IV. MODELO MATEMÁTICO DO SIMULADOR A potência do sinal de RF na saída do enlace pode ser expressa por:  Alguns parâmetros relacionados ao  podem ser considerados constantes, pois os mesmos são intrínsecos aos componentes e, portanto, invariáveis do ponto de vista operacional do sistema. Assim pode-se definir  como uma constante do sistema, expressa por:  Substituindo (1) e (3) em (2), a potência do sinal de saída do enlace é expressa por: Na formulação aqui apresentada, considera-se que a corrente de bombeio do laser, , varia diretamente com a tensão aplicada na entrada de modulação do controlador de corrente, tal que: onde  é a constante de modulação de corrente do controlador de corrente e  a tensão aplicada na entrada de modulação do controlador. Considera-se ainda que a potência óptica do laser varia linearmente em função da corrente de bombeio, tal que:  onde  é a eficiência de modulação do laser. Finalmente substituindo a (5) e (6) em (4), verifica-se que a potência de RF na saída do enlace é diretamente proporcional ao quadrado da tensão aplicada na entrada de modulação do laser, tal que: Pode-se então implementar uma função VA(t) equivalente à função que expressa a variação temporal da intensidade de sinal transmitido por uma antena radar, ), por meio de um gerador de forma de onda arbitrária. Por conveniência, a relação entre a função ) e a função VA(t) pode ser escolhida como:  Substituindo (8) em (7) têm-se a expressão final do sinal de RF de na saída do enlace: V. INTERFACE DE OPERAÇÃO DO SIMULADOR O aplicativo controlador do simulador foi desenvolvido utilizando-se a instrumentação virtual (VI) em LabVIEW e a geração dos sinais foi realizada a partir de um a placa de geração de sinais arbitrários da empresa National Instruments. A interface gráfica do simulador foi modelada de forma a apresentar em uma tela amigável opções de controle de diagramas de antenas de radar real, de tal forma que o próprio usuário consiga navegar e ajustar estes parâmetros conforme a sua necessidade. Os principais parâmetros de controle são: ângulo de cobertura da antena, ângulo de meia potência, velocidade de rotação e seleção do tipo de varredura. O painel frontal do VI desenvolvido é apresentado na Fig. 05. VI. EXPERIMENTO DE DEMONSTRAÇÃO DE CONCEITO Na implementação do enlace a fibra óptica, foi usado um laser DFB com comprimento de onda de 1558,17 nm, potência óptica máxima de 20 mW. O modulador usado foi do tipo Mach-Zehnder, com tensão de meia onda Vπ = 3,7 V na frequência de 1 GHz, perdas ópticas por inserção de 2,4 dB, e faixa de frequência de operação de 0 a 20 GHz. A impedância de linha de alimentação é de 50 Ω. Para o teste em laboratório foi usado um comprimento de 1 km de fibra monomodo, da marca 3M e modelo FS-SC-7324, com perdas menores que 1 dB/km. O fotodetector empregado tem responsividade de 0,26 A/W, capaz de operar na faixa de frequência de 0 a 26 GHz, com impedância paralela zd=50 Ω. Os dados dos dispositivos acima citados referem-se à frequência de 1 GHz. O gerador de RF utilizado é capaz de operar em uma faixa de frequência de 10 MHz até 40 GHz com impedância de saída de 50 Ω. O sinal de RF detectado é aplicado a um amplificador MITEQ que apresenta um ganho 41 dB, para uma faixa de frequência de 0,5 a 18 GHz e possui uma impedância de entrada de 50Ω. É mostrado na Fig.06 o diagrama esquemático com os principais componentes utilizados para o arranjo experimental. O aplicativo de controle foi desenvolvido na versão 8.6 do LabVIEW e a interface de comunicação utilizada foi um barramento USB 2.0 conectando o computador à placa digital de geração de sinais NI 6251. A validação do simulador foi realizada experimentalmente utilizando um osciloscópio e um analisador de espectro como instrumentos de medidas, conforme apresentado no diagrama esquemático da Fig. 06. O ambiente de simulação da antena radar é apresentado em mais detalhes na Fig. 07. De forma a verificar experimentalmente se a corrente de bombeio do laser, , varia diretamente com a tensão aplicada, , a constante de modulação de corrente,\t, foi caracterizada conforme formulação matemática apresentada em (5). O resultado é apresentado na Fig. 08. O comportamento da constante KA foi proporcional e linear com a tensão aplicada na entrada de modulação do controlador. A partir do gráfico da Fig. 08 foi obtido o valor de 103,2 mA/V para esta constante. Com o intuito de se constatar a variação da potência óptica do laser PL em função da tensão de modulação aplicada VA, a potência óptica na saída do enlace também foi caracterizada. Nesta medida, as constantes KA e KL já estão sendo consideradas. O comportamento encontrado é apresentado na Fig. 09.   O ganho de potência do enlace óptico foi caracterizado em função da tensão de modulação aplicada. O resultado mostrado na Fig. 10. O comportamento do ganho de potência do enlace varia com o quadrado do nível de tensão de  modulação aplicado, e valida a equação do modelo matemático apresentado em (7). O experimento para demonstração do padrão de irradiação da antena radar foi realizado, selecionando um padrão de irradiação de uma antena do tipo sinc() onde é o azimute em relação à direção de máximo. O padrão de varredura escolhido foi circular, com 6 rotações por minuto. A tensão VA(t) gerada foi proporcional à raiz quadrada da função sinc(ϕ t)). Este sinal foi medido e acoplado na entrada de modulação do controlador de corrente do laser. sinal de tensão VA(t) está apresentado na Fig. 11(a). Na saída de RF do enlace foi ligado um detector de envoltória. O sinal de vídeo medido no detector está apresentado na figura 11(b). Não foi possível uma discriminação completa do padrão de varredura detectado na saída de RF do simulador, em virtude de baixa sensibilidade do detector de envoltória utilizado no experimento. VII. CONCLUSÕES Este artigo apresentou uma nova técnica de simulação do padrão de irradiação e tipo de varredura de antenas radar, que pode ser empregado em sistemas geradores de ameaça radar. O uso de enlace a fibra óptica para a transmissão dos sinais de RF gerados adiciona a vantagem de possibilitar o posicionamento remoto das antenas transmissoras nesses sistemas de simulação de ameaças radar. A técnica aqui apresentada para simulação dos parâmetros da antena radar acrescenta vantagem ao emprego de enlaces a fibra óptica, possibilitando a implementação dessa funcionalidade por meio do simples controle da fonte de corrente do laser usado no enlace, que constitui um circuito eletrônico de baixa frequência e de simples implementação. Se comparada com a  técnica usada em sistemas de RF  convencionais  baseadas no controle de atenuadores inseridos na saída de RF, a técnica apresentada neste artigo se torna bastante vantajosa, uma vez que não manipula diretamente os circuitos mais complexos de RF do sistema.  Os resultados experimentais comprovam a formulação desenvolvida. A simulação do padrão da antena radar, assim como a varredura ajustada no simulador é realizada e corresponde ao padrão programado no VI e gerado pela placa digital de geração de sinais  arbitrários, conforme está  ilustrado nas Fig. 11(a) e 11(b) . Como aplicação operacional do resultado deste trabalho, pretende-se que a simulação de sinais radar utilizando enlaces à fibra óptica para transmissão remota de sinais de RF seja uma ferramenta a ser empregada futuramente em testes de avaliação e certificação sistemas  de guerra eletrônica embarcados das diversas plataformas de defesa.   "
}