{
    "id": 136,
    "titulo": "arsenal de guerra testa sistema de pontaria para morteiro pesado",
    "autor": "Noticiário do Exército",
    "url": "https://www.eb.mil.br/web/noticias/noticiario-do-exercito/-/asset_publisher/U3X7kX8FkEXD/content/id/16590416",
    "tipo_documento": "Notícia",
    "rotulo": 3,
    "resumo": 0,
    "texto": "Rio de Janeiro (RJ) – O Arsenal de Guerra do Rio realizou uma série de testes para certificação do Sistema Inercial de Pontaria no Morteiro Pesado 120 mm. As atividades ocorreram nas instalações do Centro de Avaliações do Exército, entre os dias 9 a 12 de maio, em parceria com a empresa Safran Eletronics & Defense Brasil, produtora do equipamento. O sistema de pontaria do morteiro funciona a partir de sensores giroscópicos de última geração, correspondentes aos três eixos do Morteiro Pesado 120 mm M2A1 R. O sistema realiza a coleta e o processamento automático de diversos dados. Em seguida, a comunicação com o Sistema Gênesis de Direção e Controle de Tiro permite o nivelamento correto dos mecanismos de direção do armamento e correção do tiro, visando o alcance preciso dos alvos. O Sistema de Pontaria Inercial apresentou bom desempenho ao longo de toda a bateria de testes. O seu emprego poderá aumentar significativamente a capacidade tática do morteiro 120 mm no teatro de operações, tendo em vista a automatização e a celeridade nos procedimentos de análise e correção da pontaria. O sistema oferece ainda maior capacidade de localização de alvos, maior eficácia e precisão. O processamento eletrônico dos dados de artilharia também facilita o adestramento da tropa, que pode trabalhar com informações simples e de fácil interpretação, garantindo maior agilidade na compreensão da situação e no posicionamento correto do morteiro. A modernização constante das armas e equipamentos militares é uma prioridade para o Exército Brasileiro, que conta com arsenais de guerra e com a Diretoria de Fabricação para o desenvolvimento e incorporação de tecnologia militar de ponta. "
}