{
    "id": 137,
    "titulo": "redução de dimensionalidade por transformação linear adaptativa dependente de sinais aplicada a radares stap",
    "autor": "carlos cypriano vallim junior, felipe aurélio caetano de bastos, josé antonio apolinário junior",
    "url": "http://www.ebrevistas.eb.mil.br/CT/article/view/10852",
    "tipo_documento": "Artigo de Revista",
    "rotulo": 1,
    "resumo": "Uma das principais aplicações do processamento adaptativo de espaço-tempo (space-time adaptive processing – STAP) é a detecção de alvos por sistemas de radar de busca e vigilância, notadamente para radares aerotransportados e possivelmente em presença de sinais interferentes fortes. Todavia, o crescente número de elementos empregados na construção de arranjos de antenas (phased array antennas) produz um volume de dados de processamento que inviabiliza a implementação prática de processamento de posto completo e limita a aplicabilidade de técnicas de posto reduzido quando são considerados a atual tecnologia de hardware e os requisitos de sistemas de tempo-real. Este trabalho se propõe a pesquisar e especializar um método de redução de posto por transformação linear (reduced-rank linear transformation – RLT) adaptativa, dependente de sinal, ao processamento de espaço-tempo de sistemas de radar. Verificarse-á a redução de complexidade computacional resultante da aplicação do método RLT selecionado, bem como seu desempenho em termos de outras métricas do STAP, o qual será comparado com outras técnicas de redução de posto disponíveis na literatura. A fim de verificar seu desempenho, a aplicação do método RLT ao STAP será empregada no cenário de uma plataforma radar fixa em presença de clutter e jamming intensos. ",
    "texto": " 1. Introdução O processamento de espaço-tempo, usualmente referido como processamento adaptativo de espaço-tempo (space-time adaptive processing – STAP), é empregado em problemas de detecção, rastreamento e sensoriamento em radares [1]. O STAP consiste na exploração conjunta da dependência espacial (angular) e temporal (desvio Doppler) dos alvos de interesse a serem detectados por um sistema de radar e dos sinais interferentes a serem cancelados, para obter ganho de desempenho no processamento dos sinais de radar em relação ao processamento de sinais convencional, i.e., filtragem espacial e filtragem temporal, sequenciais e separadas. Embora o processamento de sinais de um sistema de radar convencional seja suficiente para a supressão de alvos fixos por plataformas radar fixas, o emprego de um processamento 2D (bidimensional), i.e., o STAP, por um radar fixo, e.g., um radar de vigilância aérea, permanece atrativo na presença de interferências cujos parâmetros estatísticos não são conhecidos a priori, conforme demonstrado experimentalmente em [2]. A aplicação do STAP por uma plataforma fixa na presença de níveis elevados de interferência permanece pouco explorada na literatura. Tal fato, aliado à potencial aplicação em projetos de radares fixos militares e civis em curso ou a médio e longo prazo, enseja maiores estudos nesse cenário. O problema de redução da dimensão dos dados recebidos no processamento de espaço-tempo atrai cada vez mais o interesse de novas pesquisas, haja vista que o crescente número de elementos sensores em arranjos de antenas produz volumes de dados desafiadores para o processamento de sinais, especialmente quando se contempla a aplicação em sistemas operando em tempo-real. Todavia, outra motivação relevante, que também direciona a pesquisa atual sobre o problema de processamento de posto reduzido, reside na escassez de dados de apoio para a estimação de parâmetros estatísticos em ambientes realistas, decorrente do caráter intrinsecamente nãoestacionário da componente de clutter radar, que limita a quantidade de dados disponíveis para estimação dos parâmetros estatísticos da interferência ambiental, durante o período de iluminação do alvo pelo radar [3]. Algumas técnicas de posto reduzido são capazes de sobrepujar, em cenários específicos, a insuficiência de dados de apoio descorrelacionados do sinal do alvo de interesse para estimar a matriz de covariância das interferências. Graças à aplicação dessas técnicas, essa matriz torna-se inversível, possibilitando a filtragem de espaço-tempo. Além disso, as técnicas de posto reduzido resultam, em algumas situações, em desempenho superior às técnicas de posto completo [3]. Alguns algoritmos de redução de posto têm atraído muito interesse por apresentar desempenho superior, em determinadas aplicações e sob determinadas circunstâncias, às técnicas de posto completo e viabilizarem aplicações práticas [4], [5]. Uma técnica de redução de posto estatística por transformação linear adaptativa popularmente empregada por aplicações de beamforming é o filtro de Wiener multiestágios (multistage Wiener filter – MWF) [6], [5]. Uma implementação eficiente da sua matriz de bloqueio pode ser obtida empregando a transformação de Householder [7]-[9]. Neste artigo objetiva-se especializar uma técnica de redução de posto por transformação linear (reducedrank linear transformation – RLT) adaptativa dependente de sinal para a inversão da matriz de covariância das interferências de modo a viabilizar o STAP em sistemas de radar. Espera-se obter redução de complexidade computacional e ganho de desempenho em relação às técnicas de posto completo para estimação de covariância. A especialização da técnica proposta será particularizada para o cenário de sistemas de radar fixos na presença de elevados níveis de interferência, com vistas a futuras aplicações práticas. Este artigo encontra-se organizado da seguinte forma: na seção 2 é apresentado o modelo de sinal de espaço-tempo aplicado a um cenário com radar aerotransportado dotado de arranjo linear uniforme (uniform linear array – ULA), além do processador STAP de interesse; na seção 3 aplica-se o método de filtragem de posto reduzido HMWF (householder multistage Wiener filter) ao processamento STAP de um radar móvel com ULA; na seção 4 explora-se a aplicação do método HMWF, de posto reduzido, a um radar fixo com arranjo retangular uniforme (uniform rectangular array – URA); na seção 5 apresentam-se os resultados das simulações implementadas; e, por fim, na seção 6 são discutidas algumas das conclusões obtidas, destacando-se as contribuições alcançadas. 2. Modelagem de sinais para ULA O processamento do receptor radar modelado pode ser ilustrado como na Fig. 1, na qual observase que toda a filtragem de espaço-tempo é realizada no estágio com rótulo STAP, cuja saída, Z , é comparada a um limiar de detecção. Considere-se um radar phased-array STAP móvel com um arranjo linear uniforme (ULA) com N elementos e intervalo de processamento coerente (coherent processing interval – CPI) que integra M pulsos coerentes (ou amostras temporais de slow-time). O intervalo de repetição de pulsos é amostrado com taxa 1/L, sendo L o número de amostras de fast-time. O transmissor do radar emite uma forma de onda pulsada, STX(t). O sinal de eco analítico recebido pelo n-ésimo canal de recepção, relativo ao alvo de interesse e convertido para banda-base, é dado pela expressão [3], [10] onde A tgt é a amplitude do eco, τtgt é o retardo de propagação eletromagnética, que abrange o tempo desde a emissão da forma de onda pulsada até a recepção do sinal de eco, = −2π τ ( ) f f c t + gt tgt c , f é a frequência da portadora, ftgt é a frequência Doppler devida ao movimento do alvo, é a frequência espacial do alvo, sendo e , respectivamente, os ângulos de elevação e azimute do alvo. Os sinais de eco são submetidos a filtros casados em cada canal para compressão de pulsos. Após a compressão de dados, o sinal de eco é dado por [3], [10]; sendo a largura de cada pulso e , f a função de ambiguidade do filtro casado implementado pelo estágio de detecção do receptor do radar. Amostra-se o sinal comprimido, mn , nos instantes , onde é o instante inicial do l-ésimo range gate, é a frequência de amostragem do intervalo entre pulsos sucessivos (PRI), sendo Bp a largura de banda do pulso e a resolução em alcance do radar. Portanto, o sinal amostrado pode ser expresso como [3], [10] onde ( ). A amplitude do sinal descrito pela equação anterior é máxima quando , isto é, equivalente à maximização de quando o l-ésimo range gate corresponde ao alcance do alvo de interesse. Portanto, o sinal comprimido, , corresponde ao nm-ésimo elemento do l-ésimo snapshot de espaço-tempo do CPI considerado, que compõe os dados de entrada do filtro STAP conforme anteriormente observado. O detalhamento de uma modelagem simplificada para as interferências (clutter, jamming e ruído) pode ser encontrada em [10]. O snapshot de espaço-tempo recebido pelo arranjo de sensores correspondente ao l-ésimo range gate, de dimensão M × N, é representado pela sua vetorização, r[ ] l ∈MN×1e descrito pela expressão [3] onde a componente de sinal é tg s gt, tgt . O steering vector de espaço-tempo é dado por s gt, tgt a tgt b tgt , onde indica o produto de Kronecker, sendo [3] respectivamente, as comίponentes espacial e temporal [3], λc é o comprimento de onda da portadora, d é espaçamento entre os elementos do arranjo de antenas, 𝛷𝛷tgt é o ângulo de azimute do alvo de interesse e 𝜛𝜛 tgt é a frequência Doppler, normalizada em relação à frequência de repetição de pulsos (pulse repetition frequency − PRF) do radar. O vetor interferência-mais-ruído de espaço-tempo, ί[l], resulta da soma das interferências (clutter e jamming) e do ruído presentes no l-ésimo range gate. Os snapshots recebidos pelo ULA são submetidos ao filtro de espaço-tempo, w∊ MN⨉1, produzindo a saída escalar complexa [3] A fim de maximizar a probabilidade de detecção, PD, aplica-se o filtro MVDR (minimum variance distortionless response) de espaço-tempo [3] sendo R = E[r[l]rH[l]] a matriz de covariância total de interferências e s=a(θtgt)⊗b(ϖtgt) o steering vector de espaço-tempo. Pode-se demonstrar [10] que o valor esperado da relação sinal-ruído-mais-interferência (signal-plusinterference-to-noise ratio – SINR), normalizada em relação à SINR ótima, E[ρ], é dado por onde K é a quantidade de amostras de apoio (snapshots de espaço-tempo) processados pelo filtro. Resolvendose a equação anterior, fazendo K = 2MN, por exemplo, obtém-se E[ρ]  0,5, o que resulta em uma diferença de aproximadamente 3 dB entre a SINR do filtro e a SINR ótima. Quando K = MN, obtém-se E[ρ] = 2/(MN + 1). Mesmo tal valor de K não constituindo quantidade de amostras de apoio adequada para o filtro MVDR-SMI, a aplicação do filtro HMWF é capaz de atingir desempenho satisfatório com quantidade de amostras igual ou inferior a K = MN, conforme será apresentado na seção 5. 3. HMWF em radar STAP móvel ULA A técnica HMWF com redução de posto é especializada nesta seção para aplicações de espaçotempo. Como no método MWF, o HMWF obtém uma redução de posto r por meio do truncamento do filtro no r-ésimo estágio; porém, distintamente, o bloqueio do sinal desejado é implementado por refletores de Householder, que são dados por [7], [8], [9] sendo h i a normalização da correlação cruzada entre o sinal de referência e os snapshots do i-ésimo estágio do filtro, que é colinear à direção do sinal de interesse, e hi,1 é o primeiro elemento do vetor hi. Os refletores de Householder possuem norma unitária e produzem uma rotação em torno do primeiro elemento do vetor unitário na direção do sinal de interesse. Na Eq. (10), u1 =[10…0]T. Com os refletores, constrói-se a matriz de Householder da seguinte forma [9] Pode-se facilmente demonstrar que a matriz de Householder é unitária, i.e., HHH = HHH = I, onde I é a identidade, e que sua primeira coluna é hi [9]. Essas duas propriedades implicam que as matrizes de bloqueio,bi, são obtidas a partir das demais colunas da matriz de Householder, i.e., Hί =[hίBί]. Aplica-se a técnica HMWF a um radar phased-array aerotransportado STAP com ULA, com N elementos e com CPI que integra M pulsos coerentes, de mesma modelagem que a apresentada na seção 2 e operando sujeito às mesmas condições de interferência. As técnicas de redução de posto, entre as quais o filtro HMWF, são capazes de contornar as restrições impostas por amostras de apoio reduzidas na estimação da matriz de covariância de espaço-tempo. A aplicação do HMWF resulta em um filtro de espaçotempo de posto reduzido, w , dado por onde R T r H = = HMWFRTHMWF E[ [ xr r l ] [ xH l ]] é a matriz de covariância de interferências após a redução R T de posto, r H = = HMWFRTHMWF é a matriz de transformação linear de E[ [ xr r l ] [ xH l ]] redução de posto, T , e s T s é o steering vector de espaço-tempo do sinal recebido após a redução de posto. 4. HMWF em radar STAP fixo URA Analogamente à seção precedente, modelar-se-á o filtro STAP de posto reduzido pela técnica HMWF implementada no receptor de um radar fixo com arranjo retangular uniforme. Consideramos um radar phased-array terrestre STAP, com URA composto por N elementos, integrando M pulsos coerentes e sendo construído segundo a geometria apresentada na Fig. 2, cujo CPI é esquematizado na Fig. 3. O CPI é composto por L snapshots de espaço-tempo de dimensão M × N, que são representados por vetores r l [ ]∊MN⨉1, dados pela mesma expressão da Eq. (1). O steering vector de espaço-tempo resulta do produto de Kronecker do steering vector temporal, de dimensão M × 1, dado por (6), pelo steering vetor espacial, de dimensão N × 1, dado 5. Simulações Nesta seção serão apresentados resultados de simulações usando algoritmos MVDR-SMI (MVDR sample matrix inversion) [3] de posto reduzido em um cenário com escassez de amostras de apoio. Os algoritmos de posto reduzido para comparação de desempenho com o HMWF na aplicação proposta são: componentes principais (principal components – PC) [11], [12], métrica espectral cruzada (cross-spectral mectric – CSM) [13], [14], [15] e o MWF [6]. Conforme detalhado em [10], foram simulados um radar phased-array aerotransportado móvel, dotado de ULA, e um radar phased-array terrestre fixo, dotado de URA. Os arranjos de antenas de ambos os radares possuem número total de elementos N = 16 com espaçamento de meio comprimento de onda da portadora. Os radares transmitem M = 40 pulsos por CPI, totalizando, portanto, MN = 640 graus de liberdade adaptativos do filtro de espaço-tempo. Ambos os radares possuem frequência de portadora de 1 GHz, PRF de 2,5 kHz, duração dos pulsos de 20 μs, potência de transmissão de pico de 700 W, alcance máximo de interesse de 60 km, velocidade máxima de interesse de 187 m/s e resolução em velocidade de 9,4 m/s. O alvo simulado possui frequência Doppler de 400 Hz e se situa a 10 km da posição radar. Em ambos os cenários, i.e., ULA móvel e URA fixo, simula-se um interferidor que produz relação jammer-ruído (jammer-noise ratio – JNR), por elemento, de 40 dB, e o ruído é assumido estacionário branco gaussiano de média nula. O radar aerotransportado desloca-se a aproximadamente 187 m/s ao longo da direção definida pelos elementos do ULA e possui resolução em alcance de 25 m. Nesse cenário, inseriu-se clutter uniforme ao longo de 360° de azimute, com relação clutter-ruído (clutter-noise ratio – CNR), por elemento e por pulso, de 50 dB, sem ambiguidade no espectro Doppler, sem desalinhamento do vetor de velocidade da plataforma e sem movimento intrínseco do clutter. O radar terrestre é fixo no solo e possui resolução em alcance de 75 m. No cenário com o radar URA fixo, sintetizou-se o clutter distribuído uniformemente em azimute no quadrante entre o azimute 0° e 90° e, em alcance, entre 10,5 km e 11,5 km, com CNR de 50 dB, sem ambiguidades. A Fig. 4 apresenta o comportamento da SINR normalizada em relação à SINR ótima, para a aplicação do HMWF ao filtro MVDR-SMI. Nessa figura, variou-se o número de amostras para ambos os cenários (ULA e URA). Além disso, o desempenho do HMWF é comparado com o MWF, o CSM, o PC, além do filtro quiescente (𝒘 = 𝑺), aplicados ao MVDR-SMI. Similarmente, utilizando como métricas a probabilidade de detecção (D) e a probabilidade de falso alarme (𝘍𝘈), conforme definidas em [1], comparouse, para ambos os cenários de simulação (ULA móvel e URA fixo), o desempenho da aplicação do HMWF ao MVDR-SMI com as demais técnicas da simulação anterior, obtendo-se o resultado apresentado na Fig. 5. No que se refere à complexidade computacional, fazendo uso das expressões na Tabela 1, obteve-se a Fig. 6 variando o número de estágios (posto) dos filtros e utilizando 640 amostras de apoio. 6. Conclusão Este artigo explorou a aplicação do HMWF (householder multistage Wiener filter) por radares phasedarray em dois cenários: um radar aerotransportado equipado com um ULA e um radar terrestre fixo com URA. Ao aplicar o HMWF ao STAP, obteve-se o mesmo desempenho que o MWF convencional, especialmente no que tange à capacidade de operação com redução de posto de até 128 vezes em relação ao posto completo, mesmo para reduzido número de amostras de apoio. Além disso, em comparação com as demais técnicas simuladas e disponíveis na literatura, evidenciou-se, para as métricas utilizadas nas simulações de desempenho, que a capacidade de operação em posto reduzido do HMWF é significativamente superior. Indo mais além, a aplicação do HMWF ao STAP confirmou sua maior eficiência computacional para posto e número de amostras reduzidos. Esse resultado promissor vem ao encontro de um dos principais objetivos atuais de pesquisa na área de processamento de espaço-tempo de radares, em face da escassez de amostras contendo interferências estacionárias em relação ao snapshot ao qual se almeja aplicar a filtragem STAP. "
}