{
    "id": 139,
    "titulo": "sarp aplicado ao monitoramento de áreas com diferentes prioridades com emprego de uma estação de controle em solo para operação dinâmica por interface baseada na tarefa",
    "autor": "luis claudio batista da silva, ricardo maroquio bernardo, erick menezes moreiraa, paulo f. f. rosa",
    "url": "http://www.ebrevistas.eb.mil.br/CT/article/view/10838",
    "tipo_documento": "Artigo de Revista",
    "rotulo": 3,
    "resumo": "Este trabalho apresenta um sistema para controle de múltiplas aeronaves remotamente pilotadas de pequeno porte, aplicado a tarefas de monitoramento por cobertura de área com diferentes prioridades de interesse. O sistema tem por propósito prover um controle autônomo das aeronaves, enquanto fornece uma interface de usuário para supervisão centrada na tarefa, através da qual um único operador possa realizar o controle da missão. Para a manutenção da consciência situacional, as aeronaves devem formar uma rede, através da qual o envio dos dados sensoriados por aeronaves distantes e sem alcance da estação de controle possam ser retransmitidos por aeronaves mais próximas. Para a tarefa de cobertura, foi proposta uma abordagem de monitoramento por prioridades gradientes, através do particionamento da região em camadas concêntricas, cuja frequência de atualização varia gradualmente através das camadas. Para validação do sistema, foram realizados voos com uma frota de três quadricópteros conectados à estação de controle desenvolvida. Pela análise dos logs dos voos, foi possível validar os objetivos propostos para o sistema. ",
    "texto": " 1. Introdução Sistemas de aeronaves remotamente pilotadas (SARP) têm sido aplicados no monitoramento por cobertura de área, para fins tanto civis quanto militares. Cobertura por veículos aéreos é aplicada a diversas tarefas, tais como mapeamento, patrulhamento e vigilância, aquisição de alvos, busca e salvamento, dentre outros. Para os interesses desse trabalho, destacam-se as tarefas de monitoramento persistente aplicadas a missões de inteligência, vigilância e reconhecimento, comumente desempenhadas em operações de defesa. Neste tipo de tarefa, faz-se necessário que os pontos de interesse sejam frequentemente revisitados, e que a região monitorada possua pontos com diferentes prioridades, que possammudar com a evolução da missão. A atualização da s informações sensoriadas tem por objetivo prover ao controle da missão conhecimento do ambiente em tempo hábil para a manutenção da consciência situacional, requisito fundamental em atividades de comando e controle. O uso de SARP apresenta diversas vantagens, visto que o ambiente da tarefa pode ser inseguro para a presença de humanos, como também as tarefas em execução podem ser tediosas, levando à fadiga e consequentemente à redução da concentração dos operadores da missão. Embora o uso de aeronaves remotamente pilotadas (ARP) elimine o risco da presença do piloto no ambiente da tarefa, soluções que adotam veículos com cargas úteis críticas podem requerer um nível de supervisão alto. Por outro lado, ARPs de pequeno porte têm sido explorados para missões de monitoramento com recursos aplicados apenas para o sensoriamento do ambiente. Dentre as vantagens dessas aeronaves, destacam-se baixo custo e menor risco de operação. Entretanto, a restrição de recursos devido à baixa capacidade de carga paga, tais como energia e alcance da comunicação, podem limitar sua eficácia [1]. Para reduzir tais limitações, e visando aumentar a robustez, eficiência e confiabilidade deste tipo de solução, tem sido amplamente investigado o uso de múltiplas aeronaves em trabalho cooperativo aplicados a este tipo de tarefa [2]. Porém, tal solução eleva a complexidade e diversos desafios se apresentam, tais como controle e integração. O objetivo deste trabalho foi desenvolver um sistema para controle de múltiplas ARPs de pequeno porte, aplicável ao monitoramento de áreas com diferentes prioridades de interesse e alocação dinâmica de tarefas atribuídas por um único operador. A arquitetura da solução proposta é dividida em três partes: (a) estação de controle em solo, para planejamento e controle dinâmico da missão, através de interface de usuário baseada na tarefa; (b) frota de quadricópteros com capacidade de navegação autônoma por sensores inerciais e satélites; (c) software de controle embarcado nas aeronaves, responsável pelo gerenciamento da comunicação, alocação de trajetórias para a aeronave e controle dos sensores aplicados na missão. 2. Revisão da Literatura Nesta seção, são apresentados os fundamentos teóricos para sistemas de aeronaves remotamente pilotadas, bem como um comparativo com trabalhos relacionados ao tema. 2.1 Sistema de Aeronaves Remotamente Pilotadas De acordo com a Agência Nacional de Aviação Civil (ANAC) [3], um sistema de aeronaves remotamente pilotadas (SARP) é um sistema composto não apenas pela aeronave remotamente pilotada (ARP), como também pela infraestrutura necessária para sua operação, tais como: estação de pilotagem remota, enlace de comando e controle, equipamentos para lançamento e recuperação, dentre outros. A Figura 1 apresenta uma visão de alto nível da arquitetura de um SARP. Os principais componentes desta arquitetura, bem como suas funções, são apresentados a seguir: • Estação de controle em solo (ECS): elaboração e envio dos planos de voo para as ARPs; interface gráfica para controle da missão e visualização dos dados sensoriados; • Rádio controle manual: requisito de redundância para intervenção do operador em caso de falhas do sistema; o receptor embarcado decodifica os comandos de controle; • Controladora de voo: executa um software de piloto automático para controle da atitude de voo da aeronave; recebe comandos do rádio controle ou mensagens através do rádio de dados (em um protocolo definido); realiza a leitura dos sensores inerciais (INS) e receptor de satélites (GPS) para gerar os sinais necessários para os atuadores, visando cumprir a atitude de voo requerida;  Computador de bordo: além da controladora de voo, pode ser embarcado um microcomputador na ARP, que integrado ao piloto automático, permite o processamento das informações sensoriadas e a leitura dos sensores embarcados, podendo inclusive auxiliar na navegação; • Software embarcado: software que roda no computador de bordo; atua integrado ao piloto automático, enviando comandos e recebendo as leituras de dados dos sensores; • Módulo de força: fornece a energia necessária ao funcionamento dos componentes da aeronave. 2.2 Classificação das ARPs As ARPs, de acordo com o DECEA [4], podem ser classificadas quanto ao nível de automação de voo, como: • Remotamente pilotadas: a ação do piloto é direta durante todas as fases do voo; • Automáticas: funcionam com piloto automático embarcado, de modo que possam cumprir trajetória de voos planejados sem intervenção humana; entretanto, permite que o piloto possa interferir a qualquer momento; • Autônomas: realiza plano de voo previamente embarcado do início ao fim, desde a decolagem ao pouso, sem permitir a interferência de um piloto ou mudança dos parâmetros estabelecidos inicialmente para o voo. Quanto à classificação pela dimensão, conforme regulamentação da ANAC [5], as ARPs podem ser classificadas de acordo com o peso máximo de decolagem (Tabela 1). Há ainda a classificação das aeronaves quanto à sustentação. Nela, são consideradas as características estruturais e propriedades relacionadas ao modo de voo. As principais classificações por tipod e sustentação são: asa fixa (avião), asa rotativa (helicóptero e multirotores), mais leve que o ar (dirigível), dentre outras. 2.3 Quadricóptero Os quadricópteros são ARPs do tipo asa rotativa, impulsionados por quatro rotores movidos por motores elétricos e controlados por um sistema de controle eletrônico para estabilização de voo. Possuem capacidade de decolagem e pouso vertical (VTOL), voo pairado e boa manobrabilidade. É um sistema não linear, fortemente acoplado com 6-DOF (graus de liberdade), sendo 3 movimentos lineares e 3 angulares. As forças e momentos são gerados pelas hélices ligadas aos rotores. Assim, o veículo é controlado pelas velocidades angulares dos motores, que produzem um impulso e um torque que, combinados, geram um impulso principal, e os torques de rolagem (Φ), arfagem (θ) e guinada (ψ) [6]. A Figura 2 apresenta os movimentos angulares (Φ, θ, ψ), em relação aos eixos (x,y,z) do sistema de referência fixado ao veículo. A força peso é dada por mg. 2.4 Trabalhos Relacionados O objetivo do sistema proposto é o monitoramento de regiões com pontos com diferentes prioridades de interesse. Considerando a decomposição de uma região sob monitoramento em células, [7] apresenta o conceito de idade da célula como o intervalo de tempo desde sua última atualização, durante a detecção desta por alguma aeronave. Dessa forma, uma célula com prioridade mais alta deve ter sua idade máxima menor que a de prioridade mais baixa. Em [8][9][10], os autores apresentam soluções em que as ARPs trabalham de forma autônoma no monitoramento de regiões com diferentes prioridades de interesse. No entanto, diferentemente do sistema proposto neste trabalho, que permite a atribuição dinâmica de prioridades durante a missão, nos trabalhos investigados as prioridades são definidas a priori, e não podem ser redefinidas no decorrer da missão. Outro requisito do presente trabalho é a otimização dos recursos humanos empregados na missão. Em [11], os autores discutem a sobrecarga em um único piloto quando ele precisa controlar tarefas de várias aeronaves. Eles apresentam uma comparação entre o controle baseado em veículo, no qual o operador atribui tarefas individualmente a cada ARP, e o controle baseado em tarefas, no qual o operador atribui uma lista de tarefas para a frota de ARPs, que distribui autonomamente essas tarefas entre aeronaves. Os autores indicam vantagens significativas no controle baseado em tarefas, tanto no desempenho quanto na robustez da solução. No entanto, eles apontam que o controle baseado em tarefas pode levar a uma perda de controle em situações inesperadas. Em [12][13], os autores apresentam soluções de controle baseadas em tarefas, nas quais um único piloto comanda a missão por meio de uma interface de alto nível de atribuição de tarefas. No entanto, a comunicação da estação terrestre com os veículos é feita individualmente. No presente trabalho, a comunicação deve ocorrer por meio de uma rede formada pelas aeronaves e, portanto, aumentando a robustez e cobertura do sistema. Restrições de comunicação também podem reduzir a eficácia de pequenas ARPs em tarefas de monitoramento. As pesquisas em [14][15] apresentam o uso colaborativo de múltiplas aeronaves em tarefas de vigilância, nas quais as restrições de comunicação são atendidas pela formação de uma rede entre as ARPs. Pesquisas recentes [16][17][18] abordam o problema de comunicação entre múltiplas ARPs como uma nova família de rede, chamada de rede ad hoc de aeronaves (FANET), vista como uma forma especial de redes ad hoc de dispositivos móveis (MANET) e redes ad hoc de veículos (VANET). Os autores indicam que as redes formadas por aeronaves necessitam de novas abordagens, devido aos desafios impostos tanto pela distância da cobertura quanto pela mobilidade desses veículos, que exigem constantes mudanças na topologia da rede. A contribuição do presente trabalho é a elaboração da arquitetura de um sistema robusto para o controle autônomo de uma frota de ARPs, conectadas a uma estação de controle em solo, provida de uma interface de supervisão de alto nível para suportar o controle dinâmico da missão baseada na tarefa, por controle de único operador. 3. Enunciado do Problema O sistema proposto é aplicável ao monitoramento por cobertura de área, no qual as informações sensoriadas devem ser entregues na estação de controle da missão em tempo hábil para a manutenção da consciência situacional, de modo que seja um recurso de comando e controle portátil e de pronto emprego. Para isso, o SARP deve ser composto por ARPs de pequeno porte e uma ECS compacta. Para tal, propõe-se como tarefa a ser realizada pelo SARP a observação de um ponto de interesse com a manutenção de um perímetro de segurança. A prioridade decai proporcionalmente à distância radial do ponto central de maior interesse até as bordas da região sob monitoramento. Para a cobertura, propõe-se o uso de múltiplas ARPs, de modo que a região de interesse possa ser particionada entre diversas aeronaves em trabalho cooperativo. As aeronaves devem formar uma rede de dados, para que os dados sensoriados por uma aeronave, cujos recursos de comunicação não alcancem a estação de controle, possam ser retransmitidos por outras aeronaves mais próximas. Também, visando que as ARPs possam ser controladas dinamicamente por um único operador, a ECS deve fornecer uma interface de usuário de alto nível para controle baseado na tarefa, dotada de um sistema interativo de mapas para o planejamento, controle e acompanhamento da missão. As tarefas solicitadas pelo operador devem ser planejadas pelo sistema, e distribuídas entre as ARPs, para o cumprimento dos planos de voo de forma autônoma. A ECS também deve prover controles para que o operador possa intervir sobre o funcionamento de qualquer ARP para o cumprimento de funções básicas de navegação. 3.1 Domínio da Aplicação Os principais elementos do domínio da aplicação para a tarefa proposta para o SARP são descritos a seguir: • O ambiente W é outdoor e dispõe de um conjunto de coordenadas {C 1, C2,...,Cn}. Cada Ci ε R3 é um ponto sobre a superfície terrestre [latitude, longitude, altitude]; • A área de interesse A sob monitoramento é um subconjunto de W, que forma um polígono fechado; • P é uma partição de A e cada elemento cj ε P é denominado célula, cujo tamanho l é o alcance do sensor; • A célula central c 0 de A é o ponto de maior prioridade; as demais células de A formam um perímetro com K camadas concêntricas em torno de c 0; a prioridade de cada camada decai proporcionalmente à distância de c 0; • A prioridade de interesse determina a frequência fk de atualização da célula cj na camada k, para k ≤ K ε N; células da mesma camada possuem mesma prioridade; • A frota U é formada por n aeronaves autônomas {u 1,u2,...,un}; cada ui no tempo t monitora a camada k. Para os objetivos do presente trabalho, são consideradas as seguintes restrições: a região sob monitoramento é livre de obstáculos; as ARPs são similares quanto à capacidade de voo; e, os sensores embarcados para execução da missão são homogêneos quanto ao alcance de sensoriamento. 4. Solução Proposta para o SARP Para a tarefa de cobertura de área, foi adotado o uso de uma grade hexagonal, devido à propriedade de mesma distância de navegação para qualquer célula vizinha. Para abordar o monitoramento de áreas com diferentes prioridades de interesse, propomos uma abordagem chamada de gradiente de prioridades. Acélula central (c0) do gradiente é a de maior prioridade. As demais células formam camadas concêntricas em torno de c 0, cuja prioridade decai proporcionalmente em direção à borda do gradiente (vide Figura 3). As células na mesma camada têm a mesma prioridade e devem ser revisitadas com mesma frequência. Considerando uma frota de aeronaves U u u u n = { , 1 2,..., } com sensores homogêneos, a área de cobertura total A max do gradiente de prioridades sobre a grade hexagonal, considerando o tamanho do lado l do hexágono baseado no alcance do sensor e o gradiente com K camadas, é dado por: A frequência fk de revisitas para cada célula na camada k, considerando a cobertura de cada camada por apenas uma aeronave, sendo v a velocidade da aeronave, é dada por: 4.1 Algoritmo de Realocação Proposto Ao iniciar a missão, as aeronaves ocupam as camadas do gradiente por ordem de prioridade. Durante a missão, o operador pode solicitar a realocação da posição do gradiente. Neste momento, a frota de ARPs deve receber os novos planos para ocupar a nova posição de interesse. Uma solução trivial seria deslocar as ARPs para a mesma camada em que estavam antes da realocação. Porém, esta solução não prioriza a ocupação da célula central (de maior prioridade), uma vez que pode haver ARPs em camadas externas mais próximas do centro do novo gradiente, que ocupariam esta posição em menor tempo. Para isso, a abordagem proposta é a coordenação de agentes por posicionamento estratégico [19]. Nesta, a ARP que está mais próxima do centro da nova posição do gradiente ocupará esta posição. Esta estratégia aplica-se a todas as demais aeronaves, de modo que as outras camadas também serão ocupadas pela ARP mais próxima em ordem decrescente de prioridade, conforme apresentado em [20]. 4.2 Arquitetura Básica do SARP Proposto Neste trabalho, propõe-se uma arquitetura modular para um SARP, conforme apresentada na Figura 4, na qual as aeronaves são controladas por um piloto automático com capacidade de navegação autônoma por sistema inercial e por satélites. O piloto automático recebe os planos de voo a partir de um sistema de controle embarcado, responsável pela alocação de tarefas, controle da carga útil e gerenciamento dos recursos de comunicação. Na estação de controle, os recursos para planejamento de missão e uma interface de usuário para o controle da missão estão disponíveis. Para o sistema de controle embarcado, foi elaborada uma arquitetura em camadas com diferentes níveis de abstração, na qual cada camada atua como cliente da camada inferior e como servidora da camada superior (Figura 5). Cada demanda da ECS deve ser tratada pelas camadas, diminuindo o nível de abstração à medida que se aproxima do sistema de piloto automático. No nível mais alto da arquitetura, a ECS envia comandos para o controle embarcado e recebe telemetria por um protocolo de comunicação baseado na tarefa. Para a passagem de controle para o piloto automático, foi adotada a estratégia de implementação de um middleware, cujo objetivo é reduzir o nível de abstração da aplicação para o controle do veículo. O piloto automático adotado é o ArduCopter, que utiliza o protocolo de comunicação MAVLink (Micro Air Vehicle Communication Protocol). Para isso, foi utilizada a API Dronekit (open-source), que oferece um nível de abstração intermediário para a comunicação MAVLink, recebendo comandos por mensagens de objetos e realizando a conversão para o formato do protocolo. 4.3 Estação de Controle em Solo O SARP dispõe de uma ECS dotada de interface gráfica de usuário de nível supervisório baseada na tarefa, ou seja, uma interface na qual o operador possa realizar os objetivos da missão, sem necessidade de engajamento com as aeronaves. Nesta, o operador interage com o mapa da região onde ocorre a tarefa para comandar a missão. O sistema é responsável por distribuir as tarefas entre as aeronaves, que executam o voo em modo autônomo. A Figura 6 apresenta a interface gráfica da ECS desenvolvida. O painel de controle possui duas abas, uma para o planejamento e outra para o controle dinâmico (execução) da missão. Na aba de controle, são exibidas informações da telemetria em tempo real de cada ARP conectada à ECS. Na Figura 7, é apresentado o painel de telemetria disponível para cada aeronave, conforme descrito a seguir: • (A) Id ARP e camada do gradiente de alocação da ARP; • (B) Tempo total de voo da aeronave aplicada na missão; • (C) Contador de comandos enviados pela ECS e recebidos e executados pelo sistema de controle embarcado; • (D) Nível Bateria e contador de telemetria enviada pelo sistema de controle embarcado e pelo piloto automático; • (E) Configuração do link de comunicação da aeronave; • (F) Status do piloto automático e modo de voo da ARP; • (G) Índice do waypoint, latitude e longitude da posição; • (H) Velocidade, distância da ECS e altitude da aeronave; • (I) Condições de GPS: quantidade de satélites fixos (necessário mínimo de 3); satélites visíveis; índice de diluição da geometria horizontal dos satélites (ideal<1); • (J) Comandos de navegação que podem ser enviados para a ARP executar fora da missão; pode ser usado pelo operador para assumir o controle imediato da ARP Os contadores de telemetria e de comando são utilizados para que o sistema possa realizar a validação das entregas das mensagens, sem a necessidade de um mecanismo de confirmação do protocolo de comunicação. 4.4 Construção da Plataforma de Voo Para a frota de aeronaves do SARP, foi adotado o uso de quadricópteros. Este tipo de aeronave atende ao requisito do sistema para uma solução portátil. Os quadricópteros possuem uma plataforma com mecanismos de controle simples, capacidade de pouso e decolagem vertical (VTOL) e capacidade de voo pairado, além da grande oferta de componentes disponíveis no mercado. A Figura 8 apresenta um esquema básico de integração dos componentes do quadricóptero. Na Tabela 2, são apresentadas as especificações dos quadricópteros construídos para o SARP. Os componentes podem ser agrupados por função, tais como: componentes de propulsão (motores; controladores eletrônicos de velocidade- ESC; hélices), de processamento (controladora de voo; microcomputador embarcado), de comunicação (receptor de rádio controle; rádio de dados; conexão WiFi), além do chassi (frame), que fornece uma estrutura rígida ao veículo e suporte para fixação dos demais componentes. O chassi utilizado é do tipo X, no qual a frente da aeronave é apontada por um par de motores que rotacionam em sentido contrário, tendo como referencial o eixo X do sistema de coordenadas North-East-Down. A controladora de voo adotada para o projeto foi a Navio2, da Emlid [21]. Diferentemente da maioria das controladoras, a Navio2 não processa o software de piloto automático diretamente, mas funciona como um componente integrado ao barramento GPIO do RaspberryPi 3B, sendo o ArduPilot [22] o principal software de piloto automático (open-source) suportado. No entanto, a Navio2 utiliza apenas parte da capacidade de processamento do RaspberryPi 3B, de modo que outras aplicações podem rodar no mesmo ambiente do piloto automático. 5. Experimentos e Resultados Para validar o SARP proposto, foi utilizada a ECS desenvolvida para planejamento e controle do voo múltiplo autônomo, e o software de controle embarcado nas ARPs para alocação dos comandos e planos recebidos em tempo real da ECS. Para isso, foram utilizados três quadricópteros com hardware similar (Figura 9), com os parâmetros do piloto automático configurados conforme a Tabela 3. Foram realizados voos com uso de uma rede ad hoc com uso de rádios XBee. Devido ao uso da ECS desenvolvida, nenhum plano de voo foi carregado previamente na aeronave, apenas o software de controle foi embarcado. A distância entre os centroides das células do gradiente de prioridades foi parametrizada para 12,5 m. A trajetória de voo realizada por cada aeronave para cobertura do gradiente de prioridades é apresentada na Figura 10. No algoritmo de realocação proposto, a aeronave pode mudar de camada para otimizar o tempo de ocupação do gradiente. Como pode ser visto no mapa, a ARP 1 começa cobrindo a camada 2 (Figura 10a), mas diante da realocação do gradiente de prioridades para outra área, foi alocada para a camada 1, ou seja, o centro do gradiente (Figura. 10b). Na Figura 11, são apresentados gráficos de posição das trajetórias executadas por cada ARP durante a execução da tarefa. São destacados, no gráfico, os diferentes momentos do voo, desde a decolagem até o pouso. Também é possível observar o momento em que os comandos são enviados pela ECS (GCS cmd) para as ARPs. Por exemplo, no gráfico da Figura 10a, é apresentada a trajetória da ARP 1, que inicia na camada 2 da primeira posição do gradiente de prioridades e, após realocação do gradiente para a segunda posição solicitada pelo operador, muda para a camada 1 para atendimento prioritário da célula central, devido ao fato de estar mais próxima deste ponto no momento da realocação do gradiente. Na Figura 12, são apresentados quadros extraídos do vídeo gravado durante a realização do experimento de voo autônomo controlado por um único operador. Os quadros estão em ordem dos eventos comandados pelo operador, desde a decolagem até o pouso, com realocação da posição do gradiente de prioridades. Ao lado de cada quadro é apresentada uma captura de tela da interface da ECS durante o voo, com destaque para a exibição da posição e a telemetria de cada aeronave no tempo real da tarefa. Na Tabela 4, são apresentados os dados obtidos a partir da análise dos logs de voo gerados pelo piloto automático embarcado em cada quadricóptero. Para as ARPs (1) e (2), o erro de posição da trajetória realizada, quando comparada com a trajetória executada pelas aeronaves, foi submétrico, considerado um resultado satisfatório para o emprego de navegação por sistema de satélites. É possível observar que a ARP (3), configurada para velocidade horizontal 2 m/s maior que as demais e que realizou a cobertura da camada 3 do gradiente de prioridades, apresentou maior erro de posição que as demais aeronaves. Os experimentos apontaram que, quanto maior a velocidade da ARP, maior o erro de posição em relação aos vértices da trajetória de voo. Considerações sobre o experimento de voo: através deste trabalho foi possível a validação do SARP no controle de múltiplas ARPs controladas por uma ECS, por sua vez, comandada por um único operador. Para tal, foram utilizados apenas os recursos desenvolvidos para solução, sem a necessidade de software de terceiros para o planejamento e execução das tarefas. Embora os rádios de controle estivessem presentes e configurados para assumir o controle de cada quadricóptero em caso de falhas do sistema, os mesmos não foram necessários durante os voos. Também foram testadas, separadamente, as funcionalidades do painel de controle básico de navegação de cada ARP, disponível para o operador enviar comandos de controle para qualquer aeronave a qualquer instante. Entretanto, durante a realização das missões, não houve qualquer incidente que demandasse o uso deste recurso. 6. Conclusão Neste trabalho, foi proposto um sistema para coordenação de múltiplas ARPs de pequeno porte, destinado à cobertura de áreas com diferentes prioridades de interesse, aplicáveis a tarefas de monitoramento. Foram investigadas soluções, com ênfase no planejamento e execução autônomos das tarefas, bem como a disponibilidade de ECS dotada de uma interface de usuário de alto nível baseada na tarefa. O projeto do SARP foi baseado no estilo em camadas, visando uma solução modular, de fácil integração, modificação e adaptação para novas funcionalidades. Para a cobertura de áreas com diferentes prioridades, foi proposta a abordagem de gradiente de prioridades. Nesta, a região é decomposta em células que formam camadas concêntricas, de modo que a célula central deve ser coberta com maior prioridade, sendo a prioridade reduzida gradualmente através das camadas. Para o enlace entre as ARPs e a ECS, foi estabelecida uma rede ad hoc com uso de rádios XBee. O SARP desenvolvido foi validado em experimentos de voo real com o emprego de quadricópteros construídos para a pesquisa. Foi possível que um único operador realizasse o controle de uma frota com três quadricópteros em voo autônomo, e ainda sem a necessidade de intervenção do operador para o controle individual de nenhum veículo durante a missão. Os logs dos voos foram capturados e analisados. As trajetórias planejadas pela ECS foram executadas pelas ARPs. Os resultados das análises dos dados propiciaram a validação dos requisitos propostos para o sistema. "
}