	{
		"id": 14,
		"titulo": "centro de avaliações apoia teste de integração de sistema de armas",
		"autor": "Noticiário do Exército",
		"url": "https://www.eb.mil.br/web/noticias/noticiario-do-exercito/-/asset_publisher/znUQcGfQ6N3x/content/id/15309495",
		"tipo_documento": "Notícia",
		"rotulo": 3,
		"resumo": 0,
		"texto": "Rio de Janeiro (RJ) – O Centro de Avaliações do Exército (CAEx) apoiou, no período de 5 a 13 de abril, testes de integração da Viatura Blindada Multitarefa Leve sobre Rodas 4x4 (VBMT-LR 4x4) com o sistema de armas REMAX 4. A atividade, conduzida pelo Centro Tecnológico do Exército (CTEx) e pela empresa Ares, contou com o apoio da diretoria de fabricação e da empresa IVECO. Militares e técnicos do CTEx, do CAEx e engenheiros da Ares participaram das atividades, cujo objetivo foi realizar testes de integração da viatura IVECO LMV-BR 4x4 com o sistema de armas REMAX 4, da Ares. O objetivo dos testes é viabilizar a continuidade do projeto REMAX, otimizado por novas interfaces mecânicas e elétricas na plataforma veicular. Foram efetuados testes de rodagem em diversos tipos de terreno para verificar padrões e realizar a convergência na malha de estabilização do sistema de armas. Foram efetuados tiros com a viatura parada e em movimento, usando os calibres 7,62 mm e .50 polegada. Foi avaliado o comportamento do sistema, que mantém a linha de visada no alvo com emprego de traqueamento de imagem, quando alvo e viatura podem estar estacionados ou em movimento. O REMAX 4 possui, como diferencial em relação à versão anterior, uma maior capacidade de armazenamento de munição, além de ser mais leve e mais compacto. No REMAX 4, a consciência situacional proporcionada pelo equipamento permite ao chefe da viatura acessar as mesmas informações que o atirador, a respeito da viatura e do alvo, o que caracteriza constante melhoria na modernização e atualização do equipamento e prolonga o ciclo de vida dos sistemas e materiais de emprego militar do Projeto Guarani. A melhora contínua da família de blindados sobre rodas e de sistemas tecnológicos de armas remotamente controladas são produto do trabalho constante do Sistema de Ciência, Tecnologia e Inovação do Exército e da Base Industrial de Defesa e Segurança."
	}
