{
    "id": 144,
    "titulo": "identificação de sistemas lineares multivariáveis por ajuste das respostas frequenciais baseada nas respostas temporais ao degrau unitário",
    "autor": "tatiane c. ramalho, paulo c. pellanda, roberto ades, marcelo a. oliveira",
    "url": "http://www.ebrevistas.eb.mil.br/CT/article/view/8656",
    "tipo_documento": "Artigo de Revista",
    "rotulo": 1,
    "resumo": " Este trabalho apresenta um método para identificar modelos lineares multivariáveis no domínio da frequência, baseado nas respostas temporais ao degrau unitário e no ajuste ótimo das respostas em frequência medidas. Os coeficientes da matriz função de transferência são calculados analiticamente de modo a minimizar uma função custo com base em norma quadrática. Este novo método possibilita a obtenção de melhores ajustes dos modelos identificados tanto nas respostas frequenciais como nas respostas temporais em regime permanente. São utilizados três exemplos numéricos para explicitar algumas vantagens relativas do método proposto.",
    "texto": " 1. Introdução A identificação de sistemas busca técnicas alternativas à modelagem matemática convencional que, em muitos casos, pode ser inviável devido à complexidade de alguns sistemas. A partir da observação de dados de entrada e saída do sistema, a identificação é capaz de fornecer um modelo numérico que reproduza o comportamento dinâmico real do sistema, de modo satisfatório e sem envolver uma complexidade matemática elevada. O aprofundamento das técnicas utilizadas para a identificação de sistemas lineares é encontrado em vários trabalhos, como [1], [2], [3] e [4], onde são detalhadas as etapas necessárias para aplicação das técnicas. Já uma visão geral das técnicas de identificação pode ser encontrada em [5], incluindo a abordagem clássica de métodos paramétricos, bem como métodos clássicos não paramétricos. Essencialmente, o processo de identificação pode ser realizado no domínio do tempo ou da frequência. Ambas as formas apresentam resultados eficientes, porém em [6] os autores expõem algumas características da identificação no domínio da frequência não encontradas no domínio do tempo, que podem ser consideradas vantajosas, tais como: facilidade no tratamento do ruído, redução no volume de dados, desconsideração do estado inicial do sistema e facilidade na combinação de dados de diferentes experimentos, favorecendo a validação do modelo. Por um longo período, ambas as abordagens foram consideradas como métodos competitivos [7], apesar de resolverem o mesmo problema que consiste em encontrar um modelo que represente a dinâmica de um sistema linear invariante no tempo. No entanto, a decisão de escolha pelo domínio do tempo ou da frequência pode ser relacionada com a facilidade de acesso às informações em cada domínio para o sistema analisado. Percebe-se que, em várias técnicas de identificação, há o interesse em obter soluções analíticas, o que só é possível, geralmente, em alguns problemas que apresentam convexidade em relação às variáveis de ajustes. Em [8], é apresentado e discutido um método para o problema de identificação no domínio da frequência, cuja solução ótima é analítica, denominado N2CACGO. Esse método é vantajoso em alguns aspectos em relação a outras técnicas, conforme explicitado pelos autores. O método soluciona um problema de otimização convexo, de forma analítica e ótima, baseado em um critério de norma quadrática especificado no domínio da frequência, que resulta na identificação de uma matriz função de transferência. O critério de ajuste adotado pelo método utiliza a norma quadrática do erro entre a resposta em frequência do sistema original e a do modelo identificado. No entanto, como mencionado em [9], na utilização do método em alguns casos, o modelo identificado poderá ser instável ou de fase nãomínima, não sendo apropriado em certas aplicações de controle ou análise. Além disso, outro aspecto não satisfatório observado é que, eventualmente, as respostas temporais dos modelos identificados apresentam erro de estado estacionário em relação à resposta do sistema original. Para contornar essas adversidades, uma melhoria no método para sistemas monovariáveis é apresentada em [9], visando a eliminar o erro de regime permanente da resposta, bem como reduzir a quantidade de modelos instáveis ou de fase não-mínima identificados, mantendo a essência do método. Neste trabalho, é discutida uma extensão na melhoria do método N2CACGO [9] para sistemas multivariáveis, mantendo os objetivos propostos no caso de sistemas monovariáveis: eliminação dos erros de regime permanente das respostas temporais e redução da quantidade de modelos instáveis ou de fase não-mínima identificados, sem modificar a essência do método. Além disso, como em sistemas multivariáveis surge a necessidade de compor a modelagem de diversos canais simultaneamente, propõe-se também a introdução de coeficientes de ponderação para a realização de um melhor ajuste do modelo. 2. Fundamentação Teórica 2.1 Formulação do problema O problema abordado consiste em ajustar um modelo multivariável G e (s) para um dado sistema G (s) sob a forma de Matriz Função de Transferência (MFT), a partir de medições experimentais de suas respostas em frequência sob uma faixa de frequência de interesse. Assume-se que as funções de transferência (FT) dos canais a serem identificados, sejam racionais de ordem n e apresentem o mesmo polinômio característico, isto é, compartilhem o mesmo conjunto de polos, podendo ser representadas pela seguinte expansão: em que e são, respectivamente, os vetores de coeficientes reais dos numeradores e do denominador comum de ; e são, respectivamente, os polinômios em s do numerador e do denominador em (1). O índice λ representa o canal específico dentre todas as combinações possíveis entre as p entradas e as q saídas do sistema sob análise, ou seja, O modelo estimado é ajustado por meio de um critério de erro baseado em norma quadrática: no qual é o vetor de parâmetros a serem determinados; e e são, respectivamente, as respostas em frequência dos numeradores e do denominador comum de ; é um vetor contendo m valores de frequências escolhidas na faixa de interesse; e o operador é o Produto de Hadamard ou a multiplicação entre os elementos correspondentes de dois vetores (ou matrizes) de mesma dimensão. Além disso, informações referentes aos valores em regime permanente quando aplicados sinais do tipo degrau unitário nas entradas do sistema são inseridas no problema, com a finalidade de ajustar possíveis erros de regime permanente nas respostas temporais. A formulação deste ajuste será detalhada na Seção 3. 2.2 Método N2CACGO O método N2CACGO [8] busca estimar um conjunto de modelos racionais e próprios, conforme definido em (1), de ordem n previamente estabelecida, por meio da formulação de um problema de identificação convexo. A escolha do modelo é determinada pelo melhor ajuste dos dados de resposta em frequência Gλ (jω) medidos, a partir da minimização do critério de erro definido em (3). Assim, estabelece-se o seguinte problema de otimização: O método calcula analiticamente os polos e os zeros de maneira ótima, minimizando o custo pela solução de um sistema de equações lineares. 3. Método Proposto O método proposto neste artigo representa uma melhoria em relação ao método exposto na Seção 2.2, sendo uma extensão do apresentado em [9] para o caso de sistemas multivariáveis. Nesta melhoria, o problema é formulado incluindo as informações referentes aos valores em regime permanente das respostas temporais do sistema multivariável quando aplicados sinais do tipo degrau unitário em suas entradas. Para a aplicação do método proposto, partese da resposta em frequência do sistema sob estudo em um conjunto de valores de frequências, numa faixa de interesse, e das respostas em regime permanente de cada canal em função da aplicação de sinais do tipo degrau. Diversos modelos podem ser ajustados, conforme as ordens dos mesmos escolhidas a priori. O modelo selecionado será aquele que melhor atenda o compromisso entre um baixo erro de ajuste aos dados fornecidos e a menor ordem possível entre os modelos calculados (parcimônia). Com relação ao ajuste em baixas frequências, considere o resultado expresso pelo Teorema do Valor Final [10], que estabelece que a resposta y(t) em regime permanente, caso exista, pode ser determinada por: O valor de regime permanente Kλ da saída do sistema para cada canal λ quando aplicada uma entrada do tipo degrau unitário, pode ser calculado utilizando-se a propriedade demonstrada em (5): Nos casos em que os modelos são identificados a partir de sistemas físicos reais, o valor de Kλ pode ser obtido pela medição dos valores de saída do sistema, em regime permanente, a partir das excitações das entradas com sinais do tipo degrau. Logicamente, é necessário que o sistema sob análise possa ser excitado pelas entradas mencionadas. Quando a técnica proposta é aplicada diretamente a modelos previamente conhecidos, por exemplo em aplicações de redução de ordem de modelos, o valor de Kλ pode ser calculado por: onde e são, respectivamente, os coeficientes independentes de s nos polinômios do numerador e no denominador da FT de cada canal λ. Para que os modelos identificados respondam da mesma maneira, a seguinte condição deve ser utilizada: Assim, os parâmetros deixam de ser variáveis no problema e passam a ser determinados a partir dos valores calculados de βn. Consequentemente, os modelos passam a contar com um parâmetro a menos de ajuste. Para o cálculo de modelos próprios, as FT estimadas dos canais do sistema multivariável são representadas de acordo com a seguinte formulação: com o índice representando o canal específico conforme (2). Assim como apresentado em (3), um critério de erro é estabelecido: em que γλ representa os coeficientes de ponderação, utilizados para compensar as discrepâncias de valores nas normas dos canais. A função é convexa em relação aos parâmetros estimados em (10). A demonstração é realizada no Lema 1. Lema 1: Seja as FT a serem estimadas na forma de (8) para cada canal da planta e S um conjunto convexo, tal que é o vetor de parâmetros a ser projetado, então em (10) é uma função convexa. Demonstração: Dado que possui um conjunto convexo como domínio, é necessário apenas mostrar que e [0,1] : Para simplificar a notação, o argumento jω em é omitido e a variável s é mantida no lugar de jω. Assim, verifica-se que: Como a função em (10) é convexa, é possível estabelecer um problema de otimização, o qual possuirá uma única solução que, caso possa ser determinada, representará o seu mínimo global. O Teorema 1 apresenta o problema de otimização proposto e uma forma de cálculo para solucioná-lo. Teorema 1: Considere as respostas em frequência Gλ (jω) dos canais λ de um sistema multivariável G(s). Um modelo para o sistema poderá ser obtido a partir da solução do seguinte problema de identificação: em que γλ com λ ∈ Λ são os coeficientes de ponderação das normas, previamente escolhidos e, θ é o vetor de parâmetros do modelo a ser identificado, isto é: A solução ótima do problema convexo em (11) pode ser determinada resolvendo-se o seguinte sistema de equações lineares: onde as submatrizes Qj com j ∈ {1,4}, com k ∈ {2,3} e os vetores e , são dados por: em que , , representa a parte real do argumento e as submatrizes Q1 e 0 em (12) apresentam as mesmas dimensões. Demonstração: Considere a expansão do somatório da função custo apresentada em (10): Como esse problema é convexo nas variáveis αλ e β, uma condição necessária de otimalidade para a solução é igualar a zero as equações das seguintes derivadas: Derivando parcialmente (13) em relação às componentes de θ, obtém-se: O argumento em jωi é omitido para simplificar a notação. Fazendo após algumas manipulações algébricas chega-se a: De modo semelhante para as variáveis βk com }, obtém-se: e por fim para βn, tem-se que: Agrupando-se as nqp equações em (14), as (n–1) equações em (15) e a equação em (16), obtém-se o sistema de equações lineares em (12). 4. Aplicações numéricas Nesta seção, são apresentados três exemplos que explicitam algumas vantagens da modificação proposta para sistemas multivariáveis. Algumas análises comparativas são realizadas entre os modelos identificados pela aplicação do método N2CACGO na sua forma original e pelo Método Proposto (MP). Nos exemplos, consideraram-se todos os coeficientes de ponderação iguais a 1. A notação para o canal y:u utilizada, refere-se à combinação formada pela saída y e a entrada u de um sistema com p entradas e q saídas sob análise. Para avaliar os modelos identificados foram utilizados dois índices. No primeiro índice, foi considerado o erro de ajuste das respostas em frequência, baseado em norma quadrática, entre os modelos original G(s) e o identificado : em um conjunto contendo m valores de frequências escolhidas na faixa de interesse. No segundo índice, foi considerado o erro entre as respostas ao degrau yλ(t) do sistema analisado em relação às dos modelos identificados ye,λ(t), sendo definido pela integral do erro quadrático, conforme: onde o limite é ajustado em cada exemplo para um tempo finito, considerando que tenha sido atingida a resposta em regime permanente. O critério utilizado para a escolha da ordem dos modelos dos exemplos foi baseado nos índices IRF e I ISE encontrados para cada ordem n, selecionandose o modelo que apresenta os índices com os menores valores mas observando-se também um compromisso com o critério da parcimônia, conforme já mencionado no início da Seção 3, ou seja, um compromisso entre um baixo erro de ajuste aos dados fornecidos e a menor ordem possível do modelo ajustado. É importante ressaltar que, apesar de os índices (17) e (18) terem sido considerados para avaliação dos modelos obtidos, esses foram ajustados de maneira ótima pelo critério em (3), mas não por (17). Caso o índice em (17) fosse empregado na metodologia proposta, o problema se tornaria não convexo em relação aos parâmetros a serem determinados. 4.1 Exemplo I Neste exemplo, realiza-se uma análise comparativa entre dois modelos identificados de oitava ordem para um sistema SIMO (Single Input Multiple Output) com uma entrada e duas saídas. Os dados de resposta em frequência foram obtidos a partir de uma MFT gerada aleatoriamente por uma rotina computacional, com as seguintes características: décima segunda ordem, estável e de fase mínima. Os coeficientes dos numeradores e denominadores da MFT original estão apresentados na tabela A.1 do Apêndice. A figura 1 apresenta os diagramas de resposta em frequência dos modelos original e dos identificados de ordem 8 pelos métodos N2CACGO e proposto. Observa-se que ao comparar as respostas em frequência dos modelos identificados, o modelo obtido pelo método N2CACGO não apresentou um bom ajuste na faixa de baixas frequências. As respostas em frequência da MFT original apresentam diferenças relativas entre os valores em módulo nas faixas de baixas e altas frequências. Como o método N2CACGO é baseado na otimização do custo de ajuste entre as respostas em frequência do sistema original e do modelo identificado sem realizar a normalização desses valores, o ajuste na faixa de altas frequências foi priorizado pela metodologia, visto que possui valores mais significativos, prejudicando o ajuste em baixas frequências. Isso foi apresentado na figura 2, que representa os erros entre as respostas em frequência dos modelos identificados quando comparadas com as do modelo original. Quando a modificação proposta é aplicada, observa-se que o ajuste em baixa frequência passa a ser satisfatório, uma vez que garante que os valores dos coeficientes independentes de s do modelo original e do identificado sejam definidos por uma mesma razão numérica, tratando o problema existente no método N2CACGO na sua forma original para a ordem considerada do sistema. A figura 3 mostra os detalhes das respostas ao degrau unitário do modelo original e dos identificados pelos dois métodos. Verifica-se que o modelo identificado pelo método N2CACGO na sua forma original apresenta erro estacionário, em regime permanente, nas respostas ao degrau unitário em relação às respostas do modelo original. O modelo identificado pelo método proposto e original convergem para o mesmo valor, em virtude de as razões entre os coeficientes independentes de s nos modelos original e identificado pela abordagem proposta serem idênticas. Na tabela 1, encontram-se os erros de ajuste dos modelos identificados, levando em consideração os índices definidos em (17) e (18). Consideraramse 100 valores de frequência espaçados de forma logarítmica na faixa estabelecida entre 10-2 e 102 rad/s para o cálculo do índice IRF. Utilizou-se um intervalo de tempo 15s para o cálculo do índice I ISE Observa-se que os erros de ajuste encontrados quando aplicado o método proposto são bem menores do que os erros com a aplicação do N2CACGO original, especialmente para o índice I ISE, que apresenta uma considerável queda nos valores. Percebe-se também que o modelo obtido pelo método proposto é estável e de fase mínima, no entanto, o modelo estimado pelo método N2CACGO na sua forma original é estável, mas de fase nãomínima (apresentou um zero no semiplano s direito no canal 2:1 do sistema) para esse caso. Os zeros e os polos dos modelos identificados são apresentados na tabela A.2 do Apêndice. Para obter melhores ajustes na aplicação de métodos de identificação, de maneira geral, aumenta-se a ordem do modelo estimado. Imediatamente, o efeito resultante ao modelo estimado é uma maior complexidade matemática. No entanto, quando o método N2CACGO na sua forma original é utilizado, deve-se considerar a possibilidade de que o modelo obtido possa ser instável ou de fase não-mínima, em razão da eventual escolha para o modelo de ordem superior à necessária para a reprodução adequada do comportamento dinâmico. 4.2 Exemplo II O exemplo II tem o objetivo de analisar comparativamente os modelos identificados evidenciando suas vantagens e limitações do MP, além de mostrar a importância de selecionar uma faixa de frequência adequada para o processo de identificação. Os dados de resposta em frequência foram obtidos a partir de uma MFT gerada aleatoriamente por uma rotina computacional com as seguintes características: décima ordem, estável, de fase mínima, e com uma entrada e duas saídas. Os coeficientes dos numeradores e denominadores da MFT original estão apresentados na tabela A.3 do Apêndice. Com base no comportamento das respostas em frequência do modelo original, adotou-se uma ampla faixa de frequência para o processo de identificação, estabelecida entre 10-3 a 104 rad/s. Para essa faixa de frequência, os modelos de décima ordem, identificados pelos métodos N2CACGO e MP, além de não apresentarem um ajuste satisfatório das respostas em frequência foram instáveis e de fase não-mínima. Na figura 4, estão representados os diagramas de resposta em frequência do modelo original e dos identificados de ordem 10, aplicando os dois métodos considerando a faixa de frequência de 10-3 a 104 rad/s. Especificando uma faixa de frequência mais restrita, como a definida entre 10-1 a 101,5 rad/s, os resultados são significativamente melhorados, uma vez ter sido priorizado o intervalo onde o comportamento dinâmico apresentava mais relevância. Com essa faixa de frequência, foi possível identificar modelos estáveis e com erros de ajuste relativamente menores. No entanto, o método N2CACGO na sua forma original identificou um modelo de fase não-mínima, com dois zeros no semiplano s direito para ambos os canais do sistema, ao contrário do modelo estimado pela abordagem proposta, que apresentou fase mínima. Na tabela A.4 do Apêndice, encontram-se os valores numéricos dos zeros e polos dos modelos identificados. Assim como no exemplo I, verifica-se que o modelo identificado pelo MP apresentou um ajuste melhor na faixa de baixas frequências, como pode ser visto nos diagramas de respostas em frequência da figura 5. A tabela 2 apresenta os erros de ajuste dos modelos identificados, levando em consideração o índice definido em (17). Consideraram-se 100 valores de frequência espaçados de forma logarítmica na faixa estabelecida entre 10-1 a 101,5 rad/s para o cálculo do índice I RF. Assim como no exemplo I, observa-se que os erros de ajuste encontrados quando aplicado o método proposto são inferiores aos erros obtidos a partir da aplicação do N2CACGO original, especialmente na faixa de baixas frequências. Isso se deve à garantia do novo método em manter a mesma razão numérica entre os valores dos coeficientes independentes de s do modelo original e do identificado, o que também pode ser visto na figura 6, que apresenta os erros entre as respostas em frequência dos dois modelos identificados de ordem 10 quando comparadas às do modelo do sistema original. 4.3 Exemplo III O propósito deste exemplo é simular o MP em sistemas industriais e comparar os resultados com os do método N2CACGO original. O modelo utilizado possui duas entradas e duas saídas e é representado pela seguinte MFT [11]: A FT em (19) apresenta um atraso representado por e-0,1s. Um modelo de um sistema com atraso pode apresentar complexidade de manipulação, uma vez que a FT envolvida não é uma razão de polinômios em s. Para solucionar tal problema, são utilizadas técnicas de aproximação [12] para representar o termo referente ao atraso por uma função racional por meio de uma expansão em série. Foi utilizada a aproximação de Padé de primeira ordem para representar o atraso contido na FT . Neste exemplo, foram escolhidos modelos de ordem 6, uma vez que apresentaram bons ajustes. Nas tabelas 3 e 4, estão representados os erros de ajuste dos modelos identificados levando em consideração os índices definidos, respectivamente, em (17) e (18). Consideraram-se 100 valores de frequência espaçados de forma logarítmica na faixa estabelecida entre 10-2 a 101 rad/s para o cálculo do índice IRF. Para o cálculo de índice I ISE, foi utilizado um intervalo de tempo 45 s. Na figura 7, são apresentados os diagramas de resposta em frequência do modelo original e dos identificados de ordem 6, aplicando o método N2CACGO na sua forma original e o método proposto. Percebe-se que o ajuste das respostas em frequência é satisfatório para ambos os métodos. No entanto, os erros de ajuste dos modelos identificados pelo método proposto são bem menores do que os erros obtidos pelo método N2CACGO na sua forma original, principalmente em relação aos índices IISE, que são significativamente reduzidos. Nas figuras 8 e 9, podem-se observar os detalhes das respostas ao degrau unitário do modelo original e dos identificados pelos dois métodos. Constata-se que o modelo identificado pelo método N2CACGO na sua forma original apresenta erro estacionário, em regime permanente, nas respostas ao degrau unitário em relação às respostas do modelo original. Como os coeficientes independentes de s nas FT do modelo identificado pelo MP se igualaram aos correspondentes do modelo original, os valores de regime permanente nos gráficos das respostas ao degrau de cada canal desses modelos também acabaram por coincidir. 5. Análise dos resultados O método proposto foi testado em três exemplos de sistemas multivariáveis, sendo também comparado ao método N2CACGO multivariável na sua forma original conforme apresentado em [8]. Os modelos identificados pelo método proposto obtiveram um melhor ajuste, de acordo com os critérios estabelecidos, em todos os exemplos analisados. O método proposto neste artigo permitiu a identificação de modelos estáveis. Nos exemplos I e III, as respostas temporais a uma entrada do tipo degrau unitário não apresentaram erro de estado estacionário. Nos exemplos I e II, a abordagem proposta possibilitou também a identificação de modelos de fase mínima. Além disso, o método proposto ainda manteve a característica presente no método N2CACGO multivariável [8], identificando modelos com o mesmo polinômio característico para todos os canais considerados. Dessa forma, reduziu-se significativamente o número de parâmetros estimados e diminuiu-se o tempo de processamento computacional, facilitando o cálculo de realizações da matriz função de transferência com ordens provavelmente mínimas. Ao considerar que os modelos compartilham o mesmo polinômio característico também surgem algumas limitações, como no caso de sistemas que possuem dinâmicas muito diferentes em cada canal, por exemplo, em processos petroquímicos. Nesses casos, a identificação de cada canal separadamente seria mais adequada para evitar sobre-parametrização de coeficientes de numeradores com inserção desnecessária de zeros. Por outro lado, haverá um aumento no número de parâmetros a serem calculados nos denominadores das FT, já que cada canal apresentará um polinômio característico diferente. Uma das vantagens de utilizar um denominador comum é a possibilidade de se conseguir uma realização mínima ou quase mínima. Quanto ao ajuste dos coeficientes de ponderação das normas dos canais, as dificuldades encontradas são em relação a identificar quais os canais do sistema requerem essa ponderação, para que um canal não seja ponderado desnecessariamente. Uma análise mais detalhada a respeito das ponderações das normas dos canais será realizada futuramente. 6. Conclusão Neste artigo, foi proposta uma melhoria no método de identificação no domínio da frequência N2CACGO para sistemas multivariáveis, sendo uma extensão do método apresentado em [9]. O método proposto considera as informações referentes aos valores em regime permanente das respostas temporais do sistema multivariável a entradas do tipo degrau unitário, com a finalidade de reduzir os erros entre as respostas do sistema e as do modelo identificado. Os exemplos utilizados explicitaram algumas vantagens relativas do novo método. Conforme analisado, o método proposto foi capaz de identificar modelos estáveis e de fase mínima, sendo uma alternativa complementar ao método apresentado em [8] para a obtenção de modelos multivariáveis com essas características. "
}