{
    "id": 146,
    "titulo": "absorção de micro-ondas por nanopartículas de ferritas mistas de cobalto e cério",
    "autor": "i c gonçalves, r s de biasi, a b s figueiredo, c l oliveirab e j b campos",
    "url": "http://www.ebrevistas.eb.mil.br/CT/article/view/8648",
    "tipo_documento": "Artigo de Revista",
    "rotulo": 1,
    "resumo": " Partículas nanométricas de CoFe2-xCexO4, em que 0 ≤ x ≤ 0,29, foram sintetizadas pelo método sol-gel/combustão e a absorção de micro-ondas das ferritas foi medida pelo método de Absorção de Microondas Modulada Magneticamente (AMMM). Os resultados mostraram que a absorção é máxima para uma concentração de Ce entre 0,18 e 0,26, um resultado que pode ser útil para aplicações práticas desse material.",
    "texto": " 1. Introdução Aferrita de cobalto (CoFe que, na forma nanométrica, tem sido muito estudado nos últimos anos devido 2O4) é um espinélio ao grande número de aplicações, dentre as quais a absorção de micro-ondas [1]. Resultados recentes obtidos por outros pesquisadores [2,3] sugerem que a dopagem com cério aumenta a absorção de microondas pela ferrita de cobalto, mas apenas até uma fração molar de Ce da ordem de 0,3. O objetivo do presente trabalho foi confirmar esta alegação e determinar a causa da redução da absorção de microondas para frações molares de Ce maiores que certo limite. 2. Método experimental 2.1 Preparação das amostras Quantidades estequiométricas de Fe(NO3)3.9H2O, Co(NO3)2.6H2O e Ce(NO3)2.6H2O de alta pureza foram dissolvidas em água deionizada para obter a solução inicial. A esta solução foi acrescentada uma solução 0,75 molar de ácido cítrico (C6H8O7). O béquer contendo a solução final foi posicionado em uma placa quente sob agitação constante e mantido a uma temperatura de aproximadamente 60 oC até se formar um gel. Em seguida, a temperatura foi aumentada para 80 oC até o gel se tornar transparente. A temperatura foi aumentada para ocorrer a evaporação da água e o material entrar em combustão. A combustão produziu um pó, que foi macerado em um almofariz e usado para preparar uma pastilha, que foi tratada a 1000 oC por 2 h. A pastilha foi resfriada até a temperatura ambiente e macerada em um almofariz. As amostras foram rotuladas de acordo com a composição nominal, como mostra a tabela 1. 2.2 Equipamentos Os difratogramas foram obtidos em difratômetros PANalytical X’Pert Pro da Companhia de Pesquisa de Recursos Minerais (CPRM) e do Centro de Pesquisas de Energia Elétrica (CEPEL). A análise dos difratogramas foi realizada com o auxílio do software TOPAS, utilizando o método de Riertveld. As medidas da absorção da derivada da curva de absorção de micro-ondas em função do campo magnético foram realizadas no laboratório de ressonância magnética do Instituto Militar de Engenharia (IME) em um espectrômetro de ressonância magnética Varian E-12 trabalhando na Banda X (9,5 GHz). 3. Resultados 3.1 Medidas de difração de raios X O objetivo das medidas de difração de raios X foi assegurar que a fase cristalina desejada estava presente. Um difratograma típico é mostrado na figura 1. De acordo com os difratogramas, todas as amostras, exceto a amostra de ferrita de cobalto não dopada, continham, além da fase espinélio, uma fração significativa de óxido de cério (CeO2). O fato de haver nas amostras uma fração significativa de CeO 2, o que também foi observado [2,3] por outros pesquisadores, significa que a concentração de Ce na ferrita mista é menor que a concentração nominal. Para determinar a concentração real de Ce, foi usado o refinamento de Rietveld para determinar as frações mássicas de ferrita e óxido de cério. O difratograma da figura 2 foi ajustado para uma ferrita de cobalto pura, com a ficha ICSD109044, e a concordância foi boa, com um GOF de 1,2. Os difratogramas das figuras 3 a 7 foram inicialmente ajustados pelo software TOPAS com uma ficha de ferrita de cobalto dopada com cério criada tomando como ponto de partida a ficha ICSD109044 de ferrita de cobalto pura e refinados recursivamente até que as frações mássicas fossem compatíveis com as distribuições catiônicas determinadas por Hashhash et al. [4,5]. Os resultados finais são apresentados nas tabelas 2 e 3. A figura 8 mostra a variação da fração mássica de ferrita com a concentração nominal de cério. A variação é praticamente linear. A reta mostra o resultado de um ajuste por mínimos quadrados, segundo qual variação pode ser descrita com boa aproximação pela equação em que fm é a fração mássica de ferrita e fn é a fração molar nominal de cério. 3.2 Medidas de absorção de micro-ondas A figura 9 mostra a absorção não ressonante de micro-ondas conhecida como Absorção de Micro-ondas Modulada Magneticamente (AMMM) de CoFe2-xCexO4 à temperatura ambiente, obtida em um espectrômetro de ressonância magnética Varian E-12. Os parâmetros usados foram os seguintes: frequência de micro-ondas, 9,5 Hz; potência de micro-ondas, 10 mW. A intensidade relativa da absorção de micro-ondas em função da concentração de cério é mostrada na tabela 4 e na figura 10. 4. Discussão Os resultados de absorção de micro-ondas mostram que a absorção é máxima para uma concentração de cério entre 0,18 e 0,26, o que está razoavelmente próximo dos resultados obtidos por Jing et al. [3]. Quanto à causa do aumento da absorção de micro-ondas da ferrita mista, em relação à ferrita pura de cobalto para frações de cério até 0,3 e uma redução da absorção para frações superiores a 0,3, as medidas de tamanho de cristalito parecem eliminar a possibilidade de que essa grandeza seja responsável pela variação observada, já que não existe uma correlação entre o tamanho de cristalito e a concentração de cério (veja a tabela 2). Os dados de condutividade em altas frequências apresentados por Kamran e Anis-ur-Rehman [3] mostram uma variação semelhante à da absorção de micro-ondas. De acordo com esses autores, o aumento da condutividade em altas frequências das amostras com fração nominal de Ce menor ou igual a 0,3 se deve à diminuição da fração molar de íons de Fe3+ nos sítios tetraédricos, enquanto a redução da condutividade em altas frequências para frações nominais de Ce maiores que 0,3 é atribuída à presença de CeO2, que, acima de uma certa fração mássica, produz uma redução de condutividade que não é mais compensada pela redução da concentração de Fe3+ nos sítios tetraédricos. Para analisar matematicamente este fenômeno, foram analisadas separadamente a variação da fração mássica de CeO2 com a fração nominal de Ce (tabela 4 e figura 11) e a variação da fração molar de Fe nos sítios tetraédricos f,Fe,A com a fração nominal de Ce nas amostras (tabela 5 e figura 12). Nos dois casos, a variação é aproximadamente linear com a fração nominal da Ce nas amostras, mas a variação da absorção de microondas com a fração nominal de Ce não é linear. Como mostra a figura 13, é possível dividir a curva de absorção em duas regiões. Para uma fração de cério nominal menor que 0,2, a absorção é dominada pela redução da fração molar de Fe3+ em sítios tetraédricos e pode ser descrita por uma função normalizada de segundo grau A = 0,16 + 18 fCe2, em que fCe é a fração nominal de Ce. Para uma fração de cério maior que 0,3, a absorção é reduzida em virtude do aumento da fração mássica de CeO2 e a absorção tende a diminuir. Os resultados mostram, portanto, que a fração nominal de Ce para que a absorção de micro-ondas seja máxima é da ordem de 0,2 a 0,3 e que, para frações de Ce até 0,3, a absorção de micro-ondas nas amostras investigadas pode ser descrita por uma função razoavelmente simples, o que pode ser útil para futuras pesquisas. 5. Conclusões Neste trabalho foram investigadas as propriedades da ferrita de cobalto dopada com cério como um possível material para absorção de micro-ondas. Os resultados mostraram que nem todos os átomos de cério são incorporados à estrutura da ferrita das amostras dopadas, pois também é produzida uma certa quantidade de CeO2, que aumenta linearmente com a fração molar nominal de Ce. Observou-se que as amostras de ferrita mista de cobalto e cério apresentam uma absorção de micro-ondas maior que a ferrita de cobalto pura. A absorção aumenta com a concentração de Ce até uma fração molar de 0,22, provavelmente devido à redução da fração molar de átomos de Fe3+ em sítios tetraédricos. Nas amostras com concentração maior que 0,22 o valor da absorção diminui, o que é atribuído à grande quantidade de CeO2 presente no material. "
}