{
    "id": 147,
    "titulo": "avaliação de desempenho de redes tolerantes a interrupções na troca de mensagens táticas entre navios de guerra",
    "autor": "davi marinho de a falcão, ronaldo moreira salles, paulo henrique coelho maranhão",
    "url": "http://www.ebrevistas.eb.mil.br/CT/article/view/8633",
    "tipo_documento": "Artigo de Revista",
    "rotulo": 1,
    "resumo": "Disruption-Tolerant Networks (DTN) são uma evolução das Mobile Adhoc Network (MANET) onde DTN trabalham em cenários cujos nós estão esparsamente distribuídos, com baixa densidade, cujas conexões são intermitentes e onde uma infraestrutura fim-a-fim não está disponível. Portanto, DTN são recomendáveis para aplicações que apresentam latência alta que pode durar de horas até dias. O cenário marítimo possui características que justificariam o uso de redes DTN, então este trabalho propõe avaliar uma abordagem DTN no cenário marítimo envolvendo navios de guerra, em parceria com helicópteros, para o encaminhamento de mensagens táticas. As simulações compararam a performance dos protocolos Epidemic, Spray and Wait e Direct Delivery em 3 cenários com dimensões diferentes.",
    "texto": " 1. Introdução Otransporte marítimo é responsável por 90% do comércio internacional, o que justifica o grande investimento mundial no comércio marítimo e em áreas portuárias. Isto faz do mar uma área estratégica que gera riquezas para os países que possuem o conhecimento de como usar os seus recursos de forma apropriada. Acompanhando a crescente demanda do transporte marítimo existe também a necessidade de manter os navios transmitindo e recebendo informações, tais como: geolocalizações, dados meteorológicos, o status de um determinado navio, pedidos de socorro, etc. Soluções de comunicação para o ambiente marítimo são geralmente lentas e mais caras do que as soluções terrestres [1]. Essas redes são baseadas em tecnologias de High Frequency (HF), Very High Frequency (VHF) e Ultra High Frequency (UHF), para comunicação perto da costa e sistemas de satélite para cobertura de áreas a longas distâncias [2]. Por isso é importante escolher uma infraestrutura de rede que suporte comunicação em cenários com nós esparsamente distribuídos. Navios de guerra precisam trocar informações táticas entre eles durante operações e treinamentos. Contudo no alto mar, os navios sofrem com a frequente falta de conectividade porque naturalmente precisam se movimentar para longe de suas Estações Rádio Base. Deve também ser mencionado que as tecnologias satelitais nem sempre são acessíveis, seja pelo alto custo de implementação, seja pelos valores de alocação dos serviços. O risco de se obter soluções prontas que não haja transferência de conhecimento é considerado crítico quando o assunto envolve questões de defesa nacional. Como uma alternativa de baixo custo para comunicações intermitentes dos cenários dos navios de guerra, esse trabalho analisa a adequabilidade dos protocolos DTN como infraestrutura de comunicação para esses navios. As mesmas soluções adotadas para as comunicações terrestres sem fio não podem ser aplicadas com a mesma facilidade nos cenários marítimos, por causa das características naturais deste ambiente. Algumas alternativas para minimizar o problema inclui a instalação de equipamentos com baixas taxas de transmissão. As redes táticas dos navios de guerra são responsáveis por distribuir informações oriundas dos subsistemas táticos. Contudo, os navios sofrem de muita intermitência de sinal, dificultando que as mensagens alcancem todos os destinatários. Isso faz com que aumente o número de retransmissões devido ao aumento da taxa de erros de entrega. Por isso é importante escolher estratégias de roteamento que diminuam essas retransmissões, aumentando a probabilidade de sucesso na entrega [3]. Contudo, estratégias convencionais de roteamento TCP/IP requerem que os nós estejam presentes no raio de transmissão da rede sem fio. Em outras palavras, é necessário que pelo menos o nó intermediário esteja conectado à rede para que seja capaz de retransmitir informação para os nós remotos. Por isso esse trabalho propõe uma abordagem híbrida de redes, mantendo as tecnologias de comunicação atualmente em vigor no cenário marítimo, porém incrementando essa capacidade com uma arquitetura do tipo mesh, contendo uma infraestrutura de redes DTN no interior dos navios. Algumas características do cenário marítimo poderão favorecer as redes DTN nos navios de guerra, tais como: a baixa densidade na distribuição dos navios no mar, capacidade ilimitada de buffer e de energia disponíveis e velocidades dos navios favorecendo contatos prolongados entre eles. 1.1 Objetivo O presente artigo visa estudar e avaliar a performance de protocolos DTN em cenários marítimos envolvendo navios de guerra. Os cenários marítimos foram obtidos através da composição de rotas reais de navios e helicópteros da Marinha do Brasil. 1.2 Metodologia Os cenários marítimos serão simulados através de uma ferramenta de código aberto para redes oportunísticas conhecida como The ONE [4]. As simulações ocorrerão sobre 3 cenários distintos, diferenciados em termos de área, número de mensagens criadas, tamanho das mensagens e número de nós na rede. Serão avaliadas as performances dos protocolos selecionados em cada cenário marítimo, levando-se em consideração: a taxa de entrega de mensagens, atrasos, número de navios e o impacto da presença de veículos de alta velocidade dentro do cenário (helicópteros, drones etc). 2. Trabalhos relacionados O cenário marítimo [5] possui características peculiares que o torna compatível com redes tolerantes a interrupções. No trabalho de Moshin e Woods [6] foi proposto o uso de Mobile Ad-hoc Network (MANET) [7],[8] como uma alternativa de baixo custo para a comunicação de navios através de comunicação de rádio VHF. A rede MANET apresentou limitações no ambiente marítimo em regiões com alta densidade de nós ou muito esparsas. O trabalho avaliou quatro protocolos MANET no cenário marítimo: Ad-hoc On-Demand Distance Vector Protocol (AODV), Ad-hoc On-Demand Multipath Distance Vector Protocol (AOMDV), Dynamic Source Routing Protocol (DSR) e DestinationSequenced Distance Vector Protocol (DSDV), sendo que o AOMDV foi considerado o mais eficiente. O trabalho de Moshin et al. [9] também tratou do assunto do uso de MANET em cenários marítimos, simulando três tipos diferentes de protocolos. Ele também recomendou a aplicação de MANET como uma alternativa de baixo custo para os navios e concluiu que as rotas que os navios desenvolvem tendem a facilitar a entrega de pacotes através de múltiplos saltos. Ainda de acordo com o texto, a performance dos protocolos MANET apresentou uma relação positiva com a densidade de nós no cenário, ao mesmo tempo que uma relação inversa quanto à mobilidade. Isso significa que as taxas de entrega aumentam com o número de navios na área e diminuem com o aumento da mobilidade, fazendo os cenários mais esparsos. K. Youngbum [10] propôs o uso de uma rede similar à uma VANET (Vehicular Ad-hoc Network) no cenário marítimo chamada NANET (Nautical Ad-hoc Network). Uma NANET é uma arquitetura híbrida de redes em modo mesh que serviria para aumentar a capacidade de comunicação entre os navios. As simulações ocorreram em três cenários marítimos situado no porto, na costa e no oceano. Em todos eles a NANET foi simulada com os navios dentro e fora da cobertura de suas estações rádio base. No entanto, o grande problema das MANET é que elas precisam estabelecer uma conexão fim-a-fim antes de enviar uma mensagem. Contudo, este requisito não é sempre possível nos cenários marítimos por causa da grande quantidade de conexões e desconexões. Chrysostomou [2] também recomendou uma abordagem híbrida de arquitetura de redes envolvendo tecnologias convencionais e redes DTN no cenário marítimo. Ele também simulou três cenários que variaram em área, usando diferentes protocolos de roteamento: Epidemic, Prophet, MaxProp, Spray e Wait e RAPID. O trabalho concluiu que protocolos probabilísticos obtiveram uma melhor utilização dos recursos de rede e apresentaram uma boa performance na entrega de pacotes. O artigo também enfatiza sobre os benefícios das redes DTN nos cenários marítimos quando os nós estiverem esparsamente distribuídos. O problema dos protocolos probabilísticos é que eles precisam de um conjunto de informações prévias no intuito de gerar dados estatísticos, fazendo com que esses protocolos sejam muito sensíveis às mudanças. Essas mudanças podem trazer erros nas decisões de encaminhamento e perdas de oportunidades durante os encontros entre os nós. Em cenários esparsos, com poucos nós, os protocolos que se comportam incentivando o estabelecimento de conexões poderiam melhor contribuir para a entrega de mensagens aos destinatários finais. De uma forma geral, os trabalhos apresentados sobre redes Ad-hoc em cenários marítimos limitaramse a analisar as capacidades dessas arquiteturas em embarcações civis, porém o trabalho atual tem a finalidade de avaliar o uso de redes tolerantes a atrasos e interrupções, em um ambiente de simulação, para o trâmite de mensagens dos sistemas táticos entre navios de guerra. Um cenário de guerra se enquadraria como um ambiente desafiador [11], portanto possui características que podem vir a ser exploradas pelas capacidades das redes DTN. 3. dTn no ambiente marítimos Redes DTN são recomendadas em ambientes desafiadores [11], marcados por conexões intermitentes, ausência de uma infraestrutura fim-afim e que é beneficiada pela mobilidade dos nós [12], como acontece nos navios de guerra. Outras características que tornam as redes DTN atrativas para o ambiente marítimo são [2]: a baixa densidade na distribuição dos navios, uma capacidade ilimitada de buffer e de energia e as velocidades dos navios favorecendo contatos prolongados entre eles [9]. Em geral, a arquitetura DTN [12] propõe uma melhoria na comunicação dos cenários onde não existe uma infraestrutura fim-a-fim [13],[14]. 3.1 Protocolos de roteamento dTn Roteamento em redes DTN é dividido basicamente em duas estratégias [15]: a primeira delas é a estratégia de Inundação, que se baseia na replicação de mensagens para uma grande quantidade de nós com o objetivo de alcançar o nó de destino. Nesta abordagem, múltiplas cópias da mesma mensagem são criadas e enviadas através de um conjunto de nós denominados relay nodes. Esses nós armazenam as mensagens até que elas alcancem os nós de destino [16]. Protocolos baseados na estratégia de Inundação não necessitam de conhecimento a priori sobre as redes, pois eles não são probabilísticos. A segunda estratégia é a de Encaminhamento, que usa de conhecimento a priori sobre as redes para selecionar o melhor caminho até o destinatário, pois seus protocolos são probabilísticos. Esta estratégia usa o conhecimento a priori da topologia da rede ou sobre qualquer outra informação importante que permita a escolha do melhor caminho para o destinatário. Dessa forma, as mensagens não serão roteadas aleatoriamente, mas baseando-se em informações previamente disponíveis. Ainda existem abordagens híbridas que conciliam estratégias de inundação e de encaminhamento de acordo com a necessidade. 3.1.1 Single Hop Transition ou Direct Delivery É considerado o algoritmo mais simples, em que a fonte transmitirá diretamente ao destinatário, imediatamente quando eles fizerem contato [15], portanto não há retransmissões através de nós intermediários. Nesse tipo de protocolo, cada nó carrega somente a sua própria mensagem, a grande vantagem disso é que não é necessário alocar grandes recursos de armazenamento para esse tipo de protocolo. Contudo, os tempos de atrasos das mensagens serão os mais elevados comparado com outros protocolos que realizam encaminhamentos. Outro importante detalhe é que esse comportamento diminui a probabilidade de entrega das mensagens aos destinatários. Esse tipo de protocolo só se recomenda quando percebe que há uma grande movimentação na rede e que os nós de origem e destino estão a um salto de distância, ou seja, eles são vizinhos. 3.1.2 Two-Hop Relay Nesse protocolo, as retransmissões ocorrerão somente entre o nó de origem e aqueles com os quais ele manteve contato no primeiro momento. Então esses nós deverão cooperar, levando consigo essas mensagens até encontrar o destinatário final, sem gerar mais retransmissões. Esse tipo de protocolo significativamente aumenta a probabilidade de entrega de mensagens, se comparado ao Direct Delivery, contudo ainda apresenta as mesmas limitações do protocolo anterior, além do aumento do uso de largura de banda e de armazenamento [15]. 3.1.3 Epidemic Routing O Epidemic é considerado o primeiro protocolo de roteamento DTN. Ele assume que cada nó possui largura de banda e armazenamento ilimitados, isso significa que teoricamente todo nó pode armazenar todas as mensagens recebidas durante os contatos estabelecidos. Cada nó mantém uma lista de mensagens em um banco de dados interno e poderá transmitir mensagens inteiras para outros nós, durante os contatos. Em cenários onde os nós estão esparsamente distribuídos e as mensagens trocadas são curtas, este pode vir a ser considerado um bom protocolo. Contudo, o maior problema do roteamento epidêmico é que a mensagem continua se propagando, mesmo quando ela atinge o seu destinatário. Uma outra grande desvantagem é que esse tipo de roteamento consume uma grande quantidade de recursos [15]. Ele foi chamado de Epidemic por causa de seu comportamento, similar ao de uma transmissão de uma doença contagiosa, visto que o nó portador de uma mensagem irá tentar transmití-la para todos os nós em contato, sem nenhum critério. 3.1.4 Spray and Wait Este protocolo trabalha em duas fases, a primeira é chamada fase de Spray em que cada nó irá inundar a rede com cópias das mensagens para um número de L nós do tipo relay node, o valor de L é configurável no nó de origem. Se a mensagem alcança o nó de destino, a transmissão é interrompida, caso contrário ele entrará na fase de Wait em que os relay nodes podem transmitir somente durante a fase de contatos. O valor de L é calculado levando em consideração a densidade dos nós, perfil de distribuição e de mobilidade [15]. 4. Simulações Esta seção é responsável por mostrar os resultados e as explicações sobre o que foi observado durante as simulações. 4.1 Resultados das simulações Cada simulação correspondeu a um período de 12 horas de movimentação em um ambiente marítimo. Inicialmente os cenários foram simulados com a criação de apenas 16 mensagens ao todo, contudo foram realizadas simulações adicionais com 346, 585 e 587 mensagens. O tamanho das mensagens variou de 11 até 1000 bytes. Isso parte do princípio que as mensagens táticas trocadas entre os navios de guerra são poucas e curtas. O raio de transmissão foi configurado entre 12 e 13Km, as taxas de transmissão variando entre 300, 600, 1200 e 4800 bits por segundo. As velocidades dos navios variando de 0 até 18 knots. Em algumas simulações foram incluídos veículos com maior velocidade, que representaram o apoio de helicópteros na comunicação com os navios. As velocidades dos helicópteros variaram de 100 até 300 Km/h. Deste ponto em diante serão apresentados os resultados das simulações para cada um dos 3 cenários, mostrados nas figuras de 1 a 3, através da ferramenta OpenStreetMap. As rotas apresentadas nos cenários vieram da combinação de movimentações reais de navios e de helicópteros nos cenários marítimos. Sobre os cenários foram comparadas as performances dos 3 protocolos DTN mais citados: Direct Delivery, Epidemic e Spray and Wait. Os seguintes dados estarão contidos nas tabelas: Número total de nós (N.Nodes); Uma flag que indica a existência ou não de helicópteros na simulação (Helicopter); Numero total de mensagens (N.Messages); Tamanho das mensagens (Size); Média de entregas (A.V.Deliveries); e Média de Atrasos (A.V.Delays). 4.1.1 Cenário 1 Nesse cenário, foram realizadas cerca de 200 simulações, cada uma representou 12 horas de movimentação com a criação de 16 mensagens, cada mensagem variando de 11 até 1000 bytes de tamanho. Esse cenário possui 36 navios, sendo que em alguns momentos 4 deles foram substituídos por helicópteros, no intuito de verificar o impacto da influência de veículos de maior velocidade. Os resultados estão presentes na tabela 1. De acordo com os resultados, o protocolo Epidemic apresentou melhor performance na entrega de 16 mensagens no Cenário 1. Essa superioridade foi de 7.80% sobre o Spray and Wait e de 32.99% sobre o Direct Delivery. A performance dos protocolos podem ser visualizadas nas figuras 4 e 5. Pode-se perceber que os helicópteros, no Cenário 1, contribuíram com uma notável queda de 45.27% no tempo de atraso na entrega de mensagens usando o protocolo Epidemic, como pode ser visto na figura 6. As simulações no Cenário 1, de forma geral, mostraram o protocolo Epidemic como aquele que apresentou melhor performance na entrega de mensagens, cerca de 98.45%. Na sequência veio o Spray and Wait entregando 90.65% das mensagens e por fim o Direct Delivery, entregando cerca de 65.46% das mensagens. 4.1.2 Cenário 2 Nas primeiras simulações do Cenário 2 foram usadas as mesmas configurações do Cenário 1. Os resultados estão apresentados na tabela 2. O Cenário 2 apresentou uma redução de performance na entrega de mensagens em todos os protocolos quando comparado ao Cenário 1. Isso ocorreu pelo fato do aumento significativo de 250 km2 de área do novo cenário, mantendo-se a mesma quantidade de 36 nós. Portanto, a taxa de entrega de mensagens pelo protocolo Epidemic foi de 61%, no Spray and Wait foi em torno de 45% e no Direct Delivery foi de 17.55%, das 16 mensagens criadas. Porém o protocolo Epidemic continuou apresentando a melhor performance, entregando 43.43% mais do que o Direct Delivery e 16% mais do que o Spray and Wait. Essa sequência pode ser visualizada nas figuras 7 e 8. Os helicópteros provocaram uma redução de 11.20% no tempo de atraso na entrega de mensagens do protocolo Epidemic, como pode ser visto na figura 9. No Cenário 2 foram realizadas simulações adicionais com a geração de 340 e 581 mensagens, porém mantendo-se o número total de 36 nós, sendo que 4 deles eram helicópteros. Os resultados das novas simulações podem ser vistos na tabela 3. De acordo com a tabela 3, 67% das mensagens foram entregues através do protocolo Epidemic, enquanto que o protocolo Spray and Wait enviou 53% e o Direct Delivery apenas 18% das 340 mensagens. Contudo, nas simulações com 581 mensagens, o Epidemic e o Spray and Wait apresentaram um empate em torno de 64% das mensagens entregues enquanto que o Direct Delivery se manteve com 18% das mensagens entregues. 4.1.3 Cenário 3 Como era esperado, aumentando a área do cenário e mantendo a mesma quantidade de nós, as taxas de mensagens entregues ao destinatário tendem a diminuir. Pois nesse cenário é maior o esparsamento entre os navios, diminuindo a probabilidade deles se encontrarem. Para comprovar essa hipótese, no Cenário 3 foram realizadas simulações com 61 (25 novos nós). Os resultados da primeira simulação com 36 nós, 16 mensagens de tamanho variável de até 1000 bytes podem ser vistos na tabela 4. No Cenário 3, o protocolo Epidemic encaminhou cerca de 41.31% das mensagens, o protocolo Spray and Wait cerca de 34.83% e o Direct Delivery cerca de 15,81%. Isso mostrou que mesmo com o esparsamento do Cenário 3, o protocolo Epidemic se manteve como o melhor encaminhador e isso pôde ser visualizado nas figuras 10 e 11. Os helicópteros contribuíram com um acréscimo de 22% na entrega de mensagens, no protocolo Epidemic. Contudo, o simulador acusou um aumento de 20% na média de atrasos na entrega de mensagens, como mostrado no gráfico na figura 12. No entanto, uma explicação para esse aumento está na contabilização do tempo das mensagens entregues no cenário com helicópteros. Ou seja, como essas mensagens não haviam sido entregues nas simulações sem helicópteros, o tempo de armazenamento delas, em buffer, foi desprezado pelo simulador no cálculo final. Dando uma falsa impressão de que houve uma queda de desempenho, quando na verdade mais mensagens conseguiram chegar ao destinatário final através dos helicópteros. Por ser o cenário mais extenso, novas simulações foram realizadas com um número maior de navios e de mensagens no Cenário 3. A quantidade de nós variou de 36 para 61 navios e as mensagens variaram de 346 para 585. Os resultados dessas novas simulações podem ser visualizadas na tabela 5. Foi observado que quando aumentou-se o número de nós de 36 para 61, houve uma suave melhora de 4.21% na taxa de entrega das 346 mensagens criadas e de 2.81% na entrega das 585 mensagens criadas, no protocolo Epidemic. Com o aumento do número de nós na rede, os protocolos Epidemic e Spray and Wait apresentaram, mesmo pequena, uma melhoria de performance. Isso significa que esses novos nós, através da mobilidade [17], preencheram algumas das lacunas do novo cenário, permitindo que um número maior de mensagens pudessem chegar aos seus destinatários. Apesar do bom desempenho alcançado pelo protocolo Epidemic em todos os cenários, a estratégia adotada para o encaminhamento de mensagens, deste protocolo, trouxe preocupações com questões de segurança [18],[19]. Sabe-se que as mensagens dos sistemas táticos dos navios de guerra tramitam sempre em canais criptografados. Mesmo assim, pensando em dar continuidade ao estudo, deverá ser desenvolvido um módulo de segurança para o algoritmo do Epidemic [20],[21] no intuito de acrescentar mais uma camada de segurança para o trâmite de mensagens táticas em navios de guerra. 5. Conclusão A arquitetura DTN é útil em ambientes onde não exista uma infraestrutura de redes fim-a-fim. A sua habilidade de alcançar os destinatários, através da mobilidade dos nós, faz com que a abordagem DTN seja elegível para preencher as lacunas deixadas pelas redes convencionais. O número reduzido dos navios de combate em relação ao de embarcações civis (mercantes, pesqueiros etc), faz com que esses navios apresentem uma baixa densidade e estejam esparsamente distribuídos ao longo das grandes áreas das operações militares. Os cenários marítimos dos navios de guerra possuem características que favorecem o uso de redes DTN, tais como: energia e armazenamento ilimitados, constantes conexões e desconexões e velocidades compatíveis que permitem contatos prolongados. O protocolo Epidemic possui a capacidade de espalhar informação para o máximo número de nós possível, enquanto que o Spray and Wait impõe um tempo de espera entre uma inundação e outra. Por fim, o protocolo Direct Delivery não trabalha de forma colaborativa, representando a ausência de uma solução DTN em frente de um cenário desafiador. Neste trabalho, o protocolo Epidemic demonstrou ter o melhor desempenho no cenário marítimo, quando comparado aos protocolos Spray and Wait e o Direct Delivery. Quanto maior a colaboração, maior a probabilidade de sucesso na entrega de mensagens aos destinatários finais. Apesar do melhor desempenho do protocolo Epidemic, surgiu neste trabalho uma preocupação em relação à segurança desse protocolo, tendo em vista a grande quantidade de compartilhamentos executados por ele, podendo essa característica vir a ser explorada por nós maliciosos. Dessa forma, visando o aprimoramento da segurança do protocolo Epidemic no cenário marítimo, como trabalho futuro, deverá ser implementada uma técnica que auxilie o protocolo na seleção de conexões seguras. Essa ação permitiria conciliar a capacidade de disseminação do algoritmo do protocolo Epidemic com algum critério de segurança, de forma a diminuir a possibilidade de compartilhamento de informações sigilosas com nós não autorizados. Esse novo módulo representaria mais uma camada de segurança para comunicação de mensagens táticas entre navios de guerra, tendo em vista que tais mensagens não tramitam em texto claro, ou seja, utilizam canais criptografados. "
}