{
    "id": 148,
    "titulo": "otimização da trajetória de robôs móveis diferenciais de tração usando algoritmo de otimização por enxame de partículas",
    "autor": "gustavo s rodrigues, carlos l. m. de souza junior, elias d. r. lopes, marcelo a. acuña",
    "url": "http://www.ebrevistas.eb.mil.br/CT/article/view/6917",
    "tipo_documento": "Artigo de Revista",
    "rotulo": 1,
    "resumo": "Este artigo apresenta uma técnica de otimização não linear, a fim de otimizar a trajetória de um robô móvel diferencial não-holonômico. Os sistemas robóticos usados para realizar esse experimento consistem em um veículo com tração diferencial de duas rodas, acionado por dois motores de corrente contínua (CC) montados em um eixo comum e cada roda que pode ser conduzida independentemente para frente ou para trás, dado o movimento do robô. Este artigo também traz o modelo dinâmico do robô e o modelo do motor usado no robô. As equações cinemáticas do robô também são mostradas. O algoritmo de otimização por enxame de partículas, do inglês Particle Swarm Optimization (PSO), é aplicado para encontrar a melhor trajetória, usando o caminho mais curto e seguro entre dois pontos, evitando obstáculos fixos. O presente algoritmo é um método evolucionário que utiliza conceitos de otimização por enxames e a ideia original deste método veio da observação do comportamento social de populações de pássaros buscando um local ideal para se aninhar. O método visa equilibrar a individualidade e a sociabilidade da população para encontrar o local ótimo.",
    "texto": " 1. Introdução Os robôs de acionamento diferencial são muito populares e versáteis. Eles são amplamente utilizados para fins industriais e pessoais. Com o rápido crescimento da demanda e a chegada da quarta geração de automação da indústria, o estudo de seu movimento tornou-se cada vez mais necessário. A proposta neste trabalho consiste na tarefa simples de deslocamento ao objetivo, que exige que o robô se mova de um ponto inicial, com uma determinada pose (posição e orientação do robô) inicial, e vá para o ponto desejado com a pose desejada, evitando possíveis obstáculos anteriormente inseridos no sistema. Para tornar isso possível, um algoritmo para otimizar o caminho entre esses dois pontos é usado, um sistema de visão aérea também é implementado para capturar a pose instantânea do robô, alimentando o algoritmo do caminho de otimização e obtendo resultados mais precisos. 2. Modelagem Os robôs móveis com rodas constituem uma classe de sistemas mecânicos caracterizados por restrições cinemáticas que não são integráveis e, portanto, não podem ser excluídas das equações do modelo [1], o que significa que o uso da abordagem padrão para manipuladores robóticos sem restrições não é mais útil para o sistema usado neste trabalho. Como as modelagens cinemática e a dinâmica dos robôs de acionamento diferencial, que são muito específicas, não estão bem documentadas em livros, é necessário o estudo do movimento desses robôs. Os robôs de acionamento diferencial são conhecidos como um sistema subatuado e também possuem características nãoholonômicas. Entre muitas alternativas diferentes para modelar a dinâmica de um sistema, a abordagem da dinâmica de Lagrange foi usada para modelar a dinâmica do robô neste trabalho. 2.1 Restrição Não-Holonômica Um sistema não-holonômico está sujeito a pelo menos uma restrição não-integrável (isto é, nãoholonômica) [2]. Nesse caso, o comportamento de rolagem das rodas fornece ao robô uma limitação de movimento chamada restrição não-holonômica. Essas restrições tornam o robô capaz apenas de avançar e recuar, nunca se movendo para os lados. Existem duas restrições não-holonômicas no sistema e podem ser expressas como: - Nenhum movimento de escorregamento lateral, o que significa que o robô não pode se mover de lado; - Restrição pura ao rolamento, o que significa que cada roda pode ter apenas um ponto de contato com o piso, como mostra a figura 1. 2.2 Modelo Cinemático São necessários dois sistemas de coordenadas diferentes para referenciar um modelo de maneira confiável [3]. O primeiro sistema define o robô no referencial global e é chamado de sistema de coordenadas inercial e o segundo sistema define o robô em seu próprio referencial e é chamado de sistema de coordenadas do robô. Eles serão indicados como (Xi; Yi) e (Xr; Yr), respectivamente. A posição e a orientação do robô no sistema inercial estão indicadas na equação (4) onde (xa, ya) é a posição do robô (ponto 0), que é o centro das rodas motrizes na figura 2 sobre o sistema de coordenadas global e é a orientação do robô no sistema de coordenadas global. R e L são a velocidade angular das rodas direita e esquerda, respectivamente. A velocidade linear do robô e a velocidade angular são indicadas nas equações (5) e (6), respectivamente. 2.3 Modelo Dinâmico A obtenção do modelo dinâmico do sistema é necessária para a resposta do sistema mais precisa. Um método muito poderoso e tradicional é usado para descrever o movimento do robô. Lagrange introduziu esse método em 1788 e, desde então, é amplamente utilizado para descrever a equação de movimento de sistemas mecânicos. O método de Lagrange usa as energias cinemáticas e potenciais do sistema para formular as equações de movimento e pode ser escrito como indicado na equação (7). Onde L = T – V é a função Lagrangiana, T é a energia cinética, V é a energia potencial qi, são as coordenadas generalizadas, F é o vetor de força generalizada, Λ é a matriz de restrições e λ é o vetor dos multiplicadores de Lagrange. A energia cinemática do sistema é dada pela equação (8). Como o sistema tem uma dinâmica restrita horizontal, pode-se fazer L = T, então a equação de movimento do sistema é dada pelo sistema de equações (9). Onde C 1... C5 são os coeficientes relacionados às restrições cinemáticas. Usando o modelo cinemático, o modelo dinâmico reduzido pode ser escrito em termos das velocidades linear e angular do robô (v e ω), conforme descrito no sistema de equação (10). 2.4 Modelo do motor de corrente contínua (CC) A dinâmica do motor de corrente contínua (CC), amplamente difundida em muitos livros diferentes, é conhecida como: Onde E é a tensão da armadura, i é a corrente da armadura, R é a resistência da armadura e L é a indutância da armadura. A inércia do eixo do motor é dada por Is, Kt é a constante de torque do motor, K w é a constante de tensão, é o coeficiente de atrito viscoso e τ é a carga dinâmica aplicada ao motor. Fazendo L igual a 0, é possível encontrar o modelo de ordem reduzida, que é descrito como: 3. Otimização O primeiro problema de planejamento de trajetória foi abordado por [5], onde o objetivo era encontrar o menor caminho entre um ponto inicial A até um ponto final B não levando em consideração a presença de obstáculos. Posteriormente, Murray [6] e Santilli [7] usaram a mesma abordagem de Dubins [5] para o problema de planejamento de trajetória, mas incluíram obstáculos no ambiente. No presente trabalho, é utilizada a técnica denominada Optimização por Enxame de Partículas, do inglês Particle Swarm Optimization (PSO), que explora todas as soluções possíveis para o problema da obtenção de trajetória e encontra a trajetória que leva o robô de um ponto A a um ponto B através do menor caminho possível. O algoritmo PSO é um método evolucionário proposto por Eberhart [8] que utiliza conceitos de otimização por enxames. Segundo Dulikravich [9], a ideia original deste método veio da observação do comportamento social de populações de pássaros buscando um local ideal para se aninhar. Conforme descrito Herskovits [10], o método visa equilibrar a individualidade e a sociabilidade da população para encontrar o local ótimo. Quando a individualidade aumenta, consequentemente a procura por locais alternativos para o aninhamento cresce. Entretanto, quando a individualidade da população fica muito alta, os indivíduos podem nunca encontrar o melhor local. Por outro lado, quando a sociabilidade da população é aumentada, o indivíduo aprende mais com a experiência do vizinho e tende a não buscar novos locais para aninhar-se. Porém, se a sociabilidade fica muito alta, todos os indivíduos podem convergir para o primeiro local de mínimo encontrado, que possivelmente seja um mínimo local. Assim, no PSO, as partículas ou indivíduos de uma população, são constantemente melhoradas graças a experiência de partículas vizinhas, mas também permitindo que cada partícula busque novas soluções que podem ser melhores que a solução das outras partículas. Neste método as partículas responsáveis pelo melhor valor da função objetivo daquela posição (pbest) e da história (gbest) são armazenadas e a cada iteração varia-se a velocidade das partículas para tender a pbest e gbest, de forma que: onde e são, respectivamente, a posição e a velocidade da partícula na iteração . A velocidade inicial é igual a zero quando k é zero, r1 e r2 são números aleatórios com distribuição entre 0 e 1 e também são definidos os parâmetros α entre 0 e 1 e entre β 1 e 2. 4. Odometria A medição da pose do robô é uma maneira muito confiável de verificar se o robô está seguindo o caminho obtido no processo de otimização. Existem muitas maneiras diferentes de obter a pose do robô. Neste artigo, uma estrutura de visão computacional de plataforma aberta, muito rápida e robusta, é usada para rastrear o robô enquanto ele está executando o caminho. A pose do robô pode ser obtida usando uma etiqueta chamada marcador fiducial, mostrada na figura 3. A etiqueta é fixada no robô e, com a ajuda de uma câmera com vista superior, o sistema pode obter velocidade, posição e orientação do robô. O sistema chamado de ReacTIVision consiste em um algoritmo opensource que fica constantemente verificando etiquetas coladas no robô. Cada etiqueta possui seu próprio número e, utilizando o ROS (Robot Operating System) através do protocolo TUIO – protocolo de comunicação desenvolvido com a finalidade de atender os requisitos de comunicação entre interfaces tangíveis, pode-se usar o software MATLAB para obter a pose e a velocidade do robô através da identificação da imagem, como mostrado na figura 4. 5. Resultados Como resultado parcial, a simulação alcançou o melhor caminho para o robô. A posição do objetivo foi alcançada evitando os obstáculos anteriormente inseridos na simulação, como mostra a figura 5. O X azul e o diamante são a posição inicial e a posição final, respectivamente, e os círculos azuis são os obstáculos e a linha preta é o caminho otimizado. 6. Conclusão Pode-se concluir que o objetivo do presente trabalho foi alcançado, obtendo-se a trajetória otimizada entre dois pontos sem que houvesse colisão com os obstáculos previamente inseridos no plano. O algoritmo PSO se mostrou bastante eficiente para o problema proposto, convergindo rapidamente para a solução, demonstrando a robustez desejada para problemas como determinação de trajetórias ótimas de robôs de acionamento diferencial com restrições não holonômicas. "
}