{
    "id": 149,
    "titulo": "detecção de embarcações em imagens de sensores orbitais ópticos baseada em características contextuais e comparação de formato de contorno",
    "autor": "nadjane c. de almeida, carlos frederico de sá volotão, karla dos s. t.",
    "url": "http://www.ebrevistas.eb.mil.br/CT/article/view/3384",
    "tipo_documento": "Artigo de Revista",
    "rotulo": 1,
    "resumo": "Neste artigo é apresentado um método de detecção de embarcações, baseado em características de contexto e características de comparação de formato de contorno dos alvos (embarcações), detectados em imagens provenientes de sensores ópticos orbitais, a partir da aplicação de filtros de detecção de bordas. O método utiliza essas características como descritores e os submete a um processo de classificação por rede neural artificial. Foi avaliado quanto à precisão, abrangência e medida F1. Em estudo de caso em que foram utilizadas imagens com resolução espacial de 5 metros, a média dos resultados do método para a medida F1 foi de 94,9%, sendo que a precisão média foi de 92,19% e a abrangência média foi de 100%, i.e., todas as embarcações de médio a grande porte presentes nas imagens foram detectadas. As falhas de precisão ocorreram em virtude de falsos positivos provocados por pequenas ilhas. O método conseguiu detectar embarcações fundeadas juntas e atracadas ao cais.",
    "texto": " 1. INTRODUÇÃO A extração de recursos provenientes do mar e o transporte em vias navegáveis representam importantes fontes de riquezas para países costeiros. O controle do tráfego marítimo é fundamental para a garantia da soberania nacional, proteção da Zona Econômica Exclusiva (ZEE), busca e salvamento no mar e repressão à pirataria e à pesca ilegal. Para o monitoramento de áreas marítimas extensas é bastante adequado o uso de sensores orbitais ópticos, tendo em vista que os avanços tecnológicos vêm proporcionando o aumento do número de sensores disponíveis, a redução do tempo de revisita, alta resolução espacial das imagens e possibilidade de acesso em tempo real. A detecção de embarcações em imagens ópticas aplica-se à esfera comercial e militar, oferecendo contribuição a sistemas de acompanhamento e controle de tráfego marítimo. A detecção de embarcações em imagens de sensores orbitais ópticos, na maioria dos métodos, é realizada em duas fases [1]: 1) extração de navios (alvos) candidatos a partir das variações de intensidade, provocadas pelo contraste entre a embarcação e a água e do rastro deixado por embarcações em movimento e 2) análise e verificação dos alvos extraídos. A maioria dos métodos realiza a extração das áreas que contenham navios candidatos por meio da segmentação da imagem, utilizando técnicas como a detecção de bordas [2][3], transformada de Fourier [4] e segmentação por saliência [5][6]. Outros métodos fazem a extração dos navios candidatos por meio da detecção de cantos [7] ou de rede neural convolucional [8]. Fatores como ondas, navios parcialmente encobertos por nuvens ou próximos de cais e de ilhas ou fundeados a contrabordo de outro navio representam os principais desafios desta fase. A verificação dos alvos extraídos, fase destinada à eliminação dos falsos positivos, é realizada por meio de abordagens que levam em consideração: a) características de textura [2]; b) outros dados contextuais [3]-[5][9][10]; e c) características de contorno [6][7]. A maioria dos métodos utiliza um classificador supervisionado, previamente treinado com um conjunto de amostras das características (a/b/c) de navios e de planos de fundo (background). Alguns dos classificadores mais utilizados na detecção de embarcações são Máquina de vetor suporte SVM [2][7][8], AdaBoost [5], floresta aleatória (random forest) [6]. Outras abordagens baseadas em histograma orientado a gradiente (HOG) [4] e probabilidade Gaussiana [9] também são utilizadas para eliminar falsos positivos. Neste artigo é proposto um método que tem por objetivo detectar embarcações em imagens de sensores orbitais ópticos a partir de características contextuais e comparação de formato de contorno, utilizando segmentação, matriz de descritores e rede neural artificial e oferecendo algumas contribuições para o tema: I) implementa a segmentação em uma sequência de passos destinados a solucionar problemas dos métodos anteriores (falhas de detecção em imagens onde a segmentação é complexa), suavizando interferências causadas por ondas e permitindo a extração de navios em vizinhança com nível de cinza similar, II) a matriz é formada por quantidade reduzida de descritores, em relação a métodos anteriores, III) os descritores consideram informações de contexto do alvo para contribuir na remoção de falsos alarmes e IV) utiliza um classificador robusto, flexível e capaz de extrair informação mesmo em padrões ruidosos e de fazer associações entre vários padrões de naturezas distintas, diferentemente do SVM que classifica padrões distintos em pares, que aprende por experiência. O método proposto é apresentado na seção 2, que detalha os procedimentos adotados para a extração das embarcações candidatas, a obtenção dos descritores e a eliminação de falsos positivos. A seção 3 demonstra um estudo de caso de aplicação do método, abordando materiais utilizados, parâmetros de configuração, avaliação e comparações. Os resultados são discutidos na seção 4. A conclusão e as considerações finais são apresentadas na seção 5. 2.\tO MÉTODO   O método propõe-se a detectar embarcações de porte compatível com a resolução espacial da imagem, i.e., com largura correspondente a, no mínimo, duas vezes o tamanho do pixel.  As embarcações candidatas extraídas das imagens são analisadas por meio de descritores: dados de contexto, textura e comparação de contorno (forma), que são as entradas da rede neural artificial (RNA) [11]-[16]. A Fig. 1 apresenta o fluxograma de visão macro do método, separando os processos nas fases de treinamento e classificação da RNA. 2.1 Processamento digital das imagens Este processo destina-se à extração das embarcações candidatas por meio da segmentação da imagem, utilizando principalmente um filtro de detecção de bordas. O método propõe o emprego do  operador Canny [17]  em função do desempenho observado, comparativamen e a outros filtros detectores, e gerando um resultado binário e bordas com linhas finas, Fig. 2 (b). A imagem resultante da aplicação do filtro de Canny pode conter muitos ruídos quando o cenário sofrer interferência por fatores como ond s e nuvens. Neste caso, aplica-se uma máscara binária, criada por limiarização da imagem original - Fig. 2 (a), que p rmita remover os fatores da interferência, como se constata na Fig. 2 (c). Cenários   complexos   em que   o   nível   de   cinza das embarcações seja similar ao da vizinhança, como navios no porto, podem ser tratados utilizando-se uma máscara da área de continente. A quantidade mínima de pixels consecutivos, ajustada em função da resolução da imagem, define o parâmetro do operador utilizado para um refinamento da eliminação de ruídos, i.e., grupos de pixels menores que uma embarcação,  Fig. 2 (d). O fechamento e o preenchimento das regiões de detecção dos alvos candidatos são realizados para a obtenção da imagem segmentada, Fig. 2 (e). 2.2 \tObtenção dos descritores Este processo destina-se à obtenção das características de contexto (baseadas   em   dados   espectrais   da   vizinhança relacionados às características das embarcações), textura e  comparação de contorno dos  segmentos da imagem. Essas características, detalhadas nas seções 2.2.1 e 2.2.2, formam a matriz dos descritores da imagem.  2.2.1\tCaracterísticas de comparação de contornos A    comparação    de    contornos    visa reconhecer    as características de formato das embarcações. Estas geralmente possuem aparência fina, alongada e simétrica e são divididas  em   roa, popa e laterais. A proa normalmente possui aspecto pontiagudo ou ar edondado e a popa possu semelhante ao da proa. Para cada segmento extraído da imagem é gerado o código da cadeia (chain code) dos pixels do contorno [17]- [19]\t, representado graficamente na Fig. 2 (f). Os contornos são suavizados, reduzindo suas irregularidades, por meio da simplificação de pequenos trechos, que são convertidos em segmentos de reta com direção similar. Os pontos de início e de fim marcam os vértices entre segmentos de reta adjacentes e estão destacados com círculos na Fig.3 (b). O código da cadeia do co ntorno suavizado é convertido em função de desvio (turning function ou turning angle function) [20]-[23], que é utilizado para gerar a descrição do formato do objeto, fornecendo uma assinatura de sua forma. Na função de desvio, a distância é dada pelo tamanho do segmento de reta e o ângulo é obtido pela Eq. 1, onde <v,u> é o produto escal r dos vetores v e u e |v|.|u| é o produto dos módulos dos vetores v e u. Para a comparação de formato das partes da embarcação, criou-se um conjunto de padrões esperados e de padrões que não atendiam às características selecionadas das embarcações, realizado, são considerados padrões válidos aqueles que representam proas ou popas de embarcações e inválidos os demais, considerando a resolução espacial da imagem. Os padrões válidos têm formato de V, onde 55⁰ θ  90⁰, ou de U, com dois ângulos consecutivos, aproximadamente retos (θ1 e θ2  90⁰). Os padrões inválidos são aqueles onde 0⁰ θ  55⁰e 100⁰ θ  360⁰. A   comparação   dos   segmentos   da   imagem   com   os parâmetros válidos e inválidos é realizada por meio do cálculo   da   distância   entre   as   funções   de   desvio   [20], conforme Eq. 2, onde A e B referem-se aos contornos a serem comparados, ƟA é a tangente em sentido horário   medida a partir de um ponto de referência em A, ƟB é a tangente em sentido horário medida a par ir de um ponto de referência em B, s representa o tamanho do arco, t é o valor de deslocamento e p é a medida   e distância, sendo p = 1 correspondente à distância euclidiana. Quanto mais  semelhantes forem as formas, menor será o valor da distância. Haverá dois descritores de comparação, um para proa e outro para popa. As comparações entre as extremidades dos segmentos e os padrões definidos são representadas por   valores binários, onde 1 indica padrão válido e 0 indica padrão inválido. 2.2.2\tCaracterísticas de textura e de contexto Os dados de textura utilizados são a média e o desvio-padrão , onde a média representa o valor da distribuição dos níveis de cinza presentes em uma textura e o desvio-padrão descreve a dispersão dos valores em torno da média, e estão definidos conforme itens V e VI. As características de contexto estão definidas de acordo com os itens I a IV. I.\tA resposta espectral da água do mar geralmente é muito baixa   em   faixas   espectrais   utilizadas   no   sensoriamento remoto. Como   dado   contextual,   utiliza-se   um filtro   de  estatística   de   ordem   [24]   e   arbitra-se   uma   ordem   k, significando que se considera a k-ésima menor resposta  espectral sem repetição encontrada na borda de uma máscara, estabelecida a partir do pixel analisado, com dimensão fixada em tamanho que caiba a maior embarcação com espaço mínimo de k pixels entre o contorno da embarcação e a borda da máscara, como se observa na Fig. 5 (a). A utilização da k- ésima menor resposta espectral é para evitar que ruídos ou  valores   baixos   inseridos   na   imagem,   em   função   de configurações   próprias do sensor, venham a influenciar negativamente neste dado. No caso estudado k = 3. II.\tA diferenciação dos tipos de alvos em função da  resposta espectral é utilizada com a mediana da vizinhança 3x3, desconsiderando os pixels externos ao segmento. III.\tA compacidade é o índice que descreve a aparência fina, alongada e  simétrica das embarcações. É obtida pela razão entre o perímetro P e a área A do segmento, conforme Eq. 3. Na Fig. 5 (b), a compacidade do objeto alongado é 22,64, enquanto a compacidade do círculo é 9,88. auxilia a diferenciação entre embarcações, grandes ilhas e porções de continente. V.\tA média é calculada a partir dos valores da vizinhança 99, desconsiderando os pixels externos ao segmento. VI.\tO desvio-padrão é calculado a partir dos valores da vizinhança 9x9, desconsiderando os pixels externos ao segmento. Para comparar dados extraídos de imagens diferentes e com variação de amplitude nos níveis de cinza, o mínimo, a mediana, a média e o desvio-padrão devem ser normalizados. O valor mínimo utilizado na normalização corresponde à mediana   de   vizinhança   11x11   a   partir   de   um   ponto selecionado em porção de mar.. O valor máximo corresponde à   mediana   de   vizinhança   3x3   a   partir   de   um   ponto selecionado no interior da embarcação com maior resposta espectral (Fig. 4). 2.3\tTreinamento da RNA O treinamento da RNA é realizado a partir das amostras retiradas de diversas imagens. Cada amostra é uma matriz de descritores. Cole adas todas as amostras, as matrizes são concatenadas, gerando um conjunto de dados de treinamento. Estes dados são normalizados antes de serem submetidos à RNA a fim de que os atributos estejam ajustados dentro de uma mesma escala de valores. 2.4\tClassificação da RNA e análise por segmento As médias e desvios-padrões utilizados na normalização dos dados que serão classificados pela RNA devem ser os mesmos aplicado na normalização dos dados de treinamento. A RNA faz a classificação por pixel, que neste método é  convertida em uma classificação por segmento, obtida por meio da moda das classificações dos pixels que constituem o segmento. Na Fig. 5 (c), onde  os pixels do segmento estão classificados   como   E,   M   e   O,   o   resultado   da classificação por segmento é embarcação (E). 3. APLICAÇÃO DO MÉTODO O método foi proposto para ser aplicado em imagens multiespectrais de sensores ópticos. Sua aplicação em imagens de outros sensores necessitará de ajustes de acordo com as características do sensor. A eficácia do método é definida pela relação entre o menor tamanho de embarcação e a resolução espacial da imagem. A área teste selecionada para o estudo de caso foi a Baía de Guanabara. É uma área de tráfego intenso que possui vários fatores relevantes para a detecção de embarcações, como portos, ilhas de diferentes tamanhos, embarcações de propósitos e formatos diversos, ondas, manchas de óleo e sedimentos na água. 3.1 Materiais Foram utilizados 31 recortes, com dimensões variando de 200200 a 400400, de imagens RapidEye [25] de 12 bits com resolução espacial de 5 metros, geradas nos anos de 2011, 2013 e 2014. Na aplicação do método proposto, foi utilizada a banda 5 do RapidEye (infravermelho próximo), tendo em vista os melhores resultados obtidos na segmentação das imagens em relação às demais bandas testadas isoladamente ou na composição RGB. O método foi implementado em um microcomputador core i7, 2.30 GHz, 8GB e Windows 10 Pro, 64 bits, utilizando os programas a) ENVI para visualização, coleta das amostras e SVM; b) IDL para detecção de bordas, código de cadeia, comparação de contorno, geração e normalização da matriz de descritores e análise da classificação; c) Neural Network Toolbox do MATLAB para a rede neural artificial. 3.1.1 Parâmetros de configuração da RNA A RNA possui oito entradas, duas camadas ocultas (com oito e dois neurônios, respectivamente) e três saídas: embarcação, mar e outros. Nessa configuração, as amostras de não-embarcação são balanceadas pela composição dos tipos mar e outros. A RNA possui ativação do tipo sigmoide e divide o conjunto de amostras aleatoriamente em 70% para treinamento, 15% para validação e 15% para teste. Foram utilizadas 875 amostras de 134 embarcações, 593 de mar e 702 de outros (ilhas, ponte e continente), totalizando 2.170 amostras extraídas de 15 recortes de imagens. 3.1.2 Parâmetros de configuração do SVM para comparação Os resultados do método proposto (método 1) foram comparados com os resultados de um método supervisionado de classificação de imagens, o SVM (método 2), aplicado diretamente sobre o número digital dos pixels da imagem, considerando todas as bandas RapidEye para melhor resposta. No método 2, não-embarcação também é formada por amostras de mar e de outros e é aplicada a análise por segmento, descrita na seção 2.4. No ENVI, foram selecionadas 50 amostras por classe em cada imagem e foi utilizada função de base radial (RBF) com γ = 1 (função kernel) e parâmetro de penalidade = 100.  3.3 Avaliação Dezesseis recortes de imagens foram utilizados para avaliação dos métodos. Os métodos 1 e 2 foram avaliados quanto à precisão (conforme Eq. 4, onde pv são os positivos verdadeiros e pf são os positivos falsos), abrangência (conforme Eq. 5, onde pv são os positivos verdadeiros e nf são os negativos falsos) e medida F1 (conforme Eq. 6, onde β = 1) que gera a média harmônica entre precisão e abrangência. 4. RESULTADO E DISCUSSÃO Aplicado em imagens ópticas com resolução espacial de 5m, o método 2 obteve 90,63% de acerto das classificações (precisão média), a medida F1 foi de 72,68% e foram detectadas 68,57% das embarcações de médio a grande porte. A baixa abrangência média deve-se ao fato de que o SVM teve exclusivamente como entradas as respostas espectrais, que se aproximam dos valores de outros alvos presentes na cena. O método 1 obteve 92,19% de acerto nas classificações, abrangência média de 100% e medida F1 de 94,9%, conforme Fig. 6. O método utilizou técnicas de processamento digital no processo de segmentação para tratar fatores de complexidade nas imagens, como embarcações próximas do porto ou de ilha - Fig. 7(a) - ondas e manchas de óleo, e conseguiu detectar todas as embarcações de médio e grande porte presentes nas imagens. A detecção de embarcações de formatos diferentes, Fig. 7(a), foi possível devido à utilização de características de formato e comparação de contorno. O método apresentou falsos positivos para ilhas pequenas ou com formato similar ao das embarcações, Fig. 7(b). Cabe ressaltar que em resolução de 5 metros, uma embarcação com largura igual ou inferior a 10 metros possui poucos pixels de contorno em suas extremidades. Quanto maior for a quantidade de pixels do contorno mais preciso será o formato da embarcação e menor será a influência dos pixels de vizinhança, permitindo uma melhor caracterização do problema. Em imagens de alta resolução espacial, onde a quantidade de pixels é maior e os contornos possuem maior riqueza de detalhe, é possível que o desempenho do método seja superior. A utilização de uma máscara para remover as regiões de terra resolve o problema dos falsos positivos relacionados a ilhas pequenas ou com formato similar ao de embarcações, aumentando a precisão do método. O uso de um classificador, que seja capaz de aprender por experiência e fazer associações entre vários padrões de naturezas distintas, oferece possibilidade de expansão do método proposto. Pode-se investigar o emprego da rede neural artificial e a comparação de contornos para a identificação dos tipos de embarcações (fragata, navio patrulha, rebocador, navios de cruzeiro, entre outros), a partir do treinamento da RNA com dados das silhuetas das embarcações e características, como largura e comprimento, em busca de padrões que permitam identificar os tipos das embarcações detectadas na imagem. 5. CONCLUSÃO O método apresentado neste artigo realiza a detecção de embarcações em imagens de sensores remotos ópticos baseado em descritores, como características contextuais e comparação de formato de contorno. Utiliza filtros de detecção de bordas para extrair embarcações candidatas nas imagens e aplica os descritores a uma rede neural artificial para eliminação dos falsos positivos. Aplicado em imagens ópticas com resolução espacial de 5m, obteve 92,19% de precisão, abrangência de 100% e medida F1 de 94,9%. Por ser um método baseado em segmentação, a qualidade da segmentação da imagem influencia diretamente na medida de abrangência. Um ponto forte do método consiste na realização de vários recursos de processamento de imagem para garantir a obtenção dos melhores resultados no processo de segmentação. Em consequência disso, o método conseguiu detectar embarcações de médio a grande porte, inclusive juntas, próximas ou atracadas ao cais. Outro ponto forte do método consiste no uso de características de formato e de comparação de contorno que permitiram detectar embarcações de formatos diferentes. O ponto fraco apresentado pelo método refere-se à ocorrência de falsos positivos para ilhas pequenas ou com formato semelhante ao de embarcações, em imagens de resolução espacial 5m. Contudo, uma máscara com as regiões de terra pode ser aplicada para remover os falsos positivos, resolvendo o problema. Em pesquisa futura pode-se estudar o treinamento da rede neural artificial com dados de características das embarcações, como silhuetas, largura e comprimento, em busca do reconhecimento de padrões que permitam também identificar os tipos das embarcações detectadas na imagem. O método tem possibilidade de aplicação em projetos e sistemas comerciais ou militares, como o projeto SISGAAZ (Sistema de Gerenciamento da Amazônia Azul), que prevê a integração de dados de satélites e radares aos sistemas relacionados a embarcações para o monitoramento da área do Pré-Sal, controle das atividades de pesquisa científica no mar, combate ao tráfego de entorpecentes e prevenção de poluição hídrica. "
}