	{
		"id": 15,
		"titulo": "centro de avaliações do exército avança na segunda fase de testes de monóculo de imagem térmica",
		"autor": "Noticiário do Exército",
		"url": "https://www.eb.mil.br/web/noticias/noticiario-do-exercito/-/asset_publisher/znUQcGfQ6N3x/content/id/15340542",
		"tipo_documento": "Notícia",
		"rotulo": 3,
		"resumo": 0,
		"texto": "Rio de Janeiro (RJ) – O Centro de Avaliações do Exército (CAEx) – Campo de Provas da Marambaia/ 1948 – avançou, na primeira quinzena de abril, na segunda fase da avaliação técnica do monóculo de Imagem térmica OLHAR. O projeto é desenvolvido pelo Centro Tecnológico do Exército (CTEx), em conjunto com a Empresa Opto Tecnologia Optrônica Ltda, em São Carlos - SP. Os testes iniciais foram realizados na Opto, no Instituto Nacional de Pesquisas Espaciais (INPE), em São José dos Campos - SP, no Instituto Eldorado, em Campinas - SP, no Labmor Laboratório Industrial, em Itatiba - SP, na Indústria de Material Bélico do Brasil – Fábrica de Itajubá - MG (IMBEL/ FI) e no CTEx. A avaliação técnica, no Campo de Provas da Marambaia, compreendeu ensaios de parâmetros de segurança, de desempenho e ambientais. Engenheiros e técnicos do CAEx, do CTEx e da OPTO participaram de testes de ergonomia, de percepção acústica, de exposição à umidade, imersão e a temperaturas extremas (baixa e alta) e de funcionamento sob exposição de poeira e areia. Após a avaliação técnica, quando são verificados os requisitos técnicos, logísticos e industriais do sistema, será executada a avaliação operacional, com tropa, a fim de constatar a adequação do monóculo OLHAR ao incremento da capacidade individual do combatente. A pesquisa e desenvolvimento (P&D) do monóculo OLHAR integram a atividade imposta pelo Plano Estratégico do Exército (PEEx) 2020-2023 Pesquisar e desenvolver Sistemas Auxiliares de Visão, conforme a prioridade Equipamentos de visão noturna, diurna, termal e fusão de imagens, do Plano de Obtenção de Capacidades Materiais do PEEx 2020-2023. O OLHAR é resultado de um esforço conjunto do Sistema de Ciência, Tecnologia e Inovação do Exército (SCTIEx), de instituições de P&D e da Base Industrial de Defesa e Segurança (BIDS) que disponibilizará às Forças Armadas e às Organizações de Segurança Pública (OSP) um equipamento avançado em microeletrônica, mecânica de precisão e óptica que atenderá aos requisitos operacionais e técnicos homologados para o Sistema Combatente Brasileiro (COBRA)."
	}
