{
    "id": 150,
    "titulo": "imbel entrega sistema gênesis de coordenação de fogos de artilharia ao exército brasileiro",
    "autor": "Noticiário do Exército",
    "url": "https://www.eb.mil.br/web/noticias/noticiario-do-exercito/-/asset_publisher/U3X7kX8FkEXD/content/id/16599787",
    "tipo_documento": "Notícia",
    "rotulo": 3,
    "resumo": 0,
    "texto": " Brasília (DF) – No dia 7 de junho, por ocasião das comemorações ao Dia da Artilharia conduzidas pelo Comando de Artilharia do Exército em Formosa (GO), foi realizada a entrega simbólica do Sistema Gênesis ao Exército Brasileiro, um sistema computadorizado de direção e coordenação de tiro no nível Brigada desenvolvido e produzido pela IMBEL. O Sistema Gênesis, denominado Sistema Digitalizado de Artilharia de Campanha (SISDAC) pelo Exército Brasileiro, representa um salto tecnológico para a Força Terrestre, por conferir maior eficiência na busca de alvos e garantir agilidade e precisão no desencadeamento de fogos, colocando a Artilharia brasileira no mesmo patamar de similares dos países detentores dessa tecnologia. Os eventos aconteceram no Forte Santa Bárbara, em Formosa (GO), sede do Comando de Artilharia do Exército, e incluíram a realização de tiro real com o emprego do SISDAC. O 3º Grupo de Artilharia de Campanha Autopropulsado (3°GAC Ap), Regimento Mallet, sediado em Santa Maria (RS), deslocou para o local dois obuseiros M109A5+BR, três viaturas blindadas de transporte de pessoal M113 e um veículo Posto de Comando M577 A2. A demonstração de tiro real com o emprego do SISDAC recebeu a denominação Operação Paranhos, em homenagem ao idealizador e um dos principais responsáveis pelo sucesso do Projeto Gênesis, o Coronel do Quadro de Engenheiros Militares Claudio Nossar Paranhos Junior, falecido em janeiro de 2021. Por quase vinte anos, o Coronel Paranhos serviu na Fábrica de Material de Comunicações e Eletrônica (FMCE) da IMBEL, assumindo a chefia da fábrica no período de 2011 a 2016. O desenvolvimento do Sistema Gênesis contou com a efetiva participação da Artilharia Divisionária da 1ª Divisão de Exército (AD/1), do Curso de Artilharia da Academia Militar das Agulhas Negras (AMAN), do 3° Grupo de Artilharia de Campanha Autopropulsado e do 5º Grupo de Artilharia de Campanha Autopropulsado, os dois últimos sediados em Santa Maria (RS) e Curitiba (PR), respectivamente, cujas sugestões técnicas e operacionais resultantes do emprego dos equipamentos em seus exercícios e simulações permitiram incorporar importantes aperfeiçoamentos ao Sistema. A cerimônia da entrega simbólica do SISDAC pela IMBEL ao Exército Brasileiro é um marco na evolução doutrinária da Arma dos fogos largos, densos e profundos, servindo para reforçar a importância da IMBEL para a autonomia estratégica das Forças Armadas do Brasil, uma empresa inteiramente nacional que disponibiliza produtos de qualidade com alto valor tecnológico agregado, fomenta a Base Industrial de Defesa e gera milhares de empregos diretos e indiretos. Conheça mais sobre o Sistema Gênesis, clicando aqui (https://www.imbel.gov.br/index.php/comunicacoes-eletronica-e-sistemas/104#topo).  "
}