{
    "id": 152,
    "titulo": " identificação de embarcações em imagens de radares de abertura sintética aerotransportados (r-99 sar) na área marítima do brasil",
    "autor": "gamba, s.",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2012/st/VIII_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "O objetivo deste trabalho é identificar embarcações em imagens de radar obtidas pela aeronave R- 99 da FAB. Dados de amplitude, obtidas na banda L e nas polarizações HH, HV, VH e VV da região de Porto de Tubarão, ES, foram processados por meio de diferentes tipos de realces, filtros, classificadores e transformadores espectrais. As imagens com maior potencial para identificar embarcações foram ainda analisadas para diferenciar embarcações militares de mercantes, considerando-se os cinco elementos de interpretação (forma, tamanho, sombra, tonalidade e fatores associados) e as cinco fases de interpretação de imagens (detecção, reconhecimento, análise, dedução e classificação). A combinação de processamentos mais favoráveis foi o realce com contraste 50-200, seguido de filtro abertura ou erosão e classificador SVM ou transformação SCI. A diferenciação entre embarcações mercantes e militares foi obtida nas fases de análise e dedução.",
    "texto": "  I. INTRODUÇÃO No Brasil, o transporte marítimo é responsável por mais de 95% da movimentação de mercadorias relacionadas com comércio exterior [23]. Em tempos de globalização, a fabricação de muitos produtos nacionais depende da importação de insumos, de tal sorte que interferências inapropriadas sobre o tráfego nos mares podem levar a nação ao colapso. Nesse sentido, é importante que o país conheça melhor e em maior detalhe, a sua Área Marítima. Nela, há a presença constante de embarcações responsáveis pela navegação de cabotagem (comércio entre portos nacionais) e de longo curso (comércio entre portos internacionais). Existe também a possibilidade de presença de navios militares estrangeiros que requerem monitoramento [23]. Conforme destacado por [21]-[16], extensas Áreas Marítimas como é o caso da do Brasil (~ 4,5 milhões de km2), necessitam de outras formas de vigilância que complementem as já existentes (reconhecimento visual e fotográfico). O uso de dados de sensoriamento remoto óptico para identificar embarcações é limitado por causa da impossibilidade de se adquirir imagens sob condições de cobertura de nuvens ou à noite. Além disso, a dificuldade aumenta quando a turbidez das águas é elevada [25]. Como conseqüência, dados de radar de abertura sintética (SAR) têm sido amplamente utilizados para identificar navios [6]-[24]- [22]-[13]. Além das já bem conhecidas vantagens de se utilizar dados provenientes de radares imageadores, isto é, a sua capacidade de imageamento independente das condições atmosféricas e de iluminação solar [17], a identificação de embarcações marítimas por meio de assinatura radar é promissora porque as estruturas regulares presentes no convés das embarcações agem como se fossem refletores de canto (alvos que refletem a maior parte da radiação incidente na faixa espectral de microondas, por meio de reflexão especular dupla) [10]. Neste caso, embarcações aparecem como manchas brilhantes em imagens de radar, independentemente se estão paradas ou em movimento. No entanto, a capacidade de detecção de embarcações marítimas em imagens de radar depende de características como tamanho, forma e estrutura da embarcação, orientação em relação ao pulso de radar e estado do mar [15], além dos parâmetros de imageamento do sensor. De uma maneira geral, sensores com alta resolução espacial (tipicamente, 3-5 metros) apresentam maiores probabilidade de detecção, especialmente quando as dimensões das embarcações são reduzidas, porém, possuem a desvantagem de apresentar faixas de imageamento menores [4]. Pesquisas com esses dados têm sido realizadas para identificar pistas de pouso [1], discriminar culturas agrícolas [20] e mapear incrementos de desmatamento na Amazônia [8]. O objetivo deste trabalho é identificar embarcações em imagens SAR do R-99 da área marítima do Brasil. METODOLOGIA Como área-teste, foi selecionada a região do Porto de Tubarão (20º14’53 e 20º21’57 de latitude sul e 40º11’44 e 40º22’44 de longitude oeste), no Estado de Espírito Santo, com comprovada concentração de embarcações mercantes. O porto movimenta atualmente 65 milhões de toneladas de ferro e pellets (combustível sólido de resíduos de madeira prensado, proveniente de desperdícios de madeira) e 1,5 milhões de toneladas de grãos por ano [3]. As imagens em amplitude foram recebidas com resolução radiométrica de 8 bits e com correção radiométrica e geométrica, mas sem o conjunto completo de dados auxiliares necessários para a transformação em coeficientes de retroespalhamento. Essas imagens foram, em seguida, convertidas para o sistema de coordenadas geográficas (latitude e longitude) e datum WGS-84 e recortadas no tamanho aproximado de 8 km x 12 km. O primeiro procedimento de análise dessas imagens foi feito por meio da extração de um conjunto de 50 amostras de valores digitais correspondentes a embarcações atracadas em cais (estruturas lineares onde as embarcações permanecem encostadas paralelamente) e piers (estruturas lineares estreitas perpendiculares ao cais) e de outro conjunto de 50 amostras correspondentes a instalações portuárias adjacentes. As amostras foram definidas visualmente no monitor do computador por meio da função de definição de regiões de interesse (ROI), disponível no aplicativo ENVI 4.3™. Cada amostra foi formada por um número mínimo de 35 pixels e um número máximo de 56 pixels. Os dois conjuntos de dados foram analisados estatisticamente por meio do teste t de Student. Discriminação de Embarcações em Imagens SAR Um conjunto de realces e classificações digitais de imagens foi testado com o intuito de definir a combinação de técnicas mais apropriadas para discriminar embarcações em imagens SAR. As imagens originais foram processadas por cinco técnicas de realce comumente utilizadas na literatura [18]-[11]: linear 2%, linear 50-200, gaussiano, equalização de histogramas e raiz quadrada. O realce que apresentou melhor desempenho foi selecionado para a etapa seguinte de filtragem espacial. O critério utilizado para essa seleção foi baseado e adaptado da proposta do Freund e Simon (2000). Segundo esses autores, a imagem que apresenta o melhor contraste final é a que apresenta a menor média e o maior desvio-padrão. Para esse estudo, o critério utilizado foi a da menor média. Como a região de estudo apresenta a maior parte da área ocupada por oceano, a imagem que apresentar a menor média de valores digitais tende a apresentar um contraste melhor entre oceano e embarcação. Os seguintes filtros espaciais morfológicos [9] foram aplicados: dilatação, erosão, abertura e fechamento. Novamente, aquelas imagens filtradas com melhor realce, i.e., menor média de valores digitais foram selecionadas para as etapas posteriores de classificação digital e transformação espectral. Os classificadores não-supervisionados testados foram o Isodata e o K-médias, enquanto os classificadores supervisionados analisados foram: Distância Mínima, Distância Mahalanobis, Máxima Verossimilhança (MAXVER), Spectral Angle Mapper (SAM), Spectral Information Divergence (SID), codificação binária e Support Vector Machine (SVM). Para a classificação supervisionada, foram extraídas amostras de treinamento de valores digitais em áreas representativas de embarcações, instalações do cais, oceano, vegetação e solo. O total de pixels variou de 4.227 pixels (embarcação) a 144.157 pixels (oceano). Testes foram ainda realizados com classificações envolvendo três dessas cinco classes (embarcações, instalações do cais e água). O desempenho dos classificadores foi avaliado pelo coeficiente Kappa (K) [12]. A (1) fornece o valor de K é: onde γ é o número de linhas e de colunas e N é o número total de pontos. Em termos de transformadores espectrais, as seguintes técnicas foram aplicadas: decorrelação, saturação e Synthetic Color Image (SCI). A escolha da melhor imagem classificada foi baseada na matriz de confusão [12], enquanto que a melhor imagem transformada foi baseada na maior média. Foram utilizadas as três polarizações com as menores correlações de Pearson. Identificação do Tipo de Embarcação (Mercante ou Militar) As imagens classificadas e transformadas com melhor desempenho para discriminar embarcações foram analisadas visualmente para verificar os seus potenciais para diferenciar as embarcações em militar ou mercante. As embarcações militares possuem formato hidrodinâmico, necessário para o desenvolvimento de velocidades mais altas. No convés, são encontrados dispositivos como armamentos, equipamentos eletrônicos e superestrutura no seu centro. Os navios mercantes possuem cascos retangulares, com proa mais arredondada. No convés, são encontrados mastros, paus-decarga, contêineres e superestrutura na metade traseira da embarcação [2]. Forma, tamanho, sombra, tonalidade e fatores associados (contexto em que os objetos se encontram nas imagens) de embarcações militares e mercantes presentes nas imagens processadas nas etapas anteriores desse estudo foram analisados nas diferentes fases de interpretação visual de imagens. A definição da forma de um alvo em uma imagem SAR depende da geometria do imageamento do sistema SAR (resolução espacial, distorção de escala na direção de visada, deslocamento devido ao relevo e distorções causadas pelo movimento da plataforma). O tamanho que um alvo apresenta numa imagem depende da resolução espacial do sistema, enquanto o sombreamento está relacionamento com o ângulo de incidência e orientação alvo-plataforma. Tonalidade é dependente do comprimento de onda, da polarização e do ângulo de incidência do sistema sensor, além das características dos alvos, principalmente da rugosidade, da constante dielétrica e da estrutura do alvo. As fases consideradas foram a detecção, o reconhecimento, a análise, a dedução e a classificação [14]- [6]. A detecção tem relação direta com a visibilidade dos alvos. Embarcações podem ser visualizadas ou não em imagens SAR, dependendo de fatores como qualidade das imagens, resolução espacial do sensor e contraste entre o alvo e o meio [5]. O reconhecimento estabelece o que é o alvo (por exemplo, aeronave, ponte, embarcação ou antena). O reconhecimento de alvos em imagens SAR é feito principalmente por meio da observação da forma e da tonalidade. A análise é o estágio onde o alvo de interesse deve ser observado em detalhes. Por exemplo, pulsos de radar que incidem sobre as estruturas físicas de duas e três faces do convés geralmente geram borrões nas imagens SAR, dificultando a diferenciação dos componentes presentes no convés. Este problema torna-se ainda mais acentuado em embarcações militares, por causa da presença de armamentos, equipamentos eletrônicos e estruturas físicas de vários formatos. A dedução é o estágio mais complexo, pois se fundamenta nos fatores associados ou convergência de evidências. O alvo é observado não isoladamente, mas como parte de todo um contexto [5]. Por último, classificação é o estágio das conclusões em que se chega à compreensão da identidade e do verdadeiro significado do alvo. Para identificar as embarcações encontradas na região do Porto de Tubarão em mercantes ou militares, foram adotados os seguintes critérios visuais: I = insuficiente, isto é, não atende às definições de forma, tamanho, sombra, tonalidade e fatores associados; e S = satisfatória, isto é, atende as definições dos cinco elementos de interpretação. RESULTADOS Em todas as três polarizações analisadas (HH, VV e VH), os valores digitais correspondentes a embarcações e instalações portuárias adjacentes situaram-se próximos do nível de saturação, isto é, muito próximos do valor 255 (Tabela I). De certa forma, este fato já era esperado por causa da reflexão especular dupla (refletores de canto. A análise estatística pelo teste t de Student mostrou que é possível diferenciar embarcações de instalações portuárias nas três polarizações consideradas (rejeição da hipótese Ho, Tabela I) e que a polarização VV possui maior potencial de discriminação [maior diferença entre tcrit (t crítico) e tcal (t calculado)]. Tabela I. Análise da separabilidade espectral entre embarcações (EMB) e instalações portuárias adjacentes (INS) por meio de teste t de Student, presumindo amostras de valores digitais com variâncias diferentes e nível de significância α = 0,05. Na Fig. 1, são mostradas imagens SAR (banda L, polarização HH) da região de Porto de Tubarão, realçadas simplesmente pelos contrastes linear 2%, linear 50-200, gaussiano, equalização de histogramas e raiz quadrada. Os valores médios de amplitude e os correspondentes desviospadrões dessas imagens realçadas são mostrados na Tabela II. De acordo com o critério de menor média de valores digitais, mencionado anteriormente, as cenas que apresentaram os melhores realces foram aquelas processados com contraste linear 50-200. Na Fig. 2, são mostradas imagens SAR (banda L e polarização HH) da mesma região de Porto de Tubarão e realçadas pelo contraste 50-200 e por quatro filtros espaciais distintos. As médias dos valores digitais e os correspondentes desvios-padrões dessas imagens realçadas são mostrados na Tabela III. De acordo com as informações constantes desta tabela, os filtros abertura e erosão foram os que apresentaram melhores desempenhos. Na Tabela IV, são mostrados os coeficientes de correlação entre as quatro polarizações, a um nível de significância de 1%. Polarizações com baixa correlação sugerem que as mesmas são complementares, isto é, informações que são realçadas em uma polarização não são em outra e vice-versa [19]. Resultados dessa tabela indicam uma alta correlação entre as polarizações cruzadas HV e VH, denotando redundância de informações. Dessa maneira, foi selecionada a combinação das polarizações HH, VV e VH para efetuar as etapas seguintes de classificação digital e transformação espectral. Na Tabela V, são mostrados os desempenhos dos classificadores supervisionado e não-supervisionado, considerando-se os valores de índice Kappa e de exatidão global. Baseados nesses valores, pode-se afirmar que o classificador SVM (Fig. 3) apresentou o melhor desempenho. Com relação aos transformadores espectrais, considerando-se os resultados estatísticos da Tabela VI, verifica-se que a transformação SCI (maior média de valores digitais) é a que permite uma melhor discriminação das embarcações (Fig. 4). Em ambas as imagens processadas por classificação SVM e por transformação SCI, a forma, o tamanho e a tonalidade foram os principais elementos de interpretação das imagens SAR que auxiliaram na diferenciação entre embarcações militares e mercantes (Tabela VII). Os elementos sombra e fatores associados ficaram no nível insuficiente. Nas fases de detecção e reconhecimento, foi possível visualizar embarcações com o auxílio da forma, tamanho e tonalidade, porém, não foi possível diferenciar embarcações militares de mercantes (Tabela VIII). Nas fases de análise e dedução, foi possível obter tal diferenciação com os elementos forma + tamanho e forma + tamanho + tonalidade, respectivamente. Na fase de classificação, nenhum elemento de interpretação foi aceitável para diferenciar embarcações. O fator tamanho foi decisivo na diferenciação entre embarcações militares e mercantes. As embarcações mercantes são maiores que as militares, exceção os naviosaeródromos. Nas embarcações mercantes, através da forma e do tamanho, foi possível identificar detalhes presentes nos convés como a superestrutura na parte traseira da embarcação, os mastros na extremidade dianteira da embarcação e estruturas no meio embarcação. A dedução foi uma das fases mais complexas de ser analisada, pois ela se fundamenta nos fatores associados ou convergência de evidências. Conforme mencionado anteriormente, o alvo é observado não mais de forma isolada, mas como parte de todo um contexto [5]. Como as embarcações estavam atracadas próximo aos cais e piers de um porto civil, deduziuse que se tratava de embarcações mercantes. Se as embarcações estivessem, por exemplo, atracados no porto da Baía de Guanabara, que pertence à Marinha, a dedução seria que se trataria de embarcações militares. Nas imagens SAR analisadas nesse estudo, não foi possível definir, com precisão, o tipo de embarcação militar (e.g., fragata, contratorpedeiro ou navio-aeródromo) ou o tipo de embarcação mercante (e.g., petroleiro, carga-geral ou graneleiro). Esse tipo de identificação pode ser feito com imagens ópticas de alta resolução espacial. CONSIDERAÇÕES FINAIS Para discriminar embarcações em imagens SAR do R- 99, a seqüência de processamento que apresentou os melhores resultados foi: realce de contraste 50-200; filtragem abertura ou erosão; composição colorida envolvendo as polarizações HH, VV e HV ou VH; e classificador SVM ou transformador SCI. Os elementos de interpretação passíveis de serem utilizados para a referida discriminação foram a forma, o tamanho e a tonalidade. Dentre as cinco fases de interpretação (detecção, reconhecimento, análise, dedução e classificação), foi possível discriminar embarcações nas fases de detecção e reconhecimento. A diferenciação entre embarcações mercantes e militares foi possível nas fases de análise e dedução. No nível de classificação, nenhum elemento de interpretação foi aceitável para identificar o tipo de embarcação militar ou o tipo de embarcação mercante.  "
}