{
    "id": 155,
    "titulo": "proposta de arquitetura e análise do desempenho de um processador track-before-detect utilizado na detecção radar em cenário naval",
    "autor": "marcos roberto seixas , e david fernandes",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2012/st/V_2.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 2,
    "resumo": " O desenvolvimento de tecnologias para materiais absorvedores de energia eletromagnética, associado a novas formas geométricas que diminuem a reflexão de sinais transmitidos pelo radar, permitiram a construção de aeronaves e mísseis de tecnologia furtiva. As unidades navais que operam em um ambiente hostil estão sujeitas a ataques aéreos por ameaças que são observadas com baixa razão sinal ruído (SNR), e por isso não são facilmente detectadas e rastreadas pelos sensores e sistemas de processamento convencionais. O desenvolvimento de novas técnicas de processamento de sinais de Radar, entre elas a técnica track-before-detect (TBD) permitem o acompanhamento e a detecção de alvos mesmo que sejam observados com baixa SNR. Propõe-se neste trabalho uma arquitetura TBD baseada em árvore de decisão para aplicação na detecção/rastreio de alvos em Radar de Vigilância. O processador proposto tem o seu desempenho avaliado por meio de simulações do seu emprego em um cenário de interesse naval.",
    "texto": " I. INTRODUÇÃO A técnica TBD (Track-Before-Detect) é empregada para realizar a detecção e o rastreio de alvos em situações de baixa razão sinal-ruído (SNR – Signal to Noise Ratio). Matematicamente ela escolhe a trajetória do alvo, segundo algum critério de otimização, dentre um conjunto de possíveis trajetórias [1]. Isso implica em se ter um conjunto de observações, e no caso de um sistema Radar um conjunto de varreduras, antes que se decida se existe realmente um alvo (detecção) e qual foi a sua trajetória (rastreio). As possíveis trajetórias, no final das observações, são avaliadas através de um Fator de Mérito. A trajetória que corresponder ao alvo, ainda não detectado, obterá um valor do Fator de Mérito acima das demais trajetórias, identificando desse modo que esta trajetória corresponde de fato ao alvo verdadeiro. Deste modo o possível alvo foi rastreado antes de ser detectado, o que justifica o nome da técnica. O desenvolvimento computacional dos últimos anos permitiu que a técnica TBD fosse aplicada em tempo real também em radares de busca aérea, gerando novos estudos e métodos de implementação. Os sistemas TBD diferem dos demais sistemas convencionais de acompanhamento de alvos pelo fato dele não usar uma sequência de detecções como medidas de entrada do filtro de rastreio, o que caracteriza a detecção antes do rastreio usada nos métodos convencionais [1]-[3]. Em geral os sistemas TBD são métodos de acompanhamento que exigem grande carga computacional, entretanto eles podem operar com baixa SNR [4]. Em sistemas de detecção e rastreio convencionais, quando se tem um ambiente de baixa SNR, o limiar de detecção deve ser reduzido o suficiente para permitir uma alta probabilidade de detecção, o que acarreta também uma alta taxa de falso alarme, não permitindo que o processo de detecção tenha um bom desempenho [5]. Na literatura especializada existem estudos que avaliam o desempenho da técnica TBD em função da área de busca dos possíveis alvos [6]; de seu uso em um Radar Doppler pulsado [7]; da sua implementação utilizando programação dinâmica associada à saída de um banco de filtros Doppler [8]; da sua utilização em conjunto com um controle automatizado que ajusta a Probabilidade de Detecção e Falso Alarme [3], do seu desempenho quando o sinal eco é afetado pelo clutter de mar [3],[9]; da sua implementação por meio de filtro de partículas, para detecção de objetos extensos [10]; do seu emprego por meio de técnicas de programação dinâmica, para o rastreio de alvos múltiplos [11]; da sua implementação baseada em integração coerente [12]; e da sua utilização onde se considera a atribuição de pesos ao Fator de Mérito relativo a trajetória dos possíveis alvos [13], entre outros estudos. Neste trabalho mostra-se o emprego da técnica TBD que utiliza uma arquitetura baseada em árvores de decisão, proposto para aplicações em detecção/rastreio de alvos de Radar [14]. O método TBD proposto teve o seu desempenho avaliado em um cenário naval onde é realizado o rastreio/detecção de uma ameaça aérea. II. MODELO DINÂMICO DO ALVO E DA MEDIDA O alvo considerado tem uma dinâmica que corresponde ao modelo proposto por (SINGER, 1970) e (SINGER e BEHNKE, 1971). A equação de estado do alvo na k-ésima varredura é representada por onde N v é o número de varreduras e o vetor de estado é representado por sendo r(k) a distância do alvo ao Radar, v(k) a sua velocidade radial, a(k) a aceleração radial, ψ(k) o azimute, ω(k) a velocidade angular azimutal e γ(k) a aceleração angular azimutal. A matriz de transição de estado F, considerada invariante com o tempo, é dada por onde TV é o tempo de varredura do Radar, ρa o coeficiente de correlação da aceleração linear a(k) e ργ o coeficiente de correlação da aceleração angular azimutal γ(k). O vetor ruído de estado é representado por onde w a(k) é o ruído branco de aceleração radial e wγ(k) o ruído branco de aceleração azimutal, gerando respectivamente as variáveis de estado a(k) e γ(k). A matriz G, relativa ao ruído, é dada por O vetor de estado do alvo pode ser representado pelo valor quantizado das suas variáveis de estado. Considerando-se somente as posições e as velocidades tem-se onde  é o operador majorante; ∆r, ∆ψ, ∆v e ∆ω representam os intervalos de amostragem das grandezas posição e velocidade (radial e azimutal) e rmin, ψmin, vmin e ωmin, os valores mínimos destas grandezas. A equação de medida, relativa a um Radar de vigilância, é expressa por O vetor medida na k-ésima varredura é dado por onde r m(k) é distância e ψm(k) o azimute medido. A matriz de medida H é dada então por O vetor de ruído de medida branco gaussiano de média nula e descorrelacionado de W(k) é representado por onde vr(k) é o ruído de medida da distância e vψ(k) é o ruído de medida azimutal. III. TÉCNICA TRACK-BEFORE-DETECT Neste trabalho a técnica TBD empregada utiliza um critério de Programação Dinâmica proposto originalmente por [1], [17] para ser utilizado em uma sequência de imagens ópticas. Este critério foi adaptado para a aplicação em sucessivas varreduras de um Radar de Vigilância, onde o número de observações é baixo e o alvo a ser detectado/rastreado tem uma dinâmica rápida [14]. O acompanhamento (ou rastreio) de um alvo é representado por uma sequência sucessiva de estados onde x(k), k = 1,2,..., K é dado por (6) e K ≤ NV. A observação do alvo é feita pela sequência de imagens (ou matriz de dados) obtidas a cada varredura do Radar, representada por D(k), k = 1, 2, ..., K ≤ NV, durante um período de tempo igual a KTV onde d(k; nr(k), nψ(k)) é o valor do pixel da imagem na coordenada (nr(.), nψ(.)), Nr é o número de pixels (amostras) em distância e N ψ é o numero de amostras azimutais da imagem. Inicialmente consideremos que o critério para a determinação da sequência de estados que correspondem a um alvo é dado por onde {x-ˆK} é o conjunto de todas as possíveis sequências de estados que satisfazem a desigualdade e η0 é o limiar de detecção. As coordenadas (nr(.), nψ(.) ), para k = 1, 2, ..., K, indicam a sequência de posições em vizinhanças fisicamente admissíveis nas sucessivas varreduras, sequência esta iniciada na primeira varredura em um pixel candidato a ser a posição de um possível alvo. O termo equivalente a uma integração na qual são adicionados os valores dos pixels de cada varredura que se relacionam através de transições fisicamente admissíveis. Na primeira varredura a detecção de um possível alvo é feita pela medida de posição de todas as N1 amostras da imagem cuja amplitude ultrapassa um limiar. Dessas posições (pixels) se originará a sequência de posições fisicamente admissíveis na próxima varredura. Define-se para a segunda varredura o conjunto de N1 vizinhanças fisicamente admissíveis centradas nos alvos detectados na primeira varredura. Essa vizinhança é definida para cada alvo, n1 = 1, 2, ..., N1, detectado na primeira varredura, como onde v max e ωmax são as velocidades radial e angular azimutal máximas, consideradas conhecidas, da ameaça, (rm(1;.), ψm(1;.)) são as N1 coordenadas, dos possíveis alvos detectados, medidas na primeira varredura e σvm e σωm são os desvios padrões, considerados também conhecidos, relativos as incerteza nas velocidades linear e angular vmax e ωmax. Essa vizinhança, considerando-se uma distribuição gaussiana, por ter a largura de quatro desvios padrões, equivale a uma região de ocorrência do alvo com uma probabilidade de 95,4 %. Na segunda varredura detecta-se os Na possíveis alvos, em cada uma das vizinhanças V(2, n1), n1 = 1, 2, ..., N1, comparando-se as amplitudes das amostras nas vizinhanças com um limiar de detecção ajustado para se obter Na detecções. Para cada um dos alvos detectados define-se as N1Na novas vizinhanças fisicamente admissíveis, que serão usadas na terceira varredura. Essas vizinhanças são definidas por onde (rm(2;.), ψm(2;.)) são as coordenadas medidas na segunda varredura que correspondem às coordenadas (rm(1;.), ψm(1;.) ) da primeira varredura. A Fig. 1 mostra a evolução das regiões fisicamente admissíveis relativas a um alvo detectado na primeira varredura (N1 = 1), que gera uma região circular na segunda varredura, onde apenas uma detecção é mostrada. Nos setores circulares nas demais varreduras ocorrem duas detecções (Na = 2). O acompanhamento de um alvo, identificado por (n1, n2,..., nk-V, nk-V+1,..., nk) na k-ésima varredura é representado por uma sequência de V estados consecutivos anteriores, sendo k ≥ V+1 onde é o vetor de estados, na forma discreta, que identifica completamente o ramo que tem origem no nó (n1, n2,..., nk-V) e termina no nó (n1, n2,..., nk-V, nk-V+1,..., nk). Estabelece-se como critério que confirmado o nó (nr(1,n1), nψ(1, n1)) estima-se o nó (nr(2,n1,n2), nψ(2, n1,n2)) utilizando-se as V observações consecutivas x⌣1, 1 V + . Estimado o nó (nr(2,n1,n2), nψ(2, n1,n2)) estima-se o nó (nr(3,n1,n2,n3), nψ(3, n1,n2,n3)) com as V observações próximas consecutivas e assim sucessivamente. Deste modo a cada estimativa forma-se uma sequência crescente de estados estimados. Para a varredura k-V+1 tem se, portanto, a estimativa onde ( ; ( , ,..., ), 1 ( , ,..., )) 1 d k n k n n o r o ko n k n n ψ o ko representa o pixel da ko-ésima varredura nas coordenadas ( ( , ,..., ), 1 ( , ,..., )) 1 n k n n r o ko n k n n ψ o ko , que representa o nó inicial do ramo originado nas coordenadas dadas por ( ( , ,..., ), ( , ,..., )) n k n n n k n n r o k V o k V 1 1 − − ψ [14]. Observa-se assim que na varredura k tem-se o estado estimado da varredura k-V+1, e que houve um atraso temporal na resposta do sistema de (V-1)TV. Deste modo, quanto maior for o valor de V maior será o atraso de resposta do sistema, porém quanto maior for o parâmetro V maior será o número de termos que serão somados para se obter o Fator de Mérito, dado pela somatória em (18). Observa-se ainda que a escolha do limiar η0 será função do número termos (V+1) somados. A Fig. 2 mostra um exemplo de escolha do caminho na arvore de decisão para Na=2 e V=2. Considerando-se que deseja propagar a posição do alvo detectado na varredura k-2, com amplitude 0,8. Na varredura k-1 a vizinhança escolhida pela detecção de um alvo em k-2 originou duas detecções. Cada uma das posições em que se detectou um alvo tem-se as amplitudes 0,6 e 0,4. Na varredura k, detectou-se 4 alvos. Estabelecendo-se como Fator de Mérito a soma das amplitudes dos nós de cada um dos ramos de k até k-V = k-2, o maior valor do Fator de Mérito (valor 2) identifica o nó da varredura k que deve ser ligado ao nó da varredura k-2 através do um dado ramo. Assim confirma-se o nó da varredura k-1, de valor 0,4, como o nó sucessor ao nó da varredura k-2 que tem amplitude 0,8. Deste modo observa-se que o nó da varredura k-1, que tinha valor 0,6 maior que a amplitude 0,4, não foi escolhido, pois na varredura k este nó originou novos nós com amplitudes baixas. Ao se propagar a posição, pelos ramos que originaram um Fator de Mérito maior, na varredura k foi possível recuperar a trajetória do alvo, que poderia ter sido ignorado na varredura k-1. Quanto maior o parâmetro Na mais confiável será o processo de detecção, entretanto mais custoso computacionalmente será este processo de cálculo. IV. IMPLEMENTAÇÃO E RESULTADOS O desempenho do algoritmo foi analisado simulando-se um cenário naval constituído de um navio de escolta, navegando em um ambiente sob ameaça aérea, equipado com Radar de vigilância e sistema de defesa com míssil antiaéreo cujo alcance é de 6 mn (milhas náuticas). Estabelece-se como requisito que o míssil ao atingir a distância de alcance do armamento já tenha sido previamente acompanhado de modo que o Radar possa fornecer as informações de posição e velocidade do míssil oponente ao sistema de armas defensivo. Considera-se que o míssil, que foi lançado por uma aeronave que se encontra a 11 mn do navio, possui uma RCS (Radar Cross Section) média de 0,1 m2, apresenta flutuação Swerling Tipo I e se desloca em direção ao navio com uma velocidade aproximada de 298,4 m/s (580 nós). O Radar possui um tempo de varredura Tv = 3s, o que equivale a 20 rotações por minuto. A abertura azimutal do feixe da antena foi considerada igual a 1,35o. Com uma frequência de repetição de pulso de 2,4 kHz (62,5 km de alcance máximo não ambíguo) obtém-se, com a rotação da antena considerada, 27 ecos por alvo pontual. A resolução em alcance do Radar considerado é de 90m, o que implica uma duração do pulso transmitido igual a 0,6µs. O tempo de amostragem do sinal eco foi estabelecido como 0,3µs, o que resulta em um intervalo de amostragem de 45m. . Considerou-se ainda: potência de pico do Radar 800W, ganho da antena 25,3dB, comprimento de onda da portadora 10,7cm, banda equivalente de ruído 1,67MHz, temperatura efetiva de ruído da antena 400K, figura de ruído 1,58 dB e perdas do sistema 1,58dB. A região observada em cada varredura foi considerada uma área de 12mn em alcance dentro de um setor circular de 90o. Deste modo uma imagem de uma varredura tem a dimensão de 493 amostras em distância e 1800 amostras em azimute. A Fig. 3 mostra o valor da SNR em função da distância ao navio, onde se observa que a uma distância de 7,0 km a SNR é 0dB. Foi realizada uma etapa de pré processamento, que consistiu na suavização da imagem de uma varredura, utilizando-se um filtro de média móvel de dimensões de uma célula de resolução do Radar. Para a aplicação do TBD considerou-se NI = 11 possíveis alvos detectados na primeira varredura e Na = 1, 2 e 3. O parâmetro Na corresponde ao número de ramos que cada detecção gera, conforme ilustrado na Tabela I em função do número de varreduras consecutivas V = 1, 2,..., 9. Foram consideradas 1.000 realizações da simulação. Para cada simulação a posição inicial do míssil foi aleatoriamente escolhida em uma posição de marcação com distribuição normal com média de 45º e desvio padrão de 1º e distância média de 11mn e desvio padrão de 0,25mn, com velocidade inicial média de 298,4m/s e desvio padrão de 10m/s. As Figs. 4 e 5 mostram algumas trajetórias selecionadas pelo TBD considerando, respectivamente, a) V = 5 varreduras consecutivas e N a = 1 e b) V = 6 varreduras consecutivas e Na = 3 ramos da árvore de decisão. Na Fig. 4 o alvo verdadeiro (x em vermelho) foi perdido a partir da 4a varredura e na Fig. 5 o alvo foi sempre acompanhado. Ainda na Fig. 5 observase, nas ultimas varreduras, as 729 trajetórias possíveis consideradas (6 varreduras de integração por 3 ramos cada) que se apresentam na arvore de decisão. O maior valor do Fator de Mérito determinará o melhor caminho a ser seguido. Para se avaliar o desempenho do TBD implementado no cenário escolhido definiu-se as seguintes métricas: - Percentagem de Sucesso no Acompanhamento (PSA): Percentagem das realizações em que o algoritmo conseguiu manter o rastreio do alvo verdadeiro na cena (Fig. 6). - Erro Médio em Distância (EMD): erro médio calculado nas trajetórias em que o alvo foi detectado (Fig. 7). - Tempo de Acompanhamento no Rastreio (TAR): percentual do tempo, na trajetória rastreada, no qual o erro do rastreio é menor que 90m em alcance e menor que 1,35o em azimute (Fig. 8). - Tempo Normalizado de Processamento (TNP): tempo de processamento em relação ao menor tempo, que recebe o valor unitário (Tabela II). Analisando-se as Figuras e a Tabela com os parâmetros de desempenho tem-se que: • A porcentagem de sucesso de acompanhamento (PSA) de um alvo cresce com o número de varreduras consecutivas V e com o número de Ramos N a, em contrapartida o tempo de processamento também aumenta. No cenário utilizado é conveniente ter-se Na ≥ 3 e V ≥ 6 para se manter no mínimo um PSA de 80%. Uma vez escolhida a trajetória correta o erro médio em distância é praticamente invariante para Na ≥ 2 e qualquer valor de V. O mesmo acontece com o porcentual de tempo de acompanhamento (TAR). Deste modo garantido o acompanhamento correto de um alvo verdadeiro (PSA alto), praticamente fica garantida a qualidade do acompanhamento. O critério ótimo do processo descrito neste trabalho se baseia na equação (18), que se diferencia do critério representado pela equação (13) utilizado no trabalho de Costa [8] pelo fato de que, conhecido o estado no instante k-V, estima-se o estado no instante k-V+1 utilizando-se medidas do instante k-V ao instante k. Pelo critério representado em (13) toda sequência de estados é estimada simultaneamente com as medidas dos instantes 1 a K. De um modo simplista pode-se dizer que o critério (18) consiste da aplicação sucessiva do critério (13). Fazendo-se em (13) K = V o critério (18) consiste na aplicação de KV vezes o critério (13), deste modo, a principio, a aplicação do critério (18) tem um custo computacional maior que a aplicação do critério (13). Entretanto o parâmetro de desempenho PSA, mostrado na Fig. 6, é muito maior quando se utiliza o critério (18), que considera múltiplos ramos. A rigor o desempenho de cada um dos critérios dependerá dos requisitos do cenário considerado e são alternativas para o rastreio/detecção de alvos. V. CONCLUSÕES Propôs-se uma arquitetura de processamento TBD para emprego em sistemas Radar de vigilância, que utiliza um processo de arvores de decisão, que pode ter os seus parâmetros variáveis, em função do desempenho que se deseja. O desempenho do processador foi testado, por meio de simulações, em um cenário de interesse naval, que consiste na proteção de um navio contra uma ameaça aérea de alto desempenho. Foram sugeridos parâmetros para medição do desempenho do TBD, que são consistentes com requisitos exigidos em sistemas de defesa. "
}