{
    "id": 156,
    "titulo": "rastreio de alvos aéreos com dois sensores passivos de medidas de ângulos",
    "autor": "renato vianna silva, josé fernando basso bancalion e david fernandes",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2012/st/V_3.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Em um cenário de conflito, informações concretas, de fácil entendimento e precisão são peças chaves na tomada de decisão. Informações de vários sensores vindas de várias locais e com formatos diferentes devem ser apresentadas de forma clara e objetiva para quem tomará uma decisão crucial para tornar uma missão, bem sucedida. Utilizando sensores passivos e ativos é possível obter um rastreio de alvos com maior precisão e com mais informações para ajudar no aumento da consciência situacional do espaço aéreo. Este trabalho apresenta uma técnica de rastreio passivo de alvos utilizando dois sensores passivos que medem azimute e elevação de um sinal eletromagnético emitido por um alvo. Estes ângulos são usados para fazer a triangulação da localização do alvo no espaço tridimensional. Para o rastreio é utilizado um filtro de Kalman estendido. Os resultados de simulações são analisados em termos do erro de predição da trajetória em função das características de manobrabilidade do alvo e em termos da precisão de medida dos sensores.",
    "texto": " I. INTRODUÇÃO Em um sistema de vanguarda de comando e controle (C2), usado por várias forças armadas do mundo, uma rede de sensores fornece informações nas mais variadas formas possíveis para melhorar a precisão da localização de alvos e aumentar a consciência situacional do cenário tático. Nestes centros, sensores passivos como Electronic Suport Measures (ESM), Radar Warning Receivers (RWR) entre outros são comumente usados para melhorar a acurácia de sistemas que usam sensores ativos. Os dados fornecidos pelos sensores ativos e passivos são combinados através de técnicas de fusão de dados, que possibilitam o aumento de precisão da medida final. O problema do rastreamento de alvos, abordado em inúmeras publicações [1] [2] [3] [4], é amplamente conhecido e é solucionado através da utilização de métodos matemáticos específicos [5] [6]. Tipicamente um sistema de rastreio tem suas características vinculadas ao sensor utilizado. Hoje, o sensor de rastreio mais comum é o radar, apesar de existirem também outros tipos de sensores que diferem do radar na maneira pela qual fazem a obtenção dos dados do alvo a ser rastreado [4]. O radar utiliza ondas eletromagnéticas emitidas por seu transmissor que ao atingirem a superfície de um alvo são refletidas e retornam ao radar para serem utilizadas em processadores de detecção e rastreio. Sensores passivos, não emitem nenhum tipo de sinal para detecção do alvo, eles utilizam as próprias emissões do alvo para detectá-lo e rastreá-lo. Essas informações adicionais destes sensores podem ser usadas complementando aquelas adquiridas pelo radar gerando um rastreio de maior precisão. Radares e ESM são sistemas que podem ser combinados ao se usar as técnicas de fusão de dados [1]Nestas técnicas ao se introduzir o conhecimento da cinemática do alvo adquirido pelo radar na analise do ESM, tem-se um ganho de desempenho na classificação e identificação do alvo. Similarmente, utilizando as características do ESM no rastreio feito pelo radar, o rastreamento pode ser melhorado com a continuidade do rastreio de alvos altamente manobráveis, ajudando a reduzir interferências. Também é conhecido que os sensores passivos têm uma vantagem de alcance sobre o radar, pois o sinal recebido passivamente pelo sensor se propaga no percurso entre o alvo e o sensor, em contrapartida, o sinal do radar se propaga pelo dobro deste trajeto, ou seja, no percurso radar-alvo-radar [1]. A principal motivação deste estudo é avaliar o desempenho do rastreio de um alvo manobrável utilizando-se apenas sensores passivos. Nesta avaliação analisa-se o efeito da manobrabilidade do alvo e do ruído nos sensores na precisão que pode-se obter a trajetória do alvo. Estudos desta natureza, que quantizam os erros na obtenção da trajetória de um alvo, também são uteis para o estabelecimento de arquiteturas e análise do desempenho de sistemas de fusão de dados incorporadas a sistemas C2. O sistema de rastreio dos sensores passivos será obtido utilizando equações de triangulação. Cada sensor é responsável por fornecer dois ângulos, um de azimute e outro de elevação. Com esses ângulos é possível o calculo da localização do alvo em coordenadas cartesianas. Entretanto, as medidas obtidas dos sensores contêm ruídos de leitura que podem comprometer o bom desempenho do rastreio. Por isso será também utilizado o filtro de Kalman estendido para que as informações geradas pelos sensores sejam filtradas e possam ser utilizadas na triangulação da posição do alvo. Para a utilização do filtro estendido de Kalman serão usados alguns modelos dinâmicos de alvos aéreos manobráveis propostos pela literatura [5]. O desempenho do processo de rastreio passivo é avaliado por meio de simulações com diferentes trajetórias de alvos, e intensidades de ruídos de medida. Este artigo está dividido em 4 secções. A Seção I identifica as razões para o uso de sensores passivos e situa a proposta deste trabalho no campo de rastreio de alvos e sensores. A Seção II descreve o modelo adotado para a representação dinâmica do alvo, as equações de triangulação e do filtro de Kalman estendido. A Seção III apresenta os cenários utilizados na análise e apresenta os resultados obtidos através de simulação. Na Seção IV apresentam-se as conclusões do trabalho desenvolvido. II. MODELO DINÂMICO E RASTREIO PASSIVO Para que seja efetuado o rastreio de alvos manobráveis utilizando-se observações ruidosas, convém especificar um modelo dinâmico, que descreva a evolução do vetor de estado desse alvo. Os modelos dinâmicos de alvos manobráveis utilizados em algoritmos de rastreio normalmente tratam os alvos como objetos pontuais e sem forma. O modelo de Singer [5] adaptado para este trabalho pode ser descrito da seguinte forma: onde o vetor de estado no instante kT, sendo T o período de amostragem, é descrito como: Em (2), tem-se a posição do alvo representada em um sistema cartesiano por ,  e , a sua velocidade representada por ,  e  e a sua aceleração representada por ,  e . Ainda na equação (1) têm-se os termos: onde representa uma matriz 3x3 de zeros e as matrizes , e  são dadas por: O valor do coeficiente normalizado de correlação da aceleração na direção m = x, y ,z , 0 ≤ # < 1 , pode ser descrito como [5]: sendo + uma constante de tempo indicadora da manobrabilidade do alvo, por exemplo, se + ≅ 60, o alvo tem manobras suaves se + ≅ 20, o alvo tem manobras evasivas e se + ≅ 1, tem-se turbulências atmosféricas. Em (1) w(k) é o ruído de estado, branco de média nula, considerado nas acelerações sendo: A matriz de covariância do ruído de estado é dada por: sendo: onde  para m = x, y, z são as variâncias das acelerações ,  e  do vetor de estado. Os valores dessas variâncias dependem das características de manobrabilidade do alvo que se está modelando. Elas podem ser calculadas a partir da densidade de probabilidade das acelerações que são consideradas no modelo de Singer [5]. Neste modelo a aceleração tem uma probabilidade P1m de ser máxima positiva (+Am), tem a mesma probabilidade P1m de ser máxima negativa (–Am ), tem uma probabilidade P2m de ser nula e entre a máxima aceleração Am e a mínima –Am tem uma densidade de probabilidade uniforme. A amplitude da densidade de probabilidade uniforme de aceleração pode então ser calculada por:  As variâncias  com m = x, y, z são então dadas por: Os sensores passivos geralmente fornecem medidas dos ângulos de azimute e elevação. Cada sensor @< e @9, separados de uma linha base d, gera um par de ângulos (A<\t, B<), (A9\t, B9), respectivamente, conforme ilustrado na Fig. 1. Com esses ângulos, uma linha de visada pode ser determinada e o cruzamento destas linhas identifica a posição do alvo. As medidas angulares são realizadas com erros que causam uma imprecisão na determinação da posição do alvo. Considera-se um sistema de coordenadas cartesianas tridimensional, com origem no sensor S1. A linha no sentido de S1 para S2 define o eixo y e a vertical local que passa pelo Sensor S1 define o eixo z, que aponta para o centro da terra. Considera-se a Terra localmente plana, de modo que as coordenadas do Sensor S2 são dadas por (0, d, 0).O vetor medida dos sensores é definido como: o que pode ser representado em termos do vetor de estados como: onde D () é o ruído de leitura, branco, gaussiano de média nula que tem matriz de covariância dada por: sendo 8 EF e 8EH os desvios padrões dos erros de medidas dos ângulos de azimute e 8GF 8GH os desvios padrões dos erros das medidas dos ângulos de elevação. A função não linear h(.) em (13) relaciona, para cada instante kT, os ângulos ( ), de direção do alvo, com as suas coordenadas cartesianas (x(k), y(k), z(k)) : A estimava do estado do alvo em função das medidas dos sensores passivos será realizada pelo filtro de Kalman, que para poder ser utilizado requer a linearização da função h(.), tendo-se assim o chamado Filtro estendido de Kalman [1]. Para o uso do Filtro de Kalman o modelo linearizado do processo de medida será representado por: A linearização de h(.), em torno de xa(k), será obtida pela matriz H(k), representada pela matriz jacobiana formada pelas derivadas parciais de h(,) em relação a x, y e z, calculadas em . Os elementos\tsão componentes do vetor de estado xa(k-1). onde as derivadas são dadas por: As equações que compõem o filtro de Kalman estendido podem ser definidas pela matriz de covariância do erro de predição, pelo ganho do Filtro e pela matriz do erro de filtragem, dadas respectivamente por: A equação da filtragem é então representada por: onde  é o vetor de estado predito no instante kT, utilizando as medidas até o instante (k-1)T , que é calculado por Do mesmo modo que P(0|0) o estado  deve ser conhecido (ou estimado) para a inicialização do filtro [4] [5].  III. SIMULAÇÕES E RESULTADOS Será considerado o caso do rastreio de uma aeronave que se encontra em uma região de detecção de dois sensores passivos fixos, instalados no solo. O cenário escolhido é constituído por dois sensores, separados por d = 40 km, alinhados com o eixo y do sistema de referência mostrado na Fig 1, de modo que: Sensor @< posicionado na origem do sistema de coordenadas;  A aeronave se move segundo modelo dinâmico proposto por Singer [5]; As medidas fornecidas pelos sensores têm a mesma taxa de amostragem e estão em sincronia, ou seja, considera-se que as medidas são realizadas nos dois sensores no mesmo instante e Existe somente um único alvo a ser rastreado.  Para a representação da dinâmica da aeronave foram consideradas três cenários com duração de 120 segundos, sendo o período de amostragem T = 0,5s e, portanto com K = 240 amostras. No cenário 1 é considerado um alvo que apresenta dinâmica definida como lenta, no cenário 2 é considerado um alvo com dinâmica definida como moderada e o cenário 3 representa uma aeronave com grande manobrabilidade (dinâmica definida como rápida). As condições iniciais foram definidas como: A Tabela I mostra as características das dinâmicas dos alvos.: Considerou-se que os erros das medidas angulares nos sensores passivos são todos iguais, sendo o desvio padrão do erro de medida de azimute e elevação, considerados em três situações de erros crescentes: • Situação 1: a=b= 0.02° • Situação 2:  a=b= 0.05° • Situação 3:  a=b= 0.1° Os resultados de uma realização do cenário 2 (dinâmica moderada) são mostrados na Fig. 2 e Fig. 3. A variação dos ângulos de azimute e elevação, medidos pelos sensores durante o período da trajetória, são apresentados na Fig. 4 e na Fig. 5, considerando-se o ruído da Situação 2.  Da Fig. 6 a Fig. 11 estão representados os erros entre a trajetória real e as trajetórias medidas e estimadas pelo filtro estendido de Kalman, considerado-se ainda uma única realização do Cenário 2, com a Situação 3 de ruído. Observa-se na Fig. 7, Fig. 9 e Fig. 11 uma diminuição nos erros, que serão melhor quantificados a seguir. A Fig. 12, Fig. 13 e Fig. 14 mostram a variação da estimativa do erro da filtragem das coordenadas x(k), y(k) e z(k), na forma de desvio padrão, obtidas da matriz de covariância P(k|k) da expressão (37) do filtro de Kalman. Para comparação, estas mesmas figuras mostram o desvio padrão do erro de medida, \te\tdas coordenadas cartesianas. Observa-se na Fig. 12, Fig.13 e Fig.14 uma sensível diminuição no desvio padrão do erro quando se utiliza a filtragem de Kalman para a estimativa da trajetória do alvo. Os resultados médios obtidos por meio de 100 realizações de Monte Carlo são mostrados nas Tabelas II, III e IV. Nessas tabelas tem-se os desvios padrões dos erros da trajetória estimada pelo filtro estendido de Kalman em comparação com os erros da trajetória medida nas direções x\te o erro total de posição estimada e medida 8lwg ,8lw. Mostra-se ainda na Tabela II o erro médio entre a posição real e a estimada e a posição real e a medida, xµ wg ,xµ w. Considerou-se a situação do Cenário 2 (dinâmica moderada do alvo) e o sensor erros da Situação 1, 2 e 3 respectivamente. As tabelas mostram o comparativo dos erros das posições do estado real com o estado filtrado e com o estado medido pelos sensores. Como esperado, sensores com mais ruído (Situação3) geram erros maiores nas posições medidas dos alvos o que influencia nas posições estimadas pelo filtro. Foram também obtidos resultados de simulação dos Cenários 1 e 3 onde se considera alvos de baixa e alta manobrabilidade respectivamente. No primeiro caso, alvos menos manobráveis são rastreados com maior facilidade por sensores com menor precisão. Já no Cenário 3, com alvos de grande manobrabilidade, sensores de baixa precisão aumentam consideravelmente o erro do rastreio. Para tal finalidade, se faz necessário sensores com grande precisão para que o rastreio de alvos com esta característica seja possível. IV. CONCLUSÃO Neste trabalho, foi considerado um cenário que utiliza dois sensores passivos para o rastreio de alvos manobráveis. A medida dos sensores, sujeitas a ruídos, que se relacionam com as variáveis de estado do alvo por meio de uma função não linear, foram filtradas pelo filtro de Kalman estendido. Simulações realizadas quantizaram o erro na estimativa da posição do alvo levando-se em conta a manobrabilidade do alvo (Cenário 1, 2 e 3) e a incerteza da medida (Situação 1, 2 e 3). O estudo realizado possibilita, em função de uma dada manobrabilidade do alvo e uma dada configuração de sensores, realizar-se a especificação da precisão dos sensores passivos para que os erros na estimativa da posição do alvo sejam menores que um dado requisito. Este requisito pode ser gerado, por exemplo, por uma arquitetura de fusão de dados ou por um sistema de armas defensivas. "
}