{
    "id": 159,
    "titulo": "estudos de linhas de transmissão não lineares híbridas",
    "autor": "fernanda s. yamasaki, josé o. rossi, joaquim j. barroso",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2012/st/P_5.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Atualmente existe um grande interesse no estudo de linhas de transmissão discretas com elementos não lineares para geração de rádio frequência (RF). Nesta aplicação exploram-se os efeitos de dispersão da linha produzidos pela presença de elementos discretos Ls e Cs, em conjunto com a não linearidade de pelo menos um dos elementos. Ambas as propriedades da linha (dispersão e não linearidade) agindo simultaneamente permitem o aparecimento de sólitons ao longo da linha e em sua saída. Desta forma, conectando-se uma antena à saída da linha pode-se usar esta linha para gerar ondas eletromagnéticas na faixa de RF (200 MHz – 1 GHz). Em vista disto, existe um prospecto bastante favorável para a construção de um gerador de RF compacto que poderia ser aplicado em plataformas móveis de defesa. Neste trabalho, tendo como base a simulação Spice, pretende-se estudar o comportamento destas linhas para geração de sólitons utilizando indutores saturados e diodos varicaps.",
    "texto": "  I. INTRODUÇÃO Atualmente existe um grande interesse no estudo de linhas de transmissão não lineares (LTNLs) para a geração de RF de alta potência. Isto foi motivado basicamente por dois trabalhos pioneiros, sendo que o primeiro [1] descreve uma LTNL (usando ferrite como meio magnético não linear) capaz de gerar picos de potência RF em torno de 20 MW com eficiência de 20% em 1.0 GHz. O segundo consiste no trabalho experimental desenvolvido por Brown e Smith [2], usando uma LTNL a base de cerâmica de titanato de bário como um dielétrico não linear, a qual forneceu 60 MW de potência de RF na faixa de frequências entre 100 e 200 MHz. Contudo, devido às perdas capacitivas no dielétrico de LTNLs não foi possível se atingir frequências superiores a 200 MHz [3]. Devido a esta limitação tem havido um grande interesse no estudo destas linhas como descrito recentemente em [4-6]. Por outro lado, dada à impossibilidade de se fazer um estudo analítico completo devido aos efeitos não lineares das linhas, tem-se investido no uso de ferramentas computacionais como simuladores de circuitos (do tipo Spice) ou de aplicativos matemáticos para análise do problema como descrito em [7], [8]. Para as simulações em aplicativos elétricos é utilizada uma rede de varicaps, uma vez que a capacitância de junção destes dispositivos varia aproximadamente com o inverso da raiz quadrada da tensão reversa aplicada. Também, indutores saturados são utilizados, já que sua indutância varia em função da corrente. Quando ambos componentes são não lineares, o caso é conhecido como linha híbrida. Sabe-se que para a aplicação com indutores variáveis, as LTNLs são construídas com indutores ferromagnéticos saturados, onde o modelamento destes dispositivos é muito difícil de ser efetivada, a menos que um aplicativo elétrico como o simulador de circuitos LT-SPICE seja usado. Portanto, o objetivo deste trabalho consiste em estudar o comportamento de linhas hibridas usando simulações Spice, nas quais diodos varicaps e indutores saturados são empregados como elementos não lineares, almejando-se assim uma frequência mais alta do que a alcançada somente com uma linha que usa um tipo de componente com característica não linear. II. TEORIA SIMPLIFICADA DO SÓLITON O mecanismo de geração de sólitons é de fácil explicação em termos qualitativos, embora a sua análise matemática seja uma tarefa de difícil execução. Isto é demonstrado pela equação Kortweg-de Vries (KdV) modelada para uma linha de transmissão não linear e dispersiva, que apresenta soluções de ondas solitárias da forma [5]: onde c é a velocidade de propagação da onda e x0 é a posição espacial inicial (fase). Então, para se obter uma compreensão intuitiva mais fácil do processo de geração do sóliton iniciaremos com o estudo de modelamento de pulso em linhas de transmissão discretas, desprezando-se o efeito dispersivo. Quando um pulso de entrada é injetado em uma linha de transmissão discreta, este se propaga ao longo do comprimento da linha com uma velocidade dada por c = 1/(με)1/2, onde µ e ԑ são a permeabilidade magnética e a constante dielétrica do meio, respectivamente. Porém, se o dielétrico da linha é não linear (por exemplo, um material cerâmico) durante a propagação do pulso neste meio, a sua amplitude de maior valor viajará mais rápido do que sua amplitude inicial desde que ԑ diminui com o aumento da tensão. Desta forma, o atraso da linha causado para o pico do pulso diminui em relação à sua parte de baixa amplitude, formando uma onda de choque de saída com um menor tempo de subida de pulso. De forma análoga, o mesmo processo de modelamento de pulso pode ser obtido usando-se materiais magnéticos não lineares, pois a permeabilidade µ destes materiais diminui com o aumento da amplitude de corrente. Qualquer uma destas duas abordagens pode ser usada para gerar pulsos de saída muito rápidos com altos níveis de potência. Pulsos de saída bastante rápidos são gerados normalmente usando-se linhas de transmissão discretas, não lineares e não dispersivas. As linhas não dispersivas produzem ondas de choque de saída com tempo de subida mais rápido, uma vez que não é zero, sendo finalmente limitado pelo tempo de relaxação molecular do material usado como meio não linear. Por exemplo, para uma mistura do composto cerâmico dielétrico de titanato-bárioestrôncio, a frequência de relaxação correspondente está acima de 1.0 GHz, o que corresponde a um tempo de relaxação da ordem de 1.0 ns [9]. Contudo, se uma linha não linear e dispersiva (por exemplo, uma rede LC artificial feita de capacitores variáveis) é usada, a velocidade de propagação c = 1/(LC)1/2, dependerá dos valores de L & C e o tempo de subida será limitado pela frequência de corte de Bragg da linha dada por [9]: onde C(Vmax) é a capacitância de menor valor, no caso do uso de capacitores não lineares na linha, quando submetidos a amplitude do pico do pulso. Uma estimativa precisa para o tempo de redução do pulso de saída é difícil de calcular devido à não linearidade da linha e à dependência da velocidade de fase com a frequência na rede dispersiva. Entretanto, uma estimativa aproximada é feita calculando-se a diferença do tempo de atraso produzido pelas sessões da rede LC entre a propagação da porção de baixa amplitude do pulso e a de seu pico. Para a baixa amplitude do pulso, o atraso δ1 é igual a n√(LCj0), onde Cj0 é a capacitância inicial do capacitor sem polarização e n é número de seções da linha. Para o pico do pulso, o atraso δ2 = n√(LC(Vmax)) e, portanto, a redução do tempo de subida de pulso na saída ΔT = δ1-δ2 é dado por [9]: onde tri e tro são respectivamente os tempos de subida de pulso de entrada e saída. Na condição em que o tempo de subida de entrada tri > ΔT o tempo de subida final para a onda de choque de saída é calculado como tro = tri - ΔT. Por outro lado, quando tri ≤ ΔT, tro não pode cair para zero, uma vez que o tempo de subida da onda de choque de saída, neste caso, é limitado pela frequência de corte fco da linha. Portanto, acima desta frequência a energia não pode se propagar e o espectro de frequências da onda de choque é separado, ocorrendo uma série de pulsos estreitos (ondas solitárias) ao longo da linha e em sua saída em fco, pois o pulso de saída não pode ser mais comprimido (ver Fig. 1). III. SIMULAÇÃO E RESULTADOS Denomina-se linha híbrida quando se tem Ls e Cs variáveis. Quando se varia a indutância em função da corrente aplicada ela diminui e, consequentemente, a capacitância também irá diminuir em função da maior tensão aplicada, resultando em mais oscilações com maiores frequências. Para o estudo da linha híbrida utilizou-se o aplicativo elétrico LT-SPICE, que possui um modelo simplificado para o indutor saturado, o qual é determinado pela equação (4) que relaciona o fluxo com a corrente de saturação. onde L0 é a indutância inicial, IS é a corrente de saturação (que pode ser obtida através da equação (5)), i é a corrente do circuito, FEM é a força-eletromotriz do gerador, Rg é a resistência do gerador e Z0 é a impedância da linha. Porém, há uma segunda equação que relaciona o fluxo pela corrente desenvolvida por [8], a qual engloba o seguinte modelo apresentado abaixo: Paras as simulações, utilizaram-se as duas opções disponíveis de equação do fluxo para representar o indutor saturado e sua não linearidade, comparando-se seus resultados obtidos, para verificar qual a o modelo mais satisfatório. As simulações foram efetuadas no aplicativo elétrico LT-SPICE e os dados obtidos foram transferidos para o aplicativo gráfico conhecido como Origin 6.0. A Fig. 2 mostra o correspondente esquema elétrico do circuito da LTNL sem perdas, onde as simulações forma feitas com quatro diferentes valores para os indutores, sendo no caso o único parâmetro alterado. Além disto, foi utilizado o diodo varactor MV2201 ligado no modo reverso numa LTNL de 50 seções, sendo alimentada por um gerador de pulso com impedância de saída de 50 Ω, onde é injetado um pulso quadrado com 10 V de amplitude. Para este diodo varactor, com uma capacitância de junção inicial sem polarização de 14.93 pF, potencial de junção equivalente a 750 mV e fator de não linearidade m de 0.4261 é possível calcular a capacitância final C através de: Na realidade m é o fator de não linearidade do varicap, já que para m = 0 tem-se que C = Cj0. Portanto o valor de C é equivalente a 6.26 pF para amplitude do pulso de 10 V. Para uma linha híbrida, considerando que o indutor satura com uma corrente de 80 mA, através da equação (8), obtém-se uma indutância final Lf de 22.68 nH. Então com um valor de C da ordem 6.26 pF pode-se calcular a impedância de saída Z da linha através de: Adotando-se o valor final da indutância calculado em (8) resulta em uma impedância de aproximadamente 62 Ω usando-se (10). Esta é uma importante característica para a linha híbrida já que Z tende a se manter constante desde que os valores de L e C decaiam com a tensão. Para estimar o valor inicial da indutância, considerou-se primeiramente o caso de uma linha não linear construída apenas com elementos capacitivos não lineares, sendo assim neste caso com indutores lineares. Supondo uma frequência de corte final de 600 MHz com capacitância final de 6.26 pF do varicap, o valor da indutância inicial foi calculado através da expressão a seguir: onde é a frequência de corte da linha, é a capacitância final da junção e L a indutância inicial que após a substituição de seus devidos valores, resulta em 54 nH. Na Fig. 3 está mostrada uma comparação entre as simulações para três casos diferentes, sendo em linha preta um linha híbrida com L decrescendo de 54 nH para 22.68 nH e outros dois casos, assumindo-se linhas convencionais com indutores fixos de 54 nH e 22.68 nH (linhas vermelha e azul, respectivamente). Siang et al [8] desenvolveram um modelo modificado da equação do fluxo utilizada para simular o indutor da linha híbrida, de acordo com (6), onde se pode observar seu comportamento de acordo com a Fig. 4, representado pela cor preta, onde mais uma vez é mostrada a comparação com as simulações com LTNLs com indutores fixos de 54 nH e 22.68 nH. Uma comparação entre ambos os resultados de simulação da tensão de saída da linha híbrida com fluxo convencional e modificado encontra-se mostrado na Fig. 5. Nesta figura, observa-se que para o fluxo modificado as oscilações de saída apresentam maiores amplitudes de modulação e emergem com um tempo de atraso ligeiramente menor. As saídas das simulações apresentadas até o momento sugerem um circuito ideal, já que as perdas não foram consideradas. Para o circuito real, ou seja, aquele que poderá ser executado experimentalmente, as perdas no circuito atenuam as amplitudes das oscilações, de forma que se incluiu um valor fictício (sendo 0.1 Ω em série com o indutor e 1.0 Ω em série com o diodo varactor) para representar as perdas ôhmicas do circuito. O esquema deste circuito está representado na Fig. 6. As Figs. 7 e 8 a seguir mostram os resultados de simulação da LTNL híbrida comperdas respectivamente com fluxo convencional e modificado. Nos mesmos gráficos, para efeito de comparação são mostrados os resultados para uma LTNL convencional com perdas com indutores fixos de 54 nH e 22.68 nH, respectivos valores iniciais e de saturação do indutor da linha híbrida. Além disto, neste trabalho, é interessante comparar no mesmo gráfico o comportamento da linha híbrida com e sem perdas. Sendo assim, a comparação da linha híbrida com fluxo convencional com e sem perdas está mostrado na Fig. 9 enquanto que a comparação da mesma com fluxo modificado é dada na Fig. 10. IV. DISCUSSÃO Na Fig. 3 foram mostrados diferentes simulações dos pulsos de saídas obtidos para cada uma das três linhas, sendo os dois principais fatores diferenciais entre elas: a) o valor atribuído ao indutor L e b) a linearidade ou não de L. O pulso de saída referente a linha com indutor fixo emergiu antes devido ao menor atraso da linha possível, visto ele é proporcional a n(LC)1/2 e L neste caso é o menor valor possível. Já para a saída do indutor fixo de 54 nH, o atraso é maior em relação às outras saídas contidas no mesmo gráfico (da ordem de 35 ns), pois das três linhas esta possui o maior valor de L. No caso da linha híbrida, o atraso ficou num valor intermediário ao redor de 30 ns, pois o indutor decresce de um valor inicial de 54 nH para um valor final da ordem 22 nH na saturação. Outro ponto importante nos resultados obtidos é que a frequência das oscilações aumenta com menores valores de L como esperado, como demonstrado no caso das LTNLs com indutores fixos na Fig. 3 atingindo 650 MHz. No caso da linha hibrida, a frequência é maior ainda (≈ 800 MHz) devido ao efeito conjunto da não linearidade do indutor e do capacitor, porém ao custo da redução das amplitudes das oscilações, conforme se pode observar nas Figs. 3 e 4. Contudo, com fluxo modificado, observa-se que a modulação em amplitude das oscilações de saída é maior quando comparado com o caso de fluxo convencional (ver Fig. 5). Por outro lado, no caso das linhas com perdas as amplitudes das oscilações são reduzidas consideravelmente, tanto no caso das linhas híbridas com fluxo modificado ou convencional (ver Figs. 9 e 10), como no caso das LTNLs com indutores fixos (neste caso compare, por ex., Fig. 4 com Fig. 7). V. CONCLUSÃO Um dos objetivos principais deste trabalho foi o de mostrar que através de métodos computacionais se pode prever o comportamento de operação de LTNLs com intuito de gerar oscilações de saida a partir de um pulso injetado na entrada. Além disto, concluiu-se que a linha híbrida possui um desempenho superior em relação à linha com somente um componente não linear, e que ao se considerar perdas resistivas que ocorrem nos circuitos reais, a amplitude das oscilações na saída caem consideravelmente. Como trabalhos futuros, para complementar este estudo, pretende-se construir uma linha híbrida experimental para verificar os resultados obtidos nas simulações com perdas destes dispositivos. . Por último, espera-se que as ferramentas computacionais e análises descritas neste trabalho sejam de interesse para o desenvolvimento de dispositivos em aplicações para a geração de RF de alta potência, onde se deseja substituir tubos eletrônicos por elementos mais compactos como LTNLs, como por exemplo, em veículos espaciais e em plataformas móveis de sistemas de defesa.  "
}