{
    "id": 161,
    "titulo": "formação dinâmica de frotas de quadrirrotores por campos potenciais na presença de obstáculos",
    "autor": "carlos bentes, osamu saotome",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2012/st/P_6.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": " A formação dinâmica de um grupo de veículos aéreos não tripulados (VANT) é apresentada através de simulações. A utilização de campos potenciais, em conjunto com algoritmo de rota A estrela (A*), permite a navegação em ambientes parcialmente estruturados na presença de obstáculos. O algoritmo A* encontra um caminho livre de obstáculos que é posteriormente utilizado para guiar o centro de formação do agrupamento de quadrirrotores. A função de campo potencial é utilizada para controlar a formação da frota e evitar obstáculos localmente enquanto navega pela rota planejada. Resultados de simulação são apresentados para formações de diferentes formatos na presença de obstáculos.",
    "texto": "I. INTRODUÇÃO A utilização de veículos aéreos não tripulados em missões de reconhecimento e controle de desastres é de grande valia estratégica. Dado ao seu tamanho reduzido e relativo baixo custo, frotas de veículos autônomos podem ser coordenadas em regiões de risco, como por exemplo para avaliação de dados em um desastre de planta nuclear, em estruturas abaladas com risco de desmoronamento ou em missões de inteligência atrás da linha inimiga. Uma frota de microquadrirrotores composta de várias unidades poderia ser utilizada em tais situações. Para controle de formação e navegação a utilização de funções artificiais de campos potenciais pode ser utilizada [1][2][4][5]. Ela permite uma representação simples de pontos de interesse, tais como o ponto de destino, e obstáculos. Um robô utilizando-se de campos potenciais para navegação seria, por exemplo, atraído por seu ponto de destino e repelido por obstáculos em seu caminho. Um campo potencial é representado por [6]: Onde 𝑝 representa o vetor posição do ponto considerado em um sistema de coordenadas globais. Tomando-se a derivada parcial do campo acima obtém-se um vetor que pode ser utilizado como entrada de um controlador de robô, fazendo-o seguir a direção determinada pelo vetor. Este artigo propõe a criação de um campo artificial para controle de formação de frotas de quadrirrotores em coordenadas 3D, através da extensão da função de agrupamento apresentada em [2] e [7]. Diferentes agrupamentos são comparados e resultados de simulações em ambientes com obstáculos são apresentados. II. NAVEGAÇÃO E FORMAÇÃO DE VOO O agrupamento de quadrirrotores utilizando-se funções artificiais de campo é conveniente por permitir expressar com simples relações matemáticas e com baixo custo computacional as relações dinâmicas entre o posicionamento de diversos participantes de um frota e interações com outros membros e obstáculos. Suponha que o centro de agrupamento é dado por (𝑥, 𝑦, 𝑧). É possível definir um formação esférica utilizando-se campos potenciais da seguinte forma [2][7]: onde w é uma constante e 𝐷  𝑥, 𝑦, 𝑧 é a distância Euclidiana do ponto (𝑥, 𝑦, 𝑧) ao centro de formação (𝑥, 𝑦, 𝑧). O campo vetorial de agrupamento tem a seguinte forma: Onde h é o parâmetro responsável por controlar a excentricidade do plano (x,y), variando a forma do agrupamento de um plano (h=0) até uma esfera (h=1). O peso 𝑊(𝑥, 𝑦, 𝑧) é usado para definir as regiões de atração do campo vetorial. Dado duas esferas de raio 𝑅! e 𝑅!, tal que 𝑅! < 𝑅!, é possível definir o seguinte comportamento: Para uma partícula P centrada em (𝑥, 𝑦, 𝑧) dentro da região no espaço limitada pelo raio 𝑅!, é desejado que essa partícula observe um campo de repulsão de forma a mover a partícula para longe do centro de formação (𝑥, 𝑦, 𝑧). Se a partícula se encontra na região do espaço exterior a esfera centrada em (𝑥, 𝑦, 𝑧) de raio 𝑅!, é desejado que a mesma perceba uma força de atração no sentido de movê-la na direção de (𝑥, 𝑦, 𝑧). Se a partícula P está posicionada entre os raios 𝑅 e 𝑅, não é necessário aplicar nenhuma força, e a partícula já se encontra dentro da região de formação estabelecida. Desta forma, utilizando-se (2), tem-se: Se 𝐷  𝑥, 𝑦, 𝑧 ≤ 𝑅 então 𝑉 𝑃 move o ponto P para fora do centro de formação (𝑥, 𝑦, 𝑧). Se 𝐷 𝑥, 𝑦, 𝑧 ≥ 𝑅 então 𝑉 𝑃 move o ponto P na direção do centro de formação 𝑥, 𝑦, 𝑧 . Se 𝑅 < 𝐷 𝑥, 𝑦, 𝑧 < 𝑅, então 𝑉 𝑃 = 0 0 0  Desta forma, torna-se conveniente expressar a função peso 𝑊(𝑥, 𝑦, 𝑧) através da distância r entre o ponto P e o centro de formação (𝑥!, 𝑦!, 𝑧!). Portanto: onde 𝑆! 𝑟 e 𝑆!(𝑟) são projetadas para atender ao comportamento requerido, e são definidas através da função Sigmoide de acordo com: O parâmetro k é utilizado como controle interno de formação do campo vetorial de repulsão, de forma a se obter um maior controle na formação quando próxima a obstáculos, permitindo desta forma que que os membros do agrupamento se movam para o interior da esfera de formação. Ele é definido com o auxílio de sensores virtuais 𝑆!, tal que: e 𝐹 !(𝑆!) representa a função de campo potencial percebida na posição 𝑆! e é dada por: O posicionamento proposto para os sensores virtuais 𝑆!, 𝑆!, 𝑆!, 𝑆!, 𝑆! e 𝑆! é ilustrado na Fig. 1. Através da utilização de sensores virtuais, que medem os valores de campos potenciais em posições ao redor do centro de formação, pode se controlar o valor de k em (7) e a variação do campo artificial obtida é ilustrada na Fig. 2. Da mesma forma, pode-se definir as condições desejadas para formação de um campo vetorial artificial para formação cúbica. Para tal, define-se (𝑥!, 𝑦!, 𝑧!) como o centro de formação e 𝑥!, 𝑦!, 𝑧! como a posição da partícula P no sistema de coordenadas considerado. Para uma formação volumétrica de lados 𝐿 !, 𝐿!, 𝐿!, tem-se: E o campo vetorial que mantém o agrupamento de partículas na região volumétrica de lados 𝐿!, 𝐿!, 𝐿! é então dada por: A ilustração do campo vetorial criado por essa definição de campo artificial é apresentada na Fig. 3. III. RESULTADOS EXPERIMENTAIS Para a simulação de navegação e formação foram utilizadas 12 partículas representando micro-quadrirrotores em agrupamento. O primeiro passo da simulação é encontrar um caminho livre de obstáculos do ponto inicial ao ponto final. Esta tarefa é realizada através do algoritmo A estrela (A*) em uma representação discreta do ambiente simulado. O caminho encontrado na etapa de planejamento é então utilizado para guiar o centro de formação ao longo do ambiente simulado. O agrupamento é controlado pela função potencial artificial, utilizando-se das equações (5) e (11), e cujos valores de parâmetros encontram-se na tabela 1. A simulação é implementada em Python com o auxílio das bibliotecas de software livre para análise numérica Numpy [8], e de visualização de dados Matplotlib [9]. 1) Formação esférica: A formação esférica é obtida através de (5). A simulação inicia com as partículas fora de formação, e após iterações de agrupamento as partículas são direcionadas para o volume de agrupamento desejado. O agrupamento esférico é ilustrado na Fig. 4. 2) Formação Cúbica: A formação cúbica é obtida através de (11). Após agrupamento, as partículas se encontram contidas na região do espaço limitada pelo volume no formato de um cubo, como ilustrado na Fig. 5. 3) Formação circular: Da mesma forma, é possível limitar a formação a um plano de navegação, evitando que as aeronaves se sobreponham umas as outras. A formação esférica é então degenerada para a formação circular apresentada na Fig. 6. e a formação cúbica é por sua vez degenerada para sua representação retangular, de acordo com a Fig. 7. 4) Navegação: A navegação no ambiente simulado se dá pelo calculo de waypoints através do algoritmo A*. Um ambiente contendo obstáculos é representado na forma discreta de um grid. Cada obstáculo é representado no grid como pontos vermelhos (Fig. 8 – A). O caminho calculado pelo planejador de rotas é livre de obstáculos, e é ilustrado como um conjunto de pontos azuis (Fig. 8 – B). Para evitar que o algoritmo A* encontre caminhos que passem muito próximo a obstáculos, utiliza-se uma função potencial de repulsão nos obstáculos como penalização para o cálculo de rota. Tal penalização faz com que o algoritmo A* não seja mais ótimo no sentido de menor caminho, mas evita que o centro de formação do agrupamento passe muito próximo a um obstáculo. A Fig. 8 ilustra o cenário utilizado para simulações de navegação e agrupamento. Após determinar um caminho livre de obstáculos, a simulação prossegue calculando a formação em torno do centro de agrupamento, enquanto movimenta o mesmo pelos waypoints calculados. Nas Fig. 9 e Fig. 10, é apresentado o resultado da simulação de uma frota em formação retangular ao atravessar um conjunto de obstáculos. 5) Simulador Morse: O simulador Morse é um simulador de código aberto desenvolvido pelo LAAS-CNRS e é atualmente mantido por universidades para uso em pesquisas de robótica [10]. Desenvolvido com base no ambiente de modelagem Blender 3D [11], o Morse apresenta interface através de pacotes de rede para controle de atuadores e leitura de sensores em seu ambiente simulado. Para avaliar a navegação e agrupamento da frota de quadrirrotores em um ambiente virtual simulado foi construída uma interface de controle para acesso ao Morse. Em cada passo da simulação, dados das posições dos quadrirrotores no mundo virtual são obtidos pela interface de simulação, e utilizados como entrada do algoritmo de navegação e agrupamento descrito em Python. Após processamento utilizando A* e campos artificiais, a resposta de reação para cada partícula simulada é utilizada para se calcular a posição para qual cada partícula deve se mover, e este é usado como referência de entrada para o atuador de movimento presente do simulador. Os comandos de atuação são enviados para o simulador Morse através de um canal TCP/IP de comunicação. Construiu-se um modelo tridimensional de um micro-quadrirrotor para ser utilizado no simulador Morse, e esse modelo é apresentado na Fig. 11. O mundo virtual simulado é baseado em um cenário presente no Morse contendo arvores e prédios, de acordo com o ilustrado na Fig. 12. Como obstáculos são utilizados coordenadas representando regiões espaciais a serem evitadas pelo agrupamento. Os resultados da simulação contendo trajetória de navegação e posições de agrupamento é mostrado na Fig. 13. Nela pode-se observar 5 momentos distintos da simulação: 1. Posição inicial antes de agrupamento (verde) 2. Posição de agrupamento no inicio de percurso de trajetória (amarelo) 3. Reorganização da frota próxima a obstáculo (preto) 4. Frota transpassando obstáculo (ciano) 5. Formação ao final do percurso de trajetória (azul). IV. CONCLUSÃO Este trabalho apresentou a utilização de funções de campo potencial para agrupamento e navegação de frotas de quadrirrotores, simulados como partículas, em ambientes 3D na presença de obstáculos. Diferentes formas de agrupamento são apresentadas e simuladas na presença de obstáculos. Tais agrupamentos são modificados dinamicamente durante o voo através da utilização de sensores virtuais, o que permite uma reconfiguração dinâmica de formação para melhor se adaptar a obstáculos em seu percurso, como no caso de janelas e corredores estreitos. Como aplicação pode-se citar a utilização de frotas de micro-quadrirrotores em missões de reconhecimento e exploração, onde a habilidade de navegar em grupo, enquanto se evita obstáculos e áreas proibidas, é necessária.   "
}