{
    "id": 162,
    "titulo": "modificação e controle das propriedades de antenas do tipo corneta em banda x por um arranjo periódico de fios metálicos",
    "autor": "antônio tomaz de carvalho, joaquim j. barroso, pedro josé castro e alberto j. faro orlando",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2012/st/VII_2.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 2,
    "resumo": " Este trabalho apresenta os conceitos e aplicações da teoria de fios metálicos periódicos para a realização de dielétricos artificiais com o intuito de otimizar dispositivos de radio-frequência e de micro-ondas. Com base em simulação eletromagnética faz-se um estudo comparativo de antenas do tipo corneta com e sem fios metálicos e demonstra-se experimentalmente o efeito da presença dos fios metálicos nas propriedades das antenas.",
    "texto": "I. INTRODUÇÃO A utilização de fios condutores metálicos para síntese de dielétricos artificiais visando aplicações em micro-ondas remonta aos anos 1950 [1]-[3]. Numa concepção moderna, dielétricos artificiais constituem uma classe de metamateriais e têm sido explorados em diversas áreas da ciência e da tecnologia com o objetivo de manipular e controlar ondas eletromagnéticas [4]-[9]. Uma das maneiras de sintetizar tal meio artificial é utilizando fios condutores metálicos, como discutido em publicações recentes [10]-[12] O presente trabalho explora o conceito de um arranjo periódico de fios metálicos através de uma aplicação em antenas do tipo corneta. Aplicações de estruturas periódicas com fios condutores metálicos em antenas mostram-se atrativas pelas melhorias obtidas em diretividade e ganho [7]-[9]. II. TEORIA DE UM ARRANJO PERIÓDICO DE FIOS METÁLICOS Fios condutores metálicos igualmente espaçados e de modo a formar uma estrutura periódica são idealmente utilizados para modelagem de estruturas dielétricas artificiais. A periodicidade apresentada por esse tipo de estrutura assim constituída produz efeitos não encontrados na natureza para o índice de refração. Uma estrutura de fios metálicos possui uma frequência de corte e somente acima da qual há propagação de ondas. Com base na geometria de um arranjo periódico de fios paralelos e considerando o campo elétrico incidente paralelo aos fios, determina-se a frequência de corte da estrutura, expressão que é função da distância periódica de separação entre os fios (a) e do diâmetro do fio (d) empregado [4] onde c é a velocidade da luz no vácuo. Na Fig.1 são mostradas as curvas de iso-frequência no plano a-d com a distância periódica e o diâmetro do fio variando de 7,0 a 15,0 mm e de 0,2 a 0,8 mm, respectivamente. Por exemplo, fixando-se o diâmetro d em 0,5 mm (fio de cobre disponível comercialmente) tem-se que espaçamentos periódicos de 10,0 e 12,0 mm determinam as frequências de corte em 7,76 GHz e 6,23 GHz. Complementando a caracterização da estrutura, estima-se o valor da permissividade elétrica apresentada por essa estrutura periódica. Baseado no modelo de Drude, pode-se então determinar a permissividade elétrica do arranjo de fios condutores paralelos [11], onde εe é a permissividade do meio que aloja os fios condutores, denominado de meio hospedeiro, ω é a frequência de operação da onda incidente na estrutura e ωc denota a frequência angular de corte, indicada em (1). No presente trabalho, considera-se uma estrutura simples de fios metálicos igualmente espaçados de 10,0 mm um do outro onde o diâmetro dos fios é de 0,5 mm. A Fig. 2 visualiza a estrutura proposta em que são utilizados 5 fios condutores com comprimento de 60 mm, numa simulação eletromagnética no CST Microwave Studio [13]. Os parâmetros de espalhamento simulados S11 e S21, que caracterizam as propriedades de transmissão da estrutura, são apresentados na Fig. 3. Observa-se uma ampla faixa de passagem para a estrutura proposta, estendendo-se de 6,8 GHz a 13,0 GHz onde se distinguem quatro ressonâncias que resultam dos quatro ressoadores acoplados na estrutura periódica de cinco elementos. Tais ressonâncias advêm do fato de que uma estrutura periódica de N elementos suporta N-1 modos axiais [11]. Nota-se ainda no final do espectro da Fig. 3, uma região de banda de rejeição, denominada de região de Bragg. Esses efeitos podem ser observados na fase do sinal de S11 mostrada na Fig. 4. O comportamento da fase descreve claramente os efeitos presenciados pela estrutura de fios condutores. Pode-se observar o primeiro efeito na frequência de corte, aproximadamente em 7,0 GHz, pois a fase é alterada, deslocando-se rapidamente. Ao final da banda de passagem, ou inicio da banda de Bragg, aproximadamente em 13,0 GHz, pode-se observar novamente a alteração no período da fase, assim indicando o deslocamento continuo do sinal propagante. O valor da frequência de corte de 7,0 GHz indicada na Fig. 4 pode ser confirmado utilizando a expressão (1). Substituindo em (1) os valores simulados (a = 10,0 mm e d = 0,5mm) obtém-se a fp= 7,7 GHz. A discrepância com o valor obtido por simulação (7,0 GHz) deve-se ao limitado grau de homogeneização da estrutura, ou seja, quanto mais fios condutores, maior será a definição do espectro de frequência, assim definindo as bandas e as ressonâncias da estrutura. Uma aplicação prática da estrutura de fios metálicos será feita com o intuito de controlar e otimizar o diagrama de radiação de antenas. III. APARATO EXPERIMENTAL Com o intuito de verificar os estudos conceituais, um experimento foi realizado com base nos padrões de simulação, seguindo o mais fielmente possível o modelo físico proposto na simulação e com as dimensões especificadas. Utilizaram-se fios de cobre com diâmetro de 0,5 mm igualmente espaçados de 10 mm, conforme descrito na simulação. Como estrutura de sustentação dos fios condutores, foi utilizado uma placa de poliestireno de 10,0 mm espessura e permissividade elétrica relativa aproximadamente igual a 1,0, um valor de permissividade próximo à do ar conforme as condições da simulação implementada. A Fig. 5 apresenta o arranjo periódico de fios de cobre incrustados no material hospedeiro. Para o experimento foram utilizadas cinco placas de poliestireno, assim modelando o arranjo de fios metálicos periódicos. Cada camada foi cuidadosamente confeccionada para apresentar a distância especificada entre os fios metálicos e apresentar a forma de encaixe correta na antena. Usou-se uma antena para operar na faixa de frequências de 8,20 a 12,40 GHz (banda X) com padrões de funcionalidade já otimizados do fabricante ATM Microwave. A Fig. 6 apresenta a antena carregada com a estrutura de fios condutores metálicos. Os resultados de medidas dos parâmetros para a antena são apresentados na seção seguinte onde são comparados os comportamentos da antena padrão (convencional) com a antena carregada com os fios de cobre. IV. MEDIDAS EXPERIMENTAIS A fim de caracterizar e quantificar o efeito dos fios metálicos introduzidos na antena, várias medidas dos parâmetros de espalhamento foram efetuadas. Essas medidas para a antena convencional (sem placa com os fios de cobre) serviram como referência, visto que a antena já foi projetada com funcionalidade ótima pelo fabricante. As medidas foram feitas utilizando o analisador de rede vetorial do fabricante Agilent Technologies modelo N5230C. A Fig. 6 apresenta a perda por retorno (S11) obtida experimentalmente para a antena convencional. Pode-se observar que o nível da perda por retorno fica em média -15 a 20 dB para toda a faixa de frequência analisada. A mesma medida foi realizada com a antena carregada com os fios metálicos. O parâmetro S11 medido para a antena carregada é apresentado na Fig.7. Observa-se que o nível apresentou um limiar menor que o obtido com a antena convencional em toda a banda analisada. Porém, na faixa próxima de 9,5 GHz a antena apresentou uma considerável redução do parâmetro S11, chegando ficar próximo de -20 dB. Esse resultado significa que é uma boa frequência de trabalho da antena, para o espectro analisado. A fim de validar o experimento, novas simulações foram feitas, com o intuito de verificar a diretividade nessa faixa de frequência. Nas representações cartesiana e polar, a Fig. 8 compara as diretividades da antena corneta convencional e da antena carregada com fios metálicos em 9,5 GHz. É interessante ressaltar que o parâmetro de espalhamento da simulação também apresentou um nível abaixo de -20 dB na faixa próxima de 9,5 GHz, comparado-se com a antena convencional padrão. Nota-se que a antena carregada com fios metálicos apresenta uma boa focalização em uma maior faixa de cobertura, assim sendo capaz de concentrar maior energia irradiada na determinada região, se compararmos com a antena convencional. Outros diferentes experimentos práticos foram efetuados, utilizando diferentes números de fios condutores. Pode-se concluir que quanto mais fios condutores são utilizados, ou seja, maior o comprimento da estrutura de fios condutores em paralelo, melhor será a definição dos parâmetros da estrutura, caracterizando com melhor definição as ressonâncias e a frequência de corte da estrutura. Observou-se também que as medidas apresentaram boas concordâncias quando refeitas, sem diferença considerável, o que caracteriza que os eventos são permanentes e reproduzíveis. A discrepância apresentada fica em media ± 2dB. Todas as medidas foram feitas em um ambiente adequado revestido com absorvedores de microondas, e está programado para refazer os experimentos em uma câmara anecóica especifica para caracterização da antena. IV. CONCLUSÕES Aplicações com os fios condutores metálicos em antenas mostram-se importantes cujos efeitos puderam ser comprovados experimentalmente. Para as cinco camadas de fios condutores igualmente espaçadas de 10 mm, observaram-se quatro ressonâncias no espectro de reflexão da estrutura. Incorporando essa estrutura de mesma periodicidade no interior da antena, observou-se uma variação das mesmas ressonâncias no espectro de operação da antena. Dessa forma, a antena carregada ficou caracterizada com pequenas faixas de ressonâncias afetando o restante da banda de operação da antena. Essas faixas estreitas caracterizadas pela perda por retorno representam os pontos ótimos de operação da antena. Outros testes utilizando a variação no número de camadas foram feitos e pôde-se observar que um número menor de fios apresenta efeitos desprezíveis para as ressonâncias, com baixa perda por retorno e com poucas ressonâncias. Com base em simulações eletromagnéticas, constatou-se também que um número maior de fios causa obstrução na propagação de energia radiante através da antena, descaracterizando-a por completo. Assim, adotaram-se cinco camadas periódicas de fios como ideal para a realização do experimento.  "
}