{
    "id": 164,
    "titulo": "desempenho de tintas absorvedoras de radiação eletromagnética a base de nanotubos de carbono aplicada sobre material absorvedor estrutural",
    "autor": "luiza de castro folgueras  e mirabel cerqueira rezende",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2011/st/V_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "A combinação de um determinado centro absorvedor de radiação em matrizes poliméricas pode conferir características de absorção da radiação eletromagnética a um material. Nesse contexto, este trabalho tem como objetivo o processamento e avaliação de tintas obtidas a partir de nanotubos de carbono e poliuretano, aplicadas sobre um compósito tipo multicamadas, processado com tecidos de fibra de vidro. O comportamento eletromagnético da tinta e compósito foi avaliado via medidas de refletividade da radiação incidente pela técnica com guia de ondas na banda X do espectro eletromagnético (de 8 a 12 GHz). Os resultados mostram que a tinta processada e aplicada sobre o compósito apresenta reduzida espessura e bom desempenho da atenuação da radiação micro-ondas (94% de absorção da onda incidente).",
    "texto": "I. INTRODUÇÃO São denominados materiais absorvedores de radiação eletromagnética (MARE) os diversos materiais processados com a função de atenuar a radiação eletromagnética na faixa de micro-ondas, que podem ser obtidos como: tintas, compósitos, mantas, filmes finos, etc. Esses materiais são obtidos a partir da adição de centros absorvedores em diferentes tipos de matrizes poliméricas. Quando esses materiais são depositados ou aplicados em substratos, que conferem propriedades mecânicas adequadas à aplicação final torna-se estruturas absorvedoras de radiação eletromagnética, denominadas como RAS (Radar absorbing material). Devido às singulares propriedades dos nanotubos de carbono (NTCs), diversas e novas possibilidades de suas utilizações e aplicações tem impulsionado o desenvolvimento de novos materiais. Dentre as atrativas propriedades dos NTC pode-se citar boa resistência mecânica, aliada ao fato de não se quebrarem e nem se deformarem, quando dobrados ou submetidos à alta pressão. Destacam-se também como excelentes condutores de calor e capazes de transportar eletricidade. Essas propriedades reunidas em uma única estrutura, com tamanho tão reduzido, ativa a imaginação de forma que ao adicioná-los aos plásticos, por exemplo, os NTCs podem endurecê-los ou torná-los condutores de eletricidade (caráter metálico) [1,2]. A combinação de polímeros com o nanotubos de carbono permite aliar as propriedades de ambos os materiais para formar novos materiais funcionais, com aplicação na área de micro-ondas. A utilização de tintas com propriedades eletromagnéticas em conjunto com materiais obtidos à base de fibras permite o processamento de materiais absorvedores estruturais de interesse aeronáutico [3,4]. O objetivo deste trabalho é avaliar o comportamento eletromagnético de tintas absorvedoras obtidas a partir de nanotubos de carbono. As tintas foram formuladas em matriz poliuretânica; visando uso aeronáutico e foram aplicadas sobre superfícies de materiais compósitos à base de fibra de vidro, processado com impregnação de tinta também à base de nanotubos de carbono II. MATERIAIS E MÉTODOS No processamento dos nanocompósitos absorvedores foram impregnados individualmente substratos do tipo tecido de fibra de vidro estilo Plain Weave (20 cm x 20 cm); com formulações à base de nanotubos de carbono de paredes múltiplas (MWNT) (formulações com 0.1, 0.3, 0.5, 0.8 e 1.0% (m/m)) em matriz de poliuretano. A impregnação das formulações nos tecidos foi realizada via método convencional de pintura, isto é, usando pincel. Os tecidos impregnados foram empilhados, posicionando inicialmente as camadas com 0,1% de NTC e, em seguida, as outras camadas. A adesão entre os tecidos foi promovida pelo uso de prepregs de fibra de vidro, cuja cura foi sob pressão e aquecimento a 75C (Fig.1). A tinta foi processada a partir de nanotubos de carbono obtidos da empresa koreana ILJIN NANOTECH Co. Ltd. (tipo CM-95/ MWNT) e de poliuretano de uso comercial. A mistura dos nanotubos de carbono na matriz poliuretânica foi sob agitação mecânica por 15 minutos e, com auxílio de pincel, foi aplicado sobre o nanocompósito. A cura foi à temperatura ambiente e a espessura da tinta aplicada nos nanocompósitos foi de em média 0,15mm. A caracterização eletromagnética dos materiais processados foi realizada por medidas de refletividade/absorção da radiação incidente no material utilizando a técnica com guia de ondas na faixa da banda X do espectro eletromagnético (de 8 a 12 GHz) [5-7]. O guia de ondas foi acoplado a um analisador de rede vetorial Agilent Technologies (modelo 8510C) conectado a um acessório, o S-parameter Test Hewlett Packard 8510A (45 MHz - 26,56 GHz), e ainda a um gerador de freqüências sintetizado (45 MHz – 26 GHz). Para a avaliação das propriedades dielétricas e magnéticas foi utilizado o software da Agilent Technologies, em comunicação com sistema de vetorial de avaliação; e a partir, das medidas dos parâmetros S (coeficientes de reflexão e transmissão, S11 e S21). O material de referência usado para a avaliação da eficiência do MARE processado, foi uma placa de alumínio, que é 100% refletor ou 0% absorvedor coberta com o compósito. III. RESULTADOS E DISCUSSÕES Fig.2 apresenta os aspectos morfológicos dos materiais processados, pode-se observar as camadas impregnadas de tecido de fibra de vidro que formam o compósito multicamada (Fig.2(a)) e a tinta aplicada na superfície. Na Fig.2(b) é apresentado imagem por MEV da tinta removida da superfície do compósito. Observa-se que há formação de aglomerados de nanotubos de carbono na matriz poliuretânica.As curvas relativas às propriedades eletromagnéticas dos nanocompósitos multicamadas e da tinta aplicada na superfície são apresentadas na Fig.3. A linha preta, localizada em aproximadamente 0 dB (0% de absorção) na Fig. 3(a), corresponde à avaliação da placa metálica (alumínio) e alinha verde, corresponde a avaliação do compósito sem aplicação da tinta material de referência e posicionado sobre a placa de alumínio. As curvas referentes à placa metálica e ao compósito não coincidem, apresentando reflexão de máxima -1 dB. Este resultado é devido aos substratos formadores do compósito ser transparente às micro-ondas; a quantidade de MARE impregnado nos tecidos de fibra de vidro que formaram o compósito não foi suficiente para que ocorra a atenuação da onda eletromagnética. A aplicação da tinta com espessura próximo de 0,15 mm promoveu a atenuação da radiação, o material passou de quase transparente a radiação para absorvedor da onda eletromagnética. Na frequência 8 GHz a absorção apresenta valor de -4 dB (60% de atenuação) e em 12 GHz, o valor de –7 dB, atenuando próximo de 80% a onda da radiação micro-ondas. E em 10 GHz, região do espectro da banda X que operam a maioria dos radares militares, apresenta máximo de –13 dB, atenuando 94% da onda eletromagnética. Pode-se observar a permissividade e permeabilidade relativas da tinta processada a partir de poliuretano e nanotubos de carbono na Fig. 3(b). A tinta processada é considerada um material absorvedor dielétrico; assim, os valores das perdas magnéticas (permeabilidade magnética) são baixos, que podem ser desprezados. O material apresenta valores complexos de permissividade relativa, próximo de 7.0 e 1.5 para parte real e parte imaginária, respectivamente. Resultados que permite a penetração da onda no material, e como também está carregado de partículas condutivas, atenua a onda eletromagnética incidente. Quanto maior a componente imaginária da permissividade, maior a capacidade de perda do material; assim, um material com baixa perda dielétrica é capaz de armazenar energia, mas não dissipará muito a energia armazenada. Por outro lado, um material com alto valor de perda dielétrica, não armazena energia efetivamente; mas uma determinada quantidade será convertida em energia térmica dentro do material, isto é, o material absorve a energia eletromagnética em vez de armazená-la, o que o torna um MARE. IV. CONCLUSÕES Os compósitos multicamadas formados a partir de tecidos de fibra de vidro impregnados com nanotubos de carbono atuaram como suporte à tinta absorvedora; e neste estudo apresentou características de quase transparência ao radar, mas possui potencial para ser utilizado como material estrutural absorvedor de micro-ondas. A tinta processada a partir de nanotubos de carbono e poliuretano foi utilizada com espessura reduzida e apresentou boas propriedades eletromagnéticas, permitindo a penetração da onda no material de modo a atenuar até o máximo de 94% da radiação incidente.  "
}