{
    "id": 165,
    "titulo": "verificação de velocidade de alvos marítimos móveis em imagens sar",
    "autor": "marcos roberto seixas, rafael lemos paes e david fernandes",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2011/st/P_5.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "O valor da velocidade de alvos móveis em imagens obtidas por um radar de abertura sintética (SAR) auxilia as atividades de vigilância e de inteligência operacional. Nas imagens SAR marítimas, os ecos das embarcações em movimento são apresentadas deslocadas em azimute em relação a sua esteira de turbulência. Neste artigo é analisado um método determinar a velocidade de alvos móveis marítimos em imagens SAR a partir da distância entre seu eco e sua posição real na cena. A informação de velocidade do alvo móvel subsidia a análise das imagens SAR utilizadas pelos Órgãos de Inteligência Operacional e de Controle de Tráfego Marítimo ou Terrestre.",
    "texto": "I. INTRODUÇÃO O sistema SAR é utilizado no meio militar em atividades de vigilância e na coleta de dados de inteligência operacional. Seu princípio de funcionamento está baseado na propagação e reflexão de ondas eletromagnéticas, podendo operar em condição atmosférica de baixa visibilidade ou no período noturno. Devido à geometria do vôo, a região a ser imageada é previamente estabelecida. O desvio de posição em azimute dos alvos que se encontravam em movimento durante o imageamento permite calcular a componente de velocidade radial dos mesmos. Durante o vôo de imageamento (Fig. 1), uma plataforma equipada com o SAR realiza a coleta das informações na forma de dados brutos (raw data). Estas informações são armazenadas em forma de dados magnéticos podendo ser transmitidos por um enlace de dados. Alguns parâmetros sistema, como a altitude da plataforma imageadora, o ângulo de visada e a frequência de operação são estabelecidos de acordo com o tipo de missão a ser realizada. A resolução do radar determina a precisão em que os dados são obtidos [1]. Posteriormente um algoritmo realiza o processamento dos dados brutos para a formação da imagem da cena. Os ecos dos alvos que se encontravam em movimento em relação ao solo são posicionados deslocados em azimute em relação à posição em que eles realmente se encontravam [2]. O processador SAR considera que toda a cena estava imóvel durante o período de imageamento. A análise do deslocamento que ocorre entre um navio e sua esteira de turbulência permite calcular o valor da componente velocidade radial do alvo móvel marítimo. O valor do desvio sofrido pelo eco do navio em relação a sua esteira é proporcional à componente radial de sua velocidade. A velocidade de alvos móveis marítimos foi obtida a partir da medida de seu deslocamento entre um navio e sua esteira de turbulência. Uma aerofotografia foi utilizada como referência para auxiliar a identificação dos alvos de interesse. O algoritmo de processamento dos dados brutos foi modificado para que permitisse a realização da medida de distância na direção azimutal a partir da imagem SAR gerada. Este artigo apresenta um método para determinação da velocidade de alvos móveis em uma imagem SAR a partir do deslocamento de seu eco na direção de azimute. Este método será utilizado no algoritmo de processamento dos dados brutos de um SAR aerotransportado para calcular a velocidade de alvos móveis marítimos. Será calculada a velocidade de navios em alto mar, por este método, a partir de uma imagem obtida por um SAR orbital cujas velocidades dos alvos eram conhecidas. Os resultados da obtenção destas velocidades em imagens SAR serão comentados no final do artigo. II. ESTIMAÇÃO DA VELOCIDADE A informação da velocidade de alvos móveis em imagem SAR se torna um auxílio para a identificação dos pontos de interesse. A obtenção de uma imagem SAR possui um custo elevado, e em determinadas situações poderá haver riscos para a aeronave imageadora. Por isto é importante a obtenção de todas as informações relevantes durante o processamento de cada imagem SAR. O sistema SAR, durante o vôo de imageamento, recebe os ecos refletidos pela cena e armazena estes sinais em meio magnético. Devido ao deslocamento da aeronave, estes ecos sofrem um desvio de frequência Doppler que varia longo da abertura da antena. O valor desta frequência dependerá da posição relativa entre cada alvo e a plataforma imageadora (Fig. 2). Este mesmo conceito de variação do histórico de frequência Doppler é utilizado pelo algoritmo de processamento SAR durante a geração da imagem da cena. Um alvo que se encontre em movimento em relação ao solo durante o período de aquisição da imagem provoca um desvio de frequência Doppler diferente dos ecos à sua volta. O valor deste efeito Doppler adicional dependerá ainda de sua posição na cena e da direção de seu deslocamento em relação à plataforma imageadora (fig. 3). O valor desta frequência de desvio Doppler é calculado por (1) [4]: onde fdA é a frequência de desvio Doppler do alvo móvel, vA é a velocidade do alvo na cena e λ é o comprimento de onda da portadora do sistema SAR. O algoritmo de processamento SAR, durante a compensação da velocidade da plataforma imageadora, considera que toda a cena se encontrava imóvel durante o período de aquisição da imagem. Após o processamento dos dados brutos as imagens destes ecos pontuais são recolocadas em suas respectivas posições, que foram consideradas estáticas, formando assim a imagem SAR. A alteração da frequência de desvio Doppler causado pelo movimento relativo de um alvo durante o imageamento provoca uma interpretação incorreta de sua posição na imagem pelo processador SAR. Em alvos móveis marítimos, depois de formada a imagem SAR, este efeito Doppler adicional posiciona os ecos de embarcações em movimento fora de sua esteira de turbulência (fig. 4). Os alvos móveis terrestres se movimentando em uma estrada são posicionados deslocados do local nos quais estes encontravam durante o imageamento (fig. 5). Este deslocamento assume um valor máximo quando a direção do movimento do alvo móvel é perpendicular ao vôo da plataforma imageadora [5]. Após a obtenção da imagem da cena, a componente de velocidade do alvo móvel na direção de azimute faz com que o mesmo se apresente disperso ao longo desta direção. A componente da velocidade do alvo na direção de distância (range) ocasiona o deslocamento em azimute deste alvo em relação a sua posição real [3]. A componente de velocidade tangencial de um alvo em movimento é obtida pela expressão (2). Os alvos são considerados sem aceleração radial [6]. onde v é velocidade da plataforma, ∆az o deslocamento do alvo em azimute após o processamento da imagem e Ro a distância da plataforma à posição real do alvo na imagem. A esteira de turbulência deixada pelos alvos marítimos em movimento é utilizada como referência para a medida de deslocamento [7]. Em tempestades ou em outras situações de mar grosso, o clutter do mar poderá dificultar a localização da esteira e a realização da medida desta distância. Devido ao ângulo de incidência do radar em relação à cena, apenas uma componente da velocidade do alvo provoca o desvio Doppler adicional em relação à cena (Fig. 6). Para obtenção da velocidade radial, foi considerado o ângulo de visada entre o sensor SAR e o alvo, de modo a compensar a componente da velocidade que provoca o efeito Doppler (3). onde θ é o ângulo de visada do alvo na cena, variando de acordo com o afastamento do alvo na direção de range. O método de medir a distância do deslocamento entre o eco de um navio e o eco de sua esteira permite a obtenção da componente radial da velocidade do alvo marítimo. A medida desta distância no radar aerotransportado foi realizada durante o processamento da imagem SAR. A velocidade correspondente ao deslocamento medido foi calculada pelo algoritmo de processamento de imagem. A medida do deslocamento entre o eco de um alvo móvel terrestre e sua posição real na estrada foi proposto para controle de tráfego terrestre [4]. Em imagens de mar aberto geradas por um SAR orbital, este fenômeno é observado nas embarcações em alta velocidade e com ângulo de visada favorável [8]. Neste artigo, a velocidade de alvos móveis marítimos será calculada pelo deslocamento em azimute entre seu eco e sua esteira, analisando imagens de SAR aerotransportado e orbital. III. RESULTADOS OBTIDOS Foi feita a aplicação do método para o processamento dos dados brutos de um radar aerotransportado e em imagens multivisada (multilook) do sensor orbital TerraSAR-X. Após o processamento dos sinais do sensor SAR aerotransportado, foi obtida a imagem do fundo da baía de Guanabara (Fig. 7). No primeiro plano desta cena é vista a ilha do Boqueirão e ao fundo uma parte da ilha do Governador. Foram realizadas medidas de distância em azimute entre o eco de alvos marítimos móveis e de suas respectivas esteiras. Com os valores destas medidas o algoritmo SAR calculou as velocidades radias destes alvos móveis. O mesmo método foi aplicado em imagens de um radar orbital cujos valores das velocidades de seus alvos eram conhecidos pelas informações fornecidas pelo Global Positioning System (GPS), obtidas através dos Automatic Identification System (AIS) instalados a bordo destas embarcações Uma imagem obtida por satélite (Fig. 8) foi utilizada como referência durante a seleção dos possíveis alvos móveis marítimos. O conhecimento prévio da cena permitiu uma melhor análise durante a busca por alvos marítimos. As principais características do radar aerotransportado e da plataforma imageadora utilizados para a obtenção da Fig. 7 são apresentadas na Tabela I: Para a aplicação do método da medida da distância entre uma embarcação e sua esteira, foram selecionados 5 pontos que possuíam as características esperadas de alvos em movimento (Fig. 7). Os ecos dos alvos se apresentavam deslocados em azimute em relação às suas respectivas esteiras, mantendo o mesmo afastamento na direção de range. A partir do valor desta distância foi estimada a componente radial da velocidade das embarcações apresentadas na Tabela II. Este mesmo método foi aplicado em alvos móveis marítimos observados pelo satélite TerraSAR-X (Fig. 9), cujos parâmetros constam na tabela III. Foi realizada a medida da distância entre o alvo e sua esteira e calculada a velocidade componente radial da velocidade do navio. A partir do ângulo entre a esteira e a direção de range foi obtida a velocidade total dos navios e comparada com os valores de velocidade fornecidos pelo sistema de Automatic Identification System (AIS). Estes resultados estão apresentados na tabela IV. IV. CONCLUSÕES O método de determinar a velocidade dos alvos móveis marítimos a partir do deslocamento de seu eco em relação a sua esteira em imagens SAR foi aplicado ao algoritmo de processamento de um sistema aerotransportado. Os valores das velocidades obtidos estiveram dentro das velocidades esperadas para alvos marítimos encontrados no fundo da baía da Guanabara. Os valores de velocidade calculados para os alvos móveis obtidos pelo satélite TerraSAR-X ficaram próximos aos valores fornecidos pelos navios através de seus AIS. Cabe ressaltar que uma embarcação pode inserir dados falsos em seu sistema AIS e a obtenção da velocidade por um meio alternativo torna a informação mais confiável. Em atividades de inteligência operacional, o conhecimento da velocidade dos alvos encontrados na cena proporciona uma informação adicional para a interpretação desta imagem. Em locais próximos a terra, ou em que se encontrem plataformas de petróleo ou outros obstáculos naturais, é importante um conhecimento prévio da cena a fim de auxiliar a localização dos possíveis alvos móveis. Sugere-se, como trabalho futuro, um levantamento de dados com o uso de embarcações em situações controladas de velocidade e direção para a obtenção das limitações do método. Poderia ainda ser realizado um levantamento de dados com as diversas configurações do SAR aerotransportado para comparação dos resultados obtidos. Um avião de sensoriamento remoto em missão de inteligência operacional poderia ser integrado a um enlace de dados e fornecer informações em tempo real aos órgãos de Controle de Tráfego Marítimo. "
}