{
    "id": 166,
    "titulo": " estudo experimental de um trocador de calor por absorção de energia térmica utilizando acetona e diclorometano",
    "autor": "jeferson camargo fukushima, amarildo tabone paschoalini, marcio bazani e natália michelan",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2011/st/XIV_2.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "O presente estudo envolve a análise teórico experimental da transferência de calor através do mecanismo de ebulição em um reservatório de placas planas. O aparato experimental foi adaptado para simular a troca de calor em um componente eletrônico, no experimento foi utilizado como refrigerante a acetona e o diclorometano, tarugo de alumínio aquecido internamente com resistência elétrica, com fluxo de calor especifico variando entre 1 a 100W.",
    "texto": " I.INTRODUÇÃO A Ebulição Nucleada é um dos mecanismos mais eficientes de remoção de calor de uma superfície aquecida. Nos satélites e equipamentos espaciais faz-se necessário o uso de dispositivos de controle térmico cujo princípio de funcionamento baseia-se no processo de transferência de calor [4]. A utilização racional da energia em processos industriais exige dispositivos apropriados. Dentre esses dispositivos, os tubos de calor e em particular os termossifões bifásicos, são os mais utilizados em trocadores-recuperadores de calor. O termossifão bifásico ou tubo de calor assistido por gravidade é um dispositivo de transferência de calor com certas aplicações que concernem o resfriamento de equipamentos elétricos e eletrônicos, aplicações solares, trocadores de calor, em especial aqueles destinados à recuperação de calor, entre outras. Por ser um dispositivo que opera com mudança de fase do fluido de trabalho, o termossifão bifásico pode transferir vários kW/cm2 com pequena diferença de temperatura e em variados níveis de temperatura de operação. Quando o termossifão é usado em sistemas embarcados, eles devem operar sob diversos fatores adversos, especialmente várias inclinações. A inclinação tem influência sobre o desempenho térmico e limites de funcionamento deste dispositivo. A quantidade de fluido no interior do termossifão mostra-se como um importante parâmetro, pois uma elevada taxa de enchimento pode bloquear o condensador, enquanto que uma pequena taxa de enchimento pode causar a secagem da seção do evaporador, provocando um superaquecimento da parede do tubo e possíveis danos ao dispositivo [5]. Na fig. 1 é apresentado um esquema sobre os principais processos e sub-processos envolvidos na ebulição nucleada, inclui aspectos do fluido, da superfície aquecida e da interface superfície-fluido. Para a transferência de calor em ebulição, o mais importante e, ao mesmo tempo, mais difícil processo é a nucleação e a interação entre sítios de nucleação vizinhos. As interações podem ser divididas em quatro tipos principais, como mostra a fig. 2. Na superfície aquecida, a interação térmica determina ou influencia a distribuição de quatro temperaturas que por sua vez, inclui dois aspectos: a interação térmica entre bolha e superfície aquecida e a interação entre sítios de nucleação. Já no fluido, a interação hidrodinâmica domina o comportamento das bolhas, sendo dividida em: interação hidrodinâmica entre as bolhas e interação hidrodinâmica entre as bolhas e o banho [2]. Diante do exposto, o objetivo do presente artigo é o de analisar o mecanismo da ebulição nucleada, entre chapas planas de alumínio com o fluido de refrigeração acetona e o diclorometano, com o propósito de aperfeiçoar o sistema de refrigeração de placas de centrais telefônicas. II. DESENVOLVIMENTO Construção O trocador de calor utilizado foi construído para controlar a dissipação de calor emitida por uma fonte quente (fig. 3). Formado por duas placas de alumínio unidas, e com o meio oco, assim, o volume interno será preenchido com o líquido em estudo utilizado para a refrigeração. Essas placas estão em contato com um pequeno bloco de alumínio que engloba uma resistência elétrica empregada como fonte quente, simulando o componente eletrônico. A parte de cima das placas de alumínio é aletada. Ao lado das aletas há um ventilador com a função de refrigerar as placas que englobam o líquido. Todo o trocador de calor está envolto por uma parede de isopor a fim de proporcionar o isolamento do mesmo. Coleta de dados A coleta dos dados experimentais consistiu em obter a temperatura através dos termopares situados no trocador de calor em pontos de interesse. Essas temperaturas foram obtidas para diferentes valores de potência. Na fig. 4 é indicado o local de aquisição das temperaturas. A parede de isopor funciona como isolante térmico (fig. 5) dificultando a transferência de calor do ambiente para o interior, assim, a troca de calor será realizada pelo fluído refrigerador. III. RESULTADOS EXPERIMENTAIS Para a obtenção dos dados experimentais foram utilizados três pontos de aquisição da temperatura por três termopares diferentes. Os resultados experimentais foram separados em duas etapas, o primeiro para obter valores de temperatura sem a utilização do fluido, e o segundo utilizando o fluido, posteriormente, comparar os valores e verificar a eficiência do sistema. Operação sem fluido de trabalho Em temperatura ambiente, inicia-se o experimento sem o fluido de refrigeração com 100 W de potência com o objetivo inicial de verificar a temperatura máxima que o sistema pode atingir. A temperatura do termopar 1 (T1), referente a temperatura da fonte de calor, alcançou temperatura de 270 ºC. Posteriormente, o sistema foi desligado, pois atingiu o limite de escala do termopar (Tabela I). Apesar da fonte dissipadora ter alcançado 270 ºC, o sistema alcançaria facilmente valores acima dessa temperatura, pois a potência dissipada foi muito alta para a pequena área do bloco. A meta é que o sistema com o fluido refrigerante não ultrapasse 100 ºC. Portanto, não havia necessidade de verificar o quão maior essa temperatura sem o fluido de trabalho alcançaria. A Tabela I mostra os dados obtidos para a operação sem fluido de trabalho. Operação com os fluidos de trabalho Acetona Foi introduzido no interior das placas de alumínio o fluido refrigerante do sistema. Todas as medidas de segurança foram tomadas para que nada ocorra de forma prejudicial (fig. 5). Com o sistema à temperatura ambiente (23 ºC) iniciou-se o experimento diretamente dissipando um valor de 100 W. Os valores do tempo decorrido do experimento, das temperaturas da fonte de calor, fonte fria, e das aletas, juntamente com a pressão no reservatório, seguem na Tabela II. Podemos observar que o sistema levou 215 minutos para se estabilizar partindo do trocador desligado, e funcionando diretamente para uma dissipação de 100 W. Através dos dados apresentados na tabela 2, podemos obter um gráfico (fig. 6) para uma melhor visualização dos dados. Após obtermos estes dados, a potência foi gradualmente reduzida à 20W, para obtermos o gráfico (fig. 7). Observa-se na fig. 7 que há total controle da temperatura, pois, quando comparado com os dados obtidos no experimento sem o fluido refrigerante a temperatura obtida em função do tempo foi alta, fato que comprova a troca de calor do fluido refrigerante. Diclorometano Com o sistema à temperatura ambiente (23 ºC) iniciou-se o experimento diretamente dissipando um valor de 100 W. Os valores do tempo decorrido do experimento, das temperaturas da fonte de calor, fonte fria, e das aletas, juntamente com a pressão no reservatório, seguem na Tabela III. Podemos observar que o sistema levou 155 minutos para se estabilizar partindo do trocador desligado, e funcionando diretamente para uma dissipação de 100 W. Através dos dados apresentados na Tabela III, podemos obter um gráfico (fig. 8) para uma melhor visualização dos dados. Após obtermos estes dados, a potência foi gradualmente reduzida à 20W, para obtermos o gráfico (fig. 9). IV. CONCLUSÃO O método de refrigeração de componentes eletrônicos através da utilização de um fluido refrigerante com temperatura de vaporização baixa é eficaz. Sem a utilização do fluido, notou-se que o bloco interno chegou à temperatura de 270ºC, e a acetona - fluido refrigerante -, não ultrapassou a temperatura de 84ºC. Essa diferença de temperatura é superior a 180ºC, ou seja, o sistema é eficiente, já o diclorometano apresentou, que o fluido respondeu bem no experimento, ou seja, teve uma boa absorção de energia, a temperatura da fonte quente ficou estabilizada na faixa de 80 a 90 °C, que é um resultado bem expressivo (eficiência de redução de 68,52 %). Colocando em balanço todos os fatores, a utilização de ambos os compostos são viáveis.  "
}