{
    "id": 167,
    "titulo": "uso de redes de comunicações ópticas para transmissão e distribuição de emissores radar",
    "autor": "olympio l. coutinho, vilson r. almeida, josé edimar b. oliveira",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2011/st/I_2.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 2,
    "resumo": "Este artigo aborda a transmissão de sinais de RF em fibras ópticas e o emprego da infra-estrutura de redes de comunicações ópticas para a transmissão e distribuição de emissores radar remotos. Um enlace analógico a fibra concebido para a transmissão de sinais radar na faixa de frequência de 0,5 a 18 GHz é apresentado, por meio de uma abordagem teórica e experimental. Uma análise comparativa entre a transmissão de RF em fibra óptica e em cabos coaxiais é apresentada. O uso de amplificação de RF na saída do enlace analógico a fibra óptica é abordado, levando-se em consideração o ganho, a figura de ruído e a faixa dinâmica do sistema. Resultados experimentais da transmissão de um emissor radar na banda S usando a infraestrutura de fibra óptica de uma rede de comunicações digitais administrativa são apresentados.",
    "texto": " I. INTRODUÇÃO Com o desenvolvimento de fibras ópticas com baixas perdas [1] e o surgimento de dispositivos comerciais de modulação e de demodulação óptica, um grande avanço em sistemas de comunicação a fibra óptica foi testemunhado [2]. Inicialmente, o grande interesse estava voltado para sistemas de comunicação digital, em função das vantagens relativas à capacidade de transmissão de dados, distância entre estações e custo reduzido [3]. Atualmente, os sistemas de comunicações ópticas digitais são bastante abrangentes e contam com uma infra-estrutura já instalada de cabos de fibra óptica que interconectam prédios, bairros, cidades e até mesmo países. No início das comunicações ópticas, um interesse menor foi dado para a área de transmissão de sinais analógicos na faixa de rádio frequência (RF) em fibra óptica, em função da baixa performance de RF dos primeiros enlaces a fibra óptica [4]. Esta área que veio a ser denominada MicrowavePhotonics, ou também RF-Photonics, e neste artigo será referenciada como fotônica em RF [3][4]. Entretanto, o aumento das taxas de transmissão de dados das redes de comunicação ópticas digitais impulsionaram o desenvolvimento de dispositivos de modulação e de demodulação óptica mais eficientes, capazes de operar em frequências na faixa de microondas, permitindo a implementação de enlaces a fibra óptica para transmissão de sinais analógicos com desempenho de RF atrativos, se comparados com os meios convencionais de transmissão a cabo coaxial. Enlaces com ganhos de potência de RF positivos, figuras de ruído e faixas dinâmicas compatíveis com pré- amplificadores de RF têm sido reportados atualmente [5][6]. Tais resultados têm sido decisivos para a consolidação da tecnologia de fotônica em RF, uma vez que resolvem a antiga questão que outrora desencorajava o emprego da tecnologia de fotônica em sistemas de RF: altas perdas RF, elevada figura de ruído e estreita faixa dinâmica. O uso de enlaces analógicos a fibra óptica (EAFO) em sistemas de distribuição de RF em redes de televisão a cabo (CATV) e sistemas de telefonia celular é uma realidade comercial [7]. A transmissão de sinais radar em médias distâncias é uma descente demanda na área de guerra eletrônica (GE). Sistemas de simulação de emissores de sinais radar têm sido largamente empregados em campanhas de avaliação e testes de receptores de alerta e detecção de emissores radar (RWR e MAGE), sendo também uma ferramenta indispensável em pesquisa e desenvolvimento (P&D) na área de guerra eletrônica. A Força Aérea Brasileira (FAB) possui equipamentos desta natureza e os têm empregado com esta finalidade, também estendendo seu uso no ensino de GE em cursos de extensão, especialização e stricto sensu [8]. Eles possuem geradores de sinais complexos, capazes de reproduzir sinais radar de interesse e irradiá-los em direção à plataforma em teste, com o objetivo de verificar o comportamento desses receptores quando inseridos em um ambiente eletromagnético específico. Em geral, esses sistemas operam na faixa de frequência que se estende de 0.5 GHz a 40 GHz, e podem simular a emissão de uma grande quantidade de emissores radar simultaneamente. Embora a diversidade de emissores seja uma relevante característica desses simuladores de sinais radar, a diversidade espacial é ainda limitada em função do meio de transmissão de RF empregado. O uso de cabos coaxiais restringe a distância entre a unidade central de geração de sinais e o sistema irradiante, composto pelos amplificadores e antenas transmissoras, exigindo que todo experimento seja montando no mesmo espaço físico próximo à aeronave cujo sistema de GE está sob avaliação. Embora seja possível a geração de uma diversidade de emissores radar simultaneamente, todos eles são emitidos praticamente do mesmo local, não havendo diversidade espacial das plataformas emissoras de radar. O uso de fibra ópticas em substituição aos cabos coaxiais neste tipo de aplicação é bastante atrativo e está sendo pesquisado no Instituto Tecnológico de Aeronáutica [9]. O emprego da tecnológica de fotônica em RF aplicado a sistemas de GE é uma área que a FAB já vem pesquisando há alguns anos [10], sendo uma das atuais linhas de pesquisa do Programa de Pós-graduação em Aplicações Operacionais (PPGAO), realizado no ITA [11]. As pesquisas estão sendo realizadas no Laboratório de Guerra Eletrônica do ITA (LAB-GE) e contam com resultados experimentais com aplicação direta no setor operacional da FAB, fruto de temas de teses de mestrado e de doutorado do PPGAO, bem como trabalhos de conclusão do Curso de Especialização em Análise de Ambiente Eletromagnético (CEAAE). Inserido neste contexto de maturidade da tecnologia de fotônica em RF, infra-estrutura de cabeamento da rede de comunicações ópticas e emprego de fibras ópticas para transmissão de sinais RF, este artigo apresenta um enlace analógico a fibra óptica concebido para a transmissão de sinais radar na faixa de 0,5 a 18 GHz em médias distâncias, que pode usar a própria rede de fibra óptica já instala para a distribuição de emissores radar. O enlace foi caracterizado tanto em ambiente de laboratório quanto na rede de fibra óptica do Departamento de Ciência e Tecnologia Aeroespacial (DCTA). Na seção II é feita uma abordagem objetiva do enlace analógico a fibra óptica e também um estudo comparativo da transmissão de RF em fibra óptica e em cabos coaxiais. Na seção III é feita uma abordagem do uso de pós-amplificação de RF nos enlaces analógicos a fibra óptica. Na seção IV são apresentados os resultados de um experimento que usa a própria rede administrativa de comunicações ópticas para a transmissão de emissores radar. Na seção V são feitas as considerações e as conclusões do artigo. II. ENLACE ANALÓGICO A FIBRA ÓPTICA A transmissão de sinais radar em fibra óptica não é feita de maneira direta como no caso da transmissão por meio de cabo coaxial ou guia de ondas, onde o sinal é inserido na linha de transmissão na mesma faixa espectral. No caso de transmissão em fibra óptica, é necessário fazer a modulação da luz com o sinal de RF do radar, transmitir esse sinal óptico modulado e então recuperá-lo por meio de fotodetecção. O diagrama esquemático do EAFO considerado neste trabalho está mostrado na Fig. 1. O sinal de RF com potência Pe é disponibilizado na entrada do enlace por meio de uma linha de transmissão com impedância característica Zo. Parte da potência disponibilizada é refletida na entrada do modulador, devida ao descasamento de impedância entre a linha de transmissão que conduz o sinal da fonte de RF e a entrada de RF do modulador de Mach-Zehnder, podendo ser expressa por meio do parâmetro de espalhamento S11. A fração de potência dada por (1-S112) é acoplada ao modulador e propaga-se através da linha de transmissão interna do dispositivo, interagindo com a luz acoplada na entrada óptica, sendo então totalmente dissipada na carga conectada no final da linha de transmissão. Na Fig. 1, PL representa a potência óptica do laser, km as perdas ópticas do modulador, Pm a potência óptica de saída do modulador, Vπ é a tensão de meia onda do modulador, Zm a impedância característica da linha de transmissão interna do modulador, Vm a onda de tensão que nela se propaga e VB a tensão de polarização aplicada ao modulador. Ainda na Fig. 1, kf representa as perdas no trecho de fibra óptica, Pd a potência óptica que incide no fotodetector, ηd a responsividade do fotodetector, Zd a impedância paralela do fotodetector e Zc a impedância de carga do enlace, que é conectada ao fotodetector por meio de uma linha de transmissão com impedância característica Zo. Considerando impedâncias reais e perfeitamente casadas na saída do enlace, e que o modulador está polarizado no ponto de quadratura, o ganho de potência do EAFO é expresso por meio da equação abaixo [12]: onde ∆VBq é o desvio da tensão de polarização VB em torno do ponto de quadratura e Hd é a função de transferência de corrente entre o circuito de saída do fotodetector e a carga do enlace, expresso por: A potência de ruído na saída do EAFO é constituída por três parcelas: uma parcela devida ao ruído de disparo gerado no fotodetector (shot noise), outra parcela devida ao ruído de intensidade relativa do laser (RIN), e por último, a soma do ruído térmico produzido pelo modulador e pelo fotodetector. Levando-se em conta as mesmas considerações feitas na abordagem do ganho de potência do enlace, a densidade espectral de potência de ruído presente na carga pode ser determinada a partir de [12], resultando em: onde kB é a constante de Boltzmann, T é a temperatura em kelvin, e a carga do elétron, RIN é intensidade de ruído relativa do laser. A potência óptica incidente no fotodetector, Pd, leva em consideração todas as perdas desde a entrada óptica do modulador até extremidade final do percurso de fibra óptica enlace. Considerando o modulador polarizado no ponto de quadratura, ela é expressa por [12]: A figura de ruído do sistema pode ser definida como a relação entre a potência total de ruído na saída e a potência de ruído na saída devida unicamente ao ruído de entrada [12], expressa como: Na condição de operação em que o modulador de MachZehnder está polarizado no ponto de quadratura, não há componentes espectrais de ordem par produzidas pela característica não linear do modulador, independente do nível de potência do sinal de RF de entrada [12]. Nesta condição, o sinal espúrio devido à intermodulação de terceira ordem é o principal limitante da faixa dinâmica do enlace. Este sinal espúrio é gerado pelo batimento de dois sinais de RF com frequência f1 e f2, resultando em um sinal com frequência (2f1-f2) e outro com frequência (2f2-f1) [12]. A faixa dinâmica livre de sinais espúrios gerados pela intermodulação de terceira ordem (SFDR) é definida como a faixa de potência de entrada compreendida entre a potência do sinal de entrada que produz na saída um sinal na frequência fundamental com potência igual à potência de ruído, Ps/r, e a potência do sinal de entrada que produz na saída um sinal de intermodulação de terceira ordem com potência igual à potência de ruído, P3/r [12]. Expressando em função do ponto de interseção de terceira ordem, IP3, e da figura de ruído, a SFDR é determinada como: No caso de enlaces com moduladores de Mach-Zehnder operando em torno do ponto de quadratura, a faixa dinâmica SFDR é expressa por [12]: Na implementação experimental do enlace a fibra óptica, foi usado um laser DFB com comprimento de onda de 1558,17 nm, potência óptica máxima de 20 mW e ruído de intensidade relativa menor que -165 dB/Hz. O modulador eletroóptico usado foi do tipo Mach-Zehnder, com tensão de meia onda V π = 3,7 V na frequência de 1 GHz, perdas ópticas por inserção de 2,4 dB, faixa de frequência de operação de 0 a 20 GHz, impedância de entrada Zm = 50 Ω e S11 menor que 10 dB. No teste do EAFO em laboratório, foi usado um comprimento de 1 km de fibra monomodo com perdas menores que 0,4 db/km. O fotodetector empregado tem responsividade de 0,26 A/W, capaz de operar na faixa de frequência de 0 a 26 GHz, com impedância paralela Zd=50 Ω. Os dados dos dispositivos acima citados referem-se à frequência de 1 GHz. As medições foram realizadas com o diodo laser ajustado para uma potência de PL=20mW e com o modulador operando no ponto de quadratura. O nível médio de potência na fibra óptica de saída do modulador foi de Pd=5,8mW. As medidas de ganho foram feitas com um analisador de rede varrendo a faixa de frequência de 0,3 a 3 GHz, em virtude do analisador de rede disponível. Em frequências maiores do que 3 GHz, o ganho foi medido em espaçamentos de 1 GHz, usando um gerador de sinais CW e um analisador de espectro. O resultado das medições de ganho está apresentado na Fig. 2, onde o enlace com 1 m de comprimento refere-se ao enlace em que a fibra óptica de saída do modulador está conectada diretamente ao fotodetector. No caso do enlace com 1 km de extensão, as perdas ópticas medidas foram de 1,2 dB, as quais são devidas às perdas por propagação, bem como perdas nos conectores e emendas por fusão feitas na fibra óptica. A Fig. 3 mostra o sinal fundamental e o ruído de intermodulação de terceira ordem na saída do EAFO em função da potência do sinal de entrada, resultantes da aplicação de dois sinais CW com frequência de 0,95 GHz e 1.05 GHz. O valor da potência de entrada em que ocorre o ponto IP3 foi igual a 21 dBm, obtido a partir das medidas apresentadas na Fig. 3. A figura de ruído medida com o enlace sem amplificação foi de 33,4 dB, sendo o valor teórico esperado igual a 34,1 dB. Esses valores resultam em valor experimental de faixa dinâmica SFDR igual 107,5 dB.Hz2/3. O valor teórico da faixa dinâmica SFDR do enlace foi de 106,9 dB.Hz2/3. O EAFO é abordado neste artigo como uma forma alternativa de transmissão de sinais radar, quando o comprimento da linha de transmissão ou a frequência do sinal tornam restritivo o uso de cabos coaxiais. Assim sendo, é interessante realizar uma análise da transmissão de RF em cabos coaxiais, fixando-se apenas aos parâmetros de desempenho aqui abordados. Considerando apenas o cabo coaxial isoladamente, a faixa dinâmica e a figura de ruído são parâmetros consideravelmente superiores, se comparados com um enlace a fibra óptica. Por outro lado, o ganho é um parâmetro que deve ser levado em consideração na comparação dos dois sistemas. Neste texto, o termo ganho é usado para referenciar as perdas de propagação no cabo coaxiais, com objetivo de usar a mesma terminologia já consagrada no caso de enlaces analógicos a fibra óptica [4]. Na verdade, as perdas de propagação de um cabo coaxial podem ser entendidas como um ganho menor que a unidade, ou um ganho negativo quando expresso em dB. Considerando um cabo coaxial de boa performance na faixa de microondas, foi feita uma análise comparativa considerando o ganho por unidade de comprimento do EAFO e o ganho do cabo coaxial, ambos sem o uso de amplificação de RF. No caso do EAFO, existe uma perda inicial devida ao processo de modulação e de demodulação, cujo valor é o mesmo para qualquer comprimento de enlace. Uma vez computado esse valor, as perdas adicionais do enlace são, principalmente, relativas às perdas por propagação da própria fibra óptica, que são da ordem de décimos de dB/km. A partir desse valor inicial de perdas, a grande vantagem do uso de fibras ópticas começa a se destacar e torna vantajoso o seu uso na transmissão de sinais de radar na faixa de frequência de microondas, em substituição aos cabos coaxiais. A Fig. 4 mostra o ganho do enlace a fibra óptica e o ganho de um enlace usando um cabo coaxial da Radiall Inc., modelo TestPro8, ambos em função do comprimento da linha de transmissão, considerando frequências de RF distintas. Devido à característica de perda de potência extremamente baixa da fibra óptica e comprimentos considerados na Fig. 4, o ganho do enlace pode ser considerado praticamente constante e independente do comprimento do enlace. O mesmo não acontece no caso dos cabos coaxiais, que apresentam atenuações consideráveis em função do comprimento da linha de transmissão, principalmente nas frequências mais elevadas. Portanto, há uma distância a partir da qual o enlace a fibra óptica torna-se uma opção atrativa e vantajosa, aqui considerada como a distância referente ao ponto de interseção entre as curvas de ganho do enlace a fibra óptica e do cabo coaxial. No caso do enlace implementado, o uso de fibra óptica para a transmissão de sinais radar passa a ser vantajoso em relação ao cabo coaxial a partir de distâncias superiores a 115 m, considerando frequências de radares da banda S, na faixa de 3 GHz. Quando se considera frequências na X, esta distância cai para valores em torno de 60 m, chegando a valores próximos a 45 m em frequências da banda K. Nos experimentos realizados, foi usado um fotodetector com responsividade de 0,26 A/W. Entretanto, fotodetectores com responsividade em torno de 0,7 A/W em frequências de até 20 GHz já estão disponíveis comercialmente. O uso desses fotodetectores com maior responsividade possibilitam um aumento de aproximadamente 9 dB no ganho do enlace. Esse ganho pode ser melhorado ainda mais se a impedância de 50 Ω ligada na saída do fotodetector for retirada e ele for ligado diretamente na entrada do amplificador, o que aumentaria a função de transferência de corrente Hd para o valor unitário e elevaria o ganho em 6 dB. Esse aumento de 15 dB equivale a uma redução de 20 m na distância em que as perdas do enlace a fibra óptica se igualam às perdas de uma linha de transmissão com cabo coaxial. A figura de ruído diminuiria para 28 dB e a faixa dinâmica SFDR aumentaria para 110 dB.Hz2/3. Outra consideração que deve ser ressaltada é a elevada imunidade à interferência eletromagnética característica do enlace a fibra óptica, se comparada com um enlace a cabo coaxial. Uma alternativa para tornar viável o uso de cabos coaxiais em sistemas de transmissão de RF em médias distâncias é o uso de amplificadores, o que, embora possa compensar as perdas de RF, não resolve o problema da faixa de frequência instantânea do sistema. Mais ainda, a inserção de amplificadores de RF traz consigo a desvantagem de degradação da faixa dinâmica e inserção de ruído, limitando a performance do sistema de transmissão à própria figura de ruído e SFDR do amplificador usado. Uma vez considerado o uso de um amplificador para compensar as perdas do cabo coaxial, a melhor opção seria ligá-lo na entrada do sistema, com o objetivo obter uma menor figura de ruído global do sistema, que é na verdade a própria figura de ruído do amplificador, considerando que o cabo coaxial não insere ruído. A faixa dinâmica SFDR do sistema é também a mesma que a do amplificador de RF, haja vista que o cabo coaxial não produz distorção em função da intensidade do sinal. A associação do amplificador ao cabo coaxial pode ser entendida como um sistema ativo de transmissão de RF, semelhante ao EAFO, o qual deve ser também analisado considerando o uso de amplificadores. Esta análise será abordada na próxima seção. III. ENLACE ANALÓGICO A FIBRA ÓPTICA COM PÓS-AMPLIFICAÇÃO A obtenção de EAFO com ganho igual ou maior do que a unidade ainda não é tarefa fácil e muito menos uma realidade comercial. A principal dificuldade está relacionada às limitações atuais de natureza tecnológica, principalmente os níveis máximos de potência na fibra óptica e de saturação no fotodetector, bem como a obtenção de moduladores com baixa tensão V π. Enlaces com ganho maior que a unidade já foram demonstrados em laboratório [3][5], implementados a partir de moduladores com tensão Vπ bem abaixo dos dispositivos atualmente comercializados e fotodetectores com limite de saturação também fora dos padrões comerciais. Pelas razões acima mencionadas, em geral, é necessário adicionar um estagio de amplificação de RF ao EAFO. O amplificador pode ser inserido tanto na entrada quanto na saída do enlace, ou em ambas as extremidades. Sinais relativos a estágios de transmissão radar são em geral sinais fortes, com relações sinal/ruído elevadas e pouca variação do nível de potência. Neste caso, a inserção de um amplificador de RF na entrada do EAFO tende a fazer com que o modulador passe a operar com elevados níveis de potência, e desta forma causar a geração de sinais espúrios na saída do enlace. Para a transmissão desse tipo de sinais, o mais apropriado é a inserção do amplificador de RF logo após o fotodetector. O inconveniente desta configuração é que a figura de ruído do sistema é estabelecida pela própria figura de ruído do EAFO. Entretanto, uma vez que a relação sinal/ruído na entrada do sistema é alta, em função da potência do sinal transmitido, essa degradação causada pelo enlace não é um fator de grande preocupação. A resposta total do sistema é determinada em função do conhecimento dos parâmetros individuais de cada estágio isolado. Na Fig. 5, Ge, NFe e SFDRe representam o ganho de potência, a figura de ruído e a faixa dinâmica do EAFO, respectivamente. Ga, NFa e SFDRa representam o ganho de potência, a figura de ruído e a faixa dinâmica do amplificador, respectivamente. O ganho total do enlace com amplificação é o produto dos ganhos individuais de cada estágio. A figura de ruído total do sistema depende da ordem dos estágios. Considerando todos os valores de dados em escala linear, a figura de ruído em dB do enlace com pré-amplificação é dada por [12]: A faixa dinâmica devida a sinais espúrios de intermodulação de terceira ordem (SFDR) é função do ponto de interseção de terceira ordem [12]. Quando dois ou mais estágios de RF são ligados em cascata, cada um deles contribui para a formação do sinal de intermodulação resultante, que é determinado pela soma fasorial das componentes de intermodulação presentes na saída, produzidas por cada estágio do sistema. Em função da dificuldade de saber a fase de cada componente na saída do sistema, é conveniente fazer uma estimativa do sinal resultante considerando o pior caso, que é a situação em que todas as componentes são somadas em fase e que há acoplamento prefeito entre os estágios em cascada. Esta é a situação em que o ponto de IP3 é o menor possível e que resulta na menor faixa dinâmica SFDR. O valor do IP3 resultante do sistema é [12]: onde IP3e e IP3a são os pontos de interseção de terceira ordem do enlace e do amplificador, respectivamente. No caso do enlace com pós-amplificação, quem domina a relação sinal/ruído do sistema é o EAFO. O valor do ponto de intermodulação IP3 do sistema continua sendo predominantemente função do enlace, uma vez que o seu ganho negativo, dado em dB, acaba estabelecendo o regime de baixo sinal no amplificador de RF. Foi usado um amplificador de RF com um ganho de potência de 41.5 dB e figura de ruído de 3.9 dB, medidos em 1 GHz, com impedâncias de entrada e de saída iguais a 50 Ω. A faixa de frequência de operação do amplificador é de 0,5 a 18 GHz. A resposta em frequência do amplificador está mostrada na Fig. 6. As medições de ganho do enlace com pós-amplificação em função da frequência estão mostradas na Fig. 7. Comparando as Fig. 6 e Fig. 7, observa-se que as variações de ganho do enlace com amplificação estão mais relacionadas com as flutuações de ganho do próprio amplificador usado. A Fig. 8 apresenta o sinal fundamental e de intermodulação de terceira ordem na saída do enlace com pós-amplificação, resultantes da aplicação de um sinal de 0,95 GHz e outro de 1,05 GHz. O valor da figura de ruído medida foi igual a 36,6 dB, sendo o valor esperado igual a 35,9 dB. Esses valores resultam em um valor experimental de faixa dinâmica SFDR de 104,5 dB.Hz2/3, sendo o valor esperado igual 102,2 dB. Essa discrepância entre os dois valores pode ser atribuída ao fato de que em (8) é considerado o pior caso, ou seja, o menor valor do ponto de interseção de terceira ordem do sistema. IV. TRANSMISSÃO E DISTRIBUIÇÃO DE EMISSORES RADAR EM REDES DE FIBRA ÓPTICA ADMINISTRATIVAS Uma vez caracterizado o enlace com pós-amplificação, foi realizado o experimento de transmissão de um sinal radar pulsado através de um enlace com 1 km de fibra óptica em ambiente de laboratório, bem como a transmissão deste mesmo sinal através de uma rede de fibra óptica externa. O arranjo experimental montado está mostrado na Fig. 9. O modulador de pulso recebe a portadora do gerador de sinais de RF e produz na saída um sinal pulsado que é temporizado pelo gerador de pulso. Este sinal é aplicado na entrada do enlace analógico a fibra óptica e transmitido até outra extremidade do sistema. O sinal de RF de saída do enlace é aplicado a um divisor de potência de RF, que o distribui para o analisador de espectro e para um detector de envoltória, possibilitando a visualização do sinal de vídeo por meio de um osciloscópio. O sinal de saída do divisor de potência é 4,5 dB abaixo do sinal de entrada. Foi gerado o sinal de um radar pulsado de banda S, operando na frequência de 3 GHz, com uma largura de pulso de 10 µs e uma frequência de repetição de pulso de 1 kHz. Os sinais radar foram transmitidos através do enlace com pós-amplificação. A potência do laser foi ajustada para 20 mW e o modulador polarizado no ponto de quadratura, resultando em uma potência óptica na saída do modulador igual a 5,8 mW. A potência óptica medida no fotodetector foi de 3,8 mW, no caso do enlace de 1 km implementado em laboratório. A Fig. 10 mostra o sinal radar medido na entrada do enlace com pósamplificação, quando um sinal com potência de pico de 0 dBm foi aplicado na entrada. A Fig. 11 mostra o sinal radar medido na saída do enlace com pós-amplificação, quando um sinal com potência de pico de 0 dBm foi aplicado na entrada. DCTA, com um comprimento de aproximadamente 2 km de extensão. Esse percurso está mostrado na Fig. 12. O percurso teve início no distribuidor de fibra óptica existente no prédio de Divisão de Engenharia Eletrônica do ITA, instalado no Centro de Computação da Aeronáutica de São José dos Campos (CCA-SJ), seguindo a linha marcada em vermelho até um distribuidor de fibra óptica de um dos prédios administrativos do DCTA, onde foi feito um loop para conectar a uma outra fibra no mesmo cabo da fibra óptica de ida, percorrendo um trajeto de ida e volta. A potência óptica do laser e o ponto de operação do modulador foram os mesmos usados no enlace de 1 km implementado em laboratório. A potência óptica medida no fotodetector foi de 3,1 mW. Os valores medidos do ganho de potência do enlace sem amplificação na faixa de 0,5 GHz a 18 GHz estão mostrados na Fig. 13. O sinal medido na saída do enlace com pós-amplificação está mostrado na Fig. 14, após ter percorrido o percurso de ida e volta da rede externa de fibra óptica. O experimento aqui apresentado utiliza a própria rede de fibra óptica usada pelo sistema de comunicações ópticas administrativa do DCTA, onde foi feito um loop em um dos distribuidores de fibra óptica apenas para que o sinal do radar simulado pudesse retornar ao mesmo local de origem, apenas para facilitar a caracterização do sistema. Entretanto, uma questão importante deve ser aqui ressaltada. A rede de fibra óptica é o principal responsável pelo acesso de internet de alta velocidade, e interconecta vários de prédios distribuídos nas dependências da organização. Em um ou maios pontos desta rede, há uma conexão à rede de fibra óptica urbana, com ramificações de fibra óptica que se estendem aos bairros da cidade, e, em um contexto mais amplo, a outras cidades da região. Uma vez acessada a rede de fibra óptica, por meio de interconexões no distribuidor, é possível configurar uma grande diversidade de percursos de fibra óptica e construir um sistema de transmissão e de distribuição de emissores radar multiponto, gerados a partir de uma unidade central de geração de emissores. Trata-se, portanto, de uma solução de baixo custo, baseada em uma infra-estrutura de fibra óptica já instalada, capaz de implementar a diversidade espacial nos sistemas simuladores de emissores radar existentes. V. CONCLUSÃO Este artigo apresentou o conceito de transmissão de sinais radar por meio de enlace analógico a fibra óptica, considerando o seu emprego isoladamente e também com pós-amplificação de RF. Considerando o emprego dos dois sistemas de transmissão isoladamente, em distâncias em que o problema das perdas por propagação nos cabos coaxiais não se torna acentuado, o uso de fibra óptica para esse fim não é vantajoso, em função das perdas iniciais devidas aos processos de modulação e de demodulação necessários, bem como a inserção de ruído e de distorção no sistema. Entretanto, com o aumento do comprimento do enlace, a atenuação dos cabos coaxiais torna-se um problema crítico e o uso de fibra óptica surge como solução viável. Esta limitação do uso de cabos é ainda mais agravada quando se considera a resposta em frequência do sistema de transmissão, uma vez que a atenuação por unidade de comprimento é bastante dependente da frequência do sinal transmitido. Uma vez considerado o uso de amplificação de RF em ambos os sistemas de transmissão, a desvantagem de inserção de ruído de ruído e distorção é comum aos dois casos. Um enlace analógico a fibra óptica concebido para a transmissão de sinais radar na faixa de 0,5 a 18 GHz foi implementado a partir de componentes optoeletrônicos disponíveis no mercado de telecomunicações ópticas. O enlace foi testado em condições de laboratório e também em condições externas, com desempenho estável nos dois casos. A demonstração do conceito de transmissão de sinais radar pulsados foi realizada, comprovando a viabilidade do uso de redes de fibra óptica usadas como backbone de comunicações ópticas para a transmissão de sinais para transmissores remotos, possibilitando a implementação de sistemas de distribuição de emissores radar reconfiguráveis, baseados em uma infra-estrutura já existente de fibra óptica, capazes de operar na faixa de frequência da maioria dos radares empregados atualmente. Por fim, trata-se de um conceito de emprego que permite adicionar a diversidade espacial aos simuladores de emissores radar, possibilitando a criação cenários eletromagnéticos de guerra eletrônica mais realísticos.  "
}