{
    "id": 168,
    "titulo": "investigação preliminar usando anel ressoador de silício para transmissão de energia",
    "autor": "renato v. franzé e danilo h. spadoti",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2011/st/P_15.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Recentes avanços na ciência e no processo de fabricação possibilitaram a demonstração de dispositivos ópticos, passivos e ativos, utilizando a tecnologia do silício. Dentre os dispositivos passivos, ganha destaque o anel ressoador, que possui diversas vantagens e distintas aplicações. Neste artigo busca-se investigar a transferência de energia e potência em nano-anéis ressoadores de silício. A eficiência na transferência de energia obtida entre dois anéis ressoadores, operando em 1550nm, foi da ordem de 20%.",
    "texto": " I. INTRODUÇÃO Nas últimas décadas, a tecnologia do silício foi empregada no desenvolvimento de dispositivos eletrônicos. Atualmente, o silício vem sendo investigado para atuar em outra área, na faixa de frequência da ordem de tera-Hz, ou seja, na indústria da fotônica. Estimulados por uma série de recentes avanços no campo da ciência, e impulsionados pelo aumento dos investimentos nesse setor, a fotônica do silício é, atualmente, uma das áreas de pesquisa mais investigadas dentro do campo da óptica integrada [1,2]. O silício, na faixa de espectro do infravermelho (IR) médio, tem excelentes propriedades ópticas, tanto lineares como não-lineares, possibilitando, assim, o desenvolvimento de novos dispositivos fotônicos, nas mais diferentes áreas [2,3]. Logo, o silício vem se tornando uma plataforma ideal no projeto de circuitos ópticos integrados com dimensões da ordem de centenas de nanômetros. Devido ao alto contraste de índice de refração entre o silício (Si) e a sílica (SiO2) ou ar é possível projetar dispositivos com dimensões reduzidas e, ainda assim, garantir o confinamento da luz [3]. Este fato possibilita a aplicação de alta intensidade óptica em uma área reduzida de silício, tornando possível observar interações ópticas não-lineares, como, por exemplo, efeitos Raman e Kerr. No silício, os efeitos não-lineares Kerr e Raman são, respectivamente, 100 e 1000 vezes maiores aos encontrados nas fibras de sílica [1]. Dessa forma, é possível projetar estruturas nanofotônicas, operando em banda larga, atuando como, por exemplo, na amplificação óptica, conversão de comprimento de onda, entre outros [1-3]. Estas funções, até recentemente, pareciam estar além do alcance do silício. A nanofotônica é definida como área da ciência que combina a nanociência com a área da fotônica, e tem-se fundamentado como um novo e importante campo de estudo. Portanto, combinar óptica, opto-eletrônica e a tecnologia do silício, possibilita projetar dispositivos fotônicos passivos e ativos com alto desempenho [4]. Conforme comentado, entre os dispositivos passivos, um dos mais investigados é formado por guias de onda tipo canal e anéis ressoadores, exemplificado na Fig. 1. Este tipo de construção permite desenvolver dispositivos desde filtros a conversores de frequências, utilizados, por exemplo, em sistemas de comunicação, sistemas de multiplexação por comprimento de onda (WDM) [5]. Logo, a utilização de micro- e nano- anéis de silício para a construção de dispositivos utilizados nestes sistemas é amplamente difundido devido ao seu tamanho reduzido, alto fator de qualidade, Q, e ausência de reflexão intrínseca [6]. O funcionamento do anel ressoador pode ser verificado quando diferentes comprimentos de onda são acoplados no guia de onda superior, e apenas a informação desejada, no caso, λ2, é transmitida para o guia inferior através do anel. Este acoplamento ocorre de tal forma que os comprimentos de onda restantes continuam a se propagar apenas no guia superior. Pode, também, ser utilizada de forma recíproca, inserindo a informação no guia inferior, e após entrar em ressonância no anel, acopla-se no guia superior junto com os outros sinais presentes. Contudo, dispositivos com a geometria em anel, feitos em silício, tornam-se extremamente compactos e versáteis. Devido ao alto contraste de índice de refração da plataforma SIO (silicon on insulator), i.e. Si/SiO2, esses anéis podem ser construídos com raios da ordem de 0,9µm e perdas de 0,5dB [5]. Ademais, podem-se desenvolver componentes ativos incorporando mecanismos de injeção de portadora. Ganho óptico ou absorção óptica, com esta mesma estrutura, pode ser observado. Como exemplo, têm-se os moduladores eletro- óptico, lasers e detectores [6,7]. Dessa forma, a maioria dos dispositivos ópticos necessários em um sistema completo comunicação pode ser desenvolvida em apenas um chip de silício [6]. Este fato garante ampla aplicação em sistemas de defesa, que necessitam de estruturas ultracompactas e de alto desempenho. Entretanto, a construção de dispositivos em anel não se limita ao projeto de um único anel por chip. Estudos demonstram a aplicação e desenvolvimento de dispositivos ópticos utilizando um ou mais anéis ressoadores [7]. Logo, neste trabalho, busca-se analisar e investigar a transmissão de energia entre dois anéis ressoadores, projetados para operar no comprimento de onda de 1550nm. II. INVESTIGAÇÃO TEÓRICA DE ANEÍS RESSOADORES Um esquema, já bem definido na literatura, para o estudo do acoplamento de um anel ressoador com dois guias de onda é descrito utilizando o modelo da Fig. 2 [7]: onde: Si, St, Sd, Sf representam as ondas incidente, transmitida, detectada e filtrada, respectivamente. R é o raio do anel e n1 e n2 os índices de refração da sílica e do silício, respectivamente. Especificamente no anel, supõe-se uma onda de amplitude A(t), normalizada para que |A(t)|² possa representar o fluxo de potência, inserida na secção do guia de onda da porta Si, em um tempo, t. O anel pode ser visto como um oscilador, então possui energia de amplitude a(t), normalizada para que |a(t)|² represente o total de energia armazenada no anel. A relação entre o fluxo de potência e a energia armazenada é dada por [7]: onde v g é a velocidade de grupo. A energia no anel é alimentada pela onda incidente de amplitude Si. A saída é dada pela onda de detecção Sd e a potência não aproveitada pelo anel é dada pela onda de transmissão St. Caso haja mais anéis ou outros dispositivos acoplados, o anel pode ser realimentado pela onda de feedback Sf. A relação entre a onda incidente e a transmitida é onde o parâmetro -j, denominado fator de fase, é escolhido devido a configuração dos planos geométricos. O parâmetro µ pode ser definido como acoplamento mutuo entre o anel e a onda no guia [7]. A onda de amplitude A(t) presente no anel se relaciona com a equação 2 [7]: sendo: k² é definido como a fração de potência acoplada a região de interação fora do anel, sendo k normalmente definido como coeficiente de acoplamento. Pela conservação da energia, a potência na onda de detecção é [7] O fator de qualidade Q pode ser calculado conforme definido em [7]. Corresponde ao tempo médio de energia armazenada por ciclo óptico dividido pela potência acoplada as duas ondas de saída (Sd e St). Portanto, conforme [7]: onde: v g pode ser aproximado pela velocidade de fase c/ne e ω0 é a frequência de ressonância do anel. Logo, é necessário um pequeno valor de k para um alto valor de Q [7]. III. DOIS ANÉIS RESSOADORES Pode-se estender o estudo previamente descrito para um anel ressoador único, para a condição de acoplamento em mais de um anel. As características de transferências estudadas na seção anterior podem ser modificadas e, o esquema dos anéis ressoadores, pode ser visualizado na Fig. 3 [7]: No dispositivo com dois anéis haverá uma onda de amplitude a1 no primeiro anel e amplitude a2 no segundo anel. Ambas são consideradas no acoplamento. Então, a onda presente no primeiro anel e no segundo anel é escrita em (7a) e (7b), respectivamente:onde 1/τ e e 1/τd representam a taxa de decaimento relacionada a potência que sai do anel (onda transmitida) e a potência acoplada ao guia de onda de saída, respectivamente. Negligenciando as perdas, µ1 que representa a energia mutua acoplada entre os anéis, pode ser escrita conforme [7]: sendo µ1’ o acoplamento entre a potência normalizada A2 e a energia normalizada a1, µ1’ pode ser reescrito como [7]: Então, substituindo (8b) em (8a), tem-se que [7]: Que é a equação que descreve o comportamento da energia acoplada entre os anéis. IV. RESULTADOS PRELIMINARES Uma estrutura envolvendo dois anéis ressoadores, esquematizado na Fig.4, foi simulada. Os parâmetros físicos e geométricos utilizados nas simulações são: a fonte de excitação, cujo comprimento de onda utilizado foi, λ = 1550 nm, a largura dos guias de 300nm, a distância entre guia e anel foi d(μ) = 30nm e distância entre anéis de também d1(μ1) = 30 nm. O raio interno de cada anel vale 1200nm e o externo 1500nm. O silício, n2, foi utilizado como material de guia de onda e a sílica, n1, como material isolante. A onda de excitação é aplicada no guia superior e a detecção é colhida no guia inferior. O resultado da simulação do comportamento do campo elétrico pode ser visualizado na Fig. 4. A seta vermelha representa a onda incidente na entrada e a seta verde a onda na saída do guia de onda após ser transferida do primeiro para o segundo anel ressoador. Entretanto, ainda não foi possível quantificar todos os valores envolvidos nesta simulação. Considerando o equacionamento desenvolvido na seção anterior, encontramos um fator de qualidade Q da ordem de 460 e o coeficiente de acoplamento entre anéis da ordem de 20%. Contudo, estes valores não são definitivos, pois, a princípio, ainda serão ajustadas as dimensões físicas da estrutura. Como perspectiva para a sequência dessa pesquisa de iniciação científica fica a proposta de melhoria no acoplamento da estrutura, o estudo da potência e corrente transmitida, assim como, os cálculos previamente descritos. "
}