{
    "id": 169,
    "titulo": "emprego de métodos de onda completa para análise da seção reta radar em aeronaves",
    "autor": "rodrigo rodrigues de assis, leandro napoli bellei e marco antonio ferraz",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2011/st/XI_4.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Neste artigo é apresentada a análise da seção reta radar (RCS – Radar Cross Section) de aeronaves utilizando simuladores eletromagnéticos disponíveis comercialmente que empregam técnicas de onda completa. A seção reta radar é uma característica determinante para a assinatura eletromagnética de uma aeronave e deve ser considerada em aplicações onde sua sobrevivência e o cumprimento da missão sejam fatores essenciais no projeto. O objetivo deste trabalho é apresentar a metodologia e os recursos disponíveis para análise da RCS. São analisadas estruturas simples para servir de referência e validação via comparação com dados analíticos, bem como estruturas complexas de três tipos de aeronaves. É observada uma boa concordância entre resultados analíticos, computacionais e referências apresentadas na literatura para as estruturas simples analisadas, indicando um potencial considerável para análise de estruturas complexas. Entretanto a capacidade computacional é um fator limitante a ser considerado.",
    "texto": " I. INTRODUÇÃO A sobrevivência de uma aeronave de combate ou de vigilância em um cenário operacional hostil é um fator relevante a ser considerado em seu desenvolvimento. Diversos são os fatores que podem influenciar esta característica do projeto, destacando-se o tipo e o desempenho da aeronave, as táticas operacionais adotadas, o treinamento da tripulação, os equipamentos de proteção disponíveis, entre outros. Tendo em vista o elevado custo de aquisição das modernas aeronaves de defesa, torna-se imprescindível analisar cada fator ou característica das mesmas, a fim de minimizar seus pontos fracos e garantir sua sobrevivência e o cumprimento da missão. Um cliente típico de aeronaves deste tipo estará atento a todas estas características técnicas e estabelecerá requisitos específicos a serem cumpridos. Dentre as características determinantes para a sobrevivência de uma aeronave destaca-se a seção reta radar (RCS – Radar Cross Section), definida como a porção da seção reta de espalhamento correspondente a uma componente de polarização específica da onda espalhada [1]. A RCS é uma característica fundamental em aeronaves invisíveis (stealth technology), onde a probabilidade de detecção por sinais de radar reduz-se drasticamente. A longas distâncias, outras formas de detecção possuem alcance limitado e podem ser consideradas menos críticas em comparação à RCS, tais como detecção visual, detecção auditiva utilizando microfones especiais, detecção térmica, etc. Todas estas características de mitigação da detecção fazem parte do conceito de assinatura da aeronave. A geometria de uma estrutura é um fator determinante da sua seção reta radar. Em uma aeronave de uso civil geralmente esta característica não é colocada como requisito. Entretanto, sabe-se que algumas plataformas de uso civil podem tornar-se plataformas de uso militar, principalmente em aplicações como vigilância do espaço aéreo ou inteligência de comunicações. Nestes casos, mesmo não havendo requisito específico, pode-se considerar a caracterização da RCS como uma característica desejável para o cliente final, tendo em vista o cenário em que a aeronave irá operar. Com esta informação adicional é possível melhorar o planejamento da missão considerando, além de outros fatores, a probabilidade de detecção da aeronave em ambiente hostil. Tais aspectos são abordados em diversos trabalhos na literatura [2, 3]. O emprego de métodos computacionais torna-se um meio eficiente e imprescindível para análise da RCS em estruturas complexas, permitindo que o projeto seja aprimorado e detalhado em fases iniciais e proporcionando uma redução no custo de desenvolvimento. Entretanto, o uso de técnicas computacionais não elimina a necessidade de realização de medidas para validação dos resultados estimados. Neste artigo são apresentadas análises teóricas da seção reta radar de três tipos de aeronaves empregando os simuladores Super Numerical Electromagnetic Code (SuperNEC) e o Computer Simulation Technologies Microwave Studio (CST) que utilizam os métodos de onda completa denominados Método dos Momentos (MoM) e Técnica de Integração Finita (FIT), respectivamente. Ressalta-se que não foram consideradas técnicas de redução de RCS nos modelos das aeronaves utilizados neste trabalho. Métodos Computacionais Ao longo dos anos tem sido extenso o trabalho voltado ao desenvolvimento de técnicas de análise de problemas de eletromagnetismo. De modo geral, estas técnicas podem ser classificadas em experimentais, analíticas e numéricas. Técnicas experimentais envolvem geralmente altos gastos de tempo e de recursos, além de fornecer dados que geralmente são pouco flexíveis com relação ao uso em outras situações. Técnicas analíticas podem fornecer a solução exata do problema, mas sua aplicação geralmente envolve geometrias mais simples ou simplificações do problema. Técnicas computacionais (CEM – Computational Electromagnetics) permitem a solução de problemas mais complexos, cuja solução analítica é difícil de ser obtida. Entretanto, todo método computacional implica em uma simplificação analítica de forma a tornar possível a aplicação da solução numérica e, sendo assim, são também considerados aproximações [4]. Dentre as técnicas computacionais destacam-se métodos denominados de onda completa (full wave) e métodos aproximados denominados de assintóticos ou de alta freqüência. Os métodos de onda completa envolvem a solução de um conjunto de equações integrais e/ou diferenciais no domínio do tempo e/ou no domínio da freqüência e produzem resultados mais precisos. Geralmente necessitam de grande capacidade computacional e isto dificulta sua utilização em estruturas eletricamente grandes. Destacam-se o método dos momentos (Method of Moments - MoM), o método de elementos finitos (Finite Element Method - FEM), o método de diferenças finitas no domínio do tempo (Finite Difference Time Domain - FDTD) e a técnica de integração finita (Finite Integration Technique - FIT). Por outro lado, os métodos de alta freqüência são derivados da teoria óptica geométrica clássica e empregam soluções baseadas em distribuições de campo ou corrente. São, portanto, métodos aproximados que não requerem grande esforço computacional, possibilitando a solução de problemas envolvendo objetos eletricamente grandes. De fato, estas técnicas consideram que as propriedades do meio e o tamanho dos objetos têm pouca variação no intervalo de um comprimento de onda. Como na maioria dos problemas práticos de engenharia esta condição é aplicável a partir da faixa de microondas, estabeleceu-se o nome da técnica como sendo para altas freqüências [5]. Dentre as técnicas de alta freqüência destacam-se a teoria óptica geométrica (Geometrical Optics – GO), a teoria geométrica da difração (Geometrical Theory of Diffracion - GTD), a teoria uniforme da difração (Uniform Theory of Diffraction - UTD), a óptica física (Physical Optics – PO) e a teoria da difração física (Physical Theory of Diffraction – PTD). A utilização de mais de um método para solucionar o mesmo problema é denominado de técnica híbrida e tem sido bastante abordada na literatura ao longo dos anos [6]-[8]. Geralmente são empregados métodos de onda completa em conjunto com métodos assintóticos a fim de aproveitar as vantagens de cada um. Pode-se considerar a solução híbrida como sendo a solução de uma parte do problema através de um dos métodos e a parte restante através do outro método, sendo que a solução dos campos ou correntes deve ser única nas regiões de contorno entre os dois métodos [9]. Usualmente a parte menor do problema e mais próxima das fontes de excitação é solucionada através de métodos de onda completa e a parte maior e mais distante é solucionada através de métodos assintóticos. Geralmente os simuladores dedicados ao cálculo de RCS em estruturas eletricamente grandes empregam técnicas assintóticas ou híbridas, aproveitando suas vantagens do ponto de vista computacional [10]. Entretanto diversos simuladores que empregam técnicas de onda completa também possuem recursos para tais análises, onde neste caso é esperada uma maior acurácia dos resultados. Na solução empregando o método dos momentos [11], conforme ilustra a Fig. 1 (a), a estrutura sob análise é substituída pela densidade de corrente superficial equivalente (J) sobre a superfície S no espaço livre. Em seguida a função J é expandida em N funções base (Jn), onde N representa o número de incógnitas necessárias para solução das equações e In são os coeficientes a se determinar. A solução pode ser expressa na forma matricial por: onde [Z(0)] representa a matriz impedância, [V(0)] representa o vetor excitação e [I] representa o vetor das amplitudes da solução da distribuição de corrente sobre a superfície S. A equação matricial é então resolvida para o vetor amplitude de corrente [I], que ao ser substituído em (1) fornece a solução aproximada da corrente superficial sobre o objeto. Os parâmetros de irradiação das fontes (Ji) em um ponto P na presença do objeto são determinados a partir desta distribuição de corrente superficial. A Fig. 1 (b) mostra o detalhe de um modelo construído no SuperNEC utilizando o método dos momentos, onde se observa a decomposição da estrutura em segmentos proporcionais ao comprimento de onda. A Técnica de Integração Finita (FIT) desenvolvida por Weiland em 1977 [12] é baseada na solução das equações de Maxwell em sua forma integral, onde é preciso definir uma região de cálculo finita com condições de contorno pré- estabelecidas e decompor esta região em um número finito de células sob a premissa de que cada célula deve encaixar exatamente com a seguinte. Desta forma, a interseção de duas células distintas é vazia, um polígono bi-dimensional, uma borda compartilhada por ambas as células ou um ponto. A teoria de Integração Finita permite considerar esta decomposição em células ortogonais ou não ortogonais, onde são calculados os campos e densidades de fluxo elétricos e magnéticos em cada borda e face de cada célula para obter a solução de campo em toda a estrutura. Portanto, a necessidade computacional para utilização desta técnica é grande devido à segmentação de todo o domínio de cálculo, que neste caso é pré-definido possuindo a forma retangular. A Fig. 2 mostra o detalhe de um modelo construído no CST utilizando a técnica de integração finita, onde se observa a decomposição da estrutura em hexaedros proporcionais ao comprimento de onda, que neste exemplo é de 5 m. Todo objeto iluminado por um radar irá refletir certa quantidade de energia. A seção reta radar, usualmente denotada por σ, é usada para caracterizar as propriedades de espalhamento de um alvo. Ela é proporcional à potência refletida pelo alvo, expresso em m2 ou dBsm, e não é o mesmo que a área física. De modo geral, a determinação da RCS de um alvo é função da polarização da onda incidente, do ângulo de incidência, do ângulo de observação, da geometria do alvo, das propriedades elétricas do alvo e da freqüência de operação. Esta última não influencia o resultado em algumas situações, como por exemplo, no caso de uma esfera de raio muito grande em comparação ao comprimento de onda. Os efeitos eletromagnéticos aos quais uma onda irradiada está submetida podem ser classificados em cinco tipos: transmissão, reflexão, difração, refração e absorção. Os mecanismos de espalhamento em um objeto podem ser classificados como direto, normal a superfícies planas e bordas, por difração em bordas, superfícies descontínuas ou superfícies curvas (creeping waves) e espalhamento indireto de estruturas ou cavidades [13]. Uma aeronave convencional possui uma assinatura de rádio freqüência (RF – Radio Frequency) muito complexa devido aos vários componentes com formatos distintos e a variabilidade em função da direção de iluminação do radar. Dependendo da geometria do objeto, diferentes polarizações produzirão diferentes resultados de RCS para o objeto na mesma posição. A Fig. 3 (a) mostra as principais partes responsáveis pelas maiores contribuições no aumento da RCS em aeronaves, onde arestas (por exemplo, formadas por diedros e triedros) e superfícies planas são geralmente as partes que mais contribuem. A Fig. 3 (b) ilustra algumas formas para minimizar a RCS, mostrando uma relação inversa entre uma baixa RCS e o desempenho aerodinâmico na maioria dos casos. Alguns valores típicos para alguns alvos podem ser vistos em [14]. Estudos recentes abordam novas técnicas de análise em laboratório da RCS de modelos em escala de aeronaves empregando técnicas de análise térmica em conjunto com filmes de material sensível à irradiação de RF [15]. Estas novas técnicas em conjunto com resultados simulados podem minimizar a quantidade de ensaios necessários com a aeronave para se caracterizar sua assinatura radar. II. RCS EM ESTRUTURAS SIMPLES A fim de validar e comparar os resultados de ambos os simuladores é apresentada uma análise considerando quatro estruturas simples mostradas na Fig. 4, sendo a primeira uma placa plana de 15 x 15 m, a segunda um cilindro de 20 m de comprimento e 1,14 m de raio, a terceira uma esfera de 5 cm de raio e a quarta um diedro quadrangular de 30 cm de lado. As soluções analíticas para estas estruturas são mostradas em (3), (4) (5) e (6), onde λ é comprimento de onda do sinal incidente, w e o h são os lados da placa, r é o raio do cilindro, l é o comprimento do cilindro, a é o raio da esfera e z é o lado do diedro. Os dois primeiros modelos são analisados na freqüência de 100 MHz, o terceiro na freqüência de 10 GHz e o quarto na freqüência de 5 GHz. A fonte de excitação nos quatro casos é uma onda plana com polarização linear e com incidência normal na direção (φi = θi = 90°). A Fig. 5 mostra os resultados de espalhamento eletromagnético no plano xy (θ = 90°) utilizando o SuperNEC e o CST para as quatro estruturas analisadas e a Tabela I mostra de forma resumida os resultados de RCS destas estruturas. Em todos os casos é observada uma boa concordância entre os resultados dos simuladores e os resultados analíticos. III. ESTIMATIVA DE RCS EM AERONAVES A seguir é analisada a seção reta radar de duas aeronaves feitas de material condutor perfeito, conforme modelos mostrados na Fig. 6 (modelos M1 e M2), construídos no SuperNEC e no CST O modelo M1 consiste em uma aeronave de médio porte com aproximadamente 30 m de comprimento e 2,3 m de diâmetro da fuselagem. O modelo M2 consiste em uma aeronave de pequeno porte com aproximadamente 13 m de comprimento e 1,1 m de diâmetro da fuselagem. A freqüência analisada é 130 MHz, que corresponde aproximadamente ao limite máximo obtido no SuperNEC para o modelo M1, considerando a capacidade computacional disponível. A excitação é uma onda plana com polarização linear na direção zˆ , com ângulo de incidência variando de 0°≤φi≤180° em θi = 90°. A Fig. 7 mostra os resultados de espalhamento eletromagnético tridimensional total na freqüência de 130 MHz para os modelos M1 e M2 e a incidência da onda plana em φi = 0°, utilizando o SuperNEC. Observa-se um resultado de espalhamento eletromagnético mais uniforme para o modelo M2 em relação ao modelo M1, mostrando que esta geometria apresenta uma maior possibilidade de detecção por radares tanto bi-estáticos quanto mono-estáticos, em virtude da mobilidade do alvo. Entretanto, o valor absoluto de espalhamento é menor para o modelo M2 em comparação ao modelo M1. Na Fig. 8 são mostrados os resultados de espalhamento eletromagnético dos modelos M1 e M2 na polarização vertical, onde também é observado o efeito descrito acima. A RCS por definição deve ser observada dos resultados apresentados na polarização vertical, que corresponde à polarização da onda incidente neste caso. Entretanto os resultados em outras polarizações também podem ser considerados do ponto de vista da seção reta de espalhamento (SCS – Scattering Cross Section) [1]. A Fig. 9 mostra os resultados de RCS no plano xy na freqüência de 130 MHz para os modelos M1 e M2. Observase a concordância entre os métodos MoM e FIT em grande parte do diagrama. As diferenças entre estes métodos observadas em alguns ângulos, em especial em φ = 0° e em φ = 180° podem ser atribuídas às diferentes formas de construção dos modelos utilizando os recursos disponíveis em cada simulador. Para o modelo M1 a RCS é maior para ângulos de incidência φi em torno de 0°, 90° e 180° e o modelo M2 exibe comportamento semelhante. Apesar dos modelos não terem sido projetados visando a redução de RCS, observa-se que a RCS do modelo M2 apresentou um menor valor na região frontal em relação às regiões laterais e posterior. Conclui-se, portanto, que esta geometria favorece tal comportamento na freqüência analisada. A distribuição maior em φ = 90° e φ = 270° assemelha-se ao comportamento do cilindro da Fig. 5 (b) e é justificada pelo formato cilíndrico da fuselagem das aeronaves. A Fig. 10 mostra o terceiro modelo (M3) construído no CST para ressaltar a variação da RCS em função da geometria. Este modelo é uma aproximação de uma aeronave projetada para apresentar baixa RCS, com aproximadamente 21 m de comprimento, 52 m de largura e 4,1 m de diâmetro da fuselagem. Os resultados de espalhamento são apresentados na Fig. 11, onde é observado um comportamento mais diretivo para incidência em φi = 0°, principalmente próximo a φ = 0° e φ = 180°. Além disso, conforme mostrado na Fig. 12, a RCS média pode ser considerada relativamente menor do que os resultados dos modelos M1 e M2 devido ao aumento nas dimensões do modelo M3. Os picos que ocorreram neste exemplo fictício em 0°, 90° 180° e 270° são considerados indesejáveis em um desenvolvimento real de uma aeronave invisível, mas podem ser considerados aceitáveis se forem estreitos. Entretanto, é importante ressaltar que não foram utilizadas técnicas de redução de RCS e a geometria desta estrutura é uma aproximação da geometria real. Na Fig. 13 é mostrado de forma ilustrativa uma comparação em escala aproximada entre os três modelos analisados onde se observa que as dimensões do modelo M3 são bem maiores que os demais modelos. Na Fig. 14 é mostrada uma comparação do resultado de RCS no plano xy dos três modelos de aeronaves analisados no CST. Comparando estes resultados observa-se como a geometria pode influenciar no valor de RCS para diferentes tipos de aeronaves. Entretanto, de modo geral os valores de pico tendem a concentrar-se nas regiões frontal (em torno de 0°), posterior (em torno de 180°) e laterais (em torno de 90° e 270°). Estas a princípio são as principais direções a serem consideradas para iniciar um trabalho de redução da RCS. O limite máximo em freqüência simulado compatível com os recursos computacionais disponíveis foi de aproximadamente 700 MHz para o modelo M2, considerando os critérios de convergência padrão do simulador. Estima-se para este modelo uma freqüência máxima em torno de 1 GHz sendo necessário modificar estes parâmetros de convergência. Neste caso, o valor de RCS calculado pelo CST para o ângulo de incidência φi = 0° foi 26,81 dBsm em 700 MHz. Comparativamente observa-se uma RCS aproximadamente 17 dB maior em 700 MHz que a RCS também estimada pelo CST em 130 MHz considerando a mesma direção da onda incidente. Dentre as situações analisadas, foram observados tempos de simulação máximos de aproximadamente 0,4 h empregando o SuperNEC e 68 h empregando o CST. Esta diferença é atribuída ao fato de que no SuperNEC foram simulados somente diagramas no plano xy e no CST foram simulados diagramas tridimensionais para cada ponto. Os picos de utilização de memória RAM para os modelos na freqüência de 130 MHz foram de aproximadamente 1,2 Gbytes empregando o SuperNEC e 600 Mbytes empregando o CST. Para o limite máximo apresentado para o modelo M2 em 700 MHz o pico de utilização de memória RAM foi de 2,8 Gbytes. O hardware disponível possui 8 Gbytes de memória RAM, um processador Core 2 Duo de 64 bits, 2,9 GHz e Windows XP 64 bits. IV. CONCLUSÕES Neste trabalho foram apresentados metodologia e resultados de RCS de modelos aproximados de aeronaves empregando os métodos de onda completa dos simuladores SuperNEC e CST. A utilização de técnicas computacionais torna-se imprescindível para analisar tais efeitos em estruturas complexas, possibilitando o aprimoramento de ensaios. Apesar dos modelos serem analisados na freqüência de 130 MHz, devido à capacidade computacional disponível, os resultados foram analisados do ponto de vista comparativo considerando como referência os resultados das estruturas simples analisadas (placa, cilindro, esfera e diedro). Ressaltase que não foram utilizadas técnicas de redução de RCS nos modelos das aeronaves analisados. Foi observado que a geometria da aeronave tem papel determinante no resultado de RCS. Além disso, a RCS tende a aumentar para ângulos de incidência em torno de 0°, 90°, 180° e 270°, de forma independente da geometria das aeronaves analisadas. Isto pode ser atribuído ao fato de que uma aeronave possui fuselagem e asas em um padrão relativamente equivalente, de modo que os efeitos de reflexão e difração tendem a ser também equivalentes. Desta forma, estas regiões estão em uma condição de incidência perpendicular em relação à geometria e, portanto, apresentam uma maior reflexão da energia. Os resultados são considerados relevantes com relação ao tipo de informação a ser utilizada para caracterização da assinatura eletromagnética de uma aeronave. Entretanto, o emprego de métodos computacionais de onda completa requer alta disponibilidade de memória RAM para estruturas eletricamente grandes e isto limita sua utilização, tornando necessário investimento em hardware de simulação ou técnicas de processamento paralelo.  "
}