{
    "id": 170,
    "titulo": "aplicação de titanato zirconato de chumbo no desenvolvimento de capacitores cerâmicos para potência pulsada em alta tensão",
    "autor": "silva neto, l. p., silva junior, a. r., rossi, j. o.",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2011/st/XII_3.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Os capacitores cerâmicos comerciais à base de titanato de bário, dopados ou não com estrôncio, apresentam uma grande variação da constante dielétrica em função da tensão DC e da temperatura, para aplicações em alta tensão. Para projetos em que a linearidade seja um item desejável, é necessária a utilização de capacitores cerâmicos com meio dielétrico que apresente pouca ou nenhuma variação quando submetidos à alta tensão. O titanato zirconato de chumbo, conhecido como PZT, quando despolarizado torna-se uma excelente alternativa como dielétrico para fabricação de capacitores de alta tensão, pois possui baixa variação da constante dielétrica em função da tensão (17%) e com alta rigidez dielétrica (4,5kV/mm), para potências pulsadas. O trabalho apresentado consiste em caracterizar o material PZT despolarizado como meio dielétrico através de medidas de C x V e da rigidez dielétrica para potência pulsada, comparando os resultados obtidos a capacitores cerâmicos comerciais, com suas características bem conhecidas.",
    "texto": " I. INTRODUÇÃO As cerâmicas dielétricas têm sido utilizadas como meio dielétrico em dispositivos armazenadores de energia tais como capacitores de alta tensão (AT), devido à elevada constante dielétrica e alta rigidez dielétrica apresentada por estes materiais. Capacitores cerâmicos comerciais utilizam meio dielétrico à base de Titanato de Bário dopado com Estrôncio, para deslocar a temperatura de Curier para baixo da temperatura ambiente (TA). Neste fenômeno ocorre à mudança da estrutura cristalina, passando da fase ferroelétrica (estrutura tetragonal) para a fase paraelétrica (estrutura cúbica) esse deslocamento é desejável porque é exatamente nesta faixa que o material apresenta a maior constante dielétrica. A concentração de dopantes define uma forte ou fraca dependência do material em resposta à temperatura submetida (T) e a tensão aplicada (V) [1]. A constante dielétrica do material junto com as dimensões físicas define a capacitância do capacitor. Para constantes dielétricas altas é possível construir capacitores com maiores capacitâncias e tamanho reduzido. Os capacitores cerâmicos são empregados em diversas áreas como sistemas de armazenamento de alta energia em aplicações aeroespaciais, geração de pulsos retangulares com rede LC (empregado na alimentação de tubos de RF), e devido às características não lineares das cerâmicas, elas podem ser utilizadas na geração de ondas de sólitons de alta freqüência, em linhas de transmissões não lineares (LTNLs) [2]. Em busca de novos dielétricos, que permitam armazenar uma grande quantidade de energia por unidade de volume (J/cm3) na construção de capacitores de alta tensão com maior capacitância e tamanho reduzido, o composto à base de Titanato Zirconato de Chumbo, ou mais conhecido por PZT é composto pelos seguintes elementos químicos, Chumbo (Pb), Zircônio e Titânio (em abreviação a sua fórmula convencional, (Pb[Zrx Ti1-x]O3) com 0<x<1 ), podendo ser um elemento ideal para aplicações em meios dielétricos, caso este não apresente polarização remanescente. O PZT é largamente utilizado como sensores, transdutores e atuadores devido ao seu efeito piezoelétrico, apresentando uma diferença de potencial quando submetido a uma compressão mecânica ou sujeito a mudanças físicas e imposto a um campo elétrico externo. A estrutura do PZT é semelhante ao do Titanato de Bário (Peroviskita). Quando acima da temperatura de Curier a ferroeletricidade do material desaparece, tornando o material despolarizado (thermal depoling) [3]. Desta forma, somente cerâmicas PZTs despolarizadas são indicadas como meio dielétrico na construção de capacitores cerâmicos, uma vez que o PZT na forma piezoelétrico, quando submetido a um campo elétrico ou mesmo em condições de potência pulsada, apresentará uma deformação mecânica, causando consideráveis perdas em freqüência e danos ao dielétrico por deformação mecânica e fadiga. O trabalho proposto consiste em apresentar a vantagem de se utilizar à cerâmica PZT, como meio dielétrico na construção de capacitores cerâmicos comerciais em alta tensão, o qual indica uma reposta mais linear da capacitância em função da variação da tensão DC aplicada que pode ser muito útil em projetos onde pouca ou nenhuma variação da capacitância seja um parâmetro desejável (redes formadoras de pulsos LC e sistemas de armazenamento de alta energia). Foi considerada ainda, sua alta constante dielétrica (na faixa de 300-3000) em relação a outros materiais alternativos, pouco menor que o composto à base de titanato de bário que podem chegar facilmente a valores acima de 3000, e sua alta rigidez dielétrica apresentada (da ordem de 4,6kV/mm) [4]. Para tanto o trabalho apresenta as medidas da capacitância diferencial de capacitores cerâmicos comerciais em função da tensão (C x V) e das medidas da rigidez dielétrica (breakdown) comparadas aos resultados da cerâmica PZT despolarizada. Nas medidas de C x V na cerâmica PZT, constatou-se uma redução da capacitância em torno de 17% para um campo máximo de 3kV/mm, significando um pequeno fator de não-linearidade quando comparado aos capacitores cerâmicos comercias à base de titanato de bário (cerca de 70%). O teste da rigidez dielétrica consiste em obter a máxima quantidade de energia acumulada pelo material para condições de potência pulsada. O PZT atingiu valores com média de 4,6kV/mm. Este parâmetro é muito importante em sistemas de potência pulsada, onde os dielétricos dos capacitores são carregados e descarregados na escala de tempo de µs ou ns. II. MATERIAIS E MÉTODOS Neste trabalho utilizaram-se duas cerâmicas despolarizadas à base de Titanato Zirconato de Chumbo obtidas da ATCP do Brasil, conforme apresentado na Tabela I, onde a letra D significa cerâmica despolarizada, DUT amostra sobre teste e NF não fornecido. O trabalho contou com dois capacitores cerâmicos comerciais à base de Titanato de Bário e Estrôncio obtidos da Farnell, com suas dimensões e características também exibidas na Tabela I. Como apresentado na Tabela I, para os capacitores cerâmicos comerciais é fornecido a sua tensão de ruptura DC. Para o capacitor 1, sua tensão de ruptura nominal é de 3 kV e para capacitor 2 é de 2kV, o que dá respectivamente valores de rigidez dielétrica da ordem de 2.5 & 3 kV/mm para condições de tensão contínua (DC), levando em conta as espessuras dos dielétricos. Para a medida da capacitância diferencial C x V, utilizouse o circuito da Fig.1. O capacitor ou a amostra PZT sob testes é carregado por uma fonte DC de alta tensão (adquirida da Gamma HV – modelo RR10-6R) via uma resistência de 20MΩ para limitar a corrente de entrada e uma capacitância linear da ordem de 10 μF é utilizada para isolar o capacímetro da fonte de alta tensão. Por último, a resistência de 1MΩ na saída é usada para descarregar ambos os capacitores após o desligamento da fonte [2]. No caso das amostras PZT para os testes C × V, um porta-amostra foi utilizado com eletrodos de maior área (30 mm), pois neste caso é necessário uma maior área de contato para se obter uma capacitância do conjunto porta-amostra maior no PZT, na faixa de nF. Ainda, antes destes testes, uma pequena faixa circular do eletrodo de prata metálica foi removida de ambas as superfícies do PZT (1-2 mm) e em seguida o conjunto foi imerso em óleo para se evitar flashover nas bordas do dielétrico. Para os testes de Breakdown (BD) do PZT, embora o fabricante não forneça a rigidez dielétrica DC para este material se pode chegar a valores de rigidez dielétrica um pouco menores do que no caso dos capacitores, da ordem de 2-3 kV/mm de acordo com a literatura [5], dependendo da espessura do dielétrico. Tanto para os capacitores bem como para o PZT, não é fornecido sua tensão de ruptura em condições de potência pulsada, o qual vem a ser um dos principais objetivos deste trabalho em medi-los e compará- los. Normalmente, a tensão DC de ruptura dos dielétricos chega a ser duas a três vezes menores do que em condições pulsadas, visto que no caso DC a aplicação da tensão é contínua. Para realizar os testes de BD em condições pulsadas, foi desenvolvido um circuito eletrônico para produzir pulsos de saída com tensão máxima de até 60 kV (pico a pico). O sistema consiste em duas partes: a) a primeira é constituída de uma fonte carregadora DC de média tensão, com fundo de escala em 750 V e b) a segunda é composta por um pulsador de alta tensão que emprega bobinas de ignição (modelo Bosch KW 12V) para elevar a tensão de saída (3). O circuito para o teste de Breakdown é apresentado na Fig. 2 (a) & (b) [6]. Nos testes de BD, as amostras de PZT são fixas em outro porta-amostra de forma que os eletrodos cilíndricos do portaamostra de pequeno diâmetro (5 mm) pressionem o dielétrico para que não haja arco elétrico entre a superfície e os próprios eletrodos. O porta-amostra foi colocado em um recipiente com óleo de transformador de alta rigidez dielétrica (de 24 a 30 kV/mm) para que não haja descarga superficial entre os eletrodos pelo ar, uma vez que a rigidez dielétrica do ar (da ordem de 3 kV/mm) é muito menor que a rigidez dielétrica das amostras a serem testadas. Durante os testes de BD, a tensão de saída do circuito pulsador é elevada até o ponto em que o material dielétrico entra em colapso com a formação de um canal de flashover, levando a tensão a cair abruptamente até zero e determinando assim a tensão máxima que o dielétrico suporta. Para atingir a ruptura do dielétrico do PZT, é necessário que se tenha uma pequena área de contato dos eletrodos. Como as amostras PZT vêm na forma de um capacitor cilíndrico de pequena espessura (2mm), com um filme de prata metálica revestindo ambos os lados da sua superfície, foi necessário remover totalmente o eletrodo de prata com lixa. O diâmetro do eletrodo do porta-amostra define a capacitância do setup (da ordem de 100 pF) junto com a espessura do dielétrico, para que com a menor capacitância seja obtida uma menor atenuação no primário das bobinas de ignição e pelo fato de que a tensão de entrada é refletida pelo quadrado da razão de voltas da bobina. Para os testes dos capacitores não se utilizou o porta-amostra, os quais são ligados diretamente seus terminais aos do pulsador de alta potência e colocados dentro do recipiente com óleo. Após os testes de BD nas cerâmicas PZTs e nos capacitores, foram analisadas as superfícies para verificar o caminho de ruptura. Para os capacitores, retirou-se a proteção de polímero e em seguida foi feita a análise do caminho do flashover. As análises de ruptura foram feitas por meio de imagens ópticas em um estereoscópio Topcon com câmera digital CCD Sony, modelo topway, integrada. Já as análises das amostras PZTs foram feitas no microscópio eletrônico de varredura (MEV-Jeol modelo JSM 5310) equipado com detectores de energia dispersiva de raios-X (EDS), de onde são obtidas as imagens apresentadas nos resultados bem como pode ser obtida a composição química do material analisado, se desejado. III. RESULTADOS E DISCUSSÕES Para os capacitores cerâmicos comerciais, a curva da capacitância diferencial tem como característica principal um comportamento não-linear em função de V, podendo chegar até 50% na variação da capacitância para uma tensão DC próxima da tensão de ruptura. Isso pode ser verificado através da Fig.3 para o capacitor 1 e Fig.4 para o capacitor 2, com tensões de rupturas em 2 & 3 kV. Foi também identificado a correspondente variação da constante dielétrica que acompanha a variação da capacitância, como esperado [8-9]. A correspondente variação da constante dielétrica relativa diferencial εr pode ser calculada conhecendo-se C e as dimensões do capacitor (ver Tabela I) através de (1):  onde ε0 é a permissividade do meio, A é a área do eletrodo e d a espessura do dielétrico [4]. No caso das Figs. 3 e 4, a redução da constante dielétrica para os capacitores com dielétricos a base de titanato de bário, pode ser explicada levando-se em conta o seguinte: após o alinhamento inicial dos dipolos, começa a ocorrer saturação, pois à medida que o campo elétrico (E) aumenta a capacitância diferencial medida dQ/dV diminui variando inversamente proporcional a E-2/3 como já reportado [7] e, no limite, pode-se extrapolar que quando a polarização está totalmente saturada, a capacitância diferencial torna-se correspondente àquela que se tem com o vácuo entre os eletrodos. Contudo na prática, esta situação hipotética é limitada pela rigidez dielétrica do material. Já para a cerâmica PZT-D-01 (despolarizada), o comportamento da capacitância diferencial em função da tensão apresenta um comportamento mais linear, com um fator menor de não-linearidade de apenas 17 % para valores próximos da tensão de ruptura em 6 kV, conforme mostra a Fig.5. O mesmo pode ser observado para a amostra PZT-D- 02, onde o seu comportamento C×V é equivalente ao PZT-D- 01, embora neste caso haja um pequeno aumento inicial abrupto, mais observável nos valores das capacitâncias iniciais para tensões mais baixas. Como no caso anterior dos capacitores, note que a constante dielétrica do PZT-D-01 sofre uma variação semelhante a sua capacitância, conforme ilustrado na Fig.6. Entretanto, observou-se que a constante dielétrica do PZT está na faixa de 1000 sem tensão aplicada [10], enquanto que a dos capacitores cerâmicos a base de titanatos de bário e estrôncio se encontra num patamar mais alto, da ordem de 3000. Observou-se também que no caso das amostras PZTs despolarizadas, embora a estrutura esteja na fase Perovskita não-centrossimétrica, pois a temperatura de Curier do material é muito maior que a do ambiente (Tc = 325 °C), não existe polarização remanescente, uma vez que os domínios dos dipolos voltam a ter disposição aleatória assim que o campo é retirado de forma que o material seja isotrópico, não apresentando nenhum momento de dipolo elétrico por unidade de volume, caso o campo não seja muito intenso (abaixo de 2 kV/mm). Contudo, como o campo aplicado nos testes foi bastante intenso (3 kV/mm) pode ter resultado em uma pequena polarização induzida no PZT testado que poderia provocar perdas no dielétrico se utilizado na construção de um capacitor [1]. Estas perdas deverão ser de pequeno valor, visto que para que haja uma polarização remanescente de grande intensidade o processo de polarização tem de ser mais eficiente por meio do aquecimento do PZT acima da temperatura de Curier seguido de um rápido resfriamento. No entanto, isto é um ponto a ser investigado em trabalhos futuros. De qualquer maneira, uma explicação considerada para o decréscimo da constante dielétrica com o aumento do campo, pode ser pelo desalinhamento dos dipolos com campos intensos, como no caso dos capacitores a base de titanatos de Bário, onde também não há polarização remanescente do dielétrico na fase paraelétrica, conforme já relatado. Aliás, o uso de estrôncio como dopante para deslocar a temperatura de Curier abaixo da ambiente é uma importante característica dos dielétricos dos capacitores cerâmicos comerciais de titanatos de bário, uma vez que nesta condição o dielétrico se encontra na estrutura Perovskita centrossimétrica, a qual não apresenta domínios de dipolos permanentes [7]. Com relação aos testes de BD, primeiramente foram feitos com os capacitores 1 & 2 a base de BaTiO3. Estes testes são apresentados respectivamente nas Figs. 7 & 8 para os capacitores 1 & 2. Observe que a tensão de ruptura é obtida a partir do ponto em que ambas as tensões senoidais são interrompidas, com decaimento instantâneo até zero, caracterizando a descarga de BD. Como se trata de uma tensão diferencial aplicada entre os eletrodos, basta somar as duas tensões de pico de interrupção e dividir pela espessura do dielétrico para se obter a rigidez dielétrica da cerâmica em condições pulsadas. Portanto, das Figs. 7 & 8 e utilizando as espessuras dos dielétricos dadas na Tabela I, obtém-se para o capacitor 1 uma rigidez dielétrica da ordem de 8,8 kV/mm e para o capacitor 2 uma rigidez de aproximadamente 10,2 kV/mm. De acordo com a Tabela I, a tensão mínima de ruptura DC fornecida pelo fabricante é de 3 kV, o que dá uma rigidez dielétrica mínima DC da ordem de 2,54 kV/mm para uma espessura do dielétrico de 1,18 mm. Para o capacitor 2 a tensão mínima de ruptura DC é 2 kV, fornecendo uma rigidez DC minima de aproximadamente 3 kV/mm em uma espessura de 0,68 mm. Por enquanto, estes valores indicam que para o BaTiO3 em condições pulsadas, a rigidez dielétrica pode ser elevada por um fator da ordem de 3-4 maior em relação às especificações DC mínimas garantidas pelo fabricante. Para verificar o canal de flashover formado durante os testes de rigidez dielétrica para o capacitor, foi feita uma análise preliminar em um estereoscópio com câmara digital, mostrando claramente esta região de BD, conforme mostra a Fig. 9. Por outro lado, para as amostras despolarizadas, os testes de BD em condições pulsadas revelaram valores da ordem de 4,75KV/mm para amostra PZT-D-01 e de 4,5KV/mm para a amostra PZT-D-02, como indicado respectivamente pelas Figs. 10 e 11. Observando estes valores que é praticamente duas vezes menor do que aqueles obtidos com os capacitores a base de titanato de bário e considerando que a rigidez dielétrica DC para o PZT seja da ordem de 3 kV/mm, tem-se um incremento de apenas 1,5 na rigidez em condições pulsadas em relação ao valor contínuo. A imagem na Fig. 12 apresenta o canal de flashover (vista de topo) formado na superfície da amostra PZT-D-01 obtida no MEV, onde se pode inferir que a estrutura porosa de grãos foi claramente removida pelo BD para a formação do canal. A composição química das amostras foi obtida através da análise por EDS (Energy Dispersive Epectroscopy). A Fig.13 mostra a composição química para o caso do capacitor 2, indicando os picos de Titânio, Bário, Oxigênio e Estrôncio (dopante utilizado para deslocar a temperatura de Curier do material), formando o composto a base de óxido de titanato bário e estrôncio (BaSrTiO3), sendo responsável pelo comportamento não linear do dielétrico como indicado pelos gráficos de medida CxV. Na análise por EDS feita no PZT-D-01 foi possível identificar os picos de energia para o Titânio, Chumbo, Zircônia e Oxigênio, formando o composto Titanato Zirconato de Chumbo (PbZrTiO3), sendo o elemento carbono identificado na Fig.13 &14, impureza adicionada sobre a amostra no processo de polimento, para retirada das camadas de proteção polimérica e metálica. IV. CONCLUSÕES Os resultados obtidos através dos testes indicaram que a cerâmica PZT despolarizada possui um comportamento mais linear quando comparado com capacitores cerâmicos comerciais a base de titanatos, apresentando uma variação da constante dielétrica de apenas 17% em função da tensão aplicada enquanto que para os capacitores chega a apresentar, de acordo com os testes, variação maior do que 50 %. Entretanto, a rigidez dielétrica do PZT em condições de potência pulsadas medida, foi aproximadamente duas vezes menor (da ordem de 45 kV/cm) quando comparado com compostos a base de titanatos de bário + estrôncio (90 kV/cm). Outra característica importante a ser investigada em trabalhos futuros é se campos intensos próximos da ruptura DC dielétrica do PZT (na faixa de 2 a 5 kV/mm dependendo da espessura da cerâmica) induzem uma leve ferroeletricidade em amostras PZT despolarizadas, o que pode causar perdas nestes dielétricos a serem usados nos sistemas DC de carregamento [1]. "
}