{
    "id": 171,
    "titulo": " sistema de redes de antenas por controle de fase para radares vhf empregando circuitos integrados do tipo dds",
    "autor": "amanda de araújo costa castro, rafael de araújo marcondes e antonio dias de macedo filho",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2011/st/P_12.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Este trabalho discute a implementação de sistemas de radar com redes de antenas por controle de fase aplicando circuitos integrados do tipo DDS. Inicialmente, abalisa-se a vantagens de se projetar rdares na faixa de VHF, típica para detectar ameaças furtivas (baixa Seção Reta Radar). A seguir, mostra-se o princípio de funcionamento dos circuitos integrados do tipo DDS e como eles podem simplificar o projeto de um sistema de redes de antenas por controle de fase (phased array). Verifica-se, também que os DDS podem reduzir a complexidade de técnicas anti interceptação e robustez à contramedidas eletrônicas.",
    "texto": " I. INTRODUÇÃO Aeronaves e Navios furtivos (stealth) são plataformas que apresentam baixa refletividade aos sinais de radar. Em geral, seus formatos são cuidadosamente moldados para espalhar os sinais nelas incidentes para outras direções. Normalmente, esta característica, é acompanhada pelo emprego intensivo de materiais absorsores de radiação eletromagnética (MARE). Tudo isso propicia que uma aeronave furtiva tenha SRR (Seção Reta Radar) muito reduzida, podendo ser tão pequena quanto 0,1 m2 em alguns casos. No entanto, essa tecnologia torna-se, na prática, inexeqüíveis quando o radar opera em faixas mais baixas, como a de VHF, pois nessa situação, as nuances do formato da plataforma causam poucos efeitos sobre o espalhamento dos sinais A Fig. 1 ilustra que se o comprimento de onda ( escolhido fizer o alvo pertencer à Região de Raleigh ou de Ressonância, então os formatos angulares cuidadosamente calculados terão uma eficiência sofrível. Adicionalmente, nessa faixa, a profundidade pelicular atinge, também, dimensões capazes de tornar as camadas de MARE praticamente sem efeito [1]. Essas particularidades foram expostas durante o conflito em Kosovo, quando uma aeronave stealth B1 foi detectada por um radar NEBO (Fig. 2) de fabricação russa, que opera em VHF e, posteriormente abatida por um míssil IGLA. Portanto, verifica-se que radares empregando faixas de frequências mais baixas, podem ser uma interessante opção para equipar tanto o sistema de defesa anti-aéreo do sistema de Proteção de Fronteiras (SisFron), como também, o Sistema de Gerenciamento da Amazônia Azul (SisGAAz). Por sua vez, a tecnologia de redes de antenas por controle de fase (phased arrays) oferece a esses radares a capacidade de operar tanto em busca como em acompanhamento para diversos alvos simultaneamente. No entanto, por causa da quantidade de antenas necessárias, gerar os sinais, nessa banda, com as diferenças de fase requeridas não é tarefa elementar. Atualmente, uma solução que surge para minimizar essa dificuldade é empregar sistemas baseados nos circuitos integrados do tipo DDS, descritos a seguir. II. APLICAÇÃO DE DDS EM REDES DE ANTENAS Os DDS (Direct Digital Synthetizers) são circuitos integrados capazes de gerar, de modo controlavel, sinais de até 1 GHz. Eles podem fornecer sinais em faixas relativamente amplas, com níveis de saída calibrados, numa grande variedade de formas de onda e tipos de modulação. Portanto, tais componentes são particularmente interessantes para sistemas de geração de sinais de radares com redes de antenas, nos quais ondas complexas precisam ser criadas internamente com rígido controle de fase. O DDS fornece grande resolução de frequência e permite aplicação direta de modulação de fase, frequência e amplitude. Eles produzem formas de onda analógicas, normalmente senoidais, a partir de um sinal digital por meio de um conversor digital-analógico. Como as operações dentro dos DDS são essencialmente digitais, eles oferecem uma rápida comutação entre as frequências de saída e uma boa resolução numa faixa espectral ampla, consumindo por volta de 30mW de potência. A fig. 3 apresenta o esquema de um DDS [3]. Seus componentes principais são um acumulador de fase, um meio de conversão de fase para amplitude (geralmente uma sine look-up table), e um Conversor DigitalAnalógico (DAC). A frequência da onda senoidoal gerada depende de duas variáveis: a frequência do relógio (clock) e da palavra binária de sintonia (tuning word), M. O acumulador de fase calcula um endereço de fase (ângulo) para a memória tabela (look up table) FaseAmplitude. O acumulador de fase é um contador que incrementa o número armazenado cada vez que recebe um pulso de clock. A magnitude do incremento é determinada por M, que dita o tamanho do passo de fase entre as atualizações do clock. Quanto maior o salto, mais rápido o acumulador de fase chega ao limite e completa seu ciclo senoidal equivalente. Portanto, valor digital de amplitude gerado ao longo do tempo, correspondente a uma senoide. O DAC, por sua vez, converte esse número binário para um valor correspondente de tensão analógica. Para gerar uma onda senoidal de frequência fixa, um valor constante (o incremento de fase, que é determinada pelo número binário) é adicionado ao acumulador de fase, a cada ciclo de clock. Por exemplo, se o incremento de fase é grande, o acumulador de fase irá passar rapidamente através do sine look-up table e, assim, gerar uma onda senoidal de alta frequência. Além disso, a palavra F pode deslocar o sinal no tempo proporcionando uma defasagem muito precisa, que pode chegar a 0,4o. Adicionalmente, alguns DDS são capazes de controlar diretamente a amplitude do sinal gerado, dentro de certos limites. A equação de ajuste básico para a arquitetura DDS é [4]: As pincipais características do DDS para aplicações em sistemas de radar são a precisão de ajuste de frequência, controle de fase de compensação, e capacidade de variação de frequência (chirp) linear. No caso dos radares empregando redes de antenas, são necessários múltiplos canais DDS, sincronizados um com o outro. Este requisito também inclui distribuição clock em fase. A alimentação apropriada pode ser obtida através da atribuição de um canal de DDS para cada antena individual da rede. O mecanismo de varredura do feixe é feito por meio do ajuste de fase entre os sinais dos váarios elementos da rede. Usa-se, então, o recurso de deslocamento de fase para realizar a tarefa de mudar a direção do feixe. Comparado ao radar pulsado, realizar uma arquitetura de radar FMCW é consideravelmente mais desafiador para usar com redes de antenas. Nesta configuração, o feixe é mais difícil de guiar devido à constante mudança de diferença de fase que são necessários, pois o sinal é modulado em FM (chirped). O ajuste de fase deve ser realizado em cada sinal durante o período de chirp. Por exemplo, o CI AD9959 permite que mudanças de frequência, fase e amplitude ocorram simultaneamente. Outras implementaões mais sofisticadas como noise radars [5] também podem ser em muito simplificadas com o emprego de DDS. É possível sincronizar dois, ou mais, DDS operando no mesmo clock para obter na saída sinais, cuja relação de fase seja controlado diretamente. Na Figura 4, dois DDS são programados com o mesmo pino de reset sendo utilizado para atualizar ambas as partes. O reset deve ser acionado depois de ligar e antes de transferir os dados para o DDS. Isso define a saída do CI para uma fase conhecida, que serve como ponto de referência comum e permite a sincronização de vários dispositivos. Quando novos dados são enviados simultaneamente a vários DDS, uma relação de fase coerente pode ser mantida, e sua fase realativa pode ser deslocada de forma previsível por meio do registro de deslocamento de fase (F). Por exemplo, o AD9833 e o AD9834, da Analog Devices, tem 12 bits de resolução de fase, com uma resolução efetiva de 0,1 grau. É importante salientar que os dados de programação para ajuste de fase, além do clock de referência, devem ser enviados de forma simultânea para todos os DDS. Para se obter uma diferença de fase  , usa-se a seguinte relacao [4]: Finalmente, para bandas acima de 1 GHz pode-se montar um sistema que empregue misturadores. Isso, naturalmente, irá desbalancear as fases, porém, o erro introduzido por tais componentes pode ser corrigido pela colocação de memórias de correção a serem programadas após testes de calibração, conforme indicado na Fig. 5. No entanto, por causa das diminutas dimensões do CI, há grandes dificuldades, em produzir placas com as trilhas necessárias para as ligações da pinagem do CI e de soldá-lo. Os primeiros protótipos realizados tiveram resultados ainda pouco eficazes por causa da dificuldade de realizar um bom casamento de impedância nas condições descritas. A equipe trabalha num novo protótipo contando com o apoio da IMBEL. III. CONCLUSÃO Os circuitos integrados do tipo DDS oferecem a oportunidade para uma reavaliação radical dos projetos de redes de antenas aplicadas em radares. Para a faixa de VHF, adequada à detecção de alvos furtivos, essa tecnologia já esta disponível. Tais radares são particularmente interesantes para aplicações nos grandes sistemas de vigilância atualmente em fase de estudos. Além disso, a possibilidade de incrementar a robustez do radar contra a interceptação por sistemas de GE e a contramedidas eletronicas, pela geração de sinais FMCW ou modulados por ruído é outra característica de grande potencial a ser melhor investigada.  "
}