{
    "id": 173,
    "titulo": "implementação em tempo real do controle de um imageador giroestabilizado em arfagem e guinada",
    "autor": "renan de freitas elias campos, ronan arraes jardim chagas, tiago bücker, jacques waldmann",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2010/st/V_2.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 2,
    "resumo": "Este trabalho apresenta a implementação de imageador giroestabilizado em guinada e arfagem controlado remotamente por joystick para aplicação em UAV (unmanned aerial vehicle). O sistema implementado utiliza medidas de uma unidade inercial solidária (strapdown) para manter o campo de visão da câmera apontando sempre para a mesma direção no espaço inercial, independentemente dos movimentos em arfagem e guinada que o corpo – em que o sistema encontra-se instalado – realiza. Há um enlace de comunicação digital sem fio entre o sistema implementado e uma estação em terra para a recepção de dados de telemetria e envio da direção de visada desejada. Um segundo enlace analógico sem fio é utilizado para recepção em terra do vídeo obtido pela câmera. O algoritmo de giroestabilização utilizado é dado e explicita-se ainda a importância da utilização de um sistema de tempo real para esta aplicação.",
    "texto": " I. INTRODUÇÃO Sistemas capazes de manter uma linha de visada desejada, independentemente dos movimentos realizados pelo corpo em que estes estejam acoplados, são de grande importância para aplicações civis e militares voltadas para vigilância e navegação por imagens. Em particular, no caso de veículos aéreos não tripulados (VANT’s, ou UAV’s em Inglês), o uso de imageadores giroestabilizados é ainda mais relevante, em decorrência da necessidade de realimentação visual para equipe em terra das condições atuais de vôo e da missão. Exemplos de aplicações diversas relacionadas a imageadores em VANT’s são dados em [1]. Em [2] apresenta-se uma proposta do uso de imageadores como itens de série para aviação comercial, visando auxílio de investigação em caso de acidentes. Em [3] é apresentada uma aplicação típica envolvendo pouso automático, considerando-se também o uso em veículos tripulados. Em [4] e [5] são descritos algoritmos de rastreio de alvos a partir de imagens obtidas de VANT’s. Em [6] é apresentado ainda uma implementação de um imageador com dois graus de liberdade e uso de um controlador baseado em lógica Fuzzy para o travamento em alvos imóveis, rastreados por um VANT. O imageador implementado neste trabalho é mais simples e faz uso de uma unidade inercial solidária (strapdown) que fornece informações sobre a atitude atual do corpo em que o sistema encontra-se instalado. A câmera é instalada sobre gimbals cujos eixos são acionados por servomotores de rádiocomando alinhados de modo a prover movimento de arfagem (tilt), guinada (pan) e ainda escamoteamento para proteção do equipamento em decolagens e pousos. Assim, os servomotores atuam de modo a manter a linha de visada da câmera apontando sempre para uma dada direção de interesse – transmitida pela estação de terra – independentemente do movimento do corpo (em arfagem e guinada). A aquisição de dados oriundos da unidade inercial, o algoritmo de giroestabilização, bem como os algoritmos de recepção e transmissão de dados entre o sistema implementado e a estação em terra são executados concorrentemente e em tempo real por meio de um SBC (single board computer). Para tanto, o SBC utilizado roda um sistema operacional Linux dotado de extensões para execução de tarefas em tempo real. Tal fato possibilita um melhor controle do chaveamento entre as tarefas, garantindo tempos de resposta que não comprometam o funcionamento do sistema como um todo. II. SISTEMA DE TEMPO REAL Sistemas de tempo real são aqueles que devem produzir resultados corretos respeitando restrições de tempo pré- estabelecidas [7]. O sistema imageador implementado executa várias tarefas simultaneamente através do SBC disponibilizado, o qual possui um sistema operacional multitarefa Linux instalado. Entretanto, este sistema operacional por si só não é capaz de garantir que as tarefas sejam executadas em tempo real devido a limitações da versão atual de seu kernel. Assim, para garantir-se a operação em tempo real das tarefas, faz-se necessária a inclusão de um módulo adicional ao kernel do sistema: o ADEOS (Adaptive Domain Environment for Operating Systems), bem como o conjunto de bibliotecas de tempo real RTAI (Real Time Application Interface). Com isto, cria-se uma camada intermediária de controle de processos, em software, permitindo que o desenvolvedor atribua prioridades às suas tarefas da maneira que melhor lhe convier. Impede-se assim que o sistema operacional decida qual tarefa terá prioridade, possibilitando a execução das tarefas de interesse em tempo real [8]. A Tabela I apresenta a lista das tarefas que são executadas concorrentemente no SBC em tempo real. III. ALGORITMO DE GIROESTABILIZAÇÃO O algoritmo de giroestabilização do imageador é executado pela tarefa ATICAM e atua de modo a manter a orientação da linha de visada da câmera em guinada (pan) e arfagem (tilt), conforme comandos enviados pela estação em terra. O algoritmo funciona de modo que estação em terra envia, por meio de um joystick, a posição desejada para a câmera. Estes dados são transmitidos pelo enlace digital sem fio até o SBC. A tarefa SERIAL recebe o comando e encaminha para ser tratado pela tarefa ATICAM. Esta por sua vez transmite então para um microcontrolador PIC os valores de largura de pulso PWM (pulse width modulation) que precisam ser gerados para o acionamento dos servos de modo a obter a orientação desejada. A esta orientação desejada, atribui-se um vetor, o qual é representado no sistema de coordenadas b1, dos gimbals da câmera, por Lb1 , conforme (1). onde pc e tc são os ângulos de guinada (pan) e arfagem (tilt) comandados pela estação em terra respectivamente. O sistema b1 é definido pela DCM (matriz de cossenos diretores) DbNED l , obtida da atitude do sistema na inicialização deste, sendo NED (north east down) o sistema de coordenadas da horizontal local adotado. Na seqüência, determina-se um segundo sistema de coordenadas b2, que caracteriza a posição instantânea do corpo em que o sistema está solidariamente acoplado. Este é obtido constantemente ao longo do tempo, por meio da unidade inercial de medidas, e é representado pela DCM NED Db2 . Sempre que um novo comando de apontamento vier da estação em terra, apenas o vetor Lb1 deverá ser atualizado. Caso contrário, deve-se calcular os novos ângulos de pan e tilt necessários para que a linha de visada da câmera se mantenha apontando na direção do vetor Lb1 representado no sistema b2. Esta representação é feita por meio de (2). A partir de (2), extrai-se então de (3) os novos ângulos de pan pg e tilt tg, os quais deverão ser comandados aos servomotores para que a câmera permaneça estabilizada no espaço inercial, garantindo a giroestabilização do sistema. A Fig. 1 ilustra um fluxograma do funcionamento do algoritmo. Nota-se que a unidade inercial utilizada nesta implementação fornece diretamente os dados de atitude na forma de quatérnions de rotação. Estes quatérnions são então convertido para a forma de DCM internamente. Caso uma unidade de medição inercial convencional, que fornecesse apenas incrementos de velocidades angulares, fosse utilizada, a atitude do corpo poderia ser computada por qualquer dos algoritmos descritos em [9]. IV. IMPLEMENTAÇÃO DO SISTEMA IMAGEADOR Para a implementação do imageador giroestabilizado descrito neste trabalho, foram utilizados os seguintes componentes: -SBC com microcontrolador ARM de 200 MHz com sistema operacional Linux embarcado, com módulos e bibliotecas de tempo real; -Microcontrolador PIC com três saídas de PWM; -Equipamento de fusão de texto a vídeo analógico; -Unidade de medição inercial (com giros, magnetômetro, acelerômetros, altímetro, termômetro e GPS embutidos); -Rádio-Modems para transmissão sem fio bidirecional digital de dados com espalhamento espectral do sinal e alcance de até 10 km; -Montagem de gimbals para o imageador, com movimentos de arfagem (tilt) entre 15° e 90° e guinada (pan) entre -180° e +180°; -Câmera analógica com alta qualidade de imagem e eletroóptica controlável, com zoom e foco ajustáveis; -Servomotores de rádiocontrole com resolução de 10µs para comandos de pan, tilt e escamoteamento da câmera; -PC para estação em terra com joystick para envio de comandos de apontamento; -Enlace para transmissão sem fio de vídeo analógico; -Baterias de lítio-polímero. Além dos equipamentos citados, para a montagem do sistema, foi necessária ainda a confecção de placas de circuito eletrônico, cabos e conectores diversos. A Fig. 2 ilustra o diagrama de blocos simplificado do sistema desenvolvido. Na seção anterior foi visto o funcionamento do algoritmo de giroestabilização do sistema imageador, havendo interação entre a unidade inercial, o SBC, o PIC e os servomotores. A seguir o funcionamento dos demais componentes do sistema como um todo será descrito. A. Recepção de comandos oriundos da estação em terra O sistema imageador recebe comandos da estação em terra através do rádio-modem. Os comandos são recebidos no SBC pela tarefa SERIAL, a qual identifica como estes deverão ser trados. Em caso de comando de apontamento, a tarefa ATICAM deverá ser acionada para tratá-los, conforme descrito anteriormente no algoritmo de giroestabilização. Em caso de comandos de ajuste da câmera (zoom, foco, ou ligar e desligar), a tarefa CAMERA será chamada para executá-los. E, em caso de comandos destinados ao próprio SBC (reiniciar, desligar ou interromper as tarefas) a própria tarefa SERIAL se encarregará de executá-los. B. Transmissão de dados de telemetria e vídeo analógico para estação em terra A cada período de um segundo, o sistema imageador envia para a estação em terra, por meio do rádio-modem, os seguintes dados de telemetria: ângulos de pan e tilt atuais dos gimbals da câmera; o quatérnion de atitude qbNED 2 ; os dados do GPS incluso na unidade inercial (latitude, longitude, altitude, e velocidades NED); e a data e hora da última transmissão. A tarefa ATICAM é a responsável pela geração os dados de telemetria a serem transmitidos. Estes por sua vez são repassados à tarefa SERIAL, a qual se encarrega de transmiti-los através do rádio-modem. Quanto ao enlace analógico de vídeo, a tarefa ATICAM gera os dados de pan e tilt dos gimbals e os repassa à tarefa BOB. Esta, por sua vez se encarrega de anexar esta informação no vídeo analógico através do equipamento de vídeo overlay disponível. O vídeo é então transmitido à estação em terra, onde passa pelo receptor e chega ao monitor, permitindo realimentação visual em tempo real das condições de vôo do UAV. C. Recepção de dados de telemetria na estação em terra Os dados de telemetria chegam à estação em terra através do rádio-modem e são recebidos no PC pelo software de controle da estação em terra. Este software exibe os dados de telemetria recebidos e apresenta ainda uma interface amigável com o usuário, disponibilizando botões autoexplicativos para o envio dos comandos de apontamento, ajuste de imagem e ações sobre o SBC. O envio de comandos pode se dar através dos botões disponíveis na interface gráfica, pelo teclado do computador, ou ainda por joystick. A Fig 3 ilustra a tela principal deste software. Nota-se por meio desta figura que, embora a estação em terra receba via telemetria o quatérnion de atitude do corpo, este é apresentado em tela na forma de ângulos de Euler (ψ, θ e Φ). Esta parametrização é muito mais intuitiva de ser interpretada do que aquela dada por quatérnions, o que justifica e incentiva sua utilização. Observa-se também que este software já vem pré-disposto para a inclusão de giroestabilização em rolamento para câmera, já dispondo este de botões para esta finalidade, como visto logo acima do botão de Retract UP. V. CONCLUSÃO E TRABALHOS FUTUROS Foi implementado um sistema imageador giroestabilizado em guinada (pan) e arfagem (tilt) controlado remotamente por joystick para aplicação em um UAV. Testes realizados em condições de laboratório, em campo e em mesa de movimento controlado em 2 eixos indicaram resultados satisfatórios, de modo que a câmera consegue manter sua linha de visada praticamente inalterada independentemente dos movimentos de arfagem e guinada realizados pelo corpo em que o sistema está acoplado, respeitando-se os limites de fim de curso dos gimbals: de 15° a 90° em tilt e -180° a +180 em pan. A Fig. 4 ilustra uma foto do sistema imageador giroestabilizado implementado neste trabalho durante um ensaio em mesa controlada em dois eixos. Pequenos erros no processo de giroestabilização podem surgir em decorrência do limiar de resolução (10µs) dos servomotores de rádiocontrole empregados, além dos erros de medição da unidade inercial empregada. Essa limitação na acurácia da giroestabilização limita o emprego da capacidade máxima de zoom disponível e motiva o projeto de amortecimento de vibrações para o imageador e o emprego de atuadores mais sofisticados. O sistema apresentado em [6] é bastante mais complexo e faz uso de um controlador baseado em lógica Fuzzy para o travamento em alvos fixos. A solução aqui implementada é bastante simplificada, sendo que a versão atual apenas giroestabiliza o imageador, sem travamento efetivo em alvos. Para a continuidade dos trabalhos, um novo conjunto de gimbals já está em fase de testes, incluindo o movimento de rolamento da câmera em torno de seu eixo óptico e está sendo projetado um sistema de amortecimento de vibrações. Para a giroestabilização também em rolamento, um novo algoritmo foi implementado e está sendo testado. Em trabalhos futuros, pretende-se ainda substituir a câmera analógica atualmente empregada por uma digital. O objetivo será a implementação embarcada de algoritmos de visão computacional em tempo real sem incorrer no gargalo da largura de banda disponível para a transmissão de vídeo digital. Esse gargalo é um sério obstáculo ao processamento adequado de sequências de imagens a 30 quadros por segundo na estação em solo em tempo real. Já o processamento embarcado deverá possibilitar o rastreio automático de alvos, de modo similar ao visto em [6], sem a necessidade de correções manuais oriundas de comandos de joystick da estação em solo para reapontar o eixo óptico giroestabilizado em direção a um alvo no solo, seja ele estacionário ou móvel. Para tanto será feito uso do algoritmo descrito em [4]. "
}