{
    "id": 175,
    "titulo": "modelagem de um vant de asas fixas para o planejamento e controle de missões",
    "autor": "olinda de lima farias alves, antonio eduardo carrilho da cunha, roberto ades",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2010/st/XIV_2.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Este trabalho trata da modelagem e controle de uma aeronave para aplicação no Planejamento de Missões de Veículos Aéreos Não-Tripuláveis (VANT). A metodologia utilizada baseia-se em apresentar a modelagem não-linear da aeronave escolhida, linearizá-la, em seguida executar os projetos das malhas de controle (estabilização, guiamento e geração de trajet´ orias) para o modo lateral-direcional. Por fim são realizadas simulações para uma determinada missão e são analisadas as condições de exequibilidade. Estes procedimentos podem ser implementados e validados na forma de simuladores de voo ou numa plataforma experimental.",
    "texto": " I. Introdução Uma definição simples de planejamento de missão é a capacidade de mapear a melhor rota para o alvo com o maior nível de segurança e probabilidade de sucesso. Neste contexto, a premissa deste trabalho é produzir um modelo aerodinâmico de uma aeronave de asas fixas para o planejamento de missões de VANT - missões estas, que são complexas e compostas de diversas etapas. Existem diversos trabalhos que empregam os ditos métodos formais em engenharia para o planejamento e controle de missões de VANT. Especificamente, em [1] e [2], a verificação de sistemas híbridos [3] é empregada, enquanto em [4] emprega-se a teoria de controle supervisório de Sistemas Híbridos [5]. A proposta deste artigo é fornecer um modelo de um VANT de asas fixas, na forma de um sistema dinâmico híbrido [6], com as malhas de estabilização, guiamento e geração de trajetórias projetadas, para o planejamento de missões segundo as abordagens de [1], [2] e [4]. Simulações computacionais foram utilizadas como forma de validação do modelo obtido. Um trabalho similar é o de [7] onde utiliza-se a identificação paramétrica para o projeto das malhas de controle. Pode-se citar também [8], o qual apresenta leis de controle para o modo lateral sob influência do vento (estabilização); [9], exibe um algoritmo de guiamento que utiliza modelos de controle preditivo e [10], que apresenta um algoritmo de geração de trajetória. Assim, a contribuição deste artigo foi no sentido da abordagem de diferentes disciplinas que o assunto sobre aeronaves exige: modelagem, controle, planejamento de missões, etc. Desta forma, foi realizada uma integração entre a modelagem e o controle em simulações de missão usando sistemas dinâmicos híbridos. Este artigo está organizado da seguinte forma: na seção II é apresentada a formulação do problema, na seção III é descrito o modelo não-linear da aeronave e sua linearização. Na seção IV foram projetadas as malhas de controle e em seguida, na seção V, foi gerado o sistema híbrido resultante do conjunto de trajetórias e foram realizadas simulações. Por fim, na seção VI encontram-se as conclusões deste trabalho, bem como as contribuições e propostas para trabalhos futuros. II. Formulação do Problema Seleciona-se uma aeronave de asas fixas pois as aplicações militares requerem alta velocidade à frente, grande raio operacional e baixa assinatura acústica. Além disso, os aviões podem ser projetados de forma a se comportarem de forma inerentemente estável e são, portanto, comparativamente fáceis de pilotar a partir de uma estação de controle em terra. A aeronave escolhida foi o Cessna Skylane 182, devido à disponibilidade de uma plataforma de testes no Centro Tecnológico do Exército (CTEx) [11], [12]. As malhas de controle interna e externa a serem utilizadas neste trabalho, encontram-se representadas na Fig. 1. A aeronave fornece as variáveis atualizadas aos sensores. Estas são enviadas ao bloco navegação responsável por fornecer a posição, altitude e velocidades angulares e lineares da aeronave, em relação a um sistema de coordenadas de referência. Estas informações são repassadas aos blocos guiamento, estabilização e geração de trajetória. A estabilização está relacionada à técnica de controle da atitude da aeronave em torno do seu centro de massa. O guiamento refere-se à técnica de controle da posição do centro de massa da aeronave. Neste trabalho será utilizada a técnica do Guiamento Comandado [13]. Esta estratégia foi escolhida pois são necessários comandos de referência para manter o eixo longitudinal do veículo apontado para o ponto de referência imaginário, localizado sobre a trajetória de referência ou especificado na forma de um ponto de passagem. A geração de trajetória tem a função de processar os dados produzidos pelo sistema de navegação e compará-los com os dados da aeronave, gerando os sinais de erros correspondentes e transformando-os em comandos de direção desejados. Esta malha interna realimenta a malha externa, controle da missão, responsável por gerar a trajetória a ser seguida pela aeronave. O enfoque deste trabalho se dará no modo lateral/direcional da modelagem da aeronave escolhida, em virtude dos modos longitudinal e lateral serem desacoplados após a linearização. Considera-se, portanto, que haja um efetivo controle longitudinal da aeronave. III. Modelagem A. Modelo Aerodinâmico O modelo aerodinâmico não-linear da aeronave utilizado foi extraído de [14]. Versões com diferentes configurações podem ser encontradas em [12], [15] e [16]. Os parâmetros para a aeronave Cessna foram extraídos de [14]. Não apresentam-se as equações completas do modelo neste artigo, apenas faz-se menção às principais variáveis. O modelo completo apresenta as seguintes variáveis de estado, em que:  β: ângulo de deslize lateral, ângulo entre o vetor velocidade e o plano de simetria x-z da aeronave; (Fig.2a) ψ: ângulo de guinada, ângulo entre o plano xb e o plano de referência (x-z); (Fig.2a) M: número de Mach (VT = vs.M), com VT velocidade da aeronave e vs velocidade do som; (Fig.2b) α: ângulo de ataque, descrito em termos das componentes da velocidade da aeronave; (Fig.2b) θ: ângulo de arfagem, definido em relação ao referencial inercial da aeronave; (Fig.2c) φ: ângulo de rolagem, ângulo de rotação em torno do eixo longitudinal; (Fig.2d) p, q e r: velocidades angulares de rolagem, arfagem e guinada, respectivamente e x, y e z: coordenadas de posição da aeronave no plano de referência. As variáveis de entrada são, em que (vide Fig. 3): η: fração do empuxo máximo (T/TM); δe: deflexão do profundor (elevator); δa: deflexão dos ailerons e δr: deflexão do leme (rudder).  B. Linearização O modelo aerodinâmico não-linear da seção III-A, foi utilizado para a obtenção de um modelo linear. Neste processo foram excluídas as variáveis x, y e z. O ponto de equilíbrio é definido de acordo com (3) e as condições:  M = 0,196 a uma altitude de 1524 m para um voo de cruzeiro [14] e Ângulo de trajetória, que relaciona θ e α, nulo (voo plano e nivelado). Com isso, o sistema de 9 equações não-lineares (M, α, β, φ, θ, ψ, p, q, r) do modelo da aeronave da seção III-A foi resolvido utilizando-se o comando fsolve do MATLAB. Desta forma, foram obtidos os parâmetros adicionais do ponto de equilíbrio, de acordo com (4). A linearização foi realizada utilizando-se o método do Jacobiano [16]. Neste método as equações não-lineares implícitas são escritas da forma de (5), as quais são obtidas, respectivamente pelas três equações de forças, variáveis M, α e β, duas equações cinemáticas, variáveis φ, θ e as três equações de momento, variáveis p, q e r, movendo-se todos os termos não-nulos para o lado direito das equações. O vetor de estados reduzido é dado por (1) excluindo-se as coordenadas x, y e z e o ângulo de guinada ψ, os quais são retirados pois são independentes. O vetor de entradas é dado por (2). A consideração que é feita é a de pequenas perturbações na condição de estado estacionário (equilíbrio) (Xe,Ue). Então deriva-se um conjunto de equações de estado lineares com coeficientes constantes. Expande-se as equações de estado não-lineares (5) em séries de Taylor sobre o ponto de equilíbrio (Xe,Ue) e mantém-se somente os termos de primeira ordem. Assim, percebe-se que as perturbações no estado, as derivadas do estado e os vetores de entrada devem satisfazer à (6), nas quais, ∇ representa um vetor linha dos operadores das primeiras derivadas parciais, como ilustrado em (7). A equação (6) pode ser escrita na forma de equações de espaço de estado lineares implícitas de acordo com (8), na qual, as letras minúsculas, x e u representam as perturbações nos valores de equilíbrio dos vetores de estado e de entrada. As matrizes dos coeficientes são da forma de (9) e (10). estas matrizes são chamadas de matrizes Jacobianas [16] e devem ser calculadas sobre o ponto de equilíbrio. O procedimento da linearização evidenciou o desacoplamento dos modos longitudinal e lateral. O modo lateral possui como variáveis de estado (β, p, r e φ), como variáveis de entrada (δa e δr), onde o δa é responsável pelo movimento de rolagem e δr garante o alinhamento do avião durante a realização de manobras. As matrizes A e B são definidas por (11) e (12). nas quais Lβ, Lp, Lr, Nβ, Np, Nr, Lδa, Lδr, Nδa, Nδr são as derivadas latero-direcionais [14]. Serão utilizados para o projeto das malhas de controle, as saídas β e φ, sendo que as outras serão estimadas. IV. Tópicos do Controle A. Malha de Estabilização Para o projeto do controlador desta malha foi considerado o controlador LQG (Linear Quadrático Gaussiano) [17]. Este controlador foi escolhido após simulações com outros controladores e por apresentar o melhor desempenho. A presente malha está representada na Fig. 4. Na Fig. 4, o ângulo β deve ter um valor de referência que é zero e o ângulo φ é oriundo da malha de guiamento. O bloco modo lateral é conforme o obtido na seção III-B. O bloco atuadores tem como função de transferência H(s) = 10/(s+10) [18]; e o bloco integrador foi utilizado para anular os erros de estado estacionário ao degrau e foi determinado a partir de [18]. As matrizes de ponderação foram escolhidas fazendo-se os elementos da diagonal principal referentes às variáveis β e φ, inversamente proporcionais ao valor máximo destes ângulos.  Os parâmetros de desempenho para o controlador LQG foram definidos como máxima ultrapassagem < 2% para o β e φ e tempo de acomodação de 300 s para o β é de 10 s para o φ, a corresponder às Figs. 5 e 6 para os modelos linear e não-linear. Conclui-se que para uma entrada degrau de 10° em φ, o ângulo de deslize lateral estabiliza-se após 2,5 s e que o desempenho do controlador LQG projetado tanto para o modelo linear como para o não-linear está adequado.  B. Guiamento A Fig. 7 ilustra a conexão das malhas de geração de trajetória e de guiamento à malha de estabilização. O bloco da malha de estabilização inclui a malha fechada da seção IV-A juntamente com as equações linearizadas para as variáveis ψ, x e y. O controlador utilizado para a malha de guiamento foi do tipo PID (Proporcional-Integral-Derivativo). O motivo da escolha por este controlador foi devido ao fato deste ser o mais encontrado nas literaturas existentes. O controlador foi ajustado por intermédio do Root-Locus da função de transferência com entrada φ e saída ψ, de acordo com o 2º Método da regra de Ziegler-Nichols[19]. O ganho proporcional obtido foi Kp = -6,8. Como a função de transferência possui um pólo na origem, se tornou desnecessário a utilização dos ganhos Ki e Kd. A simulação do ângulo de guinada com o controlador PID está ilustrada na Fig. 8, para uma situação de um degrau de 10° (0,1745 rad) no ψd. Pode-se concluir da Fig. 8 que a curva do modelo não-linear se aproximou consideravelmente do modelo linear, o que demonstra o bom desempenho do controlador PID projetado.  C. Geração da Trajetória Foram definidos dois algoritmos de geração de trajetória, especificamente: trajetória retilínea e circular, conforme [13] e [10].  Trajetória Retilínea: Para entendimento utiliza-se a Fig. 9, em que →p é o ponto de passagem; →t é o ponto de passagem destino e →a é a posição atual da aeronave. A referência para a aeronave é dada pelo vetor → ak, de acordo com (13). Em (14), K é o parâmetro de convergência de rastreio, g é a aceleração da gravidade e respeita a (15) definida em [14], com valor de aproximadamente 1248,80m. A condição de parada é determinada por (16), que significa que quando xat ≤ 0 e yat ≤ 0, a aeronave deve parar. O ângulo de guinada desejado é calculado por meio de (17): O sinal de erro a ser enviado para o PID é indicado por (18): Em que ψn é o ângulo ψ normalizado entre [−π, π]. Trajetória Circular: Dados o ponto a ser sobrevoado → wp e o raio de convergência K, a referência para a trajetória circular é dada pelo vetor unitário →r : Emprega-se o mesmo algoritmo utilizado na trajetória retilínea com os vetores ~p e ~t definidos por (20) e (21): em que ~r⊥ é o vetor unitário perpendicular ao vetor ~r. Foram realizadas simulações com as trajetórias retilínea (partindo do ponto (0m,0m) e indo para o ponto de tangência do círculo com centro em (4000m,-800m) e raio K, e circular (ao redor deste ponto) com os modelos linear e não-linear. A trajetória retilínea juntamente com a circular está ilustrada na Fig. 10. Na Fig. 10 a aeronave parte do ponto (0m,0m) com ângulo de guinada inicial (ψ0) de 90°. Em seguida , a aeronave se desloca para o ponto (4000m,600m), ponto de tangência com a circunferência de centro (4000m,-800m), durante aproximadamente 190 s para o modelo não-linear e 71 s para o modelo linear. Após este deslocamento, a aeronave Cessna realiza um sobrevoo (uma volta) ao redor do ponto (4000m,-800m) com raio K e chega ao fim do sobrevoo com 282 s para o modelo não-linear e 202 s para o modelo linear. De acordo com a Fig. 10, verifica-se que as malhas de estabilização, guiamento e geração de trajetória estão operando adequadamente para o modelo não-linear. A diferença entre as trajetórias circulares se deve ao desacoplamento existente no modelo linear e inexistente no não-linear. Estes comportamentos diferenciados são justificados também, devido à inexistência do controle do modo longitudinal.  V. Controle da Missão  A modelagem da Missão foi realizada na forma de um Sistema Híbrido [6], o qual está ilustrado na Fig. 11. Na Fig. 11 existem alguns Controladores Contí- nuos(C1,...,Cn), nos quais se encontram os comandos para cada etapa da missão. Há uma chave, a qual é ativada sucessivamente mediante um comando da Dinâmica Discreta, em que é realizada a Seleção do Modo. Em seguida existe o bloco da Dinâmica Contínua Física, onde estão os blocos completos do modo lateral, estabilização, guiamento e geração de trajetória. Por fim, o bloco de Detecção de Eventos, que representa a condição de mudança de modos. O bloco Dinâmica Discreta contém uma máquina de estados, onde se encontram as etapas da missão. Supõe-se que o sistema híbrido permaneça estável ante aos chaveamentos e que não ocorram comportamentos espúrios do tipo Zeno [6]. Foi realizado uma simulação de missão completa conforme a descrição a seguir: a aeronave deve sair do ponto (0m,0m) até o ponto (10000m,0m), em seguida ir para o ponto (10000m,-10000m) e sobrevoar este ponto com raio K durante 300 s, a seguir o VANT deve ir para o ponto (0m,-10000m) e por fim retornar para o ponto (0m,0m). O estudo de caso, implementado no ambiente MATLAB/Simulink está ilustrado na Fig. 12. O bloco dinâmica discreta, implementado utilizando-se o Stateflow, é mostrado na Fig. 13. Portanto é notório verificar que os modelos não-linear e linear executaram adequadamente a trajetória estabelecida, com os desvios já esperados devido à inexistência do controlador do modo longitudinal e também pelo fato do modelo não-linear ser mais lento que o modelo linear. VI. Conclusões ˜ Desta forma, este trabalho teve como principal contribuição a integração da modelagem com o controle, de uma aeronave de asas fixas (Cessna Skylane 182), na simulação de uma missão usando sistemas dinâmicos híbridos para posterior aplicação no Planejamento e Controle de Missões. Neste trabalho foi utilizado somente o modo látaro-direcional, considerando que há um efetivo controle no modo longitudinal. As limitações deste trabalho foram no sentido da não abordagem do controle do modo longitudinal, daí a discrepância na trajetória circular dos modelos linear e não-linear. Pode-se inferir também a não modelagem da influência do vento e do consumo de combustível, necessárias para a parte externa de caracterização do contexto operacional. E como perspectivas para trabalhos futuros sugere-se a validação do modelo em simuladores de voo, como o Flight Gear [20] ou na plataforma experimental existente no CTEx [11].  "
}