{
    "id": 176,
    "titulo": "pré-processamento de imagens aéreas aplicado à navegação autônoma",
    "autor": "mateus habermann, rodrigo arnaldo scarpel e élcio hideiti shiguemori",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2010/st/XIV_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": " No que tange ao emprego militar, é de bom tom que os veículos aéreos não-tripulados ajam de maneira furtiva e independente do GPS ― pois os sinais deste podem ser bloqueados. Dessa forma, uma boa alternativa é pautar a navegação de tais veículos em processamento de imagens. Baseado nisso, uma das necessidades é a implementação de um algoritmo de pré-processamento de imagens, dividindo-as em área urbana e área não-urbana para que aplicações pósteras possam ser efetuadas. Utiliza-se o método de geração de agrupamentos não-hierárquico k-médias para a obtenção das referidas áreas.",
    "texto": " I. INTRODUÇÃO Um veículo aéreo não-tripulado (VANT), como o próprio nome diz, prescinde do uso do elemento humano a bordo. Assim, tal equipamento se mostra muito pertinente em operações que apresentem alto risco de morte à tripulação. Voos que atrelam tais perigos são, na maioria das vezes, de caráter militar; podendo-se aqui citar as missões de reconhecimento aéreo. Em tais atividades os VANTs precisam navegar a distâncias em que um operador em solo, provavelmente, os perderia de vista; ou mesmo ser operados em cenários em que as ondas de radiofrequência emitidas pelo controlador fiquem fora do alcance da antena ou possam ser bloqueadas pelo inimigo. Dessa forma, faz-se mister que um VANT possua capacidade de efetuar sua navegação de maneira autônoma. Essa autonomia é facilmente alcançada por meio do uso de GPS (Global Positioning System), porém, como é sabido, a concessão de seu uso pode, a qualquer momento, ser negada por parte de seus criadores, o que inviabilizaria a navegação do veículo em questão. Então, no intuito de contornar esse problema, em vez do uso de GPS, uma possível solução é o uso, por parte dos VANTs, de processamento de imagens para navegar. O presente trabalho aborda um tema de pesquisa para a navegação autônoma de um veículo aéreo não-tripulado baseada em imagens processadas em tempo-real. Tal estudo faz uso de dois algoritmos: um designado a detectar padrões em áreas urbanas; e outro que executa a mesma atividade, porém em áreas não-urbanas. Visando a melhorar o desempenho de um sistema de visão computacional, é de bom alvitre que haja um pré- processamento de imagens, o qual aloque cada algoritmo anteriormente citado a porções de sua competência nas imagens. Tal pré-processamento é proposto neste artigo, com o método k-médias [1]. Encontra-se na literatura um trabalho que realiza um pré- processamento em imagens para que um subsequente algoritmo de detecção e descrição de características apresente um melhor desempenho. Neste caso, o pré-processamento consiste de algoritmos de restauração de imagens por meio de filtros nos domínios espacial e frequencial [2]. O objetivo do presente artigo é realizar um pré- processamento em imagens aéreas, segregando-as em área urbana e área não-urbana. Assim, na seção II apresenta-se um resumo da navegação autônoma por imagens, ressaltando a importância de tal expediente. A seção III explica conceitualmente o pré- processamento; e, ainda, sua finalidade no presente trabalho. Encontra-se, na seção IV, uma breve explanação sobre algumas técnicas de agrupamento existentes, dando, naturalmente, destaque ao método k-médias, o qual é utilizado na seção V para a obtenção dos resultados aqui exibidos. Estes são apresentados na seção VI, onde há, inclusive, a citação de problemas encontrados pelo algoritmo. Finalmente, é exposta uma conclusão do trabalho, destacando-se sua importância e resultados. II. NAVEGAÇÃO AUTÔNOMA POR IMAGENS A tarefa de se determinar a posição e a atitude de uma aeronave tem sido, muitas vezes, desempenhada pelo GPS e o sistema inercial [3] [4]. Porém, o sinal oriundo dos satélites do sistema de GPS pode sofrer interferência, devido a certas características do ambiente em que se encontra a aeronave. Além disso, esse mesmo sinal pode ser bloqueado. Em ambas as situações, a navegação da referida aeronave estaria seriamente prejudicada. De maneira semelhante, o uso de sensores que emitem ondas eletromagnéticas no intuito de mapear a região voada não é uma alternativa plausível, visto que a característica furtiva do veículo aéreo em questão é malograda [5]. Uma solução viável para esse problema é aplicar sensores baseados em visão computacional, pois esses provêm informações sobre o local sobrevoado e, além disso, é possível efetuar correções no sistema inercial embarcado, já que este possui erro acumulativo [6]. III. PRÉ-PROCESSAMENTO O pré-processamento de imagens, em sua essência, é parte integrante ― porém, não obrigatória ― de um conjunto de etapas que constituem um processo de Reconhecimento de Padrões [7]. A Fig. 1 ilustra essas etapas normalmente seguidas; destacando, em caixa sombreada, o pré- processamento. O pré-processamento de imagens proposto neste trabalho visa a dividir a imagem captada pelo VANT durante sua navegação em dois grupos, a saber: área urbana e área nãourbana, visando a facilitar a identificação do local sobrevoado pelo VANT. A razão disso baseia-se no fato de se poder utilizar um algoritmo de reconhecimento de padrões para cada região destacada. IV. MÉTODOS PARA GERAÇÃO DE AGRUPAMENTOS Gerar agrupamentos, estatisticamente falando, significa dividir os elementos de uma amostra ― ou população ― de forma que os integrantes de cada grupo sejam similares entre si, em relação às variáveis consideradas. Basicamente, há três técnicas para se gerar agrupamentos: hierárquicas, não-hierárquicas e método da mistura [8]. Quando os agrupamentos são formados pelo método hierárquico, parte-se do princípio que cada elemento da amostra é um conglomerado isolado. Em cada passo do algoritmo elementos similares entre si são agrupados ― método aglomerativo ―, até que na etapa final todos eles são considerados um único grupo [9]. Obviamente, os estágios finais e iniciais do algoritmo não são desejáveis. Assim, existem métodos para se definir a quantidade ótima de agrupamentos [10]. O dendrograma, conforme exemplificado na Fig. 2, é uma maneira muito eficaz de se visualizar os agrupamentos gerados pelo método hierárquico. A Fig. 2 evidencia a existência de dois grupos em relação a certo conjunto de dados, e tal informação não é previamente conhecida. Quando se sabe, de antemão, a quantidade de agrupamentos contidos numa amostra, os métodos de agrupamento não-hierárquicos são utilizados no intuito de se descobrir quais elementos da amostra pertencem a cada grupo. Para a alocação dos elementos aos grupos, os métodos não-hierárquicos buscam a maior semelhança interna nos grupos e maior disparidade entre esses. Esses métodos são, geralmente, iterativos. Além disso, eles não são aglomerativos, o que significa que dois elementos inicialmente pertencentes ao mesmo grupo podem não mais o ser ao final do processo; assim, não é possível gerar dendrogramas [10]. Como exemplo de método não-hierárquico, cita-se o kmédias. O método k-médias, que é muito utilizado em problemas práticos, aloca cada elemento amostral ao agrupamento cujo centroide for o mais próximo daquele. Objetiva-se, com o k-médias, minimizar a soma de quadrados dentro dos agrupamentos. Algebricamente, tem-se: onde: k é o número de agrupamentos definido a priori; x é o valor de cada observação, sendo este um vetor real; ci é o centroide das observações em um determinado agrupamento; e si é o conjunto de observações em cada um dos k agrupamentos e S = {s1, s2, ..., sk}. Originalmente, o método é composto por quatro passos: • Escolhem-se k centroides, chamados de sementes, para se iniciar o processo de partição; • Cada elemento do conjunto de dados é comparado com cada centroide inicial, por meio de uma medida de distância. O elemento é alocado ao grupo cuja distância for a menor; • Depois de se aplicar o segundo passo em todos os elementos, recalculam-se os valores dos centroides para cada novo grupo formado, e repete-se o segundo passo, considerando os novos centroides; e • Os segundo e terceiro passos devem ser repetidos até que não haja mais mudança nos centroides. V. PRÉ-PROCESSAMENTO DE IMAGENS AÉREAS Das imagens captadas em voo são extraídos alguns atributos. São eles: média dos valores dos píxels; entropia; gradiente na direção do eixo x; e gradiente na direção do eixo y. Assim, em (1) xj e ci são vetores reais de 4 dimensões. Ressalta-se que outros dados (variância e desvio-padrão) foram extraídos para análises, porém o conjunto de atributos que melhor efetua a estratificação das imagens é esse mencionado no início do presente parágrafo. Tais dados são obtidos a partir de uma janela de tamanho 61x61, na qual o elemento central armazena os valores calculados. As janelas são espaçadas de 10 em 10 píxels. Diferentes valores para as janelas foram utilizados (janelas menores e maiores), porém o tamanho que melhores resultados proporcionou é 61x61 píxels. Após a obtenção da matriz com os dados computados, procede-se à divisão da imagem em dois agrupamentos usando o k-médias, método escolhido por ser nãosupervisionado. Detalhando o algoritmo, inicialmente as sementes, que são duas, são geradas, no presente trabalho, de maneira aleatória. Iterações são realizadas até que não haja mais mudança nos centroides. Após isso, cada observação é atribuída ao agrupamento correspondente ao centroide mais próximo, de acordo com a distância euclidiana. Por restrições inerentes ao método empregado, somente imagens que possuem concomitantemente áreas urbanas e não-urbanas são utilizadas. Obviamente, imagens com apenas um tipo de área não são corretamente segmentadas pelo algoritmo. VI. RESULTADOS E DISCUSSÕES No intuito de se melhor demonstrar os resultados obtidos na geração dos dois agrupamentos, foram escolhidas algumas imagens (fotos aéreas da cidade de São José dos Campos – SP) que possuem destacadas porções de áreas urbanas e nãourbanas, ou que apresentam certas peculiaridades após processadas. Os dois agrupamentos são gerados a partir de uma imagem digital discretizada em 256 tons de cinza (de 0 a 255), em que o método k-médias é utilizado. Observa-se que, em todas as imagens exibidas a seguir, os pontos verdes correspondem a áreas não-urbanas, e os pontos azuis, a regiões urbanas. Cada ponto destacado (azul ou verde) corresponde a um vetor que contém quatro tipos de informação, discutidos anteriormente. A Fig. 3 é uma foto aérea com áreas urbanas e nãourbanas bem definidas. Nota-se, na Fig. 4, que os pontos azuis e verdes definiram bem as áreas urbanas e não-urbanas, respectivamente. A Fig. 6, apesar de, no geral, discriminar bem os dois tipos de áreas, apresenta uma dificuldade encontrada no algoritmo proposto: as áreas de grandes sombras ― vide Fig. 5 ― são sempre classificadas como sendo área não-urbana, mesmo quando não o são. De maneira geral, o resultado obtido com outras imagens analisadas assemelha-se aos exibidos até agora. A Tabela I apresenta o índice de acertos e erros do algoritmo proposto aplicado a 10 imagens. O índice médio de erros é estimado por: onde: Ie índice de erros; e representa a quantidade de pontos classificados erroneamente; e t é o número total de pontos. Nas imagens exibidas t = 2772. VI. CONCLUSÃO Nos tempos atuais, no que concerne ao emprego militar, são indiscutíveis a urgência e a necessidade de se direcionar recursos e pesquisas aos projetos que envolvam veículos aéreos não-tripulados. Em tais projetos, diferentes maneiras de se guiar um VANT são estudadas mundo afora. Furtividade e independência à tecnologia estrangeira ― cita-se aqui o GPS, para o caso do Brasil ― são aspectos basilares quando o assunto em pauta é o emprego d’armas. Sob essa égide, busca-se desenvolver um VANT que se balize por processamento de imagens de forma automática e embarcada. Este artigo faz parte disso. Assim, foi proposto aqui um algoritmo que realiza um pré-processamento em imagens aéreas, dividindo-as em área urbana e área não-urbana, para que outros algoritmos (não abordados no presente trabalho) processem as imagens em suas áreas específicas. Os agrupamentos foram gerados por meio do método kmédias, e bons resultados foram alcançados (índice de acerto em torno de 95%)."
}