{
    "id": 178,
    "titulo": "regeneração de energia a partir de vibrações usando materiais piezoelétrico",
    "autor": "marcella cristina oliveira chagas, carolina maria do amaral lopes, prof. dr. carlos alberto gallo",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2010/st/P_12.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Com o intuito de produzir sistemas autoalimentados, a regeneração de energia tem sido pesquisada em larga escala. Pesquisas no sentido de aumentar a vida de bateria de sensores eletrônicos sem fio muitas vezes colocados em lugares remotos e de difícil acesso ou ainda equipamentos portáteis usados em lugares onde não há como recarregar suas baterias. Esse trabalho propõe a regeneração de energia a partir de materiais inteligentes como os elementos piezoelétricos, que convertem tensão mecânica em tensão elétrica. A tensão de saída do elemento piezoelétrico é alternada, e sua amplitude pode variar. Por isso é necessária uma interface eletrônica que garanta a compatibilidade de tensão entre o terminal de carga elétrica e do elemento piezoelétrico. Após a energia elétrica ser captada, utiliza-se um circuito derivativo que possa tornar essa energia compatível com os sistemas de armazenamento e posterior utilização. Para tanto, um circuito elétrico retira a tensão gerada pelo material piezoelétrico, depois essa é retificada e a seguir passa pelo conversor DC-DC para que seja obtida uma tensão ideal sem perda de potência.",
    "texto": " I. INTRODUÇÃO O aumento da demanda por sensores eletrônicos, em especial os sem fio, bem como os avanços tecnológicos tem possibilitado a colocação de sensores em praticamente qualquer lugar [1]. Instrumentos de soldados em batalha, ou ainda de aviões que voam grandes percursos podem ficar sem bateria a qualquer momento e a dificuldade de sua substituição tem gerado uma atenção especial para sistemas autoalimentados, em especial os regeneradores de energia. Vale ressaltar ainda a crescente preocupação com o esgotamento das fontes de energia e com o meio ambiente e os impactos que este vem sofrendo. Essa preocupação tem fortalecido a busca por novas fontes de energia, além de trazer os focos de pesquisa para as fontes renováveis e limpas, sem muitos impactos ambientais. A fonte de energia usada para regeneração depende do ambiente onde o dispositivo está inserido, podendo ser solar, ser advinda de variação térmica ou mesmo de vibração mecânica. Dentre as várias formas de conversão de energia de sua matriz energética, os geradores piezoelétricos são capazes de converter energia mecânica, tensão ou ainda vibração em energia elétrica. Por sua capacidade de converter energia mecânica diretamente em energia elétrica, de forma bidirecional [2], esse trabalho propõe seu uso em estruturas que vibram para aproveitar essa energia que seria desperdiçada. A conversão de energia mecânica em energia elétrica através de materiais inteligentes se dá devido à orientação da estrutura molecular piezoelétrica que é de tal forma que o material apresenta uma separação de carga local, conhecido como um dipolo elétrico. Quando a energia de deformação é aplicada ao material resulta em uma deformação do dipolo e a formação de cargas que podem ser removidas do material, conforme Fig 1, por um circuito de derivação e utilizado na alimentação de diversos dispositivos [3]. II. RETIFICAÇÃO A tensão de saída do elemento piezoelétrico é alternada, e não contínua. Sua amplitude depende das dimensões, características e também da vibração mecânica à qual o elemento piezoelétrico está submetido. É necessária uma interface eletrônica para garantir compatibilidade de tensão entre o terminal de carga elétrica e do elemento piezoelétrico. Então, após a energia elétrica ser captada, deve-se lançar mão de um circuito derivativo que possa tornar essa energia compatível com os sistemas de armazenamento e posterior utilização. Assim, um circuito elétrico retira a tensão gerada pelo material piezoelétrico, depois essa é retificada e a seguir passa pelo conversor DC-DC para que seja obtida uma tensão ótima e sem perda de potência. Muitas pesquisas têm buscado eficientes sistemas de regeneração e por isso encontram-se discussões sobre vários tipos de circuitos para captar energia. É percebido que os circuitos vão dos mais simples, a fim de retificar apenas meia-onda, aos mais sofisticados, como os controlados. A Fig 2 mostra um exemplo de retificação convencional (Fig 2a) e um de retificação síncrona (Fig 2b), ambos isolados galvanicamente. Os autores propõem um circuito derivativo de retificação síncrona, com isolação galvânica, a fim de obter maior eficiência na regeneração de energia e proteção da carga. A retificação síncrona é usada em conversores DC/DC, em casos em que a tensão de saida é baixa e a corrente é alta, por serem conversores de alta eficiência. Esses conversores são largamente utilizados também para que a tensão possa ser elevada ou abaixada. Os retificadores síncronos se utilizam de MOSFETs, chaves bidirecionais de potência, para retificar a tensão de saída em vez de diodos. A maior vantagem é que a queda de tensao no MOSFET é muito menor que a queda de tensão através de um diodo, diminuindo assim a perda de potencia. No entanto, para que essa vantagem seja efetivamente constatada os MOSFETS precisam estar acionados durante toda a sua conduçao. Ou seja, aumentar o periodo de conduçao do MOSFET mesmo nos períodos de corte. Além disso, quando MOSEFTs são utilizados para substituir os diodos convencionais em SR (Synchronous Rectifier), o a corrente reversa irá ocorrer em algumas condições específicas. Por exemplo, quando a corrente no indutor de saída de um SR atinge zero e os MOSFETs de retorno ainda não estão desligados, a corrente reversa fluirá através deste MOSFET. Normalmente, a corrente reversa ocorre sob condições de carga leve. No entanto, ela provoca perda de potência considerável. Por exemplo, essa perda de potência irá reduzir a eficiência de produção de 80% para 35% sob condições de carga leve. O gráfico desta simulação é dado pela Fig 4. A retificacao síncrona pode ser feita por dois métodos: a auto-alimentada (self driven) e a alimentada por um circuito externo. Neste último método, é necessário que o circuito gere os pulsos para a porta do MOSFET e um driver para carregar a capacitância da porta do MOSFETs. A tensão com que são conduzidos geralmente é regulada e a faixa de tensão de entrada pode ser bastante grande. Já no auto-alimentado, a energia para acionar o MOSFETs é obtida a partir do transformador e nenhum driver é necessário. Assim, o sistema é muito simples e confiável. No entanto, ele também tem alguns inconvenientes. A tensão com que os transistores são conduzidos é variável e depende da tensão de entrada. Não há muitas topologias adequadas para SDSR (retificador síncrono auto-alimentado). As mais adequadas para o uso de SDSR são topologias que comandam o transformador de forma assimétrica, sem tempos mortos: flyback, forward com grampeamento ativo, meia ponte com o controle complementar, etc . A topologia mais utilizada para a aplicação de SRDR é o conversor buck síncrono. É uma topologia bastante simples, a resposta dinâmica é muito rápida, e não tem transformador. Porém, a inexistencia do transformador pode ser um inconveniente em alguns casos, como por exemplo se a tensão de entrada é alta, o duty-ciclo deve ser pequeno mas isso afeta o desempenho do conversor. Além disso, o isolamento galvânico às vezes é mesmo necessário para proteçao da carga, por exemplo. Então, topologias com um transformador são necessários. O comparativo de uma análise inicial é feito com a análise isolada. As análises levam em conta uma entrada variável, a tensão de saída do elemento piezoelétrico. III. CONSIDERAÇÕES Em uma primeira análise, foi simulada fazendo uso apenas de uma ponte retificadora (Fig 3). Uma segunda análise pode ser feita com a configuração descrita na Fig 5. A fonte senoidal foi trocada por um chaveamento. Aqui as simulações se aproximam do sistema real, em especial a proposta pelos autores, isolada galvanicamente. A simulação anterior foi feita com uma situação qualquer para comparar o tipo de retificação. Outra configuração de grande interesse, que faz parte dos trabalhos futuros do autores é a da Fig 7. Nessa há a utilização de elementos de potência controlados.Aqui a simulação é feita de forma auto-alimentada. Se faz desnecessário o uso de uma fonte externa para alimentar o controle dos elementos de potência já que trata-se de regeneração de energia. Com essa configuração de circuito, o gráfico obtido é mostrado na Fig 8. Vale ressaltar que o importante dessa comparação é a verificação da otimização do retificador síncrono, controlado, auto-alimentado. Nota-se que as perdas são mais baixas. IV. TRABALHOS FUTUROS Serão feitos ensaios experimentais para a validação dos modelos de simulação. Com o auxilio de softwares específicos serão analisadas as freqüências naturais de uma determinada viga, para que os experimentos possam ser feitos com otimização mecânica.  "
}