{
    "id": 179,
    "titulo": "rastreamento 3d de alvos com base em medidas de radares 2d",
    "autor": "stiven schwanz dias e edson hiroshi aoki",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2010/st/V_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "A despeito do largo emprego de radares 2D, muitos sistemas de rastreamento de alvos com base em medidas polares (azimute e alcance inclinado) ignoram a diferença entre o alcance inclinado e o alcance no terreno e produzem estimativas das posições dos alvos no plano 2D. Contudo, essa diferença pode ser bastante significativa a ponto de comprometer a qualidade do rastreio. Uma alternativa para mitigar o erro de alcance inclinado e, em determinadas condições, estimar a altitude dos alvos é rastrear os alvos no espaço 3D. Esse trabalho apresenta um método de rastreamento 3D de alvos com base em medidas polares e uma técnica alternativa de iniciação de filtros para esse método.",
    "texto": " I. INTRODUÇÃO Apesar do crescente emprego de radares 3D, radares 2D ainda são largamente utilizados em aplicações de vigilância e de controle de tráfego aéreo. Radares 2D proveem medidas em coordenadas polares: azimute e alcance inclinado. Não obstante, medidas de alcance inclinado contem informação tanto da distância horizontal até o alvo como da altitude do mesmo. Portanto, a princípio, sistemas de rastreio podem tirar proveito disso para estimar a altitude dos alvos. Frequentemente, o erro de alcance inclinado (a diferença entre o alcance inclinado e o alcance no terreno, como mostrado na Fig. 1) é negligenciado e o rastreio é realizado no plano horizontal. Contudo, o erro de alcance inclinado pode ser bastante significativo. Por exemplo, um alvo a 10.000 metros de altitude a uma distância de 25 quilômetros do radar produzirá uma medida com erro de alcance inclinado de cerca de 2.000 metros. Muitos sistemas de rastreamento utilizam medidas provenientes de múltiplos sensores para corrigir erros de alcance inclinado. No caso de medidas polares provenientes de múltiplos sensores 2D, o alcance no terreno pode ser calculado por meio de métodos geométricos como triangulação e trilateração. No entanto, tais métodos são bastante limitados, uma vez que: 1) só podem ser utilizados nas regiões de intersecção da cobertura dos sensores; 2) requerem medidas síncronas; 3) não utilizam informação estatística sobre o estado dos alvos e sobre as medidas, o que pode, na presença de ruído de processo e de medida, incorrer em grandes erros no cálculo do alcance no terreno. Em [1], é apresentado um método geométrico para estimativa de altitude de pistas existentes a partir de medidas de um único radar 2D. No entanto, este método não se beneficia do uso de múltiplos sensores e também não considera os ruídos de medida e de processo. A dificuldade para lidar com o erro de alcance inclinado é tal que já se afirmou [2] que a única solução para esse problema é empregar radares 3D ou, ainda, inflacionar os parâmetros de filtragem que refletem o erro de medida em alcance. Como as medidas de alcance inclinado possuem informação tanto de alcance horizontal como de altitude, uma solução intuitiva para o problema é realizar o rastreio no espaço 3D, ao invés de realizá-lo no plano horizontal. Adicionalmente, a relação entre as medidas polares e o estado 3D dos alvos é não-linear. Logo, estimativas ótimas ou semi-ótimas requerem técnicas de filtragem não-linear, como o filtro de partículas. Por outro lado, em aplicações típicas de rastreamento de múltiplos alvos on-line, o custo computacional associado à filtragem não-linear pode ser proibitivo devido à alta dimensionalidade da representação 3D do estado dos alvos. Em [3], Aoki propõe um método baseado no HeightParameterized Extended Kalman Filter (HPEKF) [4] que lida com tais não-linearidades e que, em determinadas circunstâncias, produz estimativas de altitude dos alvos com base em medidas de radares 2D. Além disso, Aoki introduz uma técnica robusta de iniciação do seu método que produz estimativas do estado e da matriz de covariância iniciais das pistas. Neste artigo, é avaliada uma técnica alternativa de iniciação do método proposto em [3] baseada em simulações de Monte Carlo. Este artigo está organizado como a seguir. A seção II apresenta sucintamente o método proposto por Aoki em [3] para estimativa de altitude e mitigação do erro de alcance inclinado. Em seguida, a seção III introduz uma técnica alternativa de iniciação dos filtros. A seção IV oferece os resultados dos experimentos comparativos entre a técnica de iniciação proposta neste trabalho e a técnica original proposta por Aoki. Por fim, a seção V apresenta as conclusões e traz sugestões de trabalhos futuros. II. ESTIMATIVA DE ALTITUDE E MITIGAÇÃO DO ERRO DE ALCANCE INCLINADO Nesta seção, é apresentado o método proposto em [3] para mitigar o erro de alcance inclinado inerente às medidas de alcance produzidas por radares 2D e produzir estimativas de altitude dos alvos rastreados. A. Rastreamento 3D em Coordenadas Geodésicas com base em Medidas Polares Modelar trajetórias dos alvos diretamente em coordenadas geodésicas é vantajoso, uma vez que: 1) teoricamente, permite descrever rotas loxodrômicas e ortodrômicas com precisão e 2) não requer a seleção de uma origem para o sistema de coordenadas, o que é conveniente para um sistema com múltiplos sensores. Por outro lado, descrever modelos de dinâmica de alvos diretamente em coordenadas geodésicas é uma tarefa difícil. Uma solução é adaptar os modelos de dinâmica descritos em coordenadas cartesianas, como aqueles presentes em [5]. Para tanto, adotou-se uma representação híbrida do estado X = [ ẋ  ẏ h]T , na qual a posição é representada em coordenadas geodésicas (latitude,  longitude e h altitude) e as velocidades são representadas em coordenadas cartesianas locais relativas à posição do alvo. Um vetor arbitrário v = [vx vy vz]T em coordenadas cartesianas locais relativas à posição do alvo pode ser convertido para coordenadas geodésicas por meio da seguinte transformação: onde as coordenadas cartesianas x, y seguem a convenção NE (North, East), e M() e N() são respectivamente os comprimentos de arco em latitude e em longitude, dados por: onde a e b representam o semi-eixo maior e menor do elipsóide de referência , respectivamente. De posse de (1), obtém-se a seguinte representação em coordenadas geodésicas do modelo de Velocidade Constante (Constant Velocity, CV) descrito em [5]: onde S x, Sy e Sz são os ruídos de processo nas direções x, y e z, respectivamente, e T é o tempo de amostragem. Essa abordagem possui duas desvantagens decorrentes da dependência dos comprimentos de arco em relação à . Em primeiro lugar, o ruído de processo k é correlacionado com o estado do alvo Xk = [k ẋk k ẏk hk]T. Depois, Xk+1 é uma função não-linear de Xk. Logo, não é possível realizar predições ótimas com esse modelo por meio de técnicas lineares. Por outro lado, para pequenas distâncias, a variação dos comprimentos de arco com a latitude é quase desprezível. Assim, espera-se que, nessas condições, seja possível utilizar filtros do tipo Extended Kalman Filter (EKF) ou do tipo Unscented Kalman Filter (UKF) para realizar predições com esse modelo de maneira aproximadamente ótima. B. Passo de Predição Em seu trabalho, Duan et al. [6] sugere utilizar um filtro UKF para realizar o passo de predição num processo de rastreio em coordenadas geodésicas. Por outro lado, Aoki constatou que, para o modelo de dinâmica adotado, é mais eficiente utilizar um filtro EKF no passo de predição, visto que o cômputo do Jacobiano da função de transição de estados em coordenadas geodésicas é mais rápido do que realizar a decomposição de Cholesky das covariâncias de processo e de rastreio requeridas pelo UKF. Para o modelo CV descrito em (2), o Jacobiano da função de transição de estados é dado por: C. Passo de Atualização A implementação do passo de atualização do filtro EKF requer o cômputo do Jacobiano da transformação existente entre o espaço de estados (em coordenadas geodésicas) e o espaço de medidas (em coordenadas polares). Aoki, em seu trabalho, utiliza um procedimento de três passos composto por: 1) conversão de coordenadas geodésicas para coordenadas Earth-Centered Earth-Fixed (ECEF), 2) conversão de coordenadas ECEF para coordenadas cartesianas locais (origem no sensor) e 3) conversão de coordenadas cartesianas locais para coordenadas polares. Dessa forma, o Jacobiano H é dado por: ainda, H1, H2 e H3 são os Jacobianos dos passos 1, 2 e 3, respectivamente. O Jacobiano da conversão de coordenadas geodésicas para ECEF é dado por: onde [ h]T é a posição predita do alvo (o subíndice k|k+1 foi omitido por conveniência), e é a excentricidade do elipsóide de referência e: O Jacobiano da conversão de coordenadas ECEF para coordenadas cartesianas locais é dado por: onde S e S correspondem à latitude e à longitude da posição do radar, respectivamente. Aqui, assume-se que as coordenadas cartesianas locais seguem a convenção EN (East, North). Finalmente, o Jacobiano da conversão de coordenadas cartesianas locais para coordenadas polares é dado por: onde [x y z]T é a posição predita do alvo convertida para coordenadas cartesianas locais. D. HPEKF Em [3], é proposto um filtro AMM com múltiplos filtros em paralelo, cada um utilizando vetores de estado em coordenadas geodésicas e medidas em coordenadas polares, similar ao filtro HPEKF original proposto em [6]. O estado inicial é representado por uma mistura de Gaussianas como N componentes, cada qual, correspondendo a um subintervalo de altitude [hi, hi+1], i = 1, 2, ..., N do intervalo que vai de [h1, hN+1] de possíveis altitudes. No entanto, ao contrário do HPEKF original, na qual a partição em subintervalos e a iniciação de cada componente são feitas de forma heurística, cada componente é iniciada se calculando diretamente a média e a variância condicionada à medida inicial e ao subintervalo de altitude, ou seja:  onde Z0 é a medida inicial. O método aproximado para o cálculo de (9) e de (10) é apresentado por Aoki em [3]. Por fim, a média e a covariância da mistura são dadas por: onde wi 0 , o peso inicial atribuído a cada componente, é dado pela probabilidade a priori de cada subintervalo: O particionamento em subintervalos pode ser arbitrário, desde que as probabilidades a priori P({hi h<hi+1}) de cada subintervalo sejam corretamente ajustadas. Na prática, é desejável aumentar o número de subintervalos em regiões onde se deseja maior precisão. Depois de iniciados, as estimativas e os pesos de cada componente são atualizados de acordo com o AMM padrão. Vale destacar que os filtros de cada componente são idênticos, diferindo apenas nas condições iniciais. III. TÉCNICA ALTERNATIVA DE INICIAÇÃO DOS FILTROS A Fig. 2 mostra um alvo A voando a uma altura h' desconhecida. Como não há informação a priori sobre h' além dos limites de altitude mínimo e máximo, assume-se que h' seja uma v.a. uniformemente distribuída no subintervalo de altitude {hih<hf} com base no princípio da máxima entropia, i.e. h' ~ U(hi, hf). Ainda na Fig. 2, (θ', ι', r') é a posição real do alvo A em coordenadas esféricas (θ azimute, ι elevação e r alcance) relativas à posição do radar S que, por sua vez, está a uma altura hS. A medida inicial Z0 = [θm rm]T em coordenadas polares produzida por S está relacionada à posição real do alvo por meio das seguintes relações: onde~ ~ N(0,2) e ~r ~ N(0,r2) correspondem aos erros de medida em azimute e em alcance, respectivamente. Não obstante, na Fig. 2, as altitudes hi e hf estão relacionadas respectivamente às altitudes locais zi e zf em coordenadas cartesianas locais (referencial no radar) de acordo com:  onde rm  ~r  rm visto que, no geral, ~r  rm e ES, o raio do elipsóide de referência na posição do radar, é dado por:  Em contraste à abordagem seguida por Aoki, nesse trabalho, o estado e a covariância iniciais são calculados por meio de simulações de Monte Carlo. Para tanto, são criadas M amostras em torno da medida inicial Z0. Cada amostra S(k), k = 1, 2, ..., M, é uma hipótese acerca da posição real do alvo e é caracterizada pela tripla (θk, ιk, rk). O azimute θk, e o alcance rk são gerados a partir do seguinte par de relações: onde ~k e ~rk são tomados aleatoriamente das distribuições normais N(0,2) e N(0,r2) , respectivamente. A elevação ιk é gerada a partir da relação:  onde zk é calculado a partir de hk – tomado aleatoriamente da distribuição uniforme U(hi, hf) – conforme (14), considerando a distância até a amostra rk no lugar de rm  ~r . A posição de cada amostra S(k) em coordenadas cartesianas locais (referencial do radar) pode ser obtida, então, como a seguir: Em seguida, a posição de cada amostra é convertida de 1) coordenadas cartesianas locais, C, para coordenadas ECEF e 2) de coordenadas ECEF para geodésicas, G. Por fim, as estimativas da posição e da covariância iniciais em coordenadas geodésicas são calculadas de acordo com as expressões: As componentes de velocidade do vetor de estados podem ser iniciadas por meio de técnicas existentes, como aquelas descritas em [6]. Em especial, neste trabalho, adotou-se a iniciação com um ponto admitindo velocidade inicial nula para cada componente i, de sorte que: onde Vxymáx é a máxima velocidade esperada para o alvo no plano xy. Esse processo é repetido em cada subintervalo de altitude para iniciar as N componentes do HPEKF. Nesse caso, os pesos iniciais de cada componente são iguais, ou seja: IV. EXPERIMENTOS A. Cenários Empregados Foram considerados dois cenários (Fig. 2) com radares 2D e alvos manobráveis a fim de se comparar a técnica de iniciação proposta neste trabalho com a técnica original proposta por Aoki em [3]. Para tanto, calculou-se – por meio de simulações de Monte Carlo – os erros RMS na estimativa de altitude e da posição no plano horizontal do alvo introduzidos por cada técnica de iniciação. Ao todo, foram realizadas 250 execuções de Monte Carlo para cada cenário. Em cada execução, variou-se a altitude do alvo, distribuída uniformemente de zero a 10.000 metros. A Fig. 2 apresenta a trajetória simulada do alvo, bem como a posição do radar em cada cenário. O primeiro cenário possui um alvo voando próximo ao radar, o que incorre em erros de alcance inclinado devido à proximidade. O segundo cenário possui um alvo voando distante do radar, o que, por sua vez, implica em erros de alcance inclinado devido à curvatura da Terra. Os desvios padrão dos ruídos de medida são  = 0.15º em azimute e r = 46.3m em alcance. Nas simulações, utilizou-se um tempo de amostragem T = 0.5s. Além disso, as variâncias dos ruídos de processo foram ajustadas para Sx = 1, Sy = 1 e Sz = 10-2. Por fim, adotou-se que V m s xymáx  300 / . B. Resultados das Simulações Os resultados das simulações com o primeiro cenário são mostrados na Fig. 4. A figura mostra a evolução do erro RMS na estimativa da posição xy e da posição z do alvo ao longo do tempo de simulação de 300s. Nas legendas, O-HPEKF é o resultado obtido com a técnica de iniciação original proposta por Aoki e N-HPEKF é o resultado obtido com a técnica de iniciação proposta neste trabalho. Ambos os resultados foram obtidos utilizando cinco filtros EKF paralelos, i.e. N = 5, de sorte que o intervalo de altitude de 0 a 10.000m foi dividido em intervalos iguais de 2.000m. Por fim, vale destacar que foram utilizadas M = 10.000 amostras de Monte Carlo na abordagem N-HPEKF. Como pode ser visto na Fig. 4, o erro RMS na estimativa da posição xy e na estimativa da posição z do alvo diminuem ao longo da simulação do primeiro cenário, independente da técnica de iniciação utilizada. Portanto, para o primeiro cenário, o O-HPEKF e o N-HPEKF foram capazes tanto de mitigar o erro de alcance inclinado como de estimar corretamente a altitude do alvo. Adicionalmente, a Fig. 4 mostra que a nova técnica de iniciação proporciona erros RMS ligeiramente inferiores no início da simulação. A Fig. 5 oferece os resultados das simulações com o segundo cenário. A Fig. 5 mostra um resultado já constatado por Aoki em [3], o método HPEKF não é capaz de estimar a altitude no segundo cenário devido à baixa observabilidade do alvo – baixa variabilidade das medidas polares tanto em distância como em azimute – ao longo da simulação. Na Fig. 5, também é possível verificar que os erros RMS na estimativa da posição xy produzidas pelo O-HPEKF e pelo N-HPEKF evoluem da mesma forma. Logo, embora pouco efetivas em termos de estimação de altitude, as duas abordagens são equivalentes em termos da mitigação do erro de alcance inclinado nesse cenário. Por outro lado, o erro inicial da estimativa de altitude do O-HPEKF foi um pouco maior, o que é atribuído às linearizações presentes na técnica original de iniciação proposta em [3]. V. CONSIDERAÇÕES FINAIS Neste trabalho, foi apresentada uma técnica baseada em simulações de Monte Carlo para iniciação dos filtros empregados no método HPEKF. Os resultados mostram que, para os cenários estudados, a técnica de iniciação introduzida nesse trabalho produz erros de estimativa de posição menores ou iguais aos erros gerados pela técnica original de iniciação proposta por Aoki. Como trabalho futuro, sugere-se estudar abordagens de Monte Carlo sequenciais para lidar com o problema de mitigação do erro de alcance inclinado e de estimativa de altitude.  "
}