{
    "id": 180,
    "titulo": "efeito da adição de co e cu na absorção de microondas de compósitos de ba2zn2fe12o22 com resina epóxi",
    "autor": "roberto da costa lima, magali silveira pinho, julio cesar dos santos leandro, camila machado dias e tsuneharu ogasawara",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2010/st/VIII_2.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "A pesquisa de materiais com propriedades magnéticas e dielétricas adequadas ao uso como absorvedores de radiação eletromagnética é de grande importância para a área de Defesa Nacional. A crescente necessidade de materiais absorvedores de radiação eletromagnética (MARE) surgiu em decorrência do grande aumento no número de sistemas eletrônicos, resultando em um aumento da interferência eletromagnética (EMI, Electromagnetic Interference) e/ou do emprego destes na redução da seção reta radar (RCS, Radar Cross Section) de plataformas militares. Neste trabalho, estudou-se o efeito da adição de Co e Cu na temperatura de calcinação e na absorção de microondas de compósitos de Ba2Zn2Fe12O22 com resina epóxi. Os compósitos ZnCo e CuCoYhexaferrita:epóxi (80:20) atuaram como MARE do tipo banda larga para a faixa de freqüência de 8,0 a 12,0 GHz (banda X), enquanto que o compósito ZnCu apresentou comportamento ressonante em aproximadamente 8,5 GHz.",
    "texto": " I. INTRODUÇÃO O emprego de materiais absorvedores de microonda, em particular os materiais absorvedores de radiação eletromagnética (MARE) tornou-se um dos campos mais fascinantes da engenharia de materiais embora ainda represente um grande desafio [1]. Um MARE é constituído por compostos, com elevada perda de energia, que absorvem a radiação incidente em freqüências sintonizadas e dissipam a energia absorvida sob a forma de calor, inibindo a energia necessária para o sinal de eco de detecção por radar [1]. Materiais absorvedores de radar são utilizados como recobrimentos cujas propriedades elétricas e magnéticas foram alteradas de forma a permitir absorção de microondas em freqüências discretas ou em amplo espectro de freqüência. A incorporação de uma ferrita como aditivo magnético à matriz polimérica tem constituído tema de estudo de renomados centros de pesquisa, a nível nacional e internacional. As ferritas são utilizadas em aplicações de micro-ondas porque elas interagem com a componente magnética da radiação eletromagnética para produzir perdas e mudanças de fase, que podem variar com o campo magnético externo e com a freqüência [2]. Dentre as ferritas utilizadas como MARE, as ferritas hexagonais do tipo Y são excelentes materiais para aplicação na área de micro-ondas devido à anisotropia magnetocristalina planar e elevado valor de permeabilidade inicial [3] II. EXPERIMENTAL Um pó ultra fino de Ba2Zn2Fe12O22 hexaferrita foi sintetizado pelo método de autocombustão do precursor citrato (so-gel), utilizando os seguintes produtos de partida com grau de pureza PA: Fe(NO3)3.9H2O, Ba(NO3)2, Zn(NO3)2.6H2O ácido cítrico monohidratado em razões estequiométricas, segundo o diagrama de blocos ilustrado pela Fig. 1. A mistura foi aquecida a 70 oC com posterior adição gota a gota de amônia até pH=7,5, para subseqüente precipitação do complexo organometálico. A solução foi então aquecida a 80 oC para produção do gel com elevada viscosidade. Este gel foi levado a secura em rotoevaporador e posteriormente aquecido a aproximadamente 250 oC, resultando em reação de autocombustão. Como resultado, foi obtido um pó ultra fino que foi calcinado em diversas temperaturas por 4 h com taxa de aquecimento de 10 oC/min. De forma análoga, foram obtidas as demais hexaferritas (Ba2ZnCuFe12O22, Ba2ZnCoFe12O22 e Ba2CuCoFe12O22). Os diferentes tipos de Y-hexaferritas de bário foram incorporados a uma matriz epoxídica na proporção em massa 80:20 (Y-hexaferrita de bário:resina epóxi). Alguns autores relatam a utilização desta proporção como sendo a ideal, para a conformação de artefatos poliméricos com bom desempenho como MARE (refletividade inferior a -10 dB) [4]-[5]. A mistura dos componentes para confecção dos compósitos poliméricos foi efetuada, em vidro de relógio, adicionando-se a resina epóxi e o catalisador à Y-hexaferrita de bário. Esse material foi exaustivamente homogeneizado com espátula e conformado em molde de aço, sendo posteriormente prensado a 431 kgf/cm2 e seco em estufa a 40 oC/2h. Na Fig. 2 é possível a visualização de alguns corpos de prova para a caracterização eletromagnética. A técnica de medida utilizada foi a de linhas de transmissão, conhecida também como Método de Transmissão /Reflexão (T/R), conduzida em guia de ondas com características não ressonantes, dispersão integral e medição por duas portas. Neste método a amostra retangular é acomodada em uma seção de guia de onda e os parâmetros de espalhamento são medidos no analisador vetorial de redes HP 8510C [5]-[7]. III. RESULTADOS Os pós das Y-hexaferritas de bário obtidos pelo método de autocombustão do gel de citrato foram submetidos à análise de difração de raios-X (XRD). As Figs. 3 e 4 apresentam os resultados das análises para os pós da Zn2Yhexaferrita e Cu2Y-hexaferrita de bário. Na Fig.4 é possível observar, por intermédio dos difratogramas das Cu2Y-hexaferritas de bário obtidas em diferentes temperaturas, que a formação da fase cristalina da Y-hexaferrita de bário origina-se das ferritas do tipo espinélio e da hexaferrita do tipo M e que na temperatura de 900 oC ocorreu a formação desta fase cristalina[8]. Bai e colaboradores [7], afirmam que a adição do cátion Cu2+ na Y-hexaferrita de bário, reduz a temperatura de formação da fase cristalina de Cu2Y-hexaferrita de bário, corroborando os resultados obtidos pela análise de difração de raios –X. A Fig. 5 ilustra o desempenho dos compósitos como MARE. O compósito que apresentou a melhor atenuação foi o ZnCuY-hexaferrita de bário:epóxi com espessura de 4,0 mm, cujo valor de refletividade foi de –30,7 dB para a freqüência de 8,7 GHz, indicando que 99,98% da onda eletromagnética incidente foi atenuada. O compósito formado pela ZnCoY-hexaferrita de bário com 3,0 mm na freqüência de 10,8 GHz apresentou refletividade de –15,4 dB, que corresponde a uma atenuação de 97,12% da onda eletromagnética incidente. Já o compósito formado pela CuCoY-hexaferrita de bário também com 3,0 mm apresentou refletividade de -14,12 dB na freqüência de 10,4 GHz, que corresponde a uma atenuação de 96,13%. IV. CONCLUSÕES Pelo emprego da técnica de difração de raios-X foi possível observar a redução de 50 oC na temperatura de calcinação da Cu2Y-hexaferrita de bário. Em função do substituinte utilizado (Cu e/ou Co) foram obtidos MAREs dos tipos banda larga e ressonante, com espessuras variáveis de 3,0 a 4,5 mm. "
}