{
    "id": 181,
    "titulo": "aplicação da elint no aprimoramento de sistemas mage",
    "autor": "ricardo marzullo de britto e sergio rodrigues neves",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2010/st/II_3.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": " Este artigo descreve o uso da ELINT (Electronic Intelligence - inteligência eletrônica) técnica na atualização e aperfeiçoamento dos algoritmos de deinterleaving (desembaralhamento) de emissores. Esse tipo de ELINT fornece os parâmetros primários dos pulsos, tais como: largura de pulso, amplitude, frequência, ângulo de chegada e tempo de chegada, antes de serem submetidas aos algoritmos de deinterleaving e classificação do equipamento. Para demonstrar essa possível aplicação é proposto um método de deinterleaving, alternativo ao utilizado atualmente pela maioria dos equipamentos MAGE existentes no mercado.",
    "texto": "I. INTRODUÇÃO A inteligência de sinais (SIGINT) é um ramo do conhecimento dentro da guerra eletrônica que diz respeito à utilização dos sinais no aspecto tático ou técnico. Dependendo das características do sinal, ela pode ser classificada como: . Inteligência de comunicações (COMINT) – se utiliza de toda a classe de comunicações conhecidas tais como o telefone, radio e internet. Inteligência eletromagnética ou eletrônica (ELINT) – se utiliza de sinais do espectro eletromagnético que não pertencem às comunicações tais como de radar e de IFF (identifier friend or foe). . Inteligência telemétrica (TELINT) – baseada nas informações de telemetria provenientes de mísseis e VANTs (veículos aéreos não tripulados). A ELINT [1] inclui informações armazenadas de radares, sinais de bóias ou transponders, jammers, guiagem de mísseis, links de dados, altímetros, IFFs e quaisquer outros possíveis emissores. Alguns autores [2] dividem a ELINT em dois ramos principais: a ELINT técnica e a ELINT operacional. A ELINT técnica descreve a estrutura dos sinais, as suas características de emissão, os modos de operação, as funções dos emissores e a associação destes com radares, bóias, jammers ou sinais de navegação. O principal propósito da ELINT técnica é obter parâmetros dos sinais que possam definir as capacidades e o papel dos diversos emissores. A obtenção dos parâmetros característicos dos emissores subsidia o projeto e o aperfeiçoamento de equipamentos para a detecção destes emissores e de equipamentos de contramedidas eletrônicas. A ELINT operacional se concentra em localizar alvos específicos e determinar os padrões operacionais desses sistemas. Das análises de ELINT operacional são obtidos resultados comumente chamados de ordem de batalha eletrônica (EOB- electronic order of battle). Assim, a ELINT operacional cumpre funções associadas ao contexto tático. O objetivo desse artigo é demonstrar que a ELINT técnica pode ser utilizada não só como fonte de informação no projeto de novos equipamentos, mas também para aperfeiçoar os métodos de deinterleaving e classificação do próprio equipamento que fez as gravações. Este artigo está organizado da seguinte maneira: na seção II são descritas as motivações para o desenvolvimento de um novo método de deinterleaving. Na seção III é apresentada uma comparação entre alguns algoritmos experimentados, dentre eles o método proposto. Na seção IV são feitas as considerações finais e as conclusões. II. DESENVOLVIMENTO Um dos algoritmos de deinterleaving mais comuns em equipamentos MAGE utiliza células de duas dimensões correspondentes aos parâmetros freqüência e ângulo de chegada [3,4]. Cada célula corresponde a uma faixa de freqüências e uma faixa de ângulos de chegada dos pulsos. Essas faixas são definidas em função das distâncias entre as freqüências mais comuns dos radares e da precisão em ângulo do receptor, respectivamente [3,4]. Assim, todos os pulsos detectados que apresentem frequência e ângulo de chegada nestas faixas, formam uma célula. Porém, em uma mesma célula podem ser colocados pulsos de emissores diferentes, desde que apresentem frequência e ângulo de chegada dentro da mesma faixa de tolerância. Além disso, um mesmo emissor, com agilidade (variação intencional no valor dos parâmetros), pode ter seus pulsos distribuídos por mais que uma célula. Conseqüentemente, a separação por células não é suficiente para discriminar os emissores sendo, em geral, necessária uma segunda etapa onde é feita a análise de PRI (pulse repetition interval- intervalo de repetição de pulsos). Esta análise do PRI, que também é um parâmetro que caracteriza bem os diversos emissores, não é feita no início porque o PRI é um parâmetro secundário, pois depende da observação de uma sequência de pulsos, exigindo mais tempo que o processo de separação por células. A análise de PRI se baseia no parâmetro tempo de chegada dos pulsos de cada célula, podendo ser feita através de histogramas das diferenças entre os diversos tempos de chegada [3, 4, 5], para separação e identificação dos trens de pulsos dos diversos emissores. Dependendo do resultado da análise de PRI, a primeira etapa do algoritmo pode ter os tamanhos das células alterados, mudando, por exemplo, as faixas de frequências, de forma a unir grupos adjacentes. Assim, pulsos de um mesmo emissor que estejam em células diferentes podem ser colocados em uma única célula. Após o processo de deinterleaving, é feita também uma análise de varredura, que faz parte do processo de classificação dos emissores separados no processo do deinterleaving. Esta análise é a observação de uma sequência de amplitudes para determinar a forma e a velocidade com que o emissor está executando a varredura, podendo demorar vários segundos, já que necessita de pelo menos duas varreduras do radar que está sendo identificado. Este algoritmo não tem bom desempenho para emissores com agilidade nos parâmetros freqüência ou PRI [6,7]. Um emissor ágil pode ser detectado como se fossem vários emissores (Fig. 1). No cenário desta figura há 5 radares, confirmado visualmente pela análise das gravações feitas pela ELINT: quatro de navegação, próximos a 140°, 148°, 272° e 315° e um ágil, de direção de tiro, próximo aos 90°. O radar ágil, a direita da tela, aparece como duas nuvens de emissores. Para melhorar qualitativamente o desempenho do sistema para emissores com agilidade foi proposto um algoritmo baseado em amplitude [6, 7]. Entretanto tal algoritmo necessitava ser testado com maior variedade de cenários reais para solucionar o problema do cruzamento de amplitudes, que ocorre quando a amplitude de um emissor se confunde com a de outros emissores ao longo do tempo devido à varredura (Fig. 2), além de problemas típicos dos equipamentos MAGE, como o clutter (ecos que tipicamente retornam de terra, de ondas no mar, de chuva ou outras causas atmosféricas) e as reflexões indesejadas das emissões. De posse de gravações de cenários reais realizadas por ELINT técnica. foi possível aprimorar-se o algoritmo quanto ao problema dos cruzamentos de amplitudes. Além disso, a partir da observação das palavras descritoras dos pulsos, foi criado um método para melhorar a filtragem das reflexões e do clutter. Os experimentos foram realizados utilizando-se o software aplicativo MATLAB. III. EXPERIMENTOS REALIZADOS A. MÉTODOS DE DEINTERLEAVING O método de deinterleaving dos pulsos de radar utilizando o parâmetro amplitude é bastante eficiente contra radares com agilidade em frequência e em PRI [6,7], principalmente contra os emissores mais letais, que são os radares de direção de tiro. Nestes, devido ao apontamento característico dos radares lock-on, há boa estabilidade de amplitude dos pulsos na recepção. Porém este método necessitava de tratamento especial para os radares de varredura, pois estes apresentam amplitude variável do ponto de vista do observador. A princípio o problema é facilmente contornável ao se realizar o acompanhamento pulso a pulso, quando pensamos em um só emissor. Mas em cenários com diversos radares, acabam ocorrendo momentos em que as amplitudes de dois ou mais emissores têm o mesmo valor. A partir deste ponto as células se confundem, conforme é mostrado na Fig. 2. Uma das possíveis abordagens para resolver este problema era, além do acompanhamento da amplitude, associar a cada célula um vetor representativo da tendência de crescimento, decrescimento ou estabilidade da amplitude dos pulsos, sendo este vetor atualizado a cada novo pulso adicionado à célula. Isto vale para cenários nos quais se deseja detectar radares de direção de tiro sem perder eficiência quanto aos radares de varredura. Mas esta solução não foi plenamente satisfatória. Analisando-se as palavras descritoras dos pulsos, gravadas pela ELINT técnica, observou-se que nos limites de sensibilidade do receptor, o vetor de tendência das células deixa de representar com exatidão o comportamento da varredura do emissor, pois a partir destes pontos as derivadas das amplitudes ficam muito próximas. Foram testados vários algoritmos de deinterleaving. O método de comparação de amplitude pulso a pulso já havia apresentado melhores resultados que o método de comparação de amplitudes em intervalos fixos de tempo [7]. Os resultados aqui apresentados são todos de algoritmos que fazem comparação de parâmetros pulso a pulso, dentro dos limites de erro esperados. 1) Comparação de amplitude e marcação. Nesse algoritmo são comparados os parâmetros amplitude e marcação. A Fig. 3 apresenta o resultado do uso desse método no cenário da Fig. 1. Note que o emissor ágil aparece como vários emissores em torno dos 90º. Aparecem alguns emissores falsos próximos a 90º e 300º, um emissor falso sobreposto a um verdadeiro próximo a 150º e um emissor não aparece em 140º por ser associado à célula errada. 2) Comparação de amplitude com tendência associada às células e marcação. Nesse algoritmo, além da comparação entre amplitude e marcação é incluída a tendência de variação de amplitude. Como pode ser visto na Fig. 4 o emissor ágil aparece como vários emissores em torno dos 90º. Aparecem emissores falsos próximos a 90º e 300º, um emissor falso sobreposto a um verdadeiro próximo a 150º e um emissor não aparece em 140º por ser associado a célula errada. 3) Comparação de largura de pulso, marcação e frequência. Nesse algoritmo são comparadas a largura de pulso, a marcação e a frequência. Como pode ser visto na Fig. 5, próximo aos 90º o emissor ágil aparece como três emissores e vários emissores não aparecem por serem associados a células erradas. 4) Comparação de amplitude, largura de pulso e marcação. Nesse algoritmo a comparação é feita nos valores de amplitude, largura de pulso e marcação. O emissor ágil aparece como vários emissores em torno dos 90º. Aparecem emissores falsos próximos a 60º, 90º, 100º e sobrepostos a um emissor verdadeiro próximo a 150º. Um emissor não aparece em 140º por ser colocado em célula errada. Vide Fig. 6. 5) Comparação de amplitude, largura de pulso, marcação e frequência. A comparação realizada aqui é baseada nos valores de amplitude, largura de pulso, marcação e frequência. Na Fig. 7 pode ser visto que todos os emissores são apresentados, mas ainda aparecem emissores falsos próximos a 90º e sobreposto a um verdadeiro próximo a 150º. Dentre as cinco propostas, descritas anteriormente, a que apresentou melhor resultado foi a quinta, pois não há perda de emissores, além de apresentar poucos emissores falsos. B. FILTRAGEM DE EMISSORES FALSOS Outro problema freqüente, associado a equipamentos MAGE, que persiste independente do tipo de deinterleaving útilizado, é o das reflexões indesejadas e do clutter. Eles formam células fantasmas de um mesmo emissor, em marcações distintas (vide Figs. 8 e 9). No cenário das Figs 8 e 9 há 6 radares de navegação, confirmado visualmente pela análise das gravações realizadas pela ELINT: três na faixa de 3 GHz em 195°, 280° e 325° e três na faixa de 9 GHz sendo dois em 195° e um em 285°. Os outros emissores apresentados são alarmes falsos.O olhar do operador experiente é capaz de filtrar parte destes fantasmas, mas por vezes, principalmente na presença de cenários densos, estes falsos emissores aparecem em tamanha quantidade que a tela se torna incompreensível. Neste momento, há a possibilidade do operador baixar momentaneamente a sensibilidade do equipamento, para reduzir os falsos alarmes, mas esta solução pode omitir a detecção de algum emissor. Foi observado que, devido à menor relação sinal/ruído e ao maior espalhamento da frente de onda, pulsos provenientes de reflexões ou de clutter formam células com menor estabilidade de marcação do que células formadas por pulsos recebidos pelo caminho direto. Assim, quando há dois emissores idênticos em marcações diferentes, determinase o verdadeiro como sendo o que apresenta a menor variância nos valores das marcações dos pulsos. O resultado da aplicação desta filtragem é apresentado na Fig. 10. C. ALGORITMO PROPOSTO A versão final é uma combinação do método de melhor resultado, proposto na parte A, item 5 dessa seção com a filtragem de emissores falsos proposta na parte B. Este algoritmo utiliza a marcação e a amplitude auxiliada pelos parâmetros frequência e largura de pulso, formando células de palavras descritoras por armazenamento pulso a pulso. Ele possui apenas uma etapa, que já fornece células suficientemente confiáveis, representando cada uma um emissor. A análise de PRI ocorre posteriormente, não para atuar no deinterleaving, mas apenas para caracterizar os emissores, isso também é feito com a análise de varredura. A Fig. 11 mostra o mesmo cenário da Fig. 1, visto pela versão final do algoritmo proposto. O radar ágil aparece como único ponto, próximo aos 90° e todos os demais emissores são apresentados corretamente, sem a presença dos emissores falsos. Após os testes realizados, considera-se que este seja um algoritmo com resultados satisfatórios, que atende aos emissores de varredura ou emissores lock-on, com ou sem agilidade, além de filtrar eventuais emissores falsos, provenientes de reflexões ou clutter. IV CONCLUSÃO Foi desenvolvido um método de deinterleaving eficiente contra radares com ou sem agilidade, de varredura ou lock-on. Esse método baseia-se na comparação pulso a pulso de amplitude, largura de pulso, marcação e frequência, e utiliza uma técnica, também introduzida por esse artigo, para filtrar emissões falsas originadas por reflexões e clutter. A partir dos algoritmos testados conclui-se que a utilização dos parâmetros primários; amplitude, marcação, largura de pulso e frequência; seja para desembaralhamento, seja para a filtragem com vistas a apresentação final, é essencial para a generalidade da solução de detecção via MAGE. Os resultados aqui apresentados comprovam que as gravações de ELINT técnico fornecem subsídios extremamente importantes no desenvolvimento de novos métodos e algoritmos para os sistemas de guerra eletrônica. Estas gravações de cunho técnico auxiliam no domínio da tecnologia de processamento dos sinais de guerra eletrônica. Elas permitem rápidas adaptações no software dos equipamentos, em resposta aos constantes surgimentos de novos tipos de emissores. Tal domínio é estratégico e fundamental para o acompanhamento da constante evolução do cenário internacional da guerra eletrônica, com novos emissores, cada vez mais complexos. "
}