{
    "id": 182,
    "titulo": "simulador isar conceitual para avaliação de parâmetros de imageamento",
    "autor": "fabrício nery fernandes, rafael lemos paes e david fernandes",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2010/st/IV_4.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 2,
    "resumo": "Este artigo apresenta uma proposta de um simulador ISAR conceitual para avaliação de parâmetros de imageamento. A teoria envolvida é abordada trazendo conhecimentos já sedimentados em SAR para o ISAR e após é descrito o simulador e apresentados seus resultados.",
    "texto": " I. INTRODUÇÃO O crescimento do Brasil no cenário político mundial trouxe consigo a necessidade de melhorias na proteção das riquezas internas do país. Com essa finalidade foi adquirida a nova aeronave de patrulha da FAB, o P-3 AM, que inclui em seus novos equipamentos o modo de identificação a distância com radares de abertura sintética inversa (ISAR), equipamento ainda não operado sistematicamente pela FAB, o que pode acarretar uma subutilização do mesmo. O uso do ISAR como sistema imageador além de possibilitar a observação remota a grandes distâncias também pode operar em condições meteorológicas pouco favoráveis aos sistemas ópticos. Assim, este trabalho tem como objetivo apresentar um simulador ISAR conceitual para avaliação de parâmetros de imageamento, que em muitos casos podem ser arbitrados pelo operador do radar em função da geometria de observação do alvo e do tipo de resultado que ele espera obter da observação da imagem do alvo formado pelo ISAR. O simulador conceitual gera, de modo simplificado, imagens de alvos formados por conjuntos de refletores pontuais dominantes presentes em alvos complexos, tais como as estruturas de navios. Essa geração de imagens é realizada modelando-se e simulando-se os dados brutos do radar, em função dos parâmetros característicos do radar, do alvo, do seu movimento e da geometria de observação. A simplificação realizada foi desconsiderar o efeito da migração de célula de resolução [1] o que facilita a implementação do processo de formação de imagens. Apesar desta simplificação os efeitos na imagem das alterações dos parâmetros do radar do alvo e da observação podem ainda ser realisticamente avaliados. Apresenta-se ainda neste trabalho o desenvolvimento matemático e a definição dos sinais e parâmetros do ISAR de um modo analítico e fundamentado no processo de formação de imagens do SAR imageador de cenas extensas [1]. Na Seção II são apresentados os conceitos de formação de imagem SAR de alvos extensos, [1, 2], e na Seção III, estes conceitos são aplicados a geometria de observação do ISAR [3, 4]. Na seção IV é apresentada a estrutura do simulador e na Seção V são apresentados resultados de uma simulação em um cenário simplificado, motivado pela necessidade real de se imagear, para reconhecimento, alvos marítimos, que pelo movimento do mar são passíveis de serem imageados pelo ISAR. Na Seção VI são apresentados os comentários finais a respeito do trabalho realizado. II. SAR NO MODO IMAGEADOR DE GRANDES ÁREAS Para radares de abertura real (sem abertura sintética) a resolução azimutal é função da distância do alvo e da abertura angular azimutal a do feixe da antena, assim, para se obter uma boa resolução em radares embarcados de abertura real, é necessária uma antena de pequena abertura angular, ou seja, de grande comprimento efetivo la = /a, [1], fato este que pode impossibilitar a sua utilização em plataformas aéreas ou orbitais. No Radar de Abertura Sintética (SAR) pode-se sintetizar uma antena de grande comprimento efetivo, L >> la, utilizando-se apenas uma única antena de pequeno comprimento efetivo la, obtendo-se assim uma grande resolução azimutal [1, 2, 5]. Para geração de uma imagem bidimensional, além do processamento azimutal (direção de vôo da plataforma), é necessário o processamento do sinal em alcance (direção de propagação da onda eletromagnética transmitida). Na saída do receptor síncrono fase-quadratura do radar, acontece a primeira etapa do processamento SAR, onde a envoltória complexa do sinal eco, para se obter uma boa resolução em alcance, passa por um filtro casado com o chirp transmitido (sinal modulado linearmente em frequência), o qual realizará a compressão de pulso. A saída do filtro casado é dada por [1, 2] onde, K1 é uma constante relativa a refletividade do alvo, atenuações no meio, diagramas das antenas receptora e transmissora e os ganhos do receptor radar, Tp é o tempo de duração do chirp transmitido, γ é a variação de frequência intrapulso por unidade de tempo (chirp rate), τ é o atraso do pulso e sinc(x)= sen(x)/(x). De (1) define-se a resolução em alcance como sendo a separação entre dois primeiros nulos da função sinc(.), ou seja, onde c é a velocidade de propagação da luz no vácuo. Na segunda etapa do processamento SAR é obtida a resolução azimutal, através da síntese de uma antena muito longa (de grande resolução). Consideremos uma plataforma, com um sistema radar embarcado, movendo-se com movimento retilíneo e uniforme, com velocidade constante va e iluminando um dado alvo pontual, conforme mostrado na Fig. 1. onde R(t) é a distância do alvo pontual até o radar no instante t, R0 é a distância do alvo pontual em t = 0, va é a velocidade da plataforma, a é a abertura azimutal da antena do radar e Ti é o tempo de iluminação do alvo A fase (ψ(x)) do sinal eco relativa ao deslocamento azimutal fica onde λ é o comprimento de onda da portadora do sinal e γa é a variação de frequência azimutal durante a iluminação do alvo O sinal eco azimutal pode então ser representado por:  onde  a é relativo a posição azimutal do alvo e, se o alvo está no través da plataforma para t = 0 , como mostrado na Fig. 1, então  a = 0. Analogamente ao realizado em alcance, não se considerando os efeitos da migração da célula de resolução [3], para se obter uma boa resolução na direção azimutal, fazse a compressão azimutal do sinal (5) através de um filtro casado com exp ( )  j t a  . Assim, o sinal na saída do filtro casado tem a forma onde K2 é uma constante. De (7) determina-se a resolução azimutal onde a Ti = Ba é a banda espectral azimutal do sinal eco na dimensão azimutal da imagem SAR. Assim, a banda azimutal (Ba) fica Substituindo (9) em (8) têm-se III. MODO DE IMAGEAMENTO ISAR Na formação da imagem bidimensional os radares de abertura sintética inversa (ISAR) também utilizam compressão de pulso para se obter uma alta resolução em alcance, quanto a resolução angular a diferença básica entre o ISAR e o SAR imageador descrito na Seção II é que no ISAR a imagem é formada devido ao movimento relativo de rotação do alvo em relação ao radar. A Fig. 2 mostra a geometria básica do ISAR, onde um alvo pontual gira com velocidade angular ω com centro de rotação em C. Nesta Figura apresenta-se o alvo pontual (circulo preto) em duas posições. Na Fig. 2 R0 é a distância do radar ao elemento espalhador do alvo no instante t = 0, r é a distância do elemento espalhador ao centro de rotação do alvo, ω é a velocidade de rotação do alvo, ψ é o ângulo de observação do radar, que corresponde a um tempo de T, chamado de tempo de iluminação e R(t) é a distância do radar para o elemento espalhador no instante t. Da Fig. 2 tem-se, pela lei dos cossenos, que A fase do sinal eco de retorno do elemento espalhador do alvo no instante t fica onde γc é a variação da frequência por unidade de tempo na modulação em frequência dada pelo movimento de rotação do alvo Analogamente ao realizado na Seção II, o processamento angular é realizado através da compressão do eco de duração T e variação linear de frequência γc. No caso do ISAR será considerado um tempo de integração Ti  T, definido pelo filtro compressor, de modo que a resolução do sinal após a compressão possa ser controlada por este valor. onde ψi é o ângulo de integração (ψi ψ) correspondente ao tempo de integração Ti. Considerando o sinal eco yc(t) de um alvo pontual na posição angular inicial correspondente a c representado por  a saída z c(t) do filtro casado é dada por onde K3 é uma constante. De (15) tem-se que a resolução angular será dada por onde B c é a banda espectral angular definida por onde ψi é o ângulo de integração (ψi ψ) correspondente ao tempo de integração Ti. Observa-se que a banda angular Bc não depende somente do operador do radar escolher o tempo de integração. Esta banda varia também com a velocidade de rotação do alvo que, no caso de imageamentos de alvos marítimos, é dada pelo balanço do mar. Convém ressaltar ainda que Bc é a banda espectral após a compressão de pulso, definida arbitrariamente pelo tempo de integração Ti ou pelo ângulo de integração ψi, mas o sinal eco na entrada do filtro casado tem a sua banda B ac definida pelo tempo de observação T ou pelo ângulo de observação ψ. A imagem bidimensional gerada pelo ISAR tem um de seus eixos definido pela direção do vetor visada Rvisada , que é a reta que une a antena do ISAR ao centro de rotação do alvo. Para definir-se o outro eixo da imagem devemos considerar o vetor velocidade angular total do alvo real descrito por onde visada é a componente na direção da linha de visada e normal é a componente normal a linha de visada. Somente a componente normal pode causar desvio Doppler no sinal eco, pois a velocidade linear a ela associada, que é normal a normal , pode ter componente na direção da linha de visada. Deste modo além de Rvisada o outro eixo que define a imagem ISAR é dado por Rvisada ×normal [3]. A Fig. 3 mostra o plano de projeção correspondente a imagem ISAR. IV. ESTRUTURA DO SIMULADOR O simulador ISAR conceitual gera, de modo simplificado, a imagem ISAR de um alvo descrito por um conjunto de refletores pontuais. A simplificação considerada foi a de não levar em conta a migração da célula de resolução que faz com que o sinal eco bidimensional não possa ser representado por funções separáveis, uma para a direção em alcance e outra para a direção angular (azimutal ou de elevação). Na simulação existe a possibilidade de mudanças dos parâmetros tanto do alvo (velocidade angular e raio de rotação), como do radar (ângulo de integração e frequência de repetição de pulsos), para avaliação do imageamento. O alvo proposto é representado por uma matriz de zeros e uns, onde os uns representam a presença de alvos pontuais dominantes no plano de observação do ISAR. A separação dos alvos pontuais constituintes do alvo foi considerada como sendo a dimensão de uma célula de resolução dada pelas expressões (2) e (17). A matriz A, em (21), é um exemplo de alvo proposto, onde a linhas representam o alcance e as colunas uma posição angular de elevação. Para se ter variabilidade relativa na intensidade dos refletores pontuais, que em A é constante e igual a um, foi utilizada uma variável aleatória uniformemente distribuída entre [0, 20] para representar a intensidade de reflexão dos alvos pontuais. Também se adicionou na matriz representativa dos alvos, no plano de observação, um ruído gaussiano, com potência controlável, representando o ruído térmico aditivo. O diagrama de blocos do processador ISAR implementado é mostrado no esquema da Fig. 4. Como saídas do simulador é também possível observar, além da imagem ISAR, os sinais e espectros em alcance e angular. V. RESULTADOS Na simulação mostrada nesta seção utilizou-se uma matriz representativa de um alvo com as dimensões de 67 x 133 elementos. O cenário escolhido, representado na Fig. 5, é um navio em movimento de arfagem e as características do alvo e do radar estão na Tabela I. A Fig. 6 mostra os chirps em alcance e em elevação e a Fig. 7 mostra os espectros destes chirps ponderados por um filtro de Hamming, que é utilizado para a formatação do espectro no processa de geração da imagem ISAR. Na Fig. 8 tem-se os dados brutos que serão comprimidos pelo processador ISAR e a imagem ISAR que reconstrói a imagem do alvo observado. Na imagem ISAR na Fig. 8b, pode-se observar os refletores pontuais dominantes, com diferentes intensidades, formando a estrutura do alvo que está sendo observado. A diminuição do tempo de integração leva a uma diminuição na banda angular amostrada pelo radar, sendo esta insuficiente para amostragem total do alvo em questão, se mantida a mesma velocidade angular, ocasionando a ambiguidade na dimensão elevação conforme pode ser observado na Fig. 9. Na Fig. 9 pode-se observar as imagens duplicadas na dimensão elevação, pois o ângulo de integração escolhido foi a metade do escolhido para realização da imagem da Figura 8, sendo que o alvo continua com a mesma velocidade angular, gerando assim a ambiguidade observada. VI. COMENTÁRIOS FINAIS O simulador conceitual para avaliação de parâmetros de imageamento proposto é uma primeira versão de um processo de simulação que poderá contribuir diretamente para treinamento das equipagens que futuramente irão compor as tripulações da aeronave P-3 AM. Com este tipo de simulador pode-se:  Treinar diferentes tipos de visualizações não usuais, já que o plano de projeção da imagem irá variar de acordo com a movimentação dos alvos  Ambientar os operadores para entendimento do processo de formação da imagem ISAR e os parâmetros que norteiam a formação da imagem para uma plena utilização do equipamento. Com uma versão mais aprimorada do simulador, incorporando, por exemplo, a compensação de movimento dos desvios indesejados da plataforma e a estimativa de movimentos do alvo [1, 6]:  Ser referência para avaliações operacionais podendo realizar simulações antes da realização dos vôos.  Ser referência para futuras especificações técnicas na compra de novos equipamentos. "
}