{
    "id": 183,
    "titulo": "rastreamento de veículos com emprego de sensor laser 2d",
    "autor": "danilo habermann e claudio garcia",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2010/st/VIII_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 2,
    "resumo": "Este artigo apresenta um sistema de rastreamento de obstáculos, utilizando sensor laser 2D e filtro de Kalman. Contudo, esse filtro não é muito eficiente em situações em que haja severas perturbações na posição medida do obstáculo como, por exemplo, quando um objeto que está sendo rastreado passa por trás de uma barreira, interrompendo o feixe de laser por alguns instantes, tornando impossível receber do sensor as informações sobre sua posição. Este trabalho sugere um método de minimizar esse problema com o uso de um algoritmo denominado Corretor de Discrepâncias.",
    "texto": " I. INTRODUÇÃO Desde 2002 a agência americana DARPA (Defense Advanced Research Projects Agency) estimula universidades e empresas de dentro e fora dos EUA a desenvolver veículos autônomos. Um dos objetivos do governo americano é transformar um terço de sua frota de veículos militares em autônomos até 2015 [6]. Funções essenciais para esses veículos são a detecção e o rastreamento de obstáculos. Elas servem tanto para navegação de veículos autônomos, como podem ser empregadas em interfaces de auxílio ao condutor para mostrar-lhe os obstáculos ao redor do carro e alertá-lo sobre possíveis colisões [3]. Câmeras de vídeo são ideais para identificar sinais de trânsito e as faixas da pista. No entanto, possuem dificuldade em estimar com precisão as distâncias dos diversos objetos que se apresentam na imagem. Essa carência pode ser dirimida pelos sensores laser, que possuem uma precisão muito grande em medições de distância e podem ser empregados independentemente de condições de luminosidade. Na indústria, a detecção de obstáculos pode ser empregada em aplicações visando à segurança de pessoal e de máquinas, como é o caso da movimentação de containers em portos e de veículos autônomos em minas [4]. Em aplicações militares veículos autônomos podem ser empregados em missões de reconhecimento e para transporte de materiais, evitando que vidas sejam ceifadas no caso de ataques inimigos. O rastreamento de alvos também pode ser empregado em sistemas de armas automatizadas. Neste trabalho o objetivo é apresentar um sistema capaz de detectar e rastrear veículos em uma pista, utilizando um sensor laser fixo ao solo. A detecção e o rastreamento tornam-se mais complexos quando se tem o sensor em movimento. Os motivos de se trabalhar com o sensor fixo são de evitar os ruídos oriundos da movimentação do veículo. Assim, o foco inicial é a obtenção de um software confiável para detecção e rastreamento de obstáculos fixos e em movimento. As aplicações práticas para este tipo de situação são mais restritas, no entanto, este estudo servirá de base para um futuro uso com sensores instalados em veículos em movimento, mapeando e rastreando obstáculos ao seu redor. Uma aplicação da configuração sugerida é, por exemplo, a detecção e o rastreamento de pessoas em áreas de extrema segurança. A posição do intruso poderia ser detectada e rastreada, possibilitando o seu monitoramento através de uma câmera móvel. A Seção 2 apresenta as características do sensor laser 2D usado. A Seção 3 expõe os principais componentes de um sistema de detecção e rastreamento de obstáculos. Os resultados obtidos nos testes feitos com veículos em movimento podem ser verificados na Seção 4. Por fim, a Seção 5 traz as conclusões obtidas com o uso do software e apresenta as sugestões para trabalhos futuros para a melhoria do sistema. II. SENSOR LASER O sensor laser Sick LMS-291 é utilizado neste trabalho. Ele é empregado em diversos estudos sobre veículos autônomos e semiautônomos. O sensor opera por meio da medição do tempo de ida e volta de pulsos de luz laser. Um feixe de laser pulsado é emitido. Quando incide em um objeto, a reflexão é registrada pelo módulo receptor do sensor. O tempo entre a transmissão e a recepção do impulso é diretamente proporcional à distância entre o Sick LMS e o objeto. Com auxílio de um espelho rotativo integrado, o laser é emitido para todas as direções, cobrindo um ângulo de até 180° (Fig. 1). O contorno dos objetos-alvo é definido na sequência de impulsos recebidos. As medidas são tomadas a cada 0,25 °, 0,5 ° ou 1°. O alcance desse sensor Chega a 80 m, dependendo da refletividade do objeto. Os dados da medição são enviados ao computador em tempo real em coordenadas polares ou cartesianas. III. VISÃO GERAL DO SISTEMA DE DETECÇÃO E RASTREAMENTO DE OBSTÁCULOS Pode-se verificar a arquitetura do sistema na Fig. 2. O sensor laser é instalado em um local onde se deseje detectar e rastrear os objetos de interesse e os seus dados são processados pela rotina de detecção e rastreamento, representado pelos módulos no interior do retângulo tracejado. O resultado pode ser observado em uma interface homem-máquina (IHM), permitindo que se acompanhe em tempo real a presença e movimentação de obstáculos dentro do raio de alcance do sensor. Esses dados podem, também, ser enviados a outro sistema, como por exemplo, na fusão de dados com outros sensores em aplicações de veículos autônomos [1]. A. Agrupamento de pontos e determinação dos pontos médios dos obstáculos O tamanho dos obstáculos influencia de forma significativa, pois ao receber os dados brutos oriundos de cada varredura do sensor, o agrupamento de pontos para se definir um obstáculo será de acordo com as distâncias entre dois pontos consecutivos. Pontos pertencem ao mesmo grupo quando a distância entre dois pontos vizinhos for inferior a um valor pré-estabelecido D [2]. Analisando-se as Fig. 3 e 4, verifica-se a influência da distância pré-definida D como base para realizar a confirmação de um obstáculo. Dependendo do valor de D, pode-se detectar mais ou menos obstáculos do ambiente analisado, podendo ser diferente da realidade. Por isso, o valor D deve ser bem ajustado. Após o agrupamento dos pontos visando definir obstáculos, encontra-se o ponto médio de cada um deles. B. Confirmação do ponto médio Em cada varredura podem ser identificados vários obstáculos. Estes são numerados conforme seu posicionamento, a fim de viabilizar o rastreamento. O objeto mais à direita passa a ser o primeiro obstáculo, já o mais à esquerda é considerado o último. Isso é em virtude da operação do sensor, que faz a varredura da direita para a esquerda, conforme apresentado no capítulo II. A Fig. 5(a) mostra dois veículos se aproximando do sensor. Inicialmente, apenas o veículo da esquerda se encontra dentro do seu raio de alcance, simbolizado pela linha pontilhada. Assim ele é definido como obstáculo 1. Instantes mais tarde, os dois estão na área de atuação do sensor, como pode ser verificado na Fig. 5(b). Nessa situação, o veículo da direita será considerado inicialmente como o primeiro obstáculo, por estar à direita do sensor e o outro carro como o segundo. Esse problema inviabilizaria o rastreamento, pois o veículo da esquerda, que era o primeiro, passa a ser o segundo obstáculo com a presença do outro objeto. Para resolver esse impasse é necessário criar uma rotina para confirmar o ponto médio do obstáculo que está se rastreando, representado pelas coordenadas retangulares xmik e ymik , em que i representa os obstáculos de cada coleta de dados do sensor e k representa a atual varredura. Seja Pk  [ p1k,p2k ,...,pik ] , o vetor que armazena os pontos médios dos i obstáculos encontrados na k-ésima varredura, em que pik  ( xmik ,ymik ) . Seja Pk1 o vetor que armazena os pontos médios dos i obstáculos encontrados na (k+1)- ésima varredura. Para garantir que os obstáculos rastreados sempre tenham a mesma posição dentro do vetor, é preciso comparar todos os elementos dos vetores Pk e Pk1 . Toma-se o primeiro elemento de Pk e calculam-se as distâncias entre ele e todos os elementos de Pk1 . O elemento de Pk1 que possui a menor distância, passa a ser o primeiro elemento de um vetor auxiliar Vaux . Faz-se isso com os demais elementos de Pk . Ao final, assume-se que Pk1  Vaux . Isso corrige o problema inicial, pois a diferença de posição dos obstáculos em relação à próxima varredura geralmente é muito pequena. C. Medição da Velocidade O cálculo da velocidade dos objetos, nos eixos x e y, é realizado conforme (1) e (2), em que h representa o tempo de varredura do sistema. D. Rastreamento dos obstáculos O rastreamento basicamente é feito por meio do armazenamento dos pontos médios dos obstáculos encontrados nos vetores P. No entanto, essas posições são obtidas apenas baseadas nos dados oriundos do sensor. Ruídos ou outras perturbações como oclusões podem gerar erro no sistema. Dessa forma, é necessário aplicar outras técnicas a fim de aumentar a confiabilidade do software. Neste trabalho, para realizar o rastreamento, empregam-se o filtro de Kalman e uma função para corrigir grandes erros de posicionamento, chamada de Corretor de Discrepâncias ou simplesmente Corretor. 1) Corretor de Discrepâncias: A maior preocupação deste trabalho é rastrear veículos. Sabe-se que seus deslocamentos seguem um determinado padrão. Assim, consegue-se identificar variações bruscas nesse comportamento. Quando um veículo sendo rastreado passa por uma área onde há uma barreira entre ele e o sensor, por alguns instantes, não é possível detectar a sua posição. Neste caso, as suas últimas posições apresentam pequenos erros, pois nos instantes em que o veículo é parcialmente coberto, haverá erro na determinação do valor médio de sua posição e, consequentemente, da sua velocidade, que tende a diminuir, conforme se pode observar na Fig. 6. Como o filtro de Kalman não é capaz de corrigir variações muito bruscas, é preciso fazer uma melhoria antes da aplicação do filtro. Para cada obstáculo, a média, mi, das distâncias entre as suas últimas cinco posições é observada. Quando a distância entre duas sucessivas posições de um objeto pi( k1) e pik for maior que três vezes mi , então, aplica-se a correção, conforme explicado a seguir. As médias das dez últimas velocidades dos obstáculos, Vxmi e Vymi , obtidas por meio de xmik  e ymik  , que são as velocidades nos eixos x e y após a aplicação do filtro de Kalman, são frequentemente atualizadas.Ao verificar que há uma discrepância entre pi( k1) e pik , despreza-se o valor pik e atribui-se a ele um novo valor, conforme (3) e (4). Esses novos valores de xmik e ymik são usados no algoritmo de Kalman para encontrar xmik  e ymik, conforme é explicado a seguir. 2) Filtro de Kalman: O filtro de Kalman é um algoritmo recursivo muito usado quando se deseja rastrear obstáculos, sendo utilizado para estimar as variáveis de estado de sistemas representados por equações de estado lineares. Para sua aplicação, considera-se que o sistema seja linear e perturbado por ruído gaussiano. A equação (5) mostra como as variáveis de estado xk evoluem em função do estado anterior e da ação de controle. A matriz Ak descreve como o estado evolui de k para k+1, baseado apenas no estado anterior. A matriz Bk , descreve como a ação de controle uk modifica o estado de k para k+1. Essas duas matrizes são determinísticas. Essa equação é utilizada para modelar o estado no emprego do filtro de Kalman. A equação (6) modela as variáveis de estado medidas e também precisa ser linear e perturbada por ruído gaussiano. Os vetores  e  em (5) e (6) representam o ruído do processo e da medição, respectivamente, com média zero, independentes e com covariância R e Q. A fim de se analisar o ruído produzido pelo dispositivo de medição, mil coletas de dados foram realizadas de um obstáculo que se encontrava a quinze metros do sensor laser. Subtraíram-se os valores encontrados de 15 metros e obtevese um vetor com os erros do sensor. A Fig. 7 mostra o histograma obtido com os dados oriundos do ruído do sensor, percebe-se que os dados muito se aproximam de uma distribuição normal. Assim, pode-se considerar que os erros de medição do sensor seguem essa distribuição, podendo-se utilizar o filtro de Kalman. A Tabela I apresenta alguns parâmetros como média e desvio padrão dos mil dados coletados do sensor a uma distância de 15 m. Nota-se que o valor obtido pela subtração do ponto máximo pelo mínimo é de 7,80 cm, ou seja, um valor muito pequeno, considerando que o principal objetivo é detectar e rastrear veículos. Outro parâmetro importante apresentado nessa tabela é a variância. Esse valor é utilizado como, isto é, o ruído da medição para a aplicação do filtro de Kalman.O resultado do filtro de Kalman representa a crença (belief) de que um obstáculo possa estar em uma determinada posição e é representado como uma distribuição normal com média μk e matriz covariância k . A seguir é apresentado o algoritmo do filtro de Kalman utilizado neste trabalho (Thrun, 2006). Os seguintes parâmetros são usados: O resultado do filtro é armazenado no vetor. IV. RESULTADOS OBTIDOS Neste capítulo são apresentados alguns testes práticos realizados a fim de verificar o desempenho do software de rastreamento de obstáculos. Em todos os testes foram utilizados os seguintes equipamentos:  Sensor laser Sick LMS-291, configurado para um alcance de 80 m, varredura de 180° e resolução angular de 0,5 °, posicionado a 0,4 m acima do solo.  Veículo Ford Fiesta modelo 2007, cor prata, dimensões: 420 x 176 x 146 cm. Durante os testes, o motorista teve apenas o auxílio do velocímetro interno para manter o carro na velocidade estipulada, gerando dessa forma erro em virtude da imprecisão do aparelho e da dificuldade de se manter o veículo com direção e velocidade constantes. Utilizou-se D= 0,9 m, =0,00009 e δ=0,00003 ( =3 δ). O valor de  foi extraído da Tabela I. Trabalhou-se com um tempo de varredura do sensor de 215 ms. A. Teste com um veículo a velocidade constante de 20 km/h em linha reta O primeiro teste realizado foi de um veículo se aproximando do sensor com velocidade constante de 20 km/h. A pista de teste tinha uma ligeira curva no início e 40 m de reta, conforme apresentada na Fig. 8. O veículo começou a acelerar de forma a chegar à reta da pista a uma velocidade de 20 km/h e manteve-se nesse ritmo até passar pelo sensor. Em relação ao eixo x, o veículo na reta ficou aproximadamente a 3 metros do sensor. A Figura 9 mostra os resultados obtidos com a rotina de rastreamento. Os losangos simbolizam a posição do veículo obtida dos dados do sensor durante 42 varreduras. Os pontos são as posições do veículo obtidas pelo módulo de rastreamento, ou seja, usando o Corretor de Discrepâncias e do filtro de Kalman. A primeira posição observada do veículo foi a 51,6 m do sensor. Para não processar pontos indesejáveis, foram descartados os que estavam fora da pista. Nota-se que mesmo após o veículo entrar na reta a 40 m do sensor, houve uma variação de cerca de 1 m no eixo x. Isso se deve basicamente a dois fatores. O primeiro é em virtude de erro humano na condução do veículo e o segundo é pelo motivo do sistema apresentar um pequeno erro na obtenção do ponto médio. A Figura 10 apresenta as medições feitas pelo laser de um mesmo veículo a distâncias diferentes. Pode-se verificar na Figura 10(a) que apenas três pontos são obtidos de um veículo a cerca de 41,5 m do sensor, conseguindo-se ver apenas a frente do mesmo. Quando o carro chega a cerca de 1,5 m do sensor, muitos pontos são obtidos, podendo-se notar claramente o contorno das partes frontal e esquerda do mesmo. Como neste trabalho a posição do veículo é obtida pelo ponto médio de todos os pontos presentes em uma varredura, gera-se uma certa imprecisão em relação ao real local em que se encontra o objeto. A Fig. 11 mostra uma comparação entre os pontos médios da posição do veículo, no eixo y, obtidos pelo software, utilizando o módulo de rastreamento, com a equação que rege o movimento retilíneo uniforme com velocidade de 20 km/h (linha contínua). Foram considerados os primeiros 28 dados coletados a partir do momento em que o veículo chegou a uma distância de 40 m do sensor. A velocidade média no eixo y obtida pelo software foi de 20,57 km/h e o máximo erro absoluto entre a posição medida e a reta S=40-5,55t foi de 1,48 m, sendo a média de 0,8 m. B. Teste com um veículo a velocidade de 20 km/h ultrapassando um veículo parado O objetivo desse teste é verificar como o sistema se comporta quando existe uma barreira entre o sensor e o obstáculo sendo rastreado. O veículo mais distante do sensor laser na Figura 12 representa o veículo a ser rastreado, que trafega a 20 km/h na direção do eixo x e o outro veículo está parado. Na Fig. 13 verificam-se os pontos médios do veículo no eixo x obtidos com o uso do filtro de Kalman e do Corretor e a reta S=-32,5+5,55t (linha contínua), que representa o deslocamento do veículo, com uma velocidade de 20 km/h. Há pequenas diferenças entre as linhas, que decorrem da passagem do veículo atrás da barreira, fazendo com que os dados da medição sejam interrompidos e, também em virtude da incerteza do deslocamento real do veículo. Na Fig. 14(a) há um grande espaçamento entre os losangos no intervalo de -4<x<4. Esses losangos representam a posição registrada do veículo sem usar o módulo de rastreamento. Os pontos representam a posição do veículo empregando o filtro de Kalman, contudo, sem utilizar a função Corretor. O sensor laser não consegue enxergar o veículo em movimento quando ele passa por trás da barreira, retornando dois valores nulos. O filtro de Kalman não consegue corrigir o posicionamento do veículo neste caso. Antes de entrar na barreira, o carro percorria em média 1,10 m a cada varredura. A distância entre o último ponto medido antes de o veículo entrar atrás da barreira e o primeiro ponto ao sair da mesma foi de 6,8 m. O uso do Corretor de Discrepâncias e, em seguida, o filtro de Kalman gera um melhor rastreamento. Os resultados são vistos na Figura 14(b). Há uma diminuição da distância máxima entre dois pontos sucessivos, que nesse caso foi de 2,6 m em vez de 6,8 m. V. CONCLUSÃO Uma das necessidades dos veículos autônomos e semiautônomos é a obtenção fidedigna e em tempo real de informações do ambiente, a fim de detectar obstáculos. Para isso, muitos sensores são utilizados, sendo um deles o laser, detalhado na Seção 2. Na Seção 3 puderam ser observados os principais módulos do sistema de detecção e rastreamento de obstáculos, utilizando o sensor laser Sick LMS-291 fixo ao solo. O uso do filtro de Kalman em conjunto com a função Corretor de Discrepâncias oferece bons resultados, em especial, quando o veículo sendo rastreado passa por trás de uma barreira. É necessário testar este sistema com veículos realizando outros tipos de manobras para verificar seu desempenho. Melhorias a serem implementadas seriam a integração desse sistema com uma câmera de vídeo e a inserção do sensor laser na parte frontal do veículo. Dessa forma, o sistema estaria dando passos importantes no sentido de ser utilizado em veículos autônomos. "
}