{
    "id": 184,
    "titulo": "experimentos sobre visualização através da parede usando radar uwb",
    "autor": "carlos r. p. dionisio, sérgio tavares, marcelo perotoni e sergio takeo kofuji",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2010/st/XIV_3.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 2,
    "resumo": "Visualização através da Parede (TWI) pode fornecer informação vital do interior de um ambiente para casos onde entrar fisicamente nele representa um sério perigo à pessoa envolvida. Radar de banda ultra larga (Radar UWB) é uma tecnologia emergente que oferece alta resolução ao contrario de radar de banda estreita. Desta forma, TWI usando radar UWB tornou se uma área de pesquisa crescente com diversas aplicações na área civil e militar como, por exemplo, resgate e vigilância. Porém, ela enfrenta diversos desafios, por exemplo, nas etapas de coleta e processamento dos dados para detectar, localizar e visualizar o alvo. Neste trabalho, apresentamos uma análise e resultados de um sistema TWI usando radar UWB. Diversos experimentos foram realizados como, por exemplo, detecção de pessoas e visualização de alvos metálicos detrás de uma parede de concreto. Os resultados são encorajadores e demonstram a vantagem de utilizar um sistema de radar UWB para TWI.",
    "texto": " I. INTRODUÇÃO Em sistemas de TWI, o sinal transmitido sofre atenuação devido à perda no espaço livre, espalhamento na interface arparede, perda na parede e espalhamento desde os objetos. Uma melhor resolução e penetração do sinal são os grandes desafios ao resolver o problema de TWI. Detectar o alvo na presença de forte clutter é outro grande desafio. Clutter é devido, por exemplo, pela reflexão do sinal com a parede externa, paredes internas, objetos e acoplamento entre as antenas transmissora e receptora. Um método simples para redução de clutter baseia-se na subtração do clutter de referência a partir de dados medidos na presença do alvo. Métodos mais elaborados se baseiam, por exemplo, em técnicas estatísticas de processamento de sinais como a separação cega de fontes [1]. No passado, muitos estudos sobre TWI usando radar de banda estreita com baixa resolução foram conduzidos para detecção de um alvo detrás de uma parede. Em visualização através de roupa e embalagem, foi utilizado radar de banda estreita com ondas milimétricas para obter alta resolução [9]. Esta abordagem não pode ser utilizada para outro tipo de aplicações como, por exemplo, penetração através de materiais densos (madeira, gesso, tijolos e blocos de concreto) os quais requerem o uso de freqüências abaixo de 10 GHz [10]. Assim, radar UWB se apresenta como a melhor alternativa para TWI, isto é, UWB compensa a queda significativa da freqüência central, aumentando a largura de banda que se traduz em uma resolução fina. Também, UWB oferece imunidade a interferências e baixa probabilidade de intercepção, de interesse particular em aplicações militares. TWI usando radar UWB tornou se uma área de pesquisa crescente com diversas aplicações na área civil e militar. Ele pode ser utilizado para missões de resgate em avalanchas ou desmoronamento de construções, extração de características do alvo, detecção de alvo detrás da parede, vigilância, reconhecimento e inspeção. Nos últimos anos, o advento de técnicas e dispositivos para geração e amostragem de pulsos muito curtos, juntamente com a aprovação pela FCC da banda de 3,1 até 10,6 GHz em 2002, tem alimentado o crescimento da pesquisa em radar UWB com alta precisão. A oferta comercial de sistemas bem sucedidos de TWI usando radar UWB têm sido limitado até à data devido à complexidade associada com o desenvolvimento de tais sistemas. Diversos protótipos de sistemas de TWI usando radar UWB foram desenvolvidos para a coleta de dados [11] [12] [13]. Elas obtém uma boa resolução fina e foram bem sucedidas em alguns ambientes, porem isso não o garante para qualquer ambiente. Neste trabalho, apresentamos resultados de TWI para diversos experimentos, realizado no Laboratório de Radar UWB na Universidade de São Paulo. Dados reais foram coletados considerando diversos ambientes detrás de uma parede com dois alvos. Também, uma medição do ambiente vazio foi feita para permitir a medição do ruído/clutter e assim realizar uma subtração coerente com o ambiente correspondente. A coleta de dados com abertura sintética 2D [7] foram realizadas usando um analisador de rede vetorial Rohde & Schuarz, o qual implementa uma forma de onda passo-freqüência ao longo da faixa de freqüência de 2.6 GHz até 4.6 GHz. Antenas Vivaldi com fendas [2], foram fabricadas e montadas sobre um pedestal para fazer a varredura ao longo da parede em passos de 0.4 cm. Posteriormente, os dados foram processados para a geração da imagem. O artigo está organizado da seguinte forma. A secção 2 descreve a antena UWB escolhida para nosso sistema de radar. A secção 3 descreve o nosso sistema de radar UWB. A coleta de dados e redução de clutter e descrito na secção 4. Na secção 5, os resultados experimentais são descritos e ilustrados. Finalmente, as conclusões são apresentadas na secção 6. II. ANTENAS UWB VIVALDI COM FENDAS Para resolver satisfatoriamente o problema de TWI usando radar UWB, as antenas devem satisfazer, na banda de operação, as seguintes características: baixa perda de retorno, atraso de grupo constante, alto ganho e padrão de irradiação direcional estável. A perda de retorno deve ser inferior a -10 dB. Variações no atraso de grupo causa distorção do sinal. Um alto ganho é necessário para poder maximizar a energia do sinal que consegue atravessar a parede. As antenas direcionais irradiam apenas na direção do alvo, tanto para maximizar a potência transmitida e evitar dispersão com objetos do ambiente ou com as paredes em outras direções, especialmente detrás das antenas. Outras características desejáveis para as antenas são tamanho e volume pequeno para uso portátil, fácil de conectar ao transmissor e receptor, peso leve, baixo custo e fácil de fabricar. Com exceção do atraso de grupo e tamanho, as antenas Vivaldi com fendas [2] satisfazem todas estas características. Em sistemas de radar de banda estreita, somente a perda de retorno S11 tem sido considerado como parâmetro de interesse. Porém, para radar UWB, alem do S11, consideramos os parâmetros de ganho e padrão de irradiação para a escolha da faixa de freqüência de operação do sistema de radar. Esta escolha é baseado no compromisso entre esses parâmetros considerando a nossa aplicação em particular (paredes de concreto de espessura de 20 cm). Neste trabalho, escolhemos e fabricamos as antenas Vivaldi com fendas. A faixa de freqüência de operação do sistema de radar UWB para TWI foi escolhida de 2.6 GHz até 4.6 GHz. As figuras Fig. 1 e Fig. 2 ilustram a perda de retorno da antena fabricada e o ganho simulado, respectivamente. III. SISTEMA DE RADAR UWB PARA TWI Sistemas de radar medem a resposta temporal do canal entre o transmissor e o receptor. Esta resposta tem uma resposta em freqüência sugerindo que o canal pode ser caracterizado através de uma varredura da faixa de freqüências. Desta forma, sistemas de radar TWI podem operar no domínio do tempo ou da freqüência. No domínio do tempo, eles trabalham com um pulso muito curto. No domínio da freqüência, eles trabalham com uma onda contínua onde a resposta em freqüência é amostrada em intervalos ao longo da faixa de operação emitindo tons desde o transmissor e medindo no receptor. Como exemplo temos o radar de onda continua em passos de freqüência (SFCW) [5]. Este tipo de radar tem algumas vantagens sobre os outros tipos de sensores, por exemplo, uma ampla faixa dinâmica, maior potência média, baixo ruído sobre a transmissão de um pulso UWB e registro direto da resposta temporal [3]. A. Hardware do Sistema Neste trabalho, os dados foram obtidos com ajuda de um sistema de radar SFCW. Este sistema foi construído no Departamento de Engenharia de Sistemas Eletrônicos, Universidade de São Paulo - USP. Este sistema consiste, principalmente, de: • um analisador de rede vetorial (VNA) de duas portas (Rohde e Schwartz, R&S ZVL6) para gerar uma onda passo-freqüência na faixa de operação do sistema com potência de 10 dBm; e • duas antenas Vivaldi com fendas para a transmissão e recepção do sinal. A Fig. 3 mostra uma fotografia do nosso sistema de radar. O VNA controla todo o sistema. As antenas Tx e Rx foram montadas sobre um poste de madeira com 10 cm de separação horizontal e numa altura de 1,5 m. Foi utilizado dois cabos coaxiais LMR-400 de baixa perda para conectar as antenas ao VNA. Sinais UWB são caracterizados por uma largura de banda maior que 500 MHz ou 20% da freqüência central de irradiação [6]. O sinal UWB gerado pelo VNA é ilustrado na Fig. 4. IV. COLETA DE DADOS E REDUÇÃO DE CLUTTER Em sistemas de radar, podemos utilizar três tipos de varreduras (scan) para realizar a coleta de dados: A-scan, Bscan e C-scan. O sinal coletado em qualquer ponto de medição é chamado de A-scan (dados 1D). Ele é apresentado como intensidade do sinal versus tempo ou distância. Isto é também chamado de range profile. Este sinal é utilizado para detectar e localizar o alvo. O B-scan (dados 2D) é uma coleção de A-scans coletados ao longo de uma linha de varredura e é utilizado para visualizar o alvo. O C-scan (dados 3D) é obtido a partir do ajuntamento de B-scans. Além do alcance, o C-scan fornece informações valiosas sobre medidas do alvo em comprimento, altura e largura. Para minimizar qualquer erro de medição, o sistema foi montado em uma plataforma móvel. O VNA foi calibrado através de um processo de calibração padrão de duas portas. A coleta de dados foi realizada através de varreduras A-scan ao longo do cross-range e paralelo à parede, considerando 21 posições de antena com intervalo de 4 cm. O dado coletado foi o coeficiente de transmissão ou parâmetro S21 na porta 2. Finalmente, os dados foram transferidos do VNA a um PC para o pós-processamento utilizando scripts MATLAB. Uma folha de alumínio de 40 cm × 27 cm e outra folha de ferro de 41 cm × 28 cm foram utilizadas como alvos. Elas foram colocadas na mesma altura e separadas horizontalmente por 7 cm. O tipo de parede utilizado no experimento foi parede de concreto. Devido ao alto contraste entre a constante dielétrica da parede e do ar, ocorre uma grande reflexão de energia na parede. Desta forma, uma energia muito pequena consegue atravessar a parede, refletir no alvo e, em seguida, atravessar novamente a parede para alcançar a antena receptora. Observamos que um problema desafiante em TWI é separar o sinal refletido no alvo (sinal fraco) de sinais indesejáveis chamados de clutter (sinal forte), os quais interferem e impossibilitam a visão do alvo. Geralmente, o sinal clutter é devido ao acoplamento entre as antenas transmissora e receptora ou na reflexão sobre a superfície das paredes. Uma abordagem simples para resolver este problema consiste na subtração do clutter de referência (isto é, coletando os dados na ausência do alvo) a partir de dados medidos na presença do alvo [8]. Porém, nem sempre é possível ter acesso ao interior do ambiente e desta forma não podemos aplicar esta abordagem. Métodos mais sofisticados, para reduzir o sinal clutter, foram propostos como, por exemplo, Análise de Componentes Principais (PCA), Análise de Componentes Independentes (ICA), Análise de Fator (FA) e Decomposição de Valor Singular (SVD) [1][4]. V. RESULTADOS EXPERIMENTAIS Neste trabalho, realizamos dois tipos de experimentos para validar nosso sistema de radar UWB: detecção de pessoas e visualização de alvos metálicos. A. Detecção de uma Pessoa com Parede Neste experimento, a detecção de uma pessoa detrás de uma parede de concreto foi realizada. A distância entre as antenas e a pessoa foi de aproximadamente 1.3 m. O resultado é ilustrado na Fig. 5. O sinal de cor azul e cor vermelha representam, respectivamente, o sinal com a presença e ausência de uma pessoa estática. Devido a grande atenuação na parede do sinal irradiado, a reflexão na pessoa é fraca. Os resultados podem ser melhorados se considerarmos freqüências mais baixas para obter maior penetração na parede. B. Detecção de uma Pessoa sem Parede Neste experimento, uma pessoa é colocada em diferentes posições sobre uma reta perpendicular as antenas com separação de 50 cm. A Fig. 6 ilustra os picos representando a presença de uma pessoa. Observamos que a distância entre dois picos consecutivos é de aproximadamente 50 cm, validando a alta resolução do nosso sistema de radar. C. Visualização de duas Placas Metálicas Diferente de radares de banda estreita, o uso de sistemas de radar UWB fornece importantes vantagens como imagens de alta resolução. Para o problema de visualização de duas placas metálicas, realizamos um experimento considerando um ambiente com parede de concreto. Os alvos utilizados foram uma placa de alumínio e uma placa de ferro. A distância entre a antena e a parede foi de 32 cm e a distância entre a antena e os alvo foi de 75 cm. A espessura da parede de concreto foi de 20 cm. O sinal A-scan com a presença e ausência dos alvos numa posição de varredura ao longo do cross-range é ilustrado na Fig. 7. Diversos picos com diferentes magnitudes podem ser claramente observados nesse resultado. O primeiro pico (p1) foi devido ao isolamento incompleto entre as antenas transmissora e receptora, o segundo pico (p2) deve-se à parede e o terceiro pico (p3) é devido ao alvo. O perfil de alcance dá a idéia da posição de um alvo, mas não a sua extensão no cross-range, portanto uma imagem Bscan é gerada. Neste experimento, não levamos em conta o efeito do atraso de tempo devido à parede. A Fig. 8 ilustra a imagem B-scan com a presença dos alvos. Forte reflexão da parede pode ser claramente observada na imagem pela cor vermelha. Os alvos são fracamente observados em aproximadamente x = 1,70 m. A Fig. 9 ilustra a imagem da Fig. 8 depois da subtração do clutter de referência. Observe que podemos identificar dois alvos maiores nesta imagem. Para obter melhores resultados, aplicamos o algoritmo de ICA para obter imagens contendo a presença da parede (Fig. 10) e a presença dos alvos (Fig. 11). Observe que a parede aparece quase na mesma posição original. Também, os alvos são observados claramente e tem um comprimento similar as folhas de metal utilizadas. VI. CONCLUSÕES Neste trabalho, temos desenhado e construído um protótipo de radar UWB para TWI com abertura sintética realizado através de uma varredura. Estudos experimentais foram realizados provando a capacidade de detectar e visualizar alvos detrás da parede. Dois tipos de experimentos foram realizados para validar nosso sistema de radar UWB: detecção de pessoas e visualização de placas de metal através da parede de concreto. Para remoção de clutter, consideramos o método estatístico ICA e um método simples baseado na subtração do clutter de referência. Os resultados mostram que a posição do alvo é previsto com sucesso para o caso de detecção de pessoa sem parede. Também, as imagens geradas mostram com precisão a posição e tamanho das placas de metal. Observamos que a distância entre as antenas e o alvo produz uma atenuação do sinal. Interfaces com alto contraste dielétrico, por exemplo ar-parede, causam uma forte reflexão do sinal. Assim, o sinal refletido pelo alvo detrás da parede é fortemente atenuado podendo chegar a um nível abaixo do ruído do ambiente. Isto pode dificultar ver o alvo que está detrás da parede. Finalmente, os resultados apresentados neste trabalho mostram que nosso sistema de radar UWB é útil para detectar pessoas e visualizar alvos metálicos através da parede. "
}