{
    "id": 185,
    "titulo": "projeto do sistema de controle de uma bomba inteligente com alcance estendido",
    "autor": "carlos henrique machado silva esteves, marcus vinicius preisighe viana e josé márcio pereira figueira",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2010/st/II_2.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Este trabalho desenvolve o sistema de pilotagem de uma bomba inteligente com alcance estendido. A modelagem aerodinâmica em seis graus de liberdade é apresentada. O modelo não-linear desenvolvido é linearizado e trimado. São projetados três subsistemas de controle, um sistema de aumento de estabilidade, um controlador de rolamento e um seguidor de aceleração. Cada controlador é projetado através de análise no lugar das raízes em uma condição central do envelope, e os ganhos projetados e requisitos obtidos são utilizados, respectivamente, como condições iniciais e função de custo para métodos de otimização numérica, permitindo a obtenção automática dos ganhos dos controladores em todo o envelope de voo. São apresentados os resultados obtidos para cada subsistema, em diversas condições.",
    "texto": " I. INTRODUÇÃO O emprego de armamento guiado apresenta significativas vantagens em relação ao emprego de armamento não-guiado. O uso de bombas, quando possível, apresenta um custo menor que o uso de mísseis e, em geral, propicia uma maior capacidade de destruição. Estes fatos, aliados à pouca publicação de trabalhos no Brasil sobre sistemas de pilotagem e guiamento para bombas motivam o estudo deste assunto. Como exemplos de trabalhos publicados no Brasil, pode-se citar [1], que apresenta a modelagem e projeto do sistema de controle, com três graus de liberdade, de uma bomba com strakes laterais para alcance estendido; e [2], que apresenta a modelagem com seis graus de liberdade e projeto do sistema de controle de um míssil anti-navio. Uma bomba não-guiada típica apresenta empenagem de dimensões reduzidas, necessária apenas para garantir sua estabilidade em voo. É usual o projeto de módulos de guiamento para bombas não-guiadas. Uma forma de implementar um módulo de guiamento é substituir a empenagem da bomba não-guiada por uma de maior superfície, que proporciona mais sustentação gerando maior capacidade de manobra. Canards podem ser inseridos como superfícies de controle. Os canards, em geral, apresentam dimensões relativamente pequenas, mas com um braço longo em relação ao centro de massa do artefato, proporcionando momentos aerodinâmicos razoáveis. Uma bomba com este tipo de módulo de guiamento é estudada neste trabalho. Este trabalho detalha o desenvolvimento do sistema de pilotagem de uma bomba inteligente. Inicialmente é apresentada a modelagem do artefato, realizada com seis graus de liberdade com auxílio de software semi-empírico. O modelo não-linear desenvolvido é linearizado e trimado. A trajetória do artefato deve ser dividida em duas fases, uma de navegação, enquanto o alvo ainda está distante, e outra terminal, quando o alvo está próximo e o artefato deve voar diretamente a ele. Na fase de navegação, devem ser mantidas deflexões nos canards que resultem em um ângulo de ataque que proporcione o máximo alcance possível. Para isso, é implementado um controlador de rolamento, para que o artefato não role e as deflexões mantidas gerem sustentação na direção desejada. Além disso, é implementado um sistema de aumento de estabilidade para amortecer as oscilações naturais do sistema. Para a fase terminal, são implementados seguidores de aceleração, capazes de seguir uma referência de aceleração gerada pela lei de guiamento. As simulações são realizadas em MATLAB/Simulink. II. MODELAGEM O artefato estudado é baseado numa bomba Mk-83 com módulo de guiamento a laser Paveway II. Para facilitar a obtenção dos coeficientes aerodinâmicos, a geometria é simplificada para um perfil tangente-ogiva truncado, com o final do corpo sendo um tronco de cone. A massa do artefato é considerada 500 kg. A Fig. 1 mostra a geometria em escala. O software Missile DATCOM [3] é utilizado para a modelagem aerodinâmica neste trabalho. Tal software utiliza métodos semi-empíricos e permite a obtenção dos coeficientes aerodinâmicos e das derivadas de estabilidade estáticas e dinâmicas de um corpo em diversas condições de ângulo de ataque α e derrapagem β, altitude h, número de Mach e deflexões δi nas superfícies de controle. Neste trabalho, os parâmetros aerodinâmicos são obtidos para números de Mach entre 0.4 e 1.15, α e β entre -40º e +40º e deflexões nos canards entre -30º e +30º. A simetria é utilizada na obtenção dos parâmetros quando possível. A condição de voo padrão, na qual o ângulo de rolamento é nulo, é definida com uma configuração em X dos canards (que são alinhados com a empenagem traseira) e os sistemas de controle são projetados com base nesta configuração. Segundo [4], a configuração em X apresenta maior arrasto em voo trimado e é estaticamente estável em rolamento, ao contrário da configuração em +. A vantagem de utilizar quatro superfícies de controle simétricas é a possibilidade de gerar sustentação rapidamente em qualquer direção. Este tipo de configuração é conhecida como skid-to-turn. A Fig. 2 mostra a orientação dos canards em relação ao sistema de referência do corpo (vista traseira) e exemplos de comandos do tipo profundor, leme e aileron. A Fig. 3 mostra alguns dos parâmetros obtidos na modelagem. Nota-se a curva de coeficiente de arrasto (CD) por Mach, com o CD aumentando significativamente quando começa o regime transônico; a curva do coeficiente de sustentação (CL) por α, com o CL aumentando praticamente linearmente com o α; a curva de cm por α, onde é possível verificar a estabilidade estática do artefato, já que, com α positivo, o cm é negativo, resultando em um momento restaurador negativo. Analisando a curva CL/CD por α verifica-se que o valor de CL/CD é máximo em torno de α=6º. Este dado é bastante importante, pois mostra a condição de voo que deve ser mantida para que o artefato atinja o maior alcance possível [5]. Esta condição deve ser perseguida durante a fase de navegação do artefato, antes do chaveamento para o guiamento terminal. III. LINEARIZAÇÃO E TRIMAGEM O sistema estudado é não-linear, portanto, para possibilitar a aplicação de técnicas de controle linear, o sistema deve ser linearizado. São definidos diversos pontos no envelope de voo, dados por números de Mach entre 0.4 e 1.15 e altitudes entre 0 e 10 km. Para cada ponto, são encontradas as condições de equilíbrio instantâneas e, a partir destas condições, o modelo é linearizado numericamente. A obtenção dos pontos equilíbrio instantâneos é realizada através da minimização das derivadas dos estados, baseada no método de otimização numérica Simplex de Nelder-Mead, descrito por [6]. Tal estratégia também é utilizada por [7], na obtenção dos pontos de equilíbrio de uma aeronave. Como resultados, obtêm-se, para cada ponto no envelope, os ângulos de ataque e velocidades de arfagem de equilíbrio dado que não há deflexões nos canards; e as deflexões necessárias para manter um ângulo de ataque desejado. A Fig. 4 mostra o valor da deflexão em cada canard (do tipo profundor), para manter o ângulo de ataque que garante o máximo alcance, em cada ponto do envelope. Após a obtenção dos pontos de equilíbrio, o modelo é linearizado numericamente através do método das pequenas perturbações, conforme feito em [7]. Desta forma, a derivada de cada estado é escrita em função linear dos outros estados e das entradas de controle. Com o modelo linearizado, os modos de rolamento, arfagem e guinada podem ser desacoplados e é possível obter o diagrama de polos do sistema. A Fig. 5 mostra os polos do modo longitudinal superpostos para todas as condições de voo, onde é possível notar os modos de período curto (rápido e razoavelmente amortecido) e a fugóide (lenta e pouco amortecida). A Fig. 6 mostra uma comparação entre respostas dos sistemas linear e não-linear. Nota-se que o modelo linearizado representa bem o modelo não-linear numa região próxima ao ponto de equilíbrio instantâneo. IV. SISTEMAS DE PILOTAGEM São projetados três subsistemas para realizar a pilotagem do artefato, o sistema de aumento de estabilidade, o controlador de rolamento, e os seguidores de aceleração. A estratégia de projeto dos controladores é a mesma: inicialmente realiza-se a análise do lugar das raízes em uma condição central, definida como Mach=0,6 e h=6 km. Tal análise permite obter ganhos que propiciem um desempenho razoável. Os ganhos obtidos são utilizados como condição inicial, e o desempenho obtido é utilizado como função de custo para métodos de otimização numérica aplicados de forma a obter, automaticamente, os ganhos que cumpram os requisitos dados pela função de custo em todo o envelope de voo. As funções de custo utilizadas na otimização numérica retornam valores infinitos caso a margem de ganho do controlador seja inferior a 6 dB, ou a margem de fase seja inferior a 45º. Desta forma, garante-se uma boa margem de estabilidade para os controladores projetados automaticamente. A. Sistema de Aumento de Estabilidade A Fig. 6 mostra que as respostas do sistema em malha aberta a entradas do tipo profundor são bastante oscilatórias. Para amortecer tais oscilações, utiliza-se um controlador proporcional, denominado sistema de aumento de estabilidade, que realimenta a velocidade de arfagem em comandos do tipo profundor. A Fig. 7 mostra o diagrama deste sistema. A Fig. 8 mostra respostas obtidas na condição central, com e sem o sistema de aumento de estabilidade, para diferentes entradas degrau do tipo profundor. Nota-se que o sistema cumpre seus objetivos e amortece significativamente as oscilações da resposta. O ganho proporcional obtido para o controlador na condição central é extrapolado para todo o envelope de voo pelo método de otimização conhecido como Sequential Quadratic Programming (SQP). Tal método realiza otimização sujeita a restrições. Como requisito de desempenho, define-se a relação entre o undershoot e o overshoot da resposta em velocidade de arfagem como sendo 5%. Desta forma, garante-se um bom amortecimento independentemente das amplitudes dos sinais. Define-se uma restrição para o ganho entre 0 e 30, para velocidade de arfagem em rad/s. A Fig. 9 mostra o ganho proporcional otimizado, e o valor obtido do requisito em todo o envelope de voo. Nota-se que o requisito é cumprido com grande precisão em todo o envelope. B. Controlador de Rolamento Durante a fase de navegação, o artefato deve manter as deflexões do tipo profundor exibidas na Fig. 4 para voar com o α que garanta o máximo alcance. No entanto, o máximo alcance só é atingido caso não haja rolamento do artefato, pois a sustentação gerada deve ter a decomposição máxima possível na direção do peso. Desta forma, deve ser implementado um controlador de rolamento que mantenha o rolamento próximo de zero durante a fase de navegação. Como o ângulo de rolamento pode ser difícil de ser obtido pelos sensores embarcados, foi considerado um controlador proporcional-integral com realimentação da velocidade de rolamento em comandos do tipo aileron. A velocidade de rolamento pode ser obtida diretamente dos sensores inerciais. A Fig. 10 mostra o diagrama do controlador de rolamento implementado. A Fig. 11 mostra resultados obtidos para velocidade de rolamento, na condição central, com e sem o controlador de rolamento, para uma velocidade de rolamento inicial de 10º/s. Nota-se que o sistema cumpre seus objetivos e reduz significativamente o tempo necessário para cessar o rolamento. Os ganhos obtidos para o controlador na condição central são extrapolados para todo o envelope de voo pelo método de otimização numérica de Simplex de Nelder-Mead [6]. Como requisito de desempenho, define-se o tempo de subida da velocidade de rolamento como 0,05 s, que é muito mais rápido que as freqüências naturais do sistema e compatível com a banda de passagem dos atuadores. A Fig. 12 mostra os ganhos proporcionais e integrais otimizados, para velocidades de rolamento em rad/s, e o valor obtido do requisito em todo o envelope de voo. Nota-se que o requisito é cumprido com grande precisão em praticamente todo o envelope, apresentando somente três pontos isolados com tempos de subida até 10% maiores ou menores que o requisito. C. Seguidor de Aceleração Na fase terminal de voo, alguma lei de guiamento deve ser implementada de forma a gerar as acelerações de referência que devem ser seguidas para que o artefato atinja o alvo. Como exemplos de leis de guiamento possíveis, pode-se citar o guiamento do tipo perseguição de velocidade [8], que comanda acelerações proporcionais aos erros angulares de velocidade do artefato em relação à linha de visada; o guiamento proporcional, que é o mais largamente utilizado [9] e comanda acelerações proporcionais à velocidade de rotação da linha de visada; e uma forma mais avançada de guiamento proporcional viesado proposta por [10], que permite atingir o alvo com o ângulo de impacto desejado. Independentemente da lei de guiamento escolhida, deve ser projetado um seguidor de aceleração capaz de comandar as deflexões necessárias nas superfícies de controle para manter a aceleração desejada. Este trabalho projeta um seguidor de aceleração que pode ser utilizado com qualquer lei de guiamento. Como o artefato estudado possui dois planos de simetria, o seguidor de aceleração vertical e o seguidor de aceleração lateral são análogos e apresentam os mesmos ganhos. A única diferença é que o seguidor vertical gera comandos do tipo profundor, enquanto o seguidor lateral gera comandos do tipo leme. O seguidor de aceleração projetado consiste em uma malha interna com realimentação proporcional de velocidade de arfagem (para o seguidor vertical), de ganho idêntico ao obtido no projeto do sistema de aumento de estabilidade, e em uma malha externa contendo um controlador proporcional-integral-derivativo (PID), com realimentação de aceleração medida e um filtro passa-baixas na saída derivativa, de forma a minimizar a amplificação de ruído causada por derivação numérica de sinais. A malha interna tem a função de amortecer oscilações, enquanto a malha externa segue a aceleração de referência. A Fig. 13 mostra o diagrama de blocos do seguidor de aceleração. O projeto é realizado na condição central através de análise do lugar das raízes, e os ganhos obtidos são extrapolados para todo o envelope de voo através do método Simplex de Nelder-Mead [6]. O requisito definido para gerar a função de custo na otimização é o tempo de acomodação da aceleração ser igual a 0,5 s. Existem 3 ganhos que devem ser determinados pela otimização numérica. Para reduzir a dimensão do problema de otimização, os dois zeros adicionados pelo PID com derivada filtrada são posicionados sempre sobre os dois polos complexos conjugados do período curto do sistema com a malha interna fechada. Desta forma, apenas um ganho deve ser determinado, e os ganhos proporcional, integral e derivativo otimizados são obtidos através da alocação dos zeros e do ganho determinado pela otimização. A Fig. 14 mostra os ganhos do PID otimizados em todo o envelope, e os requisitos de desempenho obtidos. Nota-se que o requisito é satisfeito com grande exatidão em boa parte do envelope de voo, apresentando um tempo de subida maior principalmente a altas altitude e baixas velocidades, que é onde o controle é menos efetivo, já que as forças aerodinâmicas dependem da densidade do ar, que diminui com a altitude e da própria velocidade ao quadrado. A Fig. 15 mostra as respostas do sistema não-linear obtidas com o seguidor de aceleração a entradas degrau de 0,25 g de referência. Cada gráfico mostra resultados para uma determinada velocidade e são superpostas respostas para altitudes de 0, 3 km, 7 km, e 10 km. Percebe-se que, quanto maior a velocidade, maior a efetividade dos canards e o requisito é cumprido com maior exatidão para mais altitudes. Só é observado overshoot significativo e maiores dificuldades para cumprir os requisitos para a velocidade mínima considerada, de Mach=0,4. Ainda assim percebe-se que as acelerações comandadas ainda podem ser seguidas, porém com o desempenho degradado. V. CONCLUSÃO Este trabalho mostrou o desenvolvimento do sistema de pilotagem de uma bomba inteligente. Os resultados mostram que, apesar do sistema ser não-linear, é possível linearizá-lo e aplicar técnicas de controle linear para o projeto, como a análise do lugar das raízes, sem maiores problemas. Também mostrou-se que é possível utilizar métodos de otimização numérica para o projeto automático de ganhos dos controladores em todo o envelope de voo. Foi possível perceber que as maiores limitações de manobrabilidade, onde há maior dificuldade de se cumprirem os requisitos de desempenho propostos, são a baixas velocidade e altas altitudes, devido à menor intensidade das forças e momentos aerodinâmicos nestas condições. "
}