{
    "id": 186,
    "titulo": "simulação de uma bomba inteligente com guiamento terminal visual",
    "autor": "carlos henrique machado silva esteves",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2010/st/XIII_5.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Este trabalho implementa a simulação de uma bomba inteligente com guiamento terminal visual. O artefato é modelado, seu sistema de controle é projetado, é desenvolvido um simulador de voo e um método de análise de imagens que permite encontrar o alvo na imagem de uma câmera embarcada no artefato, dada uma imagem de referência de satélite. Os sinais de erro obtidos pela análise das imagens são realimentados no sistema de controle, permitindo o guiamento preciso até o alvo. O sistema completo é simulado e avaliado na presença de rajadas de vento e turbulência com diferentes configurações de sensores, incluindo sistemas de navegação inercial, sistema de posicionamento por satélites e o sistema de guiamento visual implementado.",
    "texto": " I. INTRODUÇÃO O emprego de bombas não guiadas em ataques aéreos ao solo apresenta baixa acurácia, exigindo grande número de lançamentos para cumprir uma determinada missão, gerando desperdício de recursos, efeitos colaterais e aumentando o risco para as aeronaves lançadoras. Segundo [1], na Segunda Guerra Mundial (1939-1945) o lançamento de uma bomba de 2.000 lb a média altitude apresentava um erro circular provável (ECP), que é o raio do círculo onde são esperados 50% dos pontos de impacto, de cerca de 3.300 ft. Na guerra da Coréia (1950-1953), com o aperfeiçoamento dos sistemas de tiro das aeronaves, o ECP caiu para cerca de 1.000 ft. Já no final da guerra do Vietnã (1959-1975), o ECP para as mesmas condições era cerca de 400 ft. Ainda com um ECP de 400 ft, para atingir um alvo de 60x100 ft com probabilidade de 90%, o número esperado de bombas lançadas é 176. Evidentemente este número é bastante alto para atingir um alvo relativamente grande e isto motivou a pesquisa e desenvolvimento de bombas guiadas. O guiamento a laser foi desenvolvido ainda na década de 1960 (família Paveway) e permitiu o lançamento de bombas com erro médio de cerca de 23 ft [2]. A grande desvantagem do guiamento a laser é a necessidade da iluminação do alvo por um feixe laser externo durante o voo do armamento, o que implica em uma aeronave ou tropa em solo com um pod iluminador, aumentando os riscos da missão. O sistema de navegação por satélites GPS entrou em operação na década de 1990, propiciando uma acurácia na localização de poucas dezenas de metros. Esta tecnologia permitiu o desenvolvimento de bombas guiadas com GPS e sistemas de navegação inercial (SNI), como a americana JDAM, que apresenta um ECP nominal de 13 m. As grandes desvantagens do guiamento com GPS/SNI são a necessidade de comunicação externa com satélites, que pode estar indisponível ou sofrer interferências e a impossibilidade de atingir alvos móveis. Mais recentemente, estudos vem sendo realizados para aumentar a precisão do sistema JDAM com a utilização de imageamento infravermelho e reconhecimento automático de alvos no guiamento terminal, com o objetivo de atingir um ECP de 3 m (10 ft) [2]. Também nesta linha existe o francês AASM (Armament Air-Sol Modulaire), que pode utilizar tanto guiamento com GPS/SNI quanto com SNI e imageamento infravermelho terminal, capaz de receber uma imagem infravermelha do alvo antes do lançamento localizá- lo nas imagens obtidas em voo. Tal sistema foi utilizado em combate no Afeganistão em 2008. Existem ainda sistemas semelhantes na Rússia (UPAB-1500), China (LS-6), Índia (ER-PGM) e Japão (GCS-1), porém com menos informações disponíveis. Um armamento convencional (não nuclear) realmente efetivo requer precisão que só é alcançada utilizando alguma forma de guiamento óptico na fase terminal de voo, como por exemplo o método de registro de imagens DSMAC (Digital Scene Matching Area Correlator), utilizado no míssil de cruzeiro americano BGM-109 Tomahawk [3]. Segundo [4], o míssil de cruzeiro russo Kh-101 utiliza registro de imagens no guiamento terminal, bem como o míssil de cruzeiro chinês Hong Niao-1. A utilização de imageamento infravermelho ou visível na fase terminal de voo com reconhecimento automático da localização do alvo na imagem permite um guiamento extremamente preciso e autônomo, visto que não necessita de comunicação com satélites ou com a aeronave lançadora, de iluminação do alvo por laser e nem da designação manual do alvo por operador externo. Entre as desvantagens pode-se citar o grande poder computacional exigido para a análise de imagens e a possível sensibilidade a condições adversas de visibilidade e iluminação. No entanto, como verificado pela sua utilização nos sistemas de armas mais modernos do mundo, este tipo de guiamento é plausível e deve ser estudado. É sob esta perspectiva que este trabalho é realizado. Espera-se que o desenvolvimento de módulo de guiamento visual para bombas de fins gerais, juntamente com superfícies aerodinâmicas para estender o alcance, permita o lançamento de maiores distâncias e mais precisos, minimizando o risco às aeronaves lançadoras, diminuindo o número de missões, evitando o desperdício de recursos e minimizando efeitos colaterais. Neste trabalho, é realizada a modelagem em seis graus de liberdade de uma bomba guiada e projetado seu sistema de controle. Um sistema de navegação visual é implementado e simulações são realizadas com a inserção de rajadas de vento e turbulência, avaliando a acurácia de diferentes configurações de sensores, incluindo sistemas de navegação inercial de diferentes características, sistema de posicionamento global (GPS) e o sistema de guiamento visual. II. TRABALHOS RELACIONADOS Há um número razoável de trabalhos que apresentam a modelagem e controle de mísseis e veículos aéreos não tripulados, mas pouco se encontra em relação a bombas. Além disso, não são encontrados trabalhos que abordam também a modelagem dos sensores e das perturbações atmosféricas, verificando sua influência na acurácia do sistema. Também não são encontrados trabalhos combinando o modelo completo de um artefato como o estudado com um sistema de guiamento visual. A referência [5] apresenta a modelagem e controle em três graus de liberdade de uma bomba convencional com guiamento utilizando GPS/SNI e com pequenas asas inseridas no corpo para aumento do alcance, mas não aborda a modelagem dos sensores e sua influência na acurácia do armamento. A referência [6] apresenta a modelagem com seis graus de liberdade e controle de um míssil anti-navio e realiza simulação hardware-in-the-loop com sensores reais, porém com o objetivo de avaliar o sistema de controle e não a acurácia do armamento. A referência [7] apresenta a simulação hardware-in-the-loop de uma bomba guiada a GPS/SNI, utilizando sensores reais, porém não avalia a influência de diferentes combinações de sensores na acurácia do sistema. Há um grande número de trabalhos recentes envolvendo técnicas de registro de imagens e guiamento visual de veículos aéreos autônomos. Registrar imagens consiste em encontrar a ocorrência de uma imagem dentro de outra, ou alinhar imagens obtidas de diferentes pontos de visada. Um tipo de problema que se assemelha ao estudado neste trabalho é o pouso de veículos aéreos não tripulados (VANT) e existem alguns artigos na literatura utilizando visão computacional para resolvê-lo. A maior parte das informações relativas à aplicação de análise de imagens no guiamento terminal de artefatos bélicos é de caráter confidencial e encontram-se muito poucos trabalhos na literatura endereçando esta aplicação específica. A referência [8] apresenta um sistema de navegação auxiliado por visão para as fases de aproximação e pouso de um veículo aéreo. O processamento de imagens consiste no registro das imagens capturadas durante o voo com as imagens de referência, utilizando uma forma acelerada de correlação. A referência [9] desenvolve um planador controlado somente por meio da análise das imagens de sua câmera, porém o sistema de análise da imagem é projetado apenas para encontrar janelas e fazer o planador passar por elas, não sendo possível reconhecer ou voar até um alvo qualquer. A referência [10] apresenta uma técnica baseada na transformada de Fourier-Mellin capaz de realizar o registro de imagens de forma invariante à rotação, escala e translação e sugere sua aplicação no guiamento terminal de armamento aéreo de precisão, mas não mostra resultados aplicados a um modelo completo de armamento. Esse artigo apresenta hipóteses semelhantes às deste trabalho, porém utiliza uma abordagem completamente diferente procurando atingir os mesmos objetivos. É sabido que a utilização de técnicas de correlação cruzada e variações para realizar o registro de imagens é bastante sensível a ruído, mudanças em condições de iluminação, oclusão e mudanças no ponto de visada. Em um tipo de aplicação como a proposta neste trabalho, não é possível a utilização de marcadores artificiais sobre o alvo e não é possível a utilização de uma câmera perpendicular ao solo, pois é necessário que o alvo esteja visível o maior tempo possível durante o guiamento terminal para que a distância de passagem seja a menor possível. Deste modo, deve ser utilizado um método capaz de extrair feições distintivas das imagens e que seja capaz de encontrar correspondências entre as feições obtidas em imagens de diferentes pontos de visada. Neste trabalho, é utilizado o método SIFT (Scale Invariant Feature Transform) para encontrar e descrever feições em imagens, proposto por [11]. III. DESENVOLVIMENTO A. Modelagem O artefato estudado tem a geometria baseada em uma bomba de aproximadamente 500 kg como as americanas Mk- 83, equipada com um módulo de guiamento laser, como os da família Paveway (Fig. 1) ou Lizard. Para facilitar a obtenção dos coeficientes aerodinâmicos, o modelo é simplificado para um perfil tangente-ogiva truncado, com um tronco de cone no final do corpo. O modelo aerodinâmico é obtido através do software Missile DATCOM, que utiliza métodos semi-empíricos. Os coeficientes aerodinâmicos e derivadas de estabilidade estáticas e dinâmicas são obtidos em diversos pontos com números de Mach entre 0.4 e 1.15, ângulos de ataque e derrapagem entre -40º e +40º e deflexões nas superfícies de controle entre -30º e +30º. A simetria é utilizada quando possível. B. Controle As superfícies de controle do artefato são os 4 canards simétricos, utilizados numa configuração skid-to-turn. São projetados três subsistemas de controle principais:  Sistema de Aumento de Estabilidade – controlador proporcional com realimentação da velocidade de arfagem em comandos do tipo profundor para amortecer o movimento no plano longitudinal;  Controlador de Rolamento – controlador Proporcional-Integral com realimentação da velocidade de rolamento em comandos do tipo aileron para evitar um rolamento descontrolado do artefato durante a fase de navegação;  Seguidor de aceleração – controlador ProporcionalIntegral-Derivativo baseado numa malha interna correspondente ao sistema de aumento de estabilidade, com uma malha externa com realimentação de aceleração vertical ou lateral em comandos do tipo profundor ou leme, que define a trajetória na fase terminal. Para a obtenção dos ganhos, o modelo é linearizado em pontos de equilíbrio instantâneos e é realizado o projeto em uma condição central através de análise do lugar das raízes. Os ganhos projetados na condição central são utilizados como condição inicial e o desempenho obtido é utilizado como função objetivo para algoritmos de otimização numérica, que retornam o valor para os ganhos em todo o envelope de voo, possibilitando a implementação de um escalonamento de ganhos. As fases de voo principais são a fase de navegação, na qual o artefato deve manter um ângulo de ataque que garanta o alcance máximo, corrigindo desvios no plano lateral; e a fase terminal, na qual é ativado um guiamento por perseguição de velocidade e são comandadas acelerações laterais e verticais proporcionais aos erros em azimute e elevação de forma a buscar uma trajetória em linha reta até o alvo. C. Simulador de Voo O ambiente é criado a partir de imagens da superfície terrestre e do céu. As imagens da superfície terrestre utilizadas são imagens de satélite obtidas através do software GoogleEarth, centradas no mesmo ponto, de diferentes escalas. Considera-se que o solo está contido em um plano. O simulador é capaz de gerar as imagens do ambiente obtidas pela câmera embarcada, e de gerar a visualização tridimensional da atitude do artefato durante o voo. Uma interface de comunicação UDP é desenvolvida entre o simulador de voo implementado em C/C++ e o simulador da dinâmica implementado em MATLAB/Simulink. A Fig. 2 mostra uma imagem gerada pelo visualizador de atitude. D. Análise da Imagem O método SIFT [11] é utilizado para realizar o registro entre a imagem de referência do alvo e a imagem obtida em voo. Os resultados mostram que o método funciona bem mesmo com o efeito projetivo da câmera oblíqua em relação ao solo nos pontos de visada típicos experimentados na trajetória do artefato estudado. Para buscar correspondências entre feições da imagem obtida em voo e da imagem de referência são utilizados métodos aproximados utilizando as estruturas de dados k-d trees [12] e o algoritmo de busca Best Bin First (BBF) [13]. Para selecionar ou rejeitar a correspondência é avaliada a razão entre as distâncias dos dois vizinhos mais próximos obtidos pelo BBF. Para encontrar a transformação projetiva (homografia) que leva as feições da imagem base para a imagem oblíqua é utilizado o algoritmo probabilístico RANSAC (Random Sample Consensus) [14]. Com a homografia, obtém-se a posição do alvo na imagem da câmera, dada a posição conhecida na imagem de referência. Com a inversa da matriz intrínseca de câmera, obtêm-se os erros em azimute e elevação que realimentam o sistema de controle. A Fig. 3 mostra um exemplo de quadro analisado. Na esquerda é exibida a imagem de referência ortogonal e na direita a imagem oblíqua obtida pela câmera. As feições são exibidas em vermelho e as correspondências como linhas retas ligando feições. A posição real do alvo é marcada em verde e a posição obtida após a análise em azul. IV. RESULTADOS A. Simulação Monte Carlo É realizada simulação Monte Carlo variando parâmetros de erros dos SNI e das perturbações externas (rajadas de vento e turbulência leve). Considera-se o SNI I com valores típicos utilizados num míssil de tempo de voo de poucos minutos dados por [15] e o SNI II, menos acurado, apresentando variância cinco vezes maior nos viéses e fatores de escala dos acelerômetros e giroscópios em relação ao SNI I. A tabela I mostra os resultados obtidos após 250 simulações para cada configuração de sensores. O ECP pode ser entendido como uma medida da acurácia da configuração, enquanto o desvio-padrão é uma medida da dispersão dos lançamentos. Percebe-se que a utilização de um SNI mais preciso sem auxílio de outros sensores, como na configuração 1, resulta numa acurácia muito menor que a obtida nas configurações com GPS ou câmera de vídeo. A configuração 3, com SNI pouco acurado e sem GPS, apresenta uma grande dispersão nos lançamentos, apesar de resultar em uma boa acurácia. Tal fato se deve aos casos em que os desvios na fase de navegação são tão grandes, que a região do alvo não é visível na fase terminal, impossibilitando a obtenção dos erros que realimentam o sistema de controle. Esse fato não ocorre na configuração 4, em que há GPS e, por isso, a dispersão é significativamente menor e a acurácia é a maior dentre todas as configurações testadas. A dispersão obtida para a configuração 4 é maior que a obtida para a configuração 2, apesar da acurácia da configuração 4 ser maior. Isto se deve ao uso da câmera como sensor na fase terminal para a configuração 4. Considera-se a câmera montada sobre gimbals e estabilizada aerodinamicamente, ou seja, alinhada com o vento relativo. Caso haja rajada de vento nos instantes finais de voo, a direção da câmera não estará alinhada com a velocidade inercial do artefato e os erros calculados não serão da velocidade inercial em relação à linha de visada e sim da velocidade aerodinâmica em relação à linha de visada. Desta forma, o controle não agirá de forma a levar o artefato diretamente ao alvo e distâncias de passagem maiores podem ser obtidas. B. Caso Típico O lançamento mostrado em detalhes para o caso típico consiste em um lançamento reto e nivelado, a 7 km de altitude, a 20 km de distância horizontal do alvo, a 250 m/s e com um desvio inicial em guinada de 5º em relação à direção do alvo. São inseridas turbulência leve e rajadas de vento de 10 m/s a cada 30 s. Os resultados exibidos nas Figs. 4, 5 e 6 são para a configuração 3, sem GPS e com o SNI II. A distância de passagem para este caso foi de 3,97 m. Na Fig. 4, no gráfico de velocidade (Va por t), percebe-se a perda de velocidade na fase de navegação, na qual um ângulo de ataque é mantido, e o aumento na fase terminal, na qual o artefato mergulha em direção ao alvo. No gráfico de ângulo de ataque (α por t), percebe-se claramente o instante em que o comando para manter o ângulo de ataque que garante o máximo alcance é realizado, fazendo com que este se mantenha praticamente constante até o instante quando é iniciada a fase de posicionamento para a fase terminal, onde ele se mantém em um valor negativo antes do início da fase terminal propriamente dita. No gráfico de trajetória lateral (y por x) percebe-se o grande desvio lateral acumulado durante o voo, causado pelo SNI II utilizado (de menor acurácia). No entanto, estes valores não são utilizados para o cálculo dos erros na fase terminal, pois estes são obtidos através da análise da imagem da câmera. No gráfico de trajetória vertical (h por x) percebe-se que a perda de altitude na fase de navegação é relativamente pequena devido ao ângulo de ataque mantido. Já na fase terminal o mergulho se dá praticamente em linha reta até o alvo. A Fig. 5 exibe os ângulos de Euler pelo tempo. No gráfico do ângulo de arfagem percebe-se que, durante a fase de navegação, este ângulo varia muito lentamente, mostrando que o artefato tende a apontar para o solo, porém o ângulo de ataque mantido minimiza este efeito. É verificada uma queda brusca no ângulo de arfagem no mergulho para a fase terminal, e este ângulo mantém-se praticamente constante durante essa fase, na qual o artefato voa praticamente em linha reta na direção do alvo. No gráfico do ângulo de rolamento percebe-se um pequeno rolamento mantido na fase de navegação, onde uma pequena aceleração lateral é solicitada de forma a tentar eliminar o erro lateral. O escoamento assimétrico causado pelo comando do tipo profundor mantido para garantir o alcance máximo unido com o comando do tipo leme para eliminar o erro lateral causa este pequeno ângulo de rolamento. Na fase terminal o controlador de rolamento é desativado e ocorrem variações maiores nesse ângulo. Na Fig. 6, é possível visualizar as acelerações lateral (Acy) e vertical (Acz) comandadas, experimentadas e medidas pelo sistema durante a trajetória. Na fase terminal, as acelerações de referência são proporcionais aos erros angulares calculados pela análise da imagem. Nota-se que, no início da fase terminal, há quadros em que o alvo não é encontrado na imagem, fazendo com que o valor de erro retornado seja zero e o erro obtido oscile entre zero e o valor real. Na medida em que o artefato se aproxima do alvo, este é encontrado mais facilmente na imagem e o erro angular obtido se mantém próximo ao erro real. Tal fato mostra que é interessante implementar algum tipo de filtro de modo a evitar o chaveamento que ocorre entre zero e o erro obtido no início da fase terminal, mas este assunto não é tratado neste trabalho. C. Alcance Máximo Para obter o alcance máximo dada a velocidade de lançamento e a altitude, são considerados lançamentos com sensores perfeitos, sem a influência de perturbações externas, com o artefato voando inicialmente na direção do alvo. Isto faz com que o alcance obtido seja o máximo teórico, já que é realizada a quantidade mínima possível de manobra em todas as trajetórias simuladas, ocasionando a menor perda de energia possível e o maior alcance. A Fig. 7 mostra os resultados obtidos. Percebe-se que o alcance máximo aumenta com a altitude e com a velocidade de lançamento, como é esperado. Nas condições extremas de altitude acima dos 30.000 ft e velocidade supersônica o alcance chega a 60 km, mas tais condições são difíceis de serem atingidas na prática. Considerando um lançamento típico de longo alcance, a 6 km (cerca de 20.000 ft) de altitude e a Mach=0,8, o alcance máximo teórico obtido é de aproximadamente 38,3 km. Segundo [17], durante a Guerra do Golfo (1990-1991), as bombas americanas GBU-15 de geometria semelhante à do artefato estudado neste trabalho foram lançadas com sucesso de distâncias entre 16 e 20 milhas náuticas do alvo. O caso de maior alcance corresponde a 37,04 km, valor bem próximo dos 38,3 km obtidos na simulação de lançamento típico de longo alcance deste trabalho, o que indica que o modelo desenvolvido é coerente com a realidade. V. CONCLUSÃO Este trabalho mostrou que a utilização de guiamento terminal visual em veículos aéreos autônomos é realizável e apresenta vantagens significativas em relação a métodos de guiamento tradicionais. Como cada tipo de sensor tem suas vantagens e desvantagens, é conveniente utilizar combinações de diferentes sensores para obter uma acurácia maior. Este fato é demonstrado pelos resultados das simulações Monte Carlo da configuração 4, que envolve GPS, SNI, câmera de vídeo e gerou os melhores resultados em termos de acurácia entre todas as configurações. O ECP obtido para essa configuração foi 38,15% inferior ao obtido com a configuração 2, que envolve GPS e SNI e é bastante utilizada em armamentos atuais. Verificou-se também que a utilização de sensores como o GPS e a câmera de vídeo pode eliminar a necessidade de um sistema de navegação inercial mais preciso, visto que os resultados da configuração 1 apresentaram o maior ECP dentre todas as configurações simuladas, mesmo com o SNI mais acurado.  "
}