{
    "id": 187,
    "titulo": "modelo eletromagnético para estruturas planas multicamadas: aplicabilidade e potencialidade",
    "autor": "sidnei j. s. sant’anna, j. c. da s. lacava, david fernandes e cleidimar g. pereira",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2010/st/XII_4.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "A aplicabilidade e a potencialidade de um modelo eletromagnético concebido para analisar estruturas planas com múltiplas camadas dielétricas são discutidas neste trabalho. Com foco em tópicos ligados ao espalhamento eletromagnético de alvos, exemplos são dados para a simulação de imagens SAR polarimétricas, a caracterização eletromagnética de alvos simples, o estudo de chaff e de detecção de objetos sob a superfície terrestre. ",
    "texto": "I. INTRODUÇÃO Há séculos os cientistas e pesquisadores vêm utilizando modelos matemáticos para descrever fenômenos naturais. Estes modelos têm por objetivo a compreensão, parcial ou total, da natureza física do problema. Além disso, ressalta-se que o desenvolvimento destes modelos auxilia na interpretação de dados e no estudo da sensibilidade de quantidades medidas, com relação a parâmetros de interesse. É o ponto de partida na condução de experimentos, além de propiciar dados simulados, auxiliar no projeto e construção de novos equipamentos, de ser extremamente útil no desenvolvimento de ferramentas e metodologias para tratamento de dados, entre outras razões. Modelos matemáticos têm sido utilizados em diversas áreas do conhecimento. Neste trabalho destaca-se a área da engenharia eletromagnética, na qual o estudo de ondas eletromagnéticas guiadas, da propagação de ondas em ambientes distintos do ar, de compatibilidade e interferência eletromagnéticas, de características elétricas de uma determinada antena, assim como do espalhamento eletromagnético, utiliza estes modelos. Muitos destes tópicos não podem ser analisados adequadamente por modelos puramente analíticos, sendo necessária, portanto, a utilização de métodos numéricos para a solução do problema. Os métodos numéricos podem ser divididos em três grandes grupos: os que se baseiam na solução de equações integrais (Método dos Momentos), os que se baseiam na solução de equações diferenciais (Elementos Finitos, Diferenças Finitas) e aqueles que não utilizam nenhuma destas técnicas (Óptica Física, Óptica Geométrica, Teoria Uniforme de Difração). Em se tratando de modelagem eletromagnética, o Laboratório de Antenas e Propagação (LAP) do Instituto Tecnológico de Aeronáutica tem utilizado, com sucesso, a técnica de onda completa no domínio espectral no estudo (projeto e análise) de antenas de microfita, sejam elas montadas sobre superfícies multicamadas planas [1-4], cilíndricas [5-6] ou esféricas [7]. Com base nesta experiência, tal técnica de modelagem eletromagnética foi adaptada para o estudo do espalhamento eletromagnético de alvos [8-9]. Nestes casos os alvos de interesse são descritos por estruturas planas multicamadas excitadas por ondas planas e uniformes contendo elementos espalhadores nas interfaces entre as camadas. Tendo a modelagem como foco, o objetivo deste trabalho é a discussão da potencialidade e da aplicabilidade de um específico modelo eletromagnético. Para tanto estes trabalho está organizado da seguinte maneira. A modelagem eletromagnética em consideração é descrita de maneira sucinta na Seção II. Na Seção III a aplicabilidade e a utilidade desta modelagem são exemplificadas. Finalmente, as conclusões relativas aos resultados são expostas na Seção IV. II. O MODELO ELETROMAGNÉTICO A estrutura a ser modelada é composta por N+2 camadas dielétricas lineares, homogêneas e isotrópicas superpostas na direção do eixo z de um sistema de coordenadas retangulares. As camadas são também supostas ilimitadas ao longo das direções dos eixos x e y, como mostrado na Fig. 1. A camada inferior que ocupa a região negativa de z é denominada de camada ground e possui permissividade elétrica (εg) e permeabilidade magnética (μg) complexas. As N camadas existentes entre o espaço livre e a camada ground são denominadas de camadas confinadas e são caracterizadas por espessuras ℓn, permissividade elétrica (εn), permeabilidade magnética (μn) complexas, com 1  n  N. A interface z = dN separa a N-ésima camada da região do espaço livre e tanto esta camada quanto a camada ground possuem espessuras ilimitadas. Elementos que suportem correntes elétricas ou magnéticas são impressos nas N+1 interfaces entre as camadas. Estes elementos atuarão como espalhadores da estrutura multicamadas, após uma onda eletromagnética plana e uniforme, elipticamente polarizada e com incidência oblíqua (definida pelos ângulos i e i de um sistema de coordenadas esféricas) excitar a estrutura. A onda incidente induzirá densidades superficiais de corrente elétrica ou magnética sobre os elementos espalhadores. O procedimento usado na determinação dos campos eletromagnéticos presentes em uma estrutura com múltiplas camadas planas e das respectivas funções de Green é descrito resumidamente no diagrama de blocos da Fig. 2. Este é o mesmo procedimento adotado em [8]-[12]. O desenvolvimento analítico é baseado no sistema de coordenadas retangulares localizado no topo da camada ground (interface z = 0). De acordo com esta metodologia a estrutura é tratada como um problema de contorno e as correntes induzidas nos elementos espalhadores serão as fontes virtuais dos campos espalhados. Inicialmente, parte-se das equações de onda para cada camada, no domínio de Fourier, das quais se obtém um sistema de equações diferenciais. A partir deste sistema e após a aplicação das condições de contorno apropriadas, em cada interface, produz-se um sistema linear nas amplitudes dos campos eletromagnéticos transformados, possuindo 4N+4 equações e o mesmo número de incógnitas, onde a variável N é igual ao número de camadas confinadas da estrutura. As funções de Green espectrais para cada camada são obtidas analiticamente resolvendo-se este sistema linear. Através da combinação das funções de Green espectrais e do campo excitador da estrutura, o qual está diretamente relacionado aos campos da onda incidente, monta-se um sistema de equações integrais. Neste sistema as incógnitas serão as componentes das densidades superficiais de corrente induzidas sobre os elementos espalhadores. Para resolver o sistema de equações integrais aplica-se o método dos momentos (MoM) no domínio espectral. Primeiramente, expande-se linearmente a densidade superficial de corrente em funções de base, utilizam-se o método de Galerkin (onde as funções de teste e de base são definidas iguais) e o teorema de Parseval. Neste ponto os campos eletromagnéticos transformados em qualquer ponto da estrutura multicamadas podem ser determinados. Finalmente, os campos eletromagnéticos no domínio espacial são obtidos a partir da transformada inversa de Fourier. O método da fase estacionária é usado para se obter expressões assintóticas para os campos eletromagnéticos espalhados pela estrutura. Mais detalhes sobre este procedimento de cálculo dos campos eletromagnéticos pode ser encontrado em [2]-[9]. A determinação dos campos eletromagnéticos presentes na estrutura multicamadas é realizada, neste modelo, a partir da definição dos seguintes parâmetros de entrada: a frequência de operação, as direções de incidência e espalhamento da onda eletromagnética, a polarização e a amplitude da onda incidente na estrutura, as características elétricas das camadas (permissividade elétrica, permeabilidade magnética e a tangente de perdas), a espessura das camadas confinadas e as geometrias dos elementos espalhadores. A flexibilidade, a tratabilidade e a ampla gama de aplicações deste modelo o tornam bastante atrativo para a comunidade científica no que tange o estudo do espalhamento eletromagnético de alvos. A grande versatilidade da estrutura (Fig. 1) na modelagem de diferentes tipos de problemas é demonstrada em [9], através de análise analítica e numérica de suas funções de Green espectrais. Nestas análises é mostrado como é possível se obter estruturas que contenham camadas confinadas superpostas a uma parede elétrica perfeita (PEP) a partir de estruturas compostas por camadas confinadas, superpostas a um meio linear, homogêneo e isotrópico (a camada ground). Isto é, realiza-se uma análise demonstrando em que condições a camada ground passa a se comportar como um condutor perfeito. Neste caso, admite-se que as perdas da camada ground possam ser incorporadas na sua permissividade elétrica εg. Assim, a permissividade da camada ground é escrita em função de sua tangente de perdas (tan δg). Um meio denominado de condutor elétrico perfeito deve possuir condutividade infinita, este fato implicará em εg tender para –i ∞ e, por conseguinte, g tender para  i . Desta forma, pode-se afirmar que, no limite, quando a tangente de perdas da camada ground tender para infinito ela se comportará como uma PEP (condutor perfeito). Numericamente, foi verificado que para valores de tangente de perdas superiores a 1,010+15 a camada ground já se comporta como uma PEP. III. APLICAÇÕES Nesta seção serão descritas aplicações baseadas no modelo eletromagnético apresentado na seção anterior. Algumas destas aplicações já foram desenvolvidas, enquanto outras se encontram no plano do desenvolvimento ou a ser desenvolvida. A. Modos Guiados em Estruturas Planas A presença de espalhadores em estruturas com múltiplas camadas pode propiciar a excitação de ondas guiadas nestas camadas. Na modelagem eletromagnética desenvolvida são determinadas expressões para os campos eletromagnéticos destas ondas. É, também, possível mostrar, a partir da desta modelagem, que as constantes de propagação dos modos guiados nas camadas dielétricas estão associadas aos polos das funções de Green espectrais da estrutura. O guia de ondas a ser analisado é constituído por duas camadas dielétricas, como ilustrado na Fig. 3. Note, no entanto, que a camada ground é considerada ser uma PEP. A abordagem utilizada para análise dos modos guiados em estruturas planas é similar àquela empregada na solução dos campos eletromagnéticos transformados (campos no domínio espectral). Em [8] foram traçadas curvas de dispersão para os modos guiados (TMx e TEx) para um guia com camadas dielétricas sem perdas (tan  = 0), permissividades relativas iguais a εr1=εr2=2,55 e d2=2d1 com d1=1,524 mm. Como esperado, o modo dominante (ou fundamental) é o TM0, não possuindo frequência de corte. Este fenômeno é um dos fatores limitantes da eficiência de irradiação de redes de antenas de microfita. Considerando-se que a propagação ocorre na frequência de 32,80 GHz, o gráfico das curvas de dispersão indica a possibilidade de excitação dos modos, TM0 e TE1, com as seguintes constantes de propagação:  = 1,4630 k0 e  = 1,2178 k0, respectivamente. Gráficos dos módulos das componentes dos campos eletromagnéticos guiados do modo fundamental TM0, normalizados em relação à amplitude longitudinal do campo elétrico transformado e z11, são mostrados na Fig. 4. Nesta figura as regiões hachuradas compreendidas entre z/d2=0 e z/d2=0,5 correspondem à camada dielétrica 1, e as confinadas entre z/d2=0,5 e z/d2=1,0 definem a camada dielétrica 2. Da Fig. 4 observa-se que as componentes Ex e Hy são contínuas em z=d1 e z=d2. Por outro lado, como os dielétricos das camadas 1 e 2 são iguais, a componente Ez só é descontínua na interface z=d2, isto é, entre a segunda camada e o espaço livre. B. Análise de Irradiação Considere uma estrutura que contenha apenas uma camada confinada de espessura ℓ1 entre o espaço livre e a camada ground, ou seja, faça N = 1 na Fig. 1. Admita ainda, que elementos espalhadores caracterizados por dipolos curtos elétricos e magnéticos, orientados ao longo do eixo x do sistema de coordenadas retangulares, estejam localizados na interface entre o espaço livre e a camada confinada. A influência da espessura ℓ1 da camada confinada, nos diagramas de irradiação dos dipolos elétricos e magnéticos impressos, é analisada. A característica de irradiação dos dipolos curtos é quantificada através da função diretividade (, ). As análises são realizadas na frequência de 2,25 GHz, admitindo-se que a permeabilidade magnética de todas as camadas das estruturas é igual a 0. Na avaliação da espessura da camada confinada os parâmetros elétricos das camadas dielétricas foram mantidos fixos em r = 2, tan  = 0, rg = 1 e tan g = 1,010+15, enquanto variou-se ℓ1 de 4 mm (0,030) até 40 mm (0,30), em passos de 4 mm. A influência de ℓ1 nos diagramas de irradiação dos dipolos impressos é mostrada na Fig. 5, onde são ilustrados os diagramas tridimensionais de (, ) para as espessuras ℓ1 = 4 mm e ℓ1 = 40 mm. Desta figura nota-se que, além da forma do diagrama, os níveis de irradiação também são modificados com a variação da espessura da camada confinada. Estas alterações podem ser explicadas pelo número e tipo de modos guiados pela estrutura, ou seja, com o aumento de ℓ1, mais modos guiados podem ser estabelecidos na estrutura. O aumento do número de modos guiados acarreta na diminuição da energia espalhada pela estrutura uma vez que mais energia é concentrada na estrutura. C. Caracterização Eletromagnética A caracterização eletromagnética de um dado objeto (alvo) é realizada através de medidas ou atributos que descrevam suas propriedades eletromagnéticas. Geralmente, estas medidas são obtidas a campo distante, como é o caso, por exemplo, da matriz de espalhamento, da seção reta radar e dos parâmetros entropia, anisotropia e ângulo α derivados da decomposição da matriz de coerência dos alvos [13]. Todas estas medidas estão relacionadas ao processo de espalhamento eletromagnético do alvo. O espalhamento provocado por um alvo depende de suas características eletromagnéticas assim como das características do sensor que gerou a onda eletromagnética. Uma vez que no modelo eletromagnético aqui apresentado é possível a determinação dos campos eletromagnéticos distantes espalhados pela estrutura multicamadas e temse o controle dos parâmetros de entrada, pode-se, então, utilizá-lo na caracterização eletromagnética de alvos. A seção transversal de espalhamento (Scattering Cross Section – SCS), que também é utilizada na caracterização das propriedades de espalhamento de um alvo, é outra medida que pode ser obtida através da modelagem eletromagnética aqui apresentada. A SCS de um alvo é função da polarização da onda eletromagnética incidente, do ângulo de incidência, do ângulo de observação, da geometria e das propriedades elétricas do alvo e da frequência de operação. Pode-se, desta forma, através do modelo eletromagnético estudar a influência da variação destes parâmetros na SCS de um dado alvo, como realizado em [9, 12, 14]. A fim de exemplificar o cálculo da SCS duas estruturas distintas foram utilizadas, uma contendo como elemento espalhador um dipolo elétrico e outra contendo um dipolo magnético, ambos planares. Os dipolos de largura w e comprimento ℓ têm suas dimensões orientadas, respectivamente, ao longo dos eixos y e x de um sistema de coordenadas retangulares e são posicionados na interface entre a região de espaço livre e a última camada dielétrica da estrutura. Todas as camadas dielétricas possuem parâmetros elétricos iguais aos do vácuo, isto é, rn = 1, tan n = 0 e n = 0 para n  {g, 1, 2, , N}. A análise do espalhamento dos dipolos foi realizada na frequência de 9,6 GHz (banda X) e na condição monoestática, ou seja, o campo espalhado foi calculado na mesma direção da onda incidente (i = s e i = s). Ondas linearmente polarizadas com amplitude unitária que incidem obliquamente (θi = 30o e i = 60o) na estrutura multicamadas, foram usadas para excitar os dipolos planares. Na Fig. 6 são mostrados os gráficos da SCS em azimute (θs = 30o e −180o ≤ s ≤ +180o) obtidos para o dipolo elétrico (linha contínua) e para o dipolo magnético (linha tracejada) com três comprimentos distintos ℓ = 0,20λ0, ℓ = 0,45λ0 e ℓ = 0,70λ0. Cabe ressaltar que a razão ℓ/w foi mantida igual a 100 na definição das dimensões dos dipolos em análise. Na Fig. 6a a SCS dos dipolos é obtida quando a onda eletromagnética incidente na estrutura possui polarização linear horizontal, enquanto a excitação através de uma onda verticalmente polarizada produz a SCS ilustrada na Fig. 6b. Observe que os gráficos de SCS estão refletindo o esperado da teoria, isto é, o dipolo elétrico cujo comprimento está mais próximo do comprimento ressonante (ℓ = 0,45λ0) possui uma resposta maior (espalhamento mais forte) que os demais. Já no caso do dipolo magnético a intensidade do espalhamento é proporcional ao comprimento do dipolo. Na caracterização eletromagnética é igualmente importante analisar o espalhamento provocado por uma dada estrutura em função da variação dos parâmetros elétricos que caracterizam as camadas dielétricas da estrutura. Para exemplificar esta análise são mostrados na Fig. 7 gráficos da variação da SCS em azimute (θs = 40o e −180o ≤ s ≤ +180o) em função da permissividade elétrica da camada ground e em elevação (−90o ≤ θs ≤ +90o e s = 60o) quando a tangente de perdas da camada confinada é modificada. O cálculo da SCS foi realizado no modo monoestá- tico e na frequência de 1,25 GHz (banda L) para uma estrutura contendo apenas uma camada dielétrica confinada entre a região de espaço livre e a camada ground. As camadas confinada e ground são caracterizadas, respectivamente, por r = 2,33 e tan  = 0,12, rg = 5,0 e tan g = 0,2 e pela permeabilidade magné- tica do espaço livre (μ0). Dipolos elétrico e magnético planares de comprimento 95,83 mm e largura 1,92 mm são posicionados na interface entre camada confinada e o espaço livre. D. Geração de Imagens Polarimétricas A geração de dados SAR (Synthetic Aperture Radar) é outro exemplo dentre as possíveis aplicações do modelo eletromagnético apresentado na Seção II. A metodologia utilizada na simulação de imagens SAR polarimétricas é completamente descrita em [9] e [11]. No conjunto de imagens simuladas se utilizaram estruturas multicamadas compostas por três camadas isotrópicas, lineares e homogêneas, ou seja, uma estrutura com uma única camada confinada para gerar imagens polarimétricas complexas de uma visada. Estas imagens possuem resolução espacial de 3 m nas direções de alcance e azimute e espaçamento entre pixels de 2,8 m nas mesmas direções, tendo 35º de ângulo de grazing e representam uma área no terreno de 290 m  290 m. Dipolos elétricos retangulares de espessura infinitesimais, medindo 50 mm  1 mm, são impressos na interface (plano z = d1) entre o espaço livre e a camada confinada. No processo de simulação um grande número de dipolos é distribuído aleatoriamente ao longo do plano z = d1, de tal forma que é garantido existir no mínimo 30 elementos espalhadores em cada célula de resolução do SAR. As imagens SAR simuladas representam as imagens de um sensor monoestático. O conjunto de imagens, ilustrado na Fig. 8, foi gerado para um SAR operando em banda L (1,25 GHz) e para as seguintes características da estrutura multicamadas: camada ground com rg = 5,0 e tan g = 0,2, camada confinada com ℓ1 = 527,63 mm, r= 2,33 e tan = 1,2 10-4 e ambas com permeabilidade magnética μ0. As imagens foram simuladas baseadas numa imagem idealizada de classes, contendo quatro regiões distintas como ilustrado na Fig. 8a. A orientação local dos dipolos é usada como principal atributo discriminador entre as regiões, as quais são rotuladas pelas letras A, B, C e D e representadas, respectivamente, pelas cores magenta, azul, verde e vermelho na imagem de classes. A orientação dos dipolos tem como referência o eixo azimutal e a origem do sistema de coordenadas está localizada no centro da imagem. Os dipolos são orientados preferencialmente a 10º, 30º e 20º, respectivamente, nas regiões A, B e C, enquanto na região D os dipolos têm orientação totalmente aleatória. As imagens em amplitude dos canais HH, HV e VV são mostradas na Fig. 8. O canal VH não é apresentado nesta figura já que é igual ao canal HV devido à reciprocidade. Note que este processo de simulação de imagens SAR desenvolvido pode ser aplicado para a simulação de uma nuvem chaff. O chaff apesar de ser uma das primeiras contramedidas eletrônicas empregadas ainda continua sendo utilizado eficientemente nos dias atuais. De acordo com [15] o chaff consiste de um grande número de refletores, usualmente na forma de pequenas tiras metálicas, liberados na atmosfera criando uma nuvem altamente refletiva. Estes elementos são espalhados pela ação dos ventos, com o intuito de prejudicar visibilidade de algum radar inimigo. Portanto, para simular uma nuvem de chaff, a partir do modelo eletromagnético desenvolvido basta calcular a seção transversal radar (Radar Cross Section  RCS) de dipolos elétricos distribuídos aleatoriamente e considerar que todas as camadas dielétricas da estrutura são iguais ao ar. A simulação dipolos em qualquer posição do espaço, inclusive na vertical, é conseguida com uma rotação do sistema de coordenadas. No entanto, para se levar em conta diferentes condições atmosféricas (mudanças nas características dielétricas das camadas, incluindo anisotropia) o modelo deve ser de multicamadas e desenvolver o espalhamento eletromagnético para um dipolo orientado na vertical. Este último tópico já está em fase de desenvolvimento no LAP. E. Outras Aplicações A partir da modelagem eletromagnética apresentada vislumbra-se o seu emprego no estudo de superfícies seletoras de frequências (Frequency Selective Surface FSS). Uma FSS é formada por arranjos bidimensionais periódicos de elementos metálicos e/ou aberturas (slots) impressos em uma ou mais camadas dielétricas, como mostrado simplificadamente na Fig. 9. A FSS atua como um filtro de frequências e são, geralmente, utilizadas para diminuir a RCS de uma dada estrutura. Portanto, este tipo de superfície pode ser encontrado na construção de radomes, lentes e refletores para determinadas antenas ou ainda na tecnologia stealth. O tipo, a geometria, e a posição de cada elemento, assim como os parâmetros elétricos das camadas dielétricas que compõem uma FSS são fatores fundamentais na sua caracterização. A influência destes fatores pode ser avaliada de maneira bem eficaz usando-se a modelagem eletromagnética desenvolvida. Outra possível aplicação do modelo eletromagnético descrito na Seção II é a sua adequação para detecção de objetos metálicos ou não metálicos sob a superfície terrestre. Estes objetos podem ser, por exemplo, minas terrestres com diferentes formas e tamanhos. Atualmente, o radar de penetração terrestre (Ground Penetration Radar  GPR) tem sido a tecnologia mais amplamente utilizada para este fim. Desta forma, o modelo apresentado pode auxiliar no desenvolvimento de novas metodologias para a detecção de minas, incluindo distintos modos de aquisição de dados. Isto é, as configurações multiestáticas apresentadas na Fig. 10. Dentro, ainda, da caracterização eletromagnética de alvos, a análise da densidade superficial de corrente induzida no elemento espalhador é um fator muito importante. Isto, porque os campos eletromagnéticos presentes na estrutura estão diretamente relacionados a esta densidade. Portanto, a citada análise pode ser fortemente auxiliada através da utilização de programas computacionais especificamente implementados (software) [14]. Por fim, esta modelagem pode ainda ser empregada para fins didáticos, uma vez que o ensino/aprendizado de disciplinas relativas ao espalhamento eletromagnético de alvos fica facilitado a partir do uso deste tipo de software. Neste caso o aluno pode adquirir rapidamente o conhecimento físico embutido no fenômeno eletromagnético. Mais detalhes sobre a implementação do MoM, assim como, estudos da variação da SCS e da densidade superficial de corrente induzida no dipolo podem ser encontrados em [9]. IV. CONCLUSÕES Um modelo eletromagnético que leva em conta estruturas com múltiplas camadas é apresentado neste trabalho. A determinação dos campos eletromagnéticos presentes neste tipo de estrutura é descrita de forma sucinta. A aplicabilidade do modelo eletromagnético é ilustrada através da sua utilização no estudo de modos guiados em estruturas com múltiplas camadas planas, na análise de irradiação de dipolos curtos, na caracterização eletromagnética de alvos simples e na simulação de imagens SAR polarimétricas de uma visada. Por outro lado, a potencialidade desta modelagem é destacada através da sua aplicação no estudo de chaff, de superfícies seletoras de frequências e ainda no desenvolvimento de novas metodologias aplicáveis na área de detecção de objetos sob a superfície terrestre. "
}