	{
		"id": 22,
		"titulo": "caex realiza testes do sistema transportável para rastreio de engenhos em voo",
		"autor": "Noticiário do Exército",
		"url": "https://www.eb.mil.br/web/noticias/noticiario-do-exercito/-/asset_publisher/znUQcGfQ6N3x/content/id/14745118",
		"tipo_documento": "Notícia",
		"rotulo": 3,
		"resumo": 0,
		"texto": "Rio de Janeiro (RJ) – O Centro de Avaliações do Exército (CAEx), Campo de Provas da Marambaia/ 1948 realizou, no período de 28 de junho a 9 de dezembro uma série de testes de aceitação em campo (TAC) do Sistema Transportável para Rastreio de Engenhos em Voo (STREV), cuja concepção está inserida no Programa Estratégico do Exército ASTROS (Prg EE ASTROS). O escopo do Projeto de Instrumentação para Campo de Instrução (PICI) contemplou a celebração de contrato de serviços entre o Departamento de Ciência e Tecnologia (DCT) e a empresa Omnisys Engenharia, para implantação do STREV, que se encontra atualmente em andamento, e cujas fases de revisão de projeto preliminar, revisão de projeto detalhado, fabricação, testes de aceitação em fábrica e treinamento teórico dos operadores do sistema foram entregues. Os TAC são fase decisiva do serviço em questão, durante os quais o STREV foi empregado no rastreio de munições reais de Morteiro 81 mm e Obuseiro 155 mm, com o apoio do Arsenal de Guerra do Rio e do 11º Grupo de Artilharia de Campanha, e de três lançamentos de foguetes SS-30 ASTROS, com o apoio do 6º Grupo de Mísseis e Foguetes. Nos testes realizados no CAEx, destacou-se a demonstração do STREV ao Chefe do DCT, General de Exército Guido Amin Naves, em 17 de agosto, ocasião na qual o rastreio foi monitorado em tempo real pelas autoridades presentes, por meio da exibição de dados obtidos pelo próprio sistema. Após o treinamento em campo dos operadores do sistema realizado no CAEx, no mês de setembro, o STREV foi transportado em comboio a partir da Restinga da Marambaia, no Rio de Janeiro-RJ, até o Forte Santa Bárbara, em Formosa-GO, em percurso aproximado de 1.480 km, para execução dos TAC no Campo de Instrução de Formosa, no período de 25 de outubro a 17 de novembro, durante o qual foi empregado no rastreio de seis lançamentos de foguetes SS-30 ASTROS, com o apoio do Comando de Artilharia do Exército e do 11º Grupo de Mísseis e Foguetes. Nos testes realizados no Campo de Instrução de Formosa, destacou-se a demonstração do STREV, em 16 de novembro, ao Chefe do Estado-Maior do Exército, General de Exército Marcos Antônio Amaro dos Santos, quando o rastreio foi executado, em tempo real, às autoridades presentes, por meio da exibição de dados obtidos e apresentados pelo próprio sistema. Após a conclusão dos testes no Forte Santa Bárbara, em 17 de novembro, o STREV foi transportado em comboio, durante quatro dias, em percurso aproximado de 1.960 km, a partir de Formosa-GO, até o Campo de Provas Brigadeiro Velloso (CPBV), organização militar (OM) da Aeronáutica localizada na Serra do Cachimbo, em Novo Progresso-PA. Foram executados TAC no CPBV, no período de 29 de novembro a 3 de dezembro, cujos testes objetivaram verificar e validar a transportabilidade e a operação do STREV naquela localidade remota, com vistas à aplicação do sistema no rastreio do Míssil Tático de Cruzeiro MTC-300 em campanhas de lançamento planejadas para 2022. Após a conclusão, o STREV foi transportado em comboio até o CAEx, aproximadamente 2.930 km, durante seis dias, quando foram concluídos os testes, em 9 de dezembro. O deslocamento do sistema durante os testes de aceitação em campo, no percurso: Rio de Janeiro – Formosa – Novo Progresso – Rio de Janeiro, totalizou cerca de 6.370 km e foi realizado por equipe de 15 integrantes do CAEx, com o apoio de um militar e de viatura de abastecimento do 25º Batalhão Logístico (Escola) e de engenheiros e técnicos da Omnisys. O comboio também contou com o apoio das seguintes OM ao longo do deslocamento: 13º Regimento de Cavalaria Mecanizada, em Pirassununga-SP, do 2º Batalhão Ferroviário, em Araguari-MG, do 11º Grupo de Mísseis e Foguetes, em Formosa-GO, do 58º Batalhão de Infantaria Motorizado, em Aragarças-GO, do 44º Batalhão de Infantaria Motorizado, em Cuiabá-MT, do Tiro de Guerra 09-002 da 9ª Região Militar, em Sinop-MT, do Campo de Provas Brigadeiro Velloso, em Novo Progresso-PA, do 41º Batalhão de Infantaria Motorizado, em Jataí-GO, do 37º Batalhão de Infantaria Leve, em Lins-SP, e do 2º Batalhão Logístico Leve, em Campinas-SP. O retorno do Sistema Transportável para Rastreio de Engenhos em Voo ao CAEx, após a conclusão dos testes de aceitação em campo, marca o término da mais importante fase do sistema, que antecede a aceitação definitiva prevista para janeiro de 2022."
	}
