	{
		"id":23 ,
		"titulo": "exército e embraer apresentam radar desenvolvido com tecnologia 100% nacional",
		"autor": "Noticiário do Exército",
		"url": "https://www.eb.mil.br/web/noticias/noticiario-do-exercito/-/asset_publisher/znUQcGfQ6N3x/content/id/14728435",
		"tipo_documento": "Notícia",
		"rotulo": 3,
		"resumo": 0,
		"texto": "Campinas (SP) – Um dia histórico para o desenvolvimento das tecnologias de defesa do Brasil. Na tarde da última sexta-feira, 10 de dezembro, o Exército Brasileiro e a Empresa Brasileira de Aeronáutica S/A (Embraer) apresentaram, em solenidade realizada na Unidade Embraer de Campinas, o radar Saber M200 Vigilante, tecnologia 100% nacional que eleva a capacidade brasileira de defesa antiaérea. Com alcance de 200 km, o Saber M200 Vigilante é um radar de vigilância de médio alcance desenvolvido pelo Centro Tecnológico do Exército (CTEx) para atender às necessidades do Projeto Estratégico do Exército Defesa Antiaérea. O radar poderá ser empregado na vigilância e no alerta antecipado em Baterias e Grupos de Artilharia Antiaérea ou, ainda, em atividades de controle de tráfego aéreo ou de vigilância de fronteira. Concebida e desenvolvida no Brasil em parceria com a Embraer, a tecnologia é propriedade intelectual do Exército Brasileiro. O Comandante do Exército, General de Exército Paulo Sérgio, destacou a importância da nova tecnologia e a parceria entre Exército e Embraer, que já dura 15 anos. Juntos, promovemos o estímulo à ciência, à tecnologia e à inovação, ao mesmo tempo em que contribuímos com a capacidade de dissuasão contra eventuais ameaças e para a proteção ao nosso território, além de projetar internacionalmente o Exército Brasileiro, a indústria nacional e o Brasil. O radar Saber M200 Vigilante, mais novo integrante da família de radares de vigilância, é produto de uma tecnologia de alto valor agregado e enseja uma franca possibilidade de ampliação da participação brasileira no mercado internacional de defesa, vislumbrando-se uma potencial contribuição para a economia do país. O Chefe do Departamento de Ciência e Tecnologia, General de Exército Amin, ressaltou que a apresentação do radar Saber M200 Vigilante representa um dia histórico para o Exército. O radar é um elo fundamental do Sistema de Controle e Alerta, o coração da Defesa Antiaérea, e representa um salto tecnológico sem precedentes para o Brasil. O General Amin também indicou que há novos projetos a caminho. Na família dos radares M200, já se encontra em fase avançada o radar M200 Multimissão, elo fundamental para o Sistema de Controle e Alerta e Controle de Fogo do Sistema de Artilharia Antiaérea de média altura, cujo projeto de obtenção encontra-se ativado e em execução. Já o presidente e CEO da Embraer Defesa e Segurança, Jackson Schneider, exaltou a colaboração de 15 anos entre Exército e Embraer e destacou as oportunidades geradas por tecnologias como o radar Saber M200 Vigilante. O início de operação deste radar pelas Forças Armadas do Brasil vai ser fundamental para a validação e o endosso de soluções visando futuras exportações. Tenho certeza de que esta tecnologia irá gerar energia econômica e empregos para o Brasil e para outros países também."
	}
