	{
		"id": 25,
		"titulo": "exército recebe sistema móvel de rastreio para avaliação de mísseis e foguetes",
		"autor": "Noticiário do Exército",
		"url": "https://www.eb.mil.br/web/noticias/noticiario-do-exercito/-/asset_publisher/znUQcGfQ6N3x/content/id/13494280",
		"tipo_documento": "Notícia",
		"rotulo": 2,
		"resumo": 0,
		"texto": "Rio de Janeiro (RJ) – O Centro de Avaliações do Exército (CAEx) recebeu, em 11 de junho, o Sistema Transportável de Rastreio de Engenhos em Voo (STREV), capaz de efetuar o rastreio de diversos tipos de munições, dotando o Exército Brasileiro com uma nova capacidade. O equipamento integra o programa estratégico do Exército ASTROS 2020 (PEE ASTROS 2020). O objetivo principal do sistema é apoiar a pesquisa, o desenvolvimento e a avaliação do míssil tático de cruzeiro MTC-300 e do foguete guiado SS-40G, projetos do PEE ASTROS 2020, e de outros projetos de pesquisa e desenvolvimento (P&D) de engenhos em voo da base industrial de defesa e segurança (BIDS) e das Forças Armadas. Testes Em 9 de junho, foi concluída a fase de testes de aceitação em fábrica (TAF), em São Bernardo do Campo (SP), nas instalações da empresa OMNISYS Engenharia, cuja implantação, no CAEx, integra o projeto de instrumentação para campo de instrução (PICI) do programa estratégico do Exército ASTROS 2020. Os TAF visaram à verificação de um conjunto de requisitos a nível componente, subsistema e integração, realizados preliminarmente aos testes de aceitação em campo do sistema, com o fim de incrementar seu funcionamento e integração. Após o êxito na conclusão dos TAF, houve o deslocamento rodoviário do STREV, em 10 e 11 de junho, da empresa contratada, em São Bernardo do Campo (SP) para as instalações do CAEx, onde será efetuada a primeira fase dos testes de aceitação em campo (TAC) do sistema, cujo objetivo é a verificação de requisitos e a eficácia sistêmica no rastreio de engenhos em voo. O transporte foi efetuado por militares do CAEx e apoiado pelo 8º Batalhão de Polícia do Exército (8º BPE), de São Paulo (SP), pela Academia Militar das Agulhas Negras (AMAN), de Resende (RJ), e pelo 11º Batalhão de Polícia do Exército (11º BPE), do Rio de Janeiro (RJ). Durante os TAC, está prevista a realização da última fase do treinamento em operação e manutenção do STREV, para a capacitação de pessoal na operação do sistema nas futuras missões de rastreio demandadas pelo PEE ASTROS 2020 e demais requisitantes. Antes da missão, os militares participantes receberam as devidas orientações para o cumprimento das medidas sanitárias preventivas estabelecidas nas diretrizes do Comandante do Exército e do Chefe do Departamento de Ciência e Tecnologia para a prevenção e o combate à covid-19, a fim de preservar a saúde dos militares e de seus familiares, bem como manter a capacidade operativa dos quadros do Sistema de Ciência Tecnologia e Inovação do Exército (SCTIEx)."
	}
