	{
		"id": 27,
		"titulo": "recebimento de protótipos referentes ao projeto do monóculo de imagem térmica olhar",
		"autor": "Noticiário do Exército",
		"url": "https://www.eb.mil.br/web/noticias/noticiario-do-exercito/-/asset_publisher/znUQcGfQ6N3x/content/id/12495287",
		"tipo_documento": "Notícia",
		"rotulo": 2,
		"resumo": 0,
		"texto": "São Carlos (SP) – No dia 16 de novembro, reuniram-se na empresa brasileira Opto Tecnologia Optrônica Ltda o Chefe do Departamento de Ciência e Tecnologia (DCT), General de Exército Décio Luís Schons; acompanhado do Chefe de Ensino, Pesquisa, Desenvolvimento e Inovação do DCT, General de Divisão Luis Henrique de Andrade; do Chefe do Centro Tecnológico do Exército (CTEx), General de Divisão Robson Santana de Carvalho; e do Diretor de Desenvolvimento Científico e Tecnológico da Financiadora de Estudos e Projetos (FINEP), Dr. Marcelo Silva Bortolini de Castro. Na ocasião, o Sr. Cláudio Carvas, CEO da empresa Opto Tecnologia Optrônica Ltda, realizou uma apresentação institucional da empresa e de seus principais projetos, incluindo a apresentação dos dois protótipos do Monóculo de Imagem Térmica OLHAR que estão sendo entregues como uma das etapas previstas na Fase 1 do Projeto. Em seguida, a comitiva visitou as instalações da Opto. Iniciado em outubro de 2019, o Projeto de Pesquisa e Desenvolvimento (P&D) do Monóculo de Imagem Térmica OLHAR contempla quatro Fases. A Fase 1 prevê a P&D e fabricação de protótipos; a Fase 2, a avaliação dos protótipos; a Fase 3, a fabricação do lote-piloto; e a Fase 4, a avaliação do lotepiloto.O projeto atual, integralmente financiado com recursos orçamentários, deriva parcialmente de tecnologia desenvolvida em conjunto pelo CTEx e pela empresa Opto Eletrônica S/A, entre 2008 e 2011, no âmbito do projeto Desenvolvimento da Tecnologia de Monóculos de Imagem Térmica que foi integralmente financiado pela FINEP. O Monóculo OLHAR foi projetado com o que há de mais avançado em microeletrônica, mecânica de precisão e óptica para atender aos requisitos operacionais e técnicos homologados para o Sistema Combatente Brasileiro (COBRA). Com massa e dimensões reduzidas, o equipamento oferece rápido acoplamento a armamentos e capacetes, contando ainda com a possibilidade de troca de objetivas para execução de disparos de precisão. A expectativa é que o equipamento atinja distâncias para Detecção (D), Reconhecimento (R) e Identificação (I) compatíveis com os melhores monóculos termais do mercado. A P&D do Monóculo de Imagem Térmica OLHAR é uma atividade prevista pelo Plano Estratégico do Exército (PEEx) 2020-2023, relacionada ao Programa OCOP, como Atividade Imposta 9.3.1.1 – Pesquisar e desenvolver Sistemas Auxiliares de Visão e está alinhada com a prioridade 1.6 - Equipamentos de visão noturna, diurna, termal e fusão de imagens, do Plano de Obtenção de Capacidades Materiais (PCM), Anexo A ao PEEx 2020-2023. A equipe técnica de recebimento foi composta pelo Tenente-Coronel Leonardo Bruno de Sá, Gerente do Projeto OLHAR; pelo Major Fábio Luiz Firmino, Gestor do Contrato; e pelo Capitão Thiago de Morais Gonçalves Bittencourt, Fiscal do Contrato, todos do CTEx."
	}
