	{
		"id": 29,
		"titulo": "tiro de aceitação de campo com o sistema remax das viaturas guarani comprova o poder de fogo da força.",
		"autor": "Noticiário do Exército",
		"url": "https://www.eb.mil.br/web/noticias/noticiario-do-exercito/-/asset_publisher/znUQcGfQ6N3x/content/id/8330370",
		"tipo_documento": "Notícia",
		"rotulo": 3,
		"resumo": 0,
		"texto": "Amambai (MS) – Nos dias 21 e 22 de setembro, o 17º Regimento de Cavalaria Mecanizado (17º RC Mec) recebeu representantes da Diretoria de Fabricação e da Empresa ARES para acompanhar a realização do Tiro de Aceitação de Campo do Reparo Automatizado X (REMAX), da Viatura Blindada de Transporte de Pessoal – Média de Rodas (VBTP-MR), 6x6, Guarani. Nessa oportunidade, os seis sistemas REMAX do Regimento realizaram o Tiro com metralhadoras .50 e MAG. A atividade foi apoiada pela Seção de Instrução de Blindados do Regimento, utilizando seus instrutores habilitados no sistema. O REMAX é uma estação de armas remotamente controlada com giro-estabilizado para metralhadoras .50 e 7,62 mm que foi desenvolvida a partir dos requisitos do Exército Brasileiro, por meio de uma parceria da ARES com o Centro Tecnológico do Exército (CTEx), com tecnologia nacional. O 17º RC Mec foi a primeira tropa de Cavalaria e ter seus sistemas de armas (REMAX) certificados no âmbito do Exército Brasileiro, agregando muitas novas capacidades aos Lanceiros do 17 de Cavalaria. No mês de agosto, o Pelotão de Manutenção do Esquadrão de Comando e Apoio do 17º RC Mec, junto com técnicos das empresas IVECO e ARES, instalaram o Reparo de Metralhadora Automatizado X REMAX-CTEX em VBTP-MR Guarani. Com isso, as viaturas tornaram-se aptas a receberem as metralhadoras calibre 7,62 mm e .50, aumentando o poder de fogo do Regimento nas ações de defesa externa, no Sistema Integrado de Monitoramento de Fronteiras (SISFRON), nas ações de garantia da lei e da ordem (GLO) e no combate aos crimes transfronteiriços. O sistema REMAX e o Programa Guarani O REMAX suporta metralhadora calibre 7,62 mm ou .50 (12.7 mm) e permite a pontaria em elevação e direção do armamento, a observação, o reconhecimento e a identificação de alvos durante o dia e a noite, bem como a realização do tiro em movimento, porque o reparo é estabilizado. O Programa Guarani tem por objetivo transformar as organizações militares de Infantaria Motorizada em Mecanizada e modernizar as organizações militares de Cavalaria Mecanizada."
	}
