	{
		"id": 3,
		"titulo": "sistema de aeronaves remotamente pilotadas categoria 2 é entregue ao exército brasileiro",
		"autor": "Noticiário do Exército",
		"url": "https://www.eb.mil.br/web/noticias/noticiario-do-exercito/-/asset_publisher/znUQcGfQ6N3x/content/id/16457935",
		"tipo_documento": "Notícia",
		"rotulo": 3,
		"resumo": 0,
		"texto": "Taubaté (SP) – Após meses de testes, no dia 12 de dezembro, a Aviação do Exército (AvEx) recebeu a visita do Comandante Militar do Sudeste, General de Exército Tomás Miguel Miné Ribeiro Paiva, e do Comandante Logístico, o General de Exército Eduardo Antônio Fernandes, o primeiro SARP (Sistema de Aeronaves Remotamente Pilotadas) Categoria 2. A solenidade ocorreu no hangar do 2º Batalhão de Aviação do Exército (BAvEx), onde as três aeronaves também foram apresentadas. “Esta tecnologia está colocando o Exército Brasileiro em outro patamar em termos de tecnologia, inteligência e aquisição de alvos. Vai nos ajudar muito nas operações na faixa de fronteira, operações em ambientes urbanos e nas operações convencionais mesmo”, disse o General Tomás. Até a assinatura do registro e recebimento efetivo, foram executadas diversas etapas. “O processo começou em 2019, um trâmite longo seguindo todo processo de aquisição previsto nas nossas normas. Foram cumpridos todos os requisitos, depois o acompanhamento e, hoje, a gente conclui este processo com o recebimento, que é a última fase da aquisição. A partir de agora, podemos dizer que o SARP 2 é do Exército Brasileiro”, explicou o General de Brigada Anysio Luiz Crespo Alves Negrão, Diretor de Material de Aviação do Exército. A aeronave tem quase 8 metros de envergadura, 3 de comprimento e pode chegar a uma velocidade de até 110 km/h, com autonomia de 10 horas de operações, sejam diurnas ou noturnas. Ele conta com um sistema de câmaras potentes, com 8 motores com baterias independentes, permitindo a realização de decolagens e pousos verticais automáticos, possibilitando a decolagem e aterrissagem em ambientes críticos e confinados. Com peso máximo de decolagem de 150kg , o Nauru 1000C executa vários tipos de monitoramento aéreo, desenvolvido para missões que exigem operações em cenários diversos, suportando chuva leve ou neblina, por exemplo. Todo o controle dessas aeronaves é feito a partir de um contêiner para transporte e operação do SARP, com estações de controle de solo, câmeras e monitores que mostram, em tempo real, as informações que a aeronave está captando. “É um impulso de tecnologia que vai nos dar melhor capacidade operacional. Vamos ter condições no futuro de melhorar a parte logística”, explicou General Fernandes."
	}
