	{
		"id":30 ,
		"titulo": "centro tecnológico do exército avança no desenvolvimento do projeto rádio definido por software de defesa",
		"autor": "Noticiário do Exército",
		"url": "https://www.eb.mil.br/web/noticias/noticiario-do-exercito/-/asset_publisher/znUQcGfQ6N3x/content/id/9726563",
		"tipo_documento": "Notícia",
		"rotulo": 2,
		"resumo": 0,
		"texto": "Brasília (DF) – De 2 a 5 de abril de 2019, o Centro Tecnológico do Exército (CTEx) expôs o Projeto RDSDefesa na Feira Internacional de Defesa e Segurança (LAAD Defense & Security) 2019. Durante o evento, foram realizadas demonstrações do projeto, que incluíram uma transmissão simultânea entre dois protótipos completos do RDS-Defesa, um localizado na área interna e o outro na área externa, dentro de uma Viatura Blindada de Transporte de Pessoal (VBTP) Guarani. Além disso, também se demonstrou a interoperabilidade do RDS-Defesa com os atuais equipamentos rádio utilizados pelo Exército Brasileiro. As demonstrações causaram excelente impressão no público visitante, principalmente em várias autoridades das Forças Armadas que estiveram no estande do CTEx, dentre elas o Comandante do Exército, General de Exército Edson Leal Pujol. O RDS-Defesa visa promover o desenvolvimento dos futuros sistemas de comunicações, com aumento da interoperabilidade e redução dos custos de desenvolvimento e implantação de soluções. Entre as vantagens de um RDS incluem-se a independência entre o hardware e o software, por meio do Software Communications Architecture (SCA); a capacidade de interoperabilidade, de portabilidade de Formas de Onda e de agregação de novos serviços, sem necessidade de substituição do hardware; e a possibilidade de acompanhar os avanços tecnológicos no setor de comunicações por rádio. O Projeto O Projeto Rádio Definido por Software de Defesa (RDS-Defesa) foi aprovado e autorizado pela Portaria nº 2.110, do Ministério da Defesa, de 9 de agosto de 2012, e conta com a participação das três Forças Armadas. Coube ao Exército Brasileiro a coordenação do projeto, responsabilidade que foi delegada ao CTEx. O RDS-Defesa foi incluído no Projeto Estratégico Defesa Cibernética, conforme Portaria nº 006 – EME/Res, de 25 de abril de 2012. Adicionalmente, o foi enquadrado no Plano Estratégico do Exército 2016-2019. O Brasil faz parte de um seleto grupo de 15 países que desenvolvem RDS, dentre eles os Estados Unidos da América (que foram os pioneiros), Reino Unido, Alemanha, França, Itália, Espanha e Israel. No dia 19 de dezembro de 2018, a Empresa AEL Sistemas procedeu à entrega da primeira versão do Módulo de Rádio Frequência e do Módulo de Alimentação do RDS-Defesa. Foi um importante marco do projeto, já que os dois módulos estão funcionais, o que permitirá a execução da fase de integração com os demais módulos do RDS-Defesa ao longo de 2019, com previsão de avaliação do protótipo do Rádio em 2020, no Centro de Avaliações do Exército (CAEx). Estão previstos, para abril de 2019, os primeiros testes de integração utilizando protótipos do RDSDefesa veicular operando nas faixas de VHF e HF. Além da extrema importância para as comunicações militares e para a Defesa, o RDS possui grande potencial para aplicações nas áreas de segurança pública, comunicações satelitais e comunicações móveis."
	}
