	{
		"id": 31,
		"titulo": "centro de avaliações do exército finaliza testes com o sistema gênesis da artilharia de campanha",
		"autor": "Noticiário do Exército",
		"url": "https://www.eb.mil.br/web/noticias/noticiario-do-exercito/-/asset_publisher/znUQcGfQ6N3x/content/id/12259959",
		"tipo_documento": "Notícia",
		"rotulo": 3,
		"resumo": 0,
		"texto": "Rio de Janeiro (RJ) – O Centro de Avaliações do Exército (CAEx) - Campo de Provas da Marambaia/1948 realizou, no período de 28 de setembro a 2 de outubro, testes com o Sistema Gênesis (GEN-3004), Subsistema de Direção de Tiro e Coordenação de Fogos do Sistema de Artilharia de Campanha. O Sistema Gênesis é um Sistema e Material de Emprego Militar (SMEM) desenvolvido pela Fábrica de Material de Comunicações e Eletrônica (FMCE) da Indústria de Material Bélico (IMBEL), empresa estratégica de defesa vinculada ao Comando do Exército, por intermédio do Departamento de Ciência e Tecnologia (DCT). Os testes finalizaram a avaliação operacional do aludido sistema, em cumprimento ao Plano de Avaliações de SMEM do DCT, para o biênio 2020-2021. Participaram das atividades de avaliação operacional do Gênesis 2 baterias do 31º Grupo de Artilharia de Campanha - Escola (31° GAC - Es), Organização Militar (OM) de apoio, além de militares do 8º Grupo de Artilharia de Campanha Pára-quedista (8º GAC Pqdt), do 11º Grupo de Artilharia de Campanha (11º GAC) e do 21º Grupo de Artilharia de Campanha (21º GAC), como analistas e alimentadores de informações. Prestigiaram o evento, o Chefe do CAEx, General de Brigada Carlos Eduardo da Mota Góes, e o Comandante da Artilharia Divisionária da 1ª Divisão de Exército (AD/1) - Artilharia Divisionária Cordeiro de Farias, General de Brigada Fernando Bartholomeu Fernandes, cuja missão, em relação à Artilharia de Campanha envolvida, é orientar, verificar e avaliar a situação técnica no âmbito do Comando Militar do Leste. Durante a avaliação operacional em questão, os militares do 31° GAC empregaram o Sistema Gênesis para realizar uma ampla variedade de missões típicas de apoio de fogo, desde o planejamento de fogos até as operações ofensivas de um Grupo de Artilharia de Campanha orgânico de uma brigada, em condições realísticas de combate, com execução de tiro real nas linhas de tiro do CAEx. O Sistema Gênesis constitui-se em mais um SMEM desenvolvido pelo Sistema de Ciência, Tecnologia e Inovação do Exército, que possibilitará um incremento na modernização dos métodos de direção de tiro e na coordenação de fogos em todos os Grupos de Artilharia de Campanha do Exército Brasileiro. Sua adoção pela Força Terrestre proporcionará maior eficácia ao apoio de fogo prestado, por meio da precisão do tiro, da economicidade de fogos e da redução no tempo de resposta das baterias (decorrente da maior velocidade de processamento das missões de tiro), o que representará um significativo salto de qualidade no emprego da Artilharia de Campanha."
	}
