	{
		"id":32 ,
		"titulo": "diretoria de fabricação coordena teste de engenharia da integração do sistema de armas remax",
		"autor": "Noticiário do Exército",
		"url": "https://www.eb.mil.br/web/noticias/noticiario-do-exercito/-/asset_publisher/znUQcGfQ6N3x/content/id/11451279",
		"tipo_documento": "Notícia",
		"rotulo": 2,
		"resumo": 0,
		"texto": "Rio de Janeiro (RJ) – De 27 a 30 de abril, foram realizados os testes de engenharia da integração do sistema de armas REMAX à Viatura Blindada Multitarefa Leve Sobre Rodas (VBMT-LSR) 4x4. O evento foi conduzido pelas empresas ARES e IVECO, com coordenação da Diretoria de Fabricação (DF), utilizando a estrutura de apoio de testes do Centro de Avaliações do Exército; e da 9ª Brigada de Infantaria Motorizada, por meio do 15º Regimento de Cavalaria Mecanizado e do 1º Batalhão de Infantaria Mecanizado (Escola), unidades que cederam armamento e pessoal para a operação. A VBMT-LSR, da empresa IVECO, é a nova plataforma veicular blindada integrante do Programa Estratégico do Exército Guarani, desenvolvida para mobiliar as organizações militares de Infantaria e Cavalaria mecanizadas da Força Terrestre. É uma viatura 4x4 com requisitos de blindagem e sobrevivência adaptados às realidades atuais de combate. O REMAX, sistema de armas remotamente controlado da empresa ARES, possibilita que a guarnição realize o tiro de dentro do veículo. Apesar de ser um sistema amplamente utilizado em outras viaturas do Programa Guarani, buscou-se avaliar seu desempenho frente às particularidades da VBMT-LSR. As verificações em questão tiveram como objetivo averiguar a precisão de tiro e a estabilização do sistema integrado. Ao longo do presente ano, a DF, com o apoio das empresas envolvidas, planeja conduzir novos testes, de forma a garantir a integração da viatura com os sistemas de armas e os sistemas de comando e controle, adequando-se aos requisitos operacionais, técnicos, logísticos e industriais definidos pelo Exército Brasileiro."
	}
