{
    "id": 34,
    "titulo": "tecnologia na fase laboratorial, uma vez que foram testados métodos variados para verificação da precisão do método.",
    "autor": "andré rossi kuroswiski, diego geraldo, andré negrão costa, angelo passaro",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2022/st/226634_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "A predição da eficácia de mísseis ar-ar em um combate aéreo é um fator determinante para as decisões de engajamento de uma aeronave. Modelos propostos na literatura buscam equilibrar a precisão nas predições com o desempenho computacional, visando cálculos em tempo real, seja para sistemas embarcados na aeronave ou para a representação em simuladores de alta fidelidade. Este trabalho apresenta uma proposta de modelagem alternativa baseada em regressão polinomial que, apesar da simplicidade, para a predição do alcance máximo de lançamento de mísseis Ar-Ar, superou modelos até então publicados, baseados em redes neurais. Os resultados encontrados indicaram um erro absoluto médio de apenas 0,29 milhas náuticas nas predições do alcance máximo em dados com uma distância média de 17,75 milhas náuticas.",
    "texto": "I. INTRODUÇÃO A simulação computacional de cenários de combate aéreo já é utilizada há décadas tanto para avaliação de táticas ou cenários, quanto para o treinamento dos pilotos. Nos últimos anos, com o crescimento do interesse por aeronaves autônomas, inclusive de combate, este tipo de simulação se tornou essencial para a pesquisa e desenvolvimento de agentes inteligentes [1]. Nestes cenários, a fidelidade dos modelos tem um papel fundamental para garantir um ambiente suficientemente fidedigno, de modo a permitir que os comportamentos e decisões implementadas estejam condizentes com um combate real [2]. A capacidade de processamento dos computadores atuais, permite a representação dos diversos sistemas envolvidos, aeronave, radares, armamentos, entre outros, com grande fidelidade. No entanto, grande parte das soluções que viabilizam simulações de alta fidelidade estão voltadas para simulações em tempo real, o que por vezes é insuficiente tanto para analisar cenários, quanto otimizar agentes, aplicações que podem exigir a execução de centenas ou até milhares de simulações para a obtenção dos resultados desejados [2]–[5]. Na simulação de combate aéreo, além dos sistemas e comportamentos, o modelo de predição da eficácia de mísseis ar-ar se mostra decisivo. Estes dados compõem uma área conhecida como WEZ (do inglês Weapon Escape Zone) que é a principal referência para as decisões de lançamento de mísseis e defesas, sendo inclusive apresentada em tempo real para os pilotos em voo [5]. Deste modo, tanto a precisão do modelo em estimar estes valores, quanto o desempenho computacional são relevantes. Predições incorretas levam a decisões incorretas, por exemplo, estimulando o disparo do armamento em uma distância sem chance de sucesso ou gerando estimativas incorretas sobre o real risco imposto pelo inimigo. Quanto ao desempenho computacional, como o cálculo da WEZ é utilizado repetidamente, deve ser atualizado constantemente, e modelos complexos se tornam um fator limitante, seja para sistemas embarcados ou simulações [5]. Além disso, esse cálculo pode ser usado tanto para predizer o desempenho do próprio armamento quanto para estimar o nível de ameaça do inimigo [6], de modo que a quantidade que ele é realizado se multiplica. II. MODELO DE PREDIÇÃO DA WEZ A WEZ pode ser considerada a principal referência para o emprego de misseis em um combate aéreo, sendo delimitada por três distâncias limiares. RMAX é maior distância na qual um míssil tem chance de acertar o inimigo, ou seja, nesta distância o alvo seria atingido caso não realizasse nenhuma manobra defensiva. RNEZ é a distância partir da qual, independente de manobras do alvo, a probabilidade do inimigo ser acertado é muito alta. RMIN distância a partir da qual o disparo é inviável, seja para segurança do atirador ou limitação por alguma característica do míssil. A região entre RNEZ e RMIN é conhecida como No Escape Zone (NEZ), sendo a região ideal para disparo do armamento pela alta probabilidade de sucesso. Determinar estas distâncias e estimar os resultados intermediários é o objetivo de um modelo de predição da WEZ. Entre os fatores que afetam a eficácia do armamento não estão apenas aqueles relacionados às capacidades do armamento em si, mas também diversas condições das aeronaves atiradora e alvo no momento do disparo, como, por exemplo, velocidade, altitude e direção de voo. A obtenção de dados reais em amostragem representativa destes fatores é inviável e os dados que existem são de acesso restrito, de modo que a simulação tem se mostrado como a principal alternativa [4], [5]. Além disso, em muitos casos pretende-se determinar estes valores exatamente para alimentar os modelos de uma simulação, seja para apresentar estes dados ao piloto em uma simulação virtual, ou embasar decisões de agentes autônomos [2], [6]. Nesta direção, em [4], uma Rede Neural Profunda (DNN do inglês Deep Neural Network), com 10 camadas ocultas de tamanho variado entre 32 e 2 neurônios, foi treinada com dados de 50.000 simulações, obtendo um erro médio 4% na predição da distância RMAX. Em [5] foram utilizadas Redes Neurais de duas camadas ocultas de 20 neurônios, considerada uma MLP (do inglês Multi Layer Perceptron). Seis redes foram treinadas cada uma com 20.000 simulações correspondentes a seis regiões de diferentes visadas do atirador, obtendo um erro médio de a 2%. Além da diferença na complexidade das estruturas entre as redes utilizadas em [4] e [5], na primeira foi utilizado uma função de ativação ReLU enquanto na segunda a tangente hiperbólica [7]. Outros trabalhos buscam modelar um conceito similar chamado de LAR (do inglês Launch Acceptability Region), que na prática busca definir uma área que seria equivalente à região entre RMAX e RMIN. Em [8] é proposto a utilização direta de uma simulação simplificada, que seria executada em tempo real para estimar se a aeronave inimiga estaria dentro da LAR, alcançando um erro médio de 13% com os modelos utilizados. De modo similar, em [9], um simulador de 6Dof é proposto para calcular continuamente a LAR de um armamento ar-solo. Diferentes metodologias são comparadas em [10] buscando otimizar a predição da LAR em tempo real, dado limitações de hardwares embarcados. Os melhores resultados foram obtidos com uma MLP baseada em funções de ativação adaptativas, chegando a uma precisão de 97,4% na determinação da LAR, contra 96,3% da MLP com função de ativação fixa. Em geral os trabalhos encontrados na literatura buscam modelos que otimizem a avaliação da eficácia do armamento, tanto em relação à precisão das predições, quanto ao custo computacional, tendo em vista a necessidade de execução em tempo real. Neste sentido, os resultados já encontrados podem até ser considerados satisfatórios para aplicações em tempo real, no entanto, uma das motivações deste trabalho foi a necessidade de múltiplos cálculos de WEZ em simulações acima do tempo real. Para viabilizar avaliação de cenários ou treinamento de agentes autônomos a simulação precisa ser acelerada em função do grande número de execuções que são necessárias. Por exemplo, no Ambiente de Simulação Aeroespacial (ASA) [11], uma simulação de combate entre duas aeronaves pode ser executada em velocidades superiores a 100 vezes o tempo real. Supondo que cada aeronave precise calcular a cada segundo, tanto a eficácia do próprio armamento para os inimigos, quanto o contrário, com apenas duas aeronaves seriam necessários no mínimo 400 cálculos da WEZ por segundo. Esse número ainda pode ser bem maior com múltiplas aeronaves e a necessidade de uma atualização mais rápida, fazendo com que os modelos encontrados na literatura se tornem fatores limitantes para execução de simulações como a do ASA, em alto desempenho. Neste contexto, foi conduzida uma investigação com o objetivo avaliar diferentes metodologias para a modelagem da predição do alcance máximo (RMAX) de um míssil ar-ar por meio de simulações de combate aéreo além do alcance visual. Apesar dos experimentos se limitarem à RMAX, a extrapolação das soluções avaliadas dependeria apenas de modicar o comportamento da aeronave alvo, gerar novos dados e replicador os modelos, de modo que as metodologias propostas podem ser utilizadas para a obtenção uma WEZ completa. As principais contribuições deste trabalho são: 1) Proposição de um modelo baseado em regressão polinomial com resultados equiparáveis a soluções no estado a arte para a predição da eficácia de um míssil ar-ar. 2) Comparação entre modelos preditivos baseados em RBF, MLP, DNN e Regressão Polinomial. 3) Avaliação e transformação de variáveis de entrada para simplificação do tratamento de dados na criação de modelos de WEZ. III. METODOLOGIA A. Aquisição dos Dados para Determinação do Alcance Máximo A simulação computacional foi utilizada como a ferramenta para a geração de dados para o modelo desejado. Foi utilizado a plataforma Ambiente de Simulação Aeroespacial (ASA) [11] que permite o desenvolvimento de modelos de alta fidelidade para representar cenários no nível de engajamento, contando com recursos para processamento em alto desempenho, paralelização, além de tratamento e análise de dados. Um desafio encontrado ao utilizar ferramentas de simulação como o ASA, com modelos de alta resolução, é que pode ser mais complexo para gerar os cenários nos parâmetros desejados, comparando por exemplo com implementações particulares dos modelos especificamente com esse objetivo. Por exemplo, no ASA, para ocorrer um disparo de armamento, a aeronave inimiga precisa ser detectada pelo radar, um agente que representa o piloto precisa estar configurado para comandar o disparo dependendo dos parâmetros configurados. Outro fator relevante é que uma simulação apenas não é suficiente para a obtenção de alcance máximo de um armamento, sendo necessário diversas repetições para que o valor seja determinado. O procedimento utilizado foi baseado em uma busca binária. A primeira simulação era iniciada para um disparo em uma distância equivalente ao máximo encontrado em experimentos prévios de 45 milhas náuticas (mn), prosseguindo com a busca binária conforme sucesso ou insucesso em atingir a aeronave inimiga. Como critério de parada para cada condição, foi considerado a obtenção de uma precisão menor que 0.2 mn, distância de avaliação menor que 1 mn sem sucesso ou após 10 iterações no processo de busca. Para otimização da execução dos experimentos, os testes foram paralelizados em grupos de 50 casos, ou seja, a cada rodada, 50 simulações eram executadas em paralelo fazendo buscas em diferentes conjuntos de parâmetros até que todos atingissem um critério de parada. Na sequência, novos 50 casos eram iniciados, até a criação de todos os dados desejados. B. Parâmetros de entrada para a determinação de RMAX. Os parâmetros de interesse para a determinação do alcance máximo de um míssil não estão relacionados apenas ao desempenho do armamento em si, mas também depende das condições do atirador e do alvo. O modelo de míssil implementado contém 5 graus de liberdade e adota como base o publicado em [12], com mais detalhes específicos apresentado em [4]. Para este trabalho a escolha dos parâmetros de entrada foi realizada com base em referências na literatura [4], [8], [10], [13] e experiência de integrantes do projeto ASA, sendo apresentados na Tabela I com as faixas de valores consideradas nos experimentos. TABELA I. PARÂMETROS DE ENTRADA PARA DETERMINAR RMAX Os fatores de A a E coincidem com formas já apresentadas na literatura, enquanto F, substituindo a proa do alvo ou diferenças de proas, foi uma nova proposta visando simplificar o tratamento dos dados e tornar a influência deste fator mais direta. O fator F, Proa relativa à Radial do Alvo, representa a diferença, em graus, entre direção de voo do alvo e sua radial para o atirador. O valor inicia em zero quando a proa da aeronave alvo está na direção da radial e chega a 180 graus quando o alvo está apontando em direção ao atirador, ou seja, F em zero sempre será a condição mais desfavorável para o míssil e F em 180 graus sempre indicará que o inimigo está aproando o atirador. Para os valores intermediários, os valores devem ser negativos na direção que reduz a razão de aproximação entre o alvo e o atirador e positivos caso contrário. Por exemplo, F igual a 90 graus deve indicar que o alvo está em deslocamento perpendicular à direção de lançamento do míssil e se aproximando do atirador, F em -90 graus o deslocamento também é perpendicular, mas o alvo está se afastando. Deste modo, em radiais negativas (alvo à esquerda do atirador) valores de F são positivos rotacionando o alvo no sentido horário. Em radiais positivas (alvo à direita do atirador) valores positivos são para o alvo rotacionado em direção anti-horária. Deste modo, um modelo treinado apenas com dados do setor esquerdo da aeronave pode ser utilizado para o setor direito apenas invertendo o sinal de F. Uma visão pictorial dos fatores considerados está na Figura 1. Os dados para a avaliação dos modelos de predição de RMAX foram gerados por meio de duas técnicas de design de experimento: Fatorial Completo e Completamente Aleatório [14]. O design fatorial teve como objetivo inicial simplificar a avaliação dos fatores de entrada e, secundariamente ser avaliado como uma solução para reduzir quantidade de experimentos necessários. Tendo em vista o comportamento não linear esperado, foram utilizados 3 níveis para os fatores A,B,C,D e E, sendo os dois extremos mais uma valor mediano. Apenas C foi limitado entre -60 e 0, setor à esquerda do atirador, tendo em vista a simetria do cenário. Para F foram definidos 4 níveis, sendo o quarto nível considerado necessário para permitir uma identificação da diferença de comportamentos com a aeronave com F positivo e negativo. Assim, além de F em zero e 180 graus, considerou-se 90 e -90 graus. No fim foi gerado um grupo de dados com experimentos em 864 casos diferentes. Para o design aleatório foram gerados 1000 casos selecionando aleatoriamente valores inteiros dentro das faixas dos fatores apresentadas na Tabela I, com exceção de C que também foi limitado ao setor esquerdo. Para a validação de todos os modelos deste trabalho, parcelas dos dados do design aleatório foram selecionados aleatoriamente como os dados de teste, sempre com casos não utilizados nos treinamentos. C. Modelos para predição da RMAX Os modelos de MLP [13][10] e DNN [4] foram adotados como referências iniciais na busca um modelo otimizado para a predição de RMAX, sendo adicionado como alternativas a RBF (do inglês Radial Based Function) e Regressões Polinomiais. Para a MLP utilizou-se duas camadas com duas camadas ocultas de 20 neurônios e tangente hiperbólica como função de ativação [13]. Para DNN foi utilizada a rede apresentada em [4], com dez camadas ocultas com complexidade decrescente de 32 a 2 neurônios e função de ativação ReLU. A RBF é um modelo universal de aproximação de funções muitas vezes aplicado como alternativa às redes mais tradicionais como MLP, tendo em geral uma estrutura mais simples e um treinamento mais rápido [15]. Em função de resultados anteriores promissores já obtidos por pesquisadores do projeto ASA na modelagem de WEZ, assim como diversos resultados consolidados para problemas variados, a RBF foi adotada como uma alternativa viável para os métodos já encontrados na literatura. Por fim, na busca por uma aproximação ainda mais simplificada e que trouxesse maior clareza para o tratamento dos fatores envolvidos, foram conduzidos diversos testes para verificar a possibilidade de reduzir o modelo preditivo do WEZ por meio de uma Regressão Polinomial (PR do inglês Polynomial Regression). A motivação para condução destes testes partiu da tese apresentada em [16], segundo a qual redes neurais seriam nada mais que uma forma PR, apresentando inclusive diversos casos com problemas complexos, bastante explorados na literatura, em que o método de regressão polinomial adequado superava os mais variados tipos de Redes Neurais. Apesar da tese não estar comprovada, a questão se mostrou interessante, tendo em vista que, com a facilidade de utilização de ferramentas abertas de aprendizado de máquinas, técnicas amplamente estudadas, bem mais simples e explicáveis, como a regressão polinomial, são deixadas de lado para a adoção de soluções prontas que acabam criando caixas pretas com bons resultados, mas nem sempre devidamente compreensíveis para um analista. Vale destacar os bons resultados encontrados em [16] estão diretamente relacionados à inclusão dos elementos de interação entre os fatores de entrada, tornando o grau das interações um parâmetro essencial para a melhoria do modelo. IV. RESULTADOS E DISCUSSÕES A. Avaliação inicial dos parâmetros de entrada Utilizando os resultados do experimento baseado no design fatorial, foi conduzido uma análise inicial dos fatores selecionados. Em uma análise qualitativa, baseada nos gráficos de boxplot (Figura 2), associada a um teste de Tukey [14] para verificar a significância estatística das diferenças entre as médias, já ficou evidenciado a influência direta da Radial do Alvo (C), a Altitude do Atirador (D) e da Proa de Aproximação do Alvo (F) na RMAX. Estes resultados eram esperados, já que a altitude influencia diretamente o desempenho do míssil e, tanto a radial, quanto a proa de aproximação do alvo afetam diretamente a velocidade de aproximação entre as aeronaves. Por outro lado, a Velocidade do Atirador (A), Velocidade do Alvo (B) e a Diferença de Altitudes (E) não apresentaram diferenças significantes nas médias encontradas. Este resultado não indica que estes fatores não tenham relevância para os resultados, tendo em vista que as médias equivalentes podem estar relacionas a interações já esperadas. Por exemplo, uma maior Velocidade do Alvo (B) deve aumentar RMAX se a aeronave alvo está voando em direção ao atirador, mas deve reduzir se estiver se afastando. Deste modo a interação de B com F seria uma possível explicação das médias de RMAX equivalentes para o alvo a 450, 600 e 750 nós. Analisando B para cada nível de F isoladamente, esta condição se confirmou. Para a Velocidade do Atirador (A) foi confirmada a interação com a Altitude de voo (D), já esperada, dado que para uma mesma velocidade em relação ao solo (a utilizada nos experimentos), tem-se diferentes velocidades em relação ao ar, o que afeta de modo não linear o desempenho do armamento [12]. Estas observações demonstram algumas interações identificáveis entre os fatores, no entanto, diversas interações adicionais podem existir e afetar o modelo a ser obtido em função da simulação se tornar bastante complexa à medida que mais elementos realistas são considerados. Para o fator relacionado à Proa de Aproximação do Alvo (F), a análise inicial evidenciou sua influência direta na determinação de RMAX. De maneira geral este comportamento também era esperado tendo em vista que as mudanças na proa relativa do alvo afetam diretamente a razão de aproximação entre as aeronaves. Conforme sugerido em [4], reforçado pela observação do comportamento apresentado, aproximadamente senoidal, o fator F foi decomposto em seu seno (FSEN) e cosseno (FCOS), simplificando seu tratamento conforme apresentado na Figura 3. B. Resultados com dados obtidos pelo design fatorial O objetivo principal do design fatorial foi facilitar a análise inicial dos fatores, no entanto, a possibilidade gerar os modelos a partir destes dados também foi avaliada. Para se chegar a esta conclusão, todos os dados do design fatorial foram utilizados para a regressão dos modelos baseados em RBF, MLP, DNN e Polinomial, sendo utilizado os dados do design aleatório para validação. Os resultados mostraram que este design não foi suficiente para gerar dados de treinamento adequados visando uma interpolação do modelo. Os resultados após a avaliação nos dados obtidos aleatoriamente, indicaram que as regressões não foram capazes de gerar predições satisfatórias, com erros médios superiores a 13%. Deste modo, apesar de ser válido para facilitar uma análise inicial dos dados, tendo em vista características não lineares do problema, o design fatorial não se mostrou adequado para a geração dos dados de treinamento. C. Resultados com dados obtidos pelo design aleatório Os resultados na Tabela II representam os valores médios e respectivos desvio padrão para os diferentes modelos criados a partir dos dados gerados por meio do design aleatório. Foram adotadas como métricas de referência para comparação dos modelos a Média Absoluta MAE (do inglês Mean Absolute Error), o erro médio percentual das predições em relação a RMAX correta, que consolidam uma visão geral das imprecisões para seu uso na prática. Além disso, a Raiz Quadrada do Erro Médio RMSE (do inglês Root Mean Squared Error) foi adicionada para ressaltar a presença de possíveis outliers. Para obtenção destes resultados foram realizadas vinte rodadas diferentes dividindo aleatoriamente os dados com 70% para treinamento e 30% para a validação do modelo, com o desvio padrão (Dp) destes resultados informados na coluna Dp. Conforme os resultados obtidos (Tabela II), a RBF superou os demais modelos com uma MAE de 0,292 mn, representando um erro absoluto de médio 1,6%. Outro fator de destaque foi desempenho superior da MLP em relação à DNN que, mesmo com uma rede mais simples, obteve uma MAE de 0.337 ante 0.566 da DNN. Foram feitas algumas tentativas de ajustes de parâmetros para melhorar o desempenho da DNN, mas, tendo em vista os resultados com as outras soluções, considerou-se que a complexidade da rede extrapolava as necessidades para o problema em questão. Em casos isolados a DNN chegou a apresentar resultados superiores, no entanto, em outros casos a MAE era elevada, o que fica evidenciado pelo elevado desvio padrão dos seus resultados médios. TABELA II. RESULTADOS COM OS DADOS DO DESIGN ALEATÓRIO Os principais resultados dos testes com as regressões polinomiais também estão na Tabela II. As regressões foram feitas com aumento gradativo de complexidade, inicialmente sem interações entre os fatores, gerando o modelo chamado de PR1. Este modelo representa uma regressão linear de primeira ordem com 7 coeficientes e, como esperado, não foi capaz de representar adequadamente os dados, com uma MAE de 4,655 mn, erro médio de 26,2%. Adicionando interações de segunda ordem, neste caso, todos os produtos entre dois fatores e os fatores ao quadrado, foi gerado o modelo PR2 com 35 coeficientes que obteve um erro médio de 3,8%. Em seguida, o PR3, com interações até terceira ordem gerando 119 coeficientes, e o PR4, até quarta ordem com 329 coeficientes, alcançaram erros médios de 1,8% e 1,7%, ligeiramente inferiores à melhor solução baseada em RBF, mas já superando a MLP e DNN. Os resultados obtidos com as regressões polinomiais, apesar de não provar a tese apresentada em [16], demonstram a relevância de considerar estes modelos como uma alternativa real antes de partir para soluções mais complexas e menos transparentes. Além disso, estes modelos facilitam não apenas a melhor compreensão do problema, ao permitir a identificação dos fatores de maior relevância, como também facilitam simplificações eliminando os de menor significância. C. Análise e Simplificação do modelo Polinomial PR3 Após a obtenção dos modelos polinomiais com desempenho equiparável aos outros métodos, o PR3 foi analisado em maiores detalhes buscando maior compreensão e possível simplificação. O PR3 foi escolhido, pois, apesar de ser superado pelo PR4, a diferença do erro médio entre eles foi de apenas 0,1%, de modo que, pela menor complexidade, o uso do PR3 na prática se mostrou a melhor escolha. Para o modelo PR3, foi calculado o valor do efeito relativo de cada fator, tendo em vista o valor absoluto de cada coeficiente. Os dez fatores com maiores contribuições estão na Tabela III, sendo que aqueles que representam potência de um mesmo fator foram agrupados. Os resultados confirmaram as questões levantadas na análise inicial, nas quais F já indicava grande relevância para os resultados. Os efeitos de FCOS e FSEN, incluindo os fatores de segunda e terceira ordem, corresponderam a 50,0% do total (sendo 27,1% para FSEN e 22,9% para FCOS. Além disso, as interações FCOS · FSEN e FCOS · FSEN2 ainda contribuíram com 7,6% e 4,0%. Na sequência, D e suas potências, aparece com 3,9%, sendo seguido por outros fatores e interações com níveis de contribuição que vão reduzindo gradativamente. Estes efeitos relativos foram utilizados para gerar modelos mais simplificados. Novos regressões foram realizadas eliminando fatores com menor relevância. O modelo PR3 contém 119 fatores, no entanto, um resultado equivalente pode ser obtido com 70 fatores, eliminando 59 coeficientes e mantendo um erro médio de 1,8%. Os demais resultados dos modelos reduzidos estão na Tabela IV, demonstrando que a eliminação de fatores pode ser realizada baseada nos efeitos relativos, permitindo buscar um equilíbrio entre a simplificação desejada com o erro médio aceitável. III. CONCLUSÕES Os resultados encontrados demonstraram a possibilidade da obtenção de modelos de WEZ mais simplificados e sem perdas performance nas predições em relação aos trabalhos encontrados na literatura. A solução baseada na RBF se mostrou uma nova alternativa à DNN e MLP, no entanto, com resultados similares, a regressão polinomial se mostra mais vantajosa pela simplicidade, tanto para utilização em simuladores de alto desempenho, quanto para embarcar em sistemas reais. As características da solução polinomial ainda permitiram demonstrar como o modelo se torna mais flexível, sendo possível, por exemplo, eliminar fatores de menor relevância, mantendo a precisão desejada nas predições. Vale destacar que conduzir a regressão polinomial em grupos de dados muito grandes pode ser inviável, tornando as soluções baseadas em redes neurais mais adequadas. No entanto, os resultados indicam que para modelar a WEZ a quantidade de dados não chega a ser um problema, no fim, treinamentos com 700 casos se mostraram suficientes. Como trabalho futuro será conduzida uma comparação prática de ganho de desempenho com a solução polinomial em relação às demais, além de uma reavaliação de métodos para a aquisição de dados em substituição ao aleatório, buscando reduzir ainda mais a quantidade de dados necessários. "
}