{
    "id": 35,
    "titulo": "avaliação de algoritmos de machine learning na classificação de alvos marítimos em imagens sar.",
    "autor": "fabiano g. da silva, lucas p. ramos, bruna g. palm e renato machado",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2022/st/226621_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Recentemente, a disponibilidade de dados públicos de sensoriamento remoto obtidos através de sistemas orbitais tem aumentado significativamente, tornando possível a avaliação de técnicas de inteligência artificial para obtenção de diversos produtos, como detecção, discriminação e classificação de alvos. Este artigo avalia os algoritmos de machine learning (ML) para classificar alvos (plataformas petrolíferas e navios) em imagens polarimétricas VH de radar de abertura sintética (SAR), obtidas pelo sistema Sentinel-1 operando na banda C. Para isso, os algoritmos random forest (RF) e k-nearest-neighbors (kNN) disponíveis nas bibliotecas Python de ML, Orange e Scikit-learn, são considerados. Estes algoritmos operam através de atributos gerados pela rede neural convolucional (CNN, convolutional neural network) VGG-16. Como métricas de avaliação, utilizam-se a acurácia e a área abaixo da curva. Os maiores resultados são obtidos com a biblioteca Orange e se mostram competitivos com os alcançados na literatura.",
    "texto": "I. INTRODUÇÃO As imagens orbitais têm sido utilizadas no sensoriamento remoto da Terra para mapeamento de mudanças climáticas, queimadas florestais, poluição de águas e do ar [1]. Dentre os sistemas orbitais, destaca-se o radar de abertura sintética (SAR, synthetic aperture radar). Por ser um sensor ativo, este sistema é capaz de mapear grandes áreas e gerar imagens durante o dia e noite com alta resolução espacial. As nuvens não interferem no processo de aquisição de dados pelo sensor, assim como as condições climáticas adversas pouco influenciam na geração das imagens [2]. O radar emite pulsos de onda eletromagnética com alta potência e recebe o eco do sinal retroespalhado. Apenas uma parte dessa onda é transmitida e recebida pelo sensor da antena do radar [2]. Em particular, o processo de formação da imagem SAR é devido ao retroespalhamento da onda eletromagnética ao atingir um alvo. Esse fenômeno também é conhecido como backscatter. A amplitude e fase do sinal retroespalhado dependem das características físicas do material (por exemplo, geometria e rugosidade) e das propriedades dielétricas [2]. Devido ao processo de múltiplos percursos, as imagens SAR são afetadas pelo efeito speckle ou ruído multiplicativo. Além disso, essas imagens são caracterizadas por possuir maior brilho nas áreas com mais retroespalhamento.  Os dados orbitais SAR podem ser usados em diversas aplicações, por exemplo, detecção de navios [3], classificação de plataformas de petróleo [4], mapeamento urbano [5], caracterização de solos [6], mapeamento vulcânico [7], vigilância marítima [8], [9], e detecção de manchas de óleo no mar [10]. Dentre os sistemas SAR considerados em diferentes aplicações, destacam-se: [2]: o europeu Sentinel-1; os alemães TERRASAR-X e TANDEM-X; os chineses HJ-1C e GAOFEN-3; o italiano COSMO-SkyMed; o japonês ALOS 2; o indiano RISAT-1; o canadense Radarsat-1/2; o argentino SAOCOM-1/2; o espanhol PAZ. O Brasil possui uma extensa área marítima conhecida como Amazônia Azul que é rica em biodiversidade, recursos naturais, como por exemplo, o petróleo [11], na qual foi descoberto o pré-sal [12]. Diante disso, há necessidade de monitorar e controlar essa faixa do litoral, sendo o SAR uma alternativa interessante por gerar imagens de alta resolução e com informações de amplitude e fase que permitem uma análise mais detalhada dos alvos de interesse. Nas aplicações de classificação de alvos marítimos, técnicas de machine learning (ML) e deep learning (DL) têm sido amplamente consideradas [13], [14], [15]. Algumas dessas técnicas são: support vector machine (SVM) [16], random forest (RF) [17], logistic regression, k-nearest-neighbors (kNN) [17], redes neurais [18]. As redes neurais convolucionais (CNN, convolutional neural network) também são ferramentas interessantes para classificação e extração de atributos. Neste artigo, avaliam-se os algoritmos kNN e RF, disponíveis nas bibliotecas Orange e Scikit-Learn, para classificação de alvos marítimos em imagens SAR. Como dados, utilizam-se imagens SAR, polarização VH, obtidas pelo sistema Sentinel-1 operando na banda C. Para extrair os atributos das imagens, a CNN VGG-16 pré-treinada com o banco de dados ImageNet foi considerada [19], [20]. Além desta introdução, a Seção II apresenta os Materiais e Métodos; a Seção III apresenta os Resultados e Discussões. Por fim, a Seção IV conclui este trabalho de pesquisa. II. MATERIAIS E MÉTODOS Esta seção apresenta o banco de dados considerado, as técnicas de ML utilizadas pelos softwares de código aberto Orange [21] e Scikit-Learn [22]. Além disso, também são explicadas todas as etapas da metodologia aplicada neste artigo. A. Imagens SAR Considerou-se o sistema Sentinel-1 neste estudo. Esse sistema possui as seguintes características: banda C; frequência 5,405 GHz e polarização HH+HV, VV+VH, VV, HH [8]. A base das imagens é o produto ground range detected (GRD), modo interferométrico wide swarth (IW), alta resolução (20 m × 22 m - alcance × azimute). A Fig. 1 apresenta uma comparação entre as imagens ópticas [23] e os patches das imagens SAR [24] das plataformas de petróleo do tipo Floating Storage and Offloading (FSO) P-38, Floating Production Storage and Offloading (FPSO) P-58 e Floating and Production Unit (FPU) P-53.  B. Bibliotecas Open Source e algoritmos de classificação Para classificação dos alvos, utilizam-se os classificadores kNN e RF disponíveis nas bibliotecas de código aberto (open source) Orange [25] e Scikit-learn [22], que são desenvolvidas em Python e realizam tarefas de ML, data mining e visualização de dados. Essas ferramentas estão cada vez mais sendo utilizadas pela comunidade científica [26], [4].  A seguir, elencam-se as vantagens e desvantagens das bibliotecas Scikit-Learn [27] e Orange [28] e dos classificadores kNN [29] e RF [29]. i. Scikit-learn  Vantagens: Possui documentação atualizada e com códigos de exemplos; Abrange a maioria dos algoritmos de ML; Possui fluxograma que orienta o usuário na seleção do modelo. Desvantagens: Não é uma plataforma analítica de ponta a ponta. Sendo assim, pode ser necessário a integração com outras soluções; Possui alta curva de aprendizado; Não lida de forma simples com grande quantidade de dados. ii. Orange  Vantagens: Inclui as funções para data mining, machine learning, pré-processamento e visualização de dados; Programação visual, representada através de widgets, de fácil aprendizagem e com código desenvolvido em Python; Permite operações com big data utilizando o widget SQL, mas é necessário instalar o módulo psycopg2; Constante desenvolvimento e atualização de widgets; Documentação online ampla com exemplos e tutoriais. Desvantagens: Número limitado de widgets quando comparado com outros softwares como RapidMiner [30] e KNIME [31]; Suporte apenas aos bancos de dados PostgreSQL e MSSQL. iii. RF (Random Forest)  Vantagens: Uso em classificação e regressão com dados numéricos e categóricos; Modela relações de dados não lineares; Resistência a overfitting e robustez à presença de ruído nos dados; O aumento do número de árvores diminui a variância; Utiliza aleatoriedade na formação dos subgrupos de árvores de decisão independentes; Cada árvore de decisão produz resultados independentes; Não tendencioso porque a decisão final depende de todos os resultados. Desvantagens: Não há um número exato de árvores para obter o melhor resultado de classificação, já que o tamanho dos dados e quantidade de atributos influenciam nos resultados; O aumento do número de árvores aumenta o viés; Maior tempo de processamento e maior complexidade de algoritmo quando comparado com árvores individuais. iv. kNN (k-Nearest Neighbors)  Vantagens: Lógica simples e fácil configuração para problemas mais complicados; Aumento do k diminui a variância; Há uma variedade de técnicas para cálculo eficiente da distância de k-vizinhos mais próximos; Aplicações em classes multimodais e com muitos rótulos. Desvantagens: Pode consumir mais memória para um grande número de atributos; Aumento do custo computacional para grandes conjuntos de dados devido à necessidade de cálculo. da distancia do objeto não rotulado para os objetos rotulados;  Aumento de k, aumenta o viés; Uso de comparações baseadas em distância que atribuem intrinsecamente peso igual a cada atributo. Deve-se escolher uma técnica que incorpore ponderação de atributos. C. Metodologia Neste estudo utilizam-se imagens SAR orbitais, técnicas de DL para extração de atributos e técnicas de ML para classificação. A metodologia é apresentada na Fig. 2 e explicada com detalhes no itens a seguir.  Imagens SAR: são adquiridas 8 imagens SAR, modo GRD, IW, L1, polarização VH, através do projeto Copernicus [32]; Pré-Processamento: as imagens SAR originais do tipo amplitude são transformadas em imagens sigma zero através do software Sentinel Application Platform (SNAP). A partir dessas imagens, são coletados 400 patches dos alvos no formato Tagged Image File Format (TIFF), sendo 200 de plataformas de petróleo e 200 de navios. A verdade de campo (ground truth) das plataformas de petróleo é obtida com base na geolocalização (latitude × longitude) fornecida pela Agência Nacional do Petróleo, Gás Natural e Biocombustíveis (ANP) e do portal Marine Traffic [33]; Extração de atributos: a extração de atributos é realizada através da vetorização dos 400 patches de imagens utilizando a VGG-16 pré-treinada com o banco de dados ImageNet; Formação do banco de dados: com base nos atributos extraídos pela VGG-16, forma-se o dataframe df-16vh; Bootstrap e formação de grupos de treino e teste: com base no dataframe original, df-16vh, que é composto por 400 amostras (patches) dos alvos, e seguindo a mesma metodologia proposta por [24], formam-se 50 subgrupos distintos de forma aleatória e com reposição através da técnica bootstrap. Cada grupo é formado por amostras de treino (80% do total de amostras) e teste (20% do total de amostras); Classificação: a classificação dos alvos é efetuada com os classificadores de ML RF e kNN das bibliotecas Python, Orange e Scikit-learn. O ajuste dos parâmetros é feito da seguinte forma: RF - número de árvores: 50; kNN - número de vizinhos: 7. Para comparação, as seguintes métricas foram empregadas [34]. Área abaixo da curva (AUC, area under the curve): esta métrica é formada pela área abaixo da curva (ROC, Receiver Operating Characteristic). A AUC resume o valor da curva ROC em um número que varia entre 0 e 1. Quanto mais próximo de 1, melhor a performance. Acurácia (Acc, accuracy): esta métrica indica a proporção de amostras corretamente classificadas, diante do total de amostras em um teste.  III. RESULTADOS E DISCUSSÕES A Tabela I apresenta os resultados da média das métricas em 50 classificações dos subgrupos gerados com a técnica bootstrap. Percebe-se que o RF possui os maiores valores de AUC e Acc, destacando os resultados com a biblioteca Orange que apresenta 0,905 e 0,818, para AUC e Acc, respectivamente. Comparando o RF das duas bibliotecas, a AUC possui os mesmos valores, 0,905. Analisando a Tabela I, a mediana é a mesma para o RF com as duas bibliotecas, 0,812. Já em relação ao kNN, o maior desvio padrão é de 0,039 com o Scikit-Learn. A Fig. 3 apresenta o histograma de distribuição com as médias de classificações. Com base na dispersão dos dados, também apresenta-se no mesmo gráfico a distribuição de probabilidade. O histograma do RF com a biblioteca Orange tem a maior concentração de acurácia entre 0,775 e 0,850. Ainda de acordo com a Fig. 3, os resultados com Orange são mais concentrados para os dois classificadores enquanto que os resultados com o Scikit-learn apresentaram-se espalhados. Ao analisar os boxplot da Fig. 4, evidenciam-se os resultados com o Orange como melhores que os resultados do Scikit-learn. As médias no Orange são superiores às medianas. As médias de acurácia apresentadas pelo Orange possuem maior homogeneidade, conforme pode ser visto pela forma da caixa do boxplot, ou seja, a distância da mediana para o primeiro e terceiro quartil possuem valores aproximados. Os resultados obtidos se mostram competitivos com [24]. De acordo com a biblioteca de ML utilizada, um mesmo algoritmo pode apresentar resultados diferentes. Isso pode ocorrer devido a diversos fatores, dentre eles:  funções de pré-processamento; arredondamentos; ajuste de parâmetros disponíveis; bibliotecas científicas utilizadas na implementação (Numpy, Scipy, Scikit-learn, PyTorch). IV. CONCLUSÕES Este artigo avaliou os algoritmos de ML RF e kNN com as bibliotecas Orange e Scikit-learn na classificação de alvos marítimos. Devido a suas grandes estruturas metálicas e geometria, os navios e plataformas se destacam no canal de polarização VH gerando maior backscattered. A CNN VGG-16 se mostrou eficiente para extração de atributos das imagens SAR e geração de vetores para ambos os classificadores com as duas bibliotecas. O RF da biblioteca Orange obteve melhor desempenho com acurácia de 81,8% e AUC de 0,905. Os classificadores da biblioteca Scikit-learn apresentaram acurácia de 81,2% e 77,4% para o RF e kNN, respectivamente. Os resultados obtidos nesta pesquisa se mostram competitivos com a literatura. Como trabalhos futuros, pode-se avaliar o algoritmo Gradient Boosting para classificação e outras opções de CNN, como por exemplo a SqueezeNet, para extração de atributos.  "
}