	{
		"id":36,
		"titulo": "análise da frequência radar na detecção de um rpa em função da rcs",
		"autor": "Newton A. S. Gomes, Renê L. P. Costa, Igor J. Sleutjes, Renan M. Richter1 e Maurício R. Baldan",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2022/st/226012_1.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 1,
		"resumo":"Este artigo apresenta um estudo da predição radar de aeronaves remotamente pilotadas (RPA) do tipo DJI Phantom. Foram avaliadas as frequências de 1, 3 GHz (Banda L), 2, 8 GHz (Banda S), 5, 3 GHz (Banda C) e 10, 0 GHz (Banda X) para a gradação dos respectivos alcances de detecção. Empregou-se o conceito da RCS estática, estimado por simulações eletromagnéticas e posteriormente aplicaram-se os dados na equação radar. Os resultados evidenciam que a frequência de 1, 3 GHz gera o maior alcance de detecção do RPA DJI Phantom, sendo 70, 5% mais efetiva em relação a frequência de 10, 0 GHz que apresentou o menor alcance em relação ao conjunto de frequências avaliadas. Esse trabalho colabora para definir um critério mais técnico para aquisição de radares para detecção de RPA no contexto da segurança de voo e da defesa aérea." ,
		"texto": "I. INTRODUÇÃO O advento das aeronaves não tripuladas foi revolucionário, tanto em aplicações civis quanto nas militares. No entanto, à medida em que suas demandas aumentam, suas regulamenta- ções e controle ainda carecem de estudos mais técnicos sobre meios e métodos de detecção. Regras para estes sistemas ainda são incipientes e carecem de evolução apropriada com vistas à segurança de voo e defesa aérea. O presente trabalho traz uma metodologia de geração de critério, no intuito de avaliar a aplicabilidade do uso de frequências de micro-ondas para a detecção radar de um conjunto de RPA (Remotely Piloted Aircraft - Aeronave Remotamente Pilotada) baseada no conceito de RCS (Radar Cross Section - Seção Reta Radar) [1]. Na seção II é apresentada a fundamentação teórica do conceito de uma aeronave remotamente pilotada, o processo de detecção e a equação radar condicionada a RCS da aeronave. Na seção III é discutida a definição do RPA e a sua modelagem computacional. Na seção IV é apresentado a RCS do RPA em função das frequências e a predição do alcance radar. Ao final, é apresentada a conclusão deste trabalho. II. FUNDAMENTAÇÃO TEÓRICA A. Aeronaves Remotamente Pilotadas - RPA As primeiras aeronaves não tripuladas foram desenvolvidas pela Alemanha, nos anos 1940 do século XX, conhecidas como bombas voadoras do tipo V-1, para serem empregadas contra a Inglaterra como um armamento aéreo. Nos anos 1970, o engenheiro espacial israelense Abraham (Abe) Karem, construiu o Albatross utilizando fibra de vidro e madeira, que posteriormente teve melhorias em suas baterias recebendo financiamento da DARPA (Defense Advanced Research Projects Agency), sendo chamado de Amber, Fig. 1. Esses estudos deram origem ao que viria a ser a aeronave MQ-1 Predator empregada pelas forças militares dos EUA [2].Na sua gênese, o desenvolvimento dessas aeronaves tinha o objetivo de terem aplicações militares, tendo como intuito a execução de atividades em que poderiam haver riscos a vida humana, como monitoramento de áreas específicas gerando uma segurança a toda uma guarnição de uma base aérea, por exemplo. Uma característica importante é que essas aeronaves podem executar o voo, sendo controladas por sistemas de rádio frequência e posteriormente serem recuperadas, retornando para a sua origem de decolagem ou um outro local pré-determinado para seu pouso. No Brasil, essas aeronaves são utilizadas em vários tipos de aplicações, tanto comerciais, quanto pessoais e militares. Conforme o Departamento de Controle do Espaço Aéreo (DECEA), que tem por missão planejar, gerenciar e controlar as atividades relacionadas ao controle do espaço aéreo, à proteção ao voo, ao serviço de busca e salvamento e às telecomunicações do Comando da Aeronáutica, o uso do termo VANT (Veículo Aéreo Não-Tripulado) é considerado obsoleto pela Organização da Aviação Civil Internacional (OACI), sendo o termo RPA (Remotely Piloted Aircraft) o atualmente padronizado internacionalmente e adotado pelo DECEA [3]. Em algumas situações, está sendo empregado o termo SARP (Sistema de Aeronave Remotamente Pilotada), contudo existe um acrônimo de Standard and Recommended Procedures que representa uma padronização internacional para orientações emitidas ao segmento aeronáutico pela OACI levando assim a uma confusão no uso dos termos na fraseologia, desta forma o DECEA adotou a sigla RPA como o termo aeronáutico para esse tipo de aeronave [4]. B. Processo de Detecção de Ameaças No contexto de realizar a defesa aérea em contraposição a uma ameaça representada por um ou conjunto de RPAs, baseado na classificação apresentada pela OTAN (Organização do Tratado do Atlântico Norte) [5], Tabela I, e combinando o conjunto de prováveis empregos operacionais baseado nas Ações de Força Aérea, no contexto do Poder Aeroespacial, como preconiza na DCA 1-1/2020 - Doutrina Básica da Força Aérea Brasileira, é necessário observar, dissuadir, negar, desviar, neutralizar e destruir qualquer ameaça que possa ser eminente no espaço aéreo sob jurisdição da FAB (Força Aérea Brasileira) [6]. No intuito de executar essas premissas, quando contextualizado para alvos do tipo RPA, é necessário que seja cumprido um ciclo de atividades no intuito de viabilizar essa Ação de Força Aérea, conforme a Fig. 2. Nesse contexto, o ciclo inicia com a detecção, seguida pela identificação, posteriormente por sua classificação e por último, a sua neutralização. O processo de detecção e identificação são ações definidas pelo uso de sensores capazes de realizar essas tarefas, setorizado para sistemas de guerra eletrônica. O processo de classificação está correlacionado ao comando e controle bem como a ação de neutralização a um sistemas de armas coordenado aos outros sistemas já descritos [7]. Fica evidenciado que o processo de detecção é vital para que o ciclo possa ocorrer até a obtenção da neutralização da ameaça, que no caso deste trabalho é um RPA. 1) Sistemas de Detecção: Os RPAs tem sido empregados em cenários bélicos no século XXI e há uma tendência de aumentar a sua participação em futuros conflitos em vários níveis de emprego. A indústria de Defesa, mundialmente, tem desenvolvido métodos para permitir uma melhor detecção de alvos nas diversas faixas do espectro eletromagnético, podendo utilizar sistemas radar, sistemas passivo de RF, sistemas eletro-ópticos na faixa do visível (EO) e infravermelho (IR) e sistemas acústicos. Cada sistema possui suas vantagens e desvantagens, contudo, esse trabalho objetivou o sistema radar em função de já existirem soluções implantadas nas frequências em estudo [7].C. Equação Radar e a Radar Cross Section (RCS) O conceito do radar está associado à propagação de ondas eletromagnéticas que foram desenvolvidas a partir dos estudos do físico alemão Heinrich Rudolf Hertz, em 1883, onde aplicou a eletrodinâmica clássica das equações de Maxwell [8]. Um sistema radar básico é composto por um transmissor, um receptor e uma antena, sendo emitido um conjunto de sinais pulsados em micro-ondas, onde a energia eletromagnética transmitida pela antena é definida pelo vetor de Poynting (S⃗) apresentado em (1) [1]. O vetor de Poynting corresponde a densidade direcional do fluxo de energia transferida por unidade de área, W/m2, de um campo eletromagnético em um determinado volume no espaço, em uma determinada frequência [9]. O princípio de funcionamento do radar corresponde a detecção do fluxo de energia espalhado pelo alvo que foi recebido pelo receptor radar, sendo definido uma distância máxima entre esse alvo e o radar por (2).Nesta condição, o alcance radar está formatado para parâmetros inerentes às características do radar a ser operado, como amplificador de potência de transmissão (Pt), o ganho da antena (G), o comprimento de onda eletromagnética emitida (λ) em função da frequência de operação, a temperatura de operação do sistema (Te), a largura de banda do receptor radar (BW), a figura de ruído do receptor (F) e a relação sinal-ruído do receptor (SNRo). A única variável que não depende do sistema radar é a RCS do alvo, σ [1]. Conforme em (3), a RCS (σ) corresponde a relação entre o campo elétrico espalhado pelo alvo (E⃗s) e o campo elétrico incidente pelo radar (E⃗i) em função dos ângulos azimutais (ϕ) e de elevação (θ). O valor da RCS em (3) é dado em m2, mas se utiliza esse valor também em dBsm, definido por (4). Os valores da RCS, quando estão abaixo de 1m2, são normalmente empregados na unidade de dBsm. Este trabalho utiliza os valores da RCS em m2 e dBsm [1].III. MATERIAIS E MÉTODOS A. Definição do RPA para a Modelagem As aeronaves remotamente pilotadas são apresentadas em 2 configurações, uma na forma de asa fixa e outra, na forma de asa rotativa. Tendo como referência a classificação de RPA definido pela OTAN, Tabela I, os RPAs classe III e II possuem características mais semelhantes a uma aeronave tripulada [10] e sua detecção radar deve ter uma maior probabilidade de ocorrer em detrimento dos RPAs da classe I. Em função desta condição, foi escolhido um RPA classe I na forma de asa rotativa do tipo quadricóptero, por se tratar de aeronaves mais comuns de serem encontradas no Brasil, podendo ser empregadas para uso civil ou militar. O RPA avaliado é uma versão do modelo DJI Phantom que possui um peso de 1, 388 kg, sendo classificado na classe I pela OTAN. O CAD (Computer Aided Design) foi modelado geometricamente pelo software FreeCAD nas dimensões de 472, 57 mm de comprimento na diagonal e 211, 95 mm de altura, Fig. 3. B. Modelagem e Simulação do RPA DJI Phantom O estudo da RCS de alvos complexos, como é o caso de um RPA, é realizado através de medidas eletromagnéticas em uma câmara anecoica ou empregando métodos computacionais numéricos utilizando softwares específicos bem como uma estrutura computacional dedicada para essa finalidade [11]. O software utilizado no estudo é o FEKO da empresa ALTAIR, sendo aplicado o método assintótico physical optics com discretizações de λ/8 do CAD. Todas as modelagens e simulações utilizaram uma máquina Intel Xeon E-2246 com 12 núcleos e uma memória RAM de 64 GB. O RPA sob estudo neste trabalho, bem como muitos outros RPAs comerciais, são construídos por materiais plásticos do tipo ABS (Acrylonitrile Butadiene Styrene - Acrilonitrila Butadieno Estireno) com poucos componentes metálicos em sua estrutura [12], contudo, pelo fato de não se ter amostras do material para avaliar as suas permissividades elétricas (ϵ) e a permeabilidade magnética (µ) e devido ao fato de se desejar compreender o efeito das geometrias do RPA em estudo, foi definido que as estruturas físicas são modeladas com materiais condutores metálicos, conhecidos na literatura como PEC (Perfect Electric Conductor). Esta condição permitirá que seja analisado a condição de melhor caso para a detecção por parte do radar em todas as frequências a serem adotadas nas simulações. Avaliando os tipos de radares primários utilizados mundialmente para uso no controle de tráfego aéreo, defesa aérea e possíveis soluções comerciais para detecção de RPA empregando a faixa de micro-ondas, foram definidas as frequências para as simulações eletromagnéticas, conforme a Tabela II. Os radares monoestáticos alocados no solo, podem ter uma rotação mecânica em torno do seu eixo. Outra condição são suas antenas fixas mecanicamente, tendo uma varredura eletrônica, no caso, um radar phased-array [13] ou uma combinação de uma rotação mecânica em seu próprio eixo e uma varredura eletrônica. No FEKO, a modelagem do engajamento radar é realizado na forma como é definido os ângulos ϕ e θ em uma calota esférica. Os radares de solo, normalmente, possuem uma abertura de feixe vertical no valor de 30◦, o que defini uma alocação de 90◦ ≤ θ ≤ 120◦ para o ângulo de elevação e de 0◦ ≤ ϕ ≤ 360◦ para os ângulos azimutais. Na Fig. 5 é apresentado a representação de engajamento dos vetores de Poynting S⃗ e do campo elétrico E⃗ , que no caso será na polarização horizontal, do tipo HH, que corresponde em emitir a onda eletromagnética na polarização horizontal e detectar a onda espalhada originada do alvo na polarização horizontal. Essa condição é a mais empregada em radares com aplicação para tráfego aéreo e defesa aérea.IV. RESULTADOS E DISCUSSÃO A. RCS do RPA DJI Phantom Conforme a Fig. 5, o RPA está na linha de visada do radar, sendo inicialmente avaliado a RCS com um feixe radar no ângulo de θ = 90◦ e um ϕ qualquer entre 0◦ e 360◦. Esses resultados, na forma polar, são apresentados nas Fig. 6 (banda L), 7 (banda S), 8 (banda C) e 9 (banda X). Essas condições são repetidas para os ângulos de elevação 90◦ ≤ θ ≤ 120◦ com passos de 1 grau. Foi realizado o cálculo da RCS média (σ¯) na condição de 0◦ ≤ ϕ ≤ 360◦ para os ângulos θ nos valores de 90◦, 95◦, 100◦, 105◦, 110◦, 115◦ e 120◦, Fig. 10. Conforme a Fig. 10, um radar operando na banda L, na frequência de 1,3 GHz, a RCS média dos ângulos azimutais são maiores que as RCS médias nas frequências na banda S, C e X. As frequências de banda S, C e X possuem RCS médias muito próximas, sendo as de banda S e X se alternando nos ângulos θ tendo os menores valores. Os valores das RCS se aproximam da banda L quando o ângulo θ se aproxima de 120◦, que representa o RPA voando em aproximação ao radar e com elevada altitude. Na Tabela III é apresentado uma síntese das RCS em função da frequência aplicada sobre o RPA DJI Phantom. Esse conjunto de simulações tiveram um custo computacional na sua execução, sendo apenas mensuradas o tempo de cálculo numérico e não contabilizado os tempos de preparo do CAD, desenvolvimento da modelagem e síntese dos resultados. A mensuração temporal despendido é apresentado na Tabela IV, tendo um total de 7d 15h 23min. B. Predição do Alcance Radar Na subseção IV-A foi obtido um conjunto de resultados das RCS do RPA em várias condições de ângulos de azimute ϕ e elevação θ, em função das frequências escolhidas para as modelagens e simulações. Esses resultados representam a RCS estática pois não é tratado a condição dinâmica de voo dos RPA. Caso tivesse sido tratada uma trajetória de voo em função de uma posição e velocidades, as RCS teriam um comportamento que se chama de RCS dinâmica [15]. A definição da melhor frequência para detectar o RPA é empregada a determinação do alcance máximo médio Rmax, aplicando as RCS médias por frequência para o RPA. Conforme em (2), o alcance do alvo pode ser reescrito por (5). Em (5), o termo que depende do tipo do radar empregado pode ser sintetizado por uma constante k, definido em (6). Nessa condição, (5) é sintetizado em (7). Esse estudo visa avaliar qual ou quais frequências permitem definir um maior alcance (Rmax) de detecção. Nessa condi- ção, mesmo havendo vários tipos de radares em função das frequências, é empregado um radar hipotético em todas as frequências, para teste, no sentido de obter os valores de Rmax médio para o RPA, variando os valores de θ e as frequências de operação. Na Tabela V são expressos os valores nominais das variá- veis de um radar que será substituído em (6). Realizadas as conversões de unidades e o cálculo numérico em (6), é obtido um k = 34.513, 21. Essa constante representa a síntese deste radar hipotético para ser aplicado no RPA. Na Fig. 10, é apresentada a RCS média do RPA, em função das frequências. Ao aplicar esse valores em (7), são obtidos os alcances médios máximos para o RPA, Fig. 11. Esses resultados são sintetizados com as médias dos alcances em função dos ângulos θ na Tabela VI. Considerando os dados obtidos para o alcance radar médio do RPA da Tabela VI, a banda L apresenta o maior alcance médio estimado dentre todas as bandas avaliadas, no valor de 8.381, 7 m (4, 5 NM). Definindo esse valor como referência, e tendo as outras bandas emitindo simultaneamente ao RPA, o alcance em banda S em relação a banda L é reduzido no valor de 42, 8%, empregando a banda C a redução é de 57, 3% e na banda X essa redução chega ao valor de 70, 5%. Essa condição permiti inferir que a banda L, em 1, 3 GHz, representa a frequência mais adequada para obter a aquisição do RPA em detrimento das outras frequência estudadas. Esse estudo não avalia as perdas de propagação, nem a variação da largura de pulso (LP), a frequência de repetição de pulso (FRP), bem como os diagramas de radiação das antenas para a definição das células de resolução. Contudo, todos esses termos estão implícitos e tendo valores constantes quando é definido o radar hipotético, desta forma, o tipo do radar se torna isento da análise, sendo avaliado as condições do alvo sob o critério da sua RCS em uma determinada frequência de operação. Fica evidenciado, através das simulações, que nas condições estudadas, as RCS do RPA possuem valores abaixo de 0 dBsm (1 m2). Esses resultados são observados em todas as variações de frequência, banda L, S, C e X, nos ângulos de azimute ϕ e ângulos de elevação θ. Comparado a valores da RCS de uma aeronave militar que foi medido em apenas um ângulo de elevação [16], há uma correlação entre esses resultados com os valores publicados na literatura por outros grupos de pesquisa, onde apresenta um valor médio de -20 dBsm (0, 01 m2). A RCS média do RPA é apresentado, em todas frequências do estudo, com uma variação de -10,6 dBsm (0, 09 m2) à -16,7 dBsm (0, 02 m2). Ao avaliar esses dados, os resultados obtidos nas simulações realizadas nesse trabalho, quando comparados com Schroder et al. [12] e Tasai et al. [17], permitem afirmar que o método é confiável e que esses valores das RCS estão correlacionados com medidas experimentais, validando os dados obtidos nessa pesquisa. No caso do uso de um radar banda X, observou-se que as RCS nessa frequência, Fig. 9, possuem uma cintilação acentuada em todos ângulos azimutais, o que é bem menos evidente na banda L. Essa condição, quando analisada dinamicamente, caracteriza um alvo com uma perda elevada de detecção em função do tempo, dificultando a sua designação por um operador radar. V. CONCLUSÃO Na busca das melhores frequências, a banda L, nas condi- ções de engajamento do RPA do tipo DJI Phantom, representa um maior alcance de detecção, sendo a mais indicada para obter um rastreio desse tipo de alvo a uma maior distância. As outras frequências avaliadas não estão inabilitadas para aquisição desse alvo, contudo, terão um alcance degradado em relação a banda L, principalmente a banda X, sendo obtido um valor de 70, 5%. Baseado nos resultados desse trabalho, desenvolver o uso conjugado de mais de uma banda de frequência é desejável, quando se opta por uma combinação de alcances simultaneamente, contudo, a priorização da escolha das frequência devem estar na de maior alcance para as de menor alcance. Esse trabalho apresenta um estudo do RPA do tipo DJI Phantom sendo determinado a RCS e a frequência que permite haver um maior alcance de detecção na faixa de micro-ondas, contribuindo para estabelecer uma melhor entendimento sobre esse tema, sendo definido um critério mais técnico para aquisição de radares para detecção de RPA no contexto da segurança de voo e da defesa aérea."
	}
