{
    "id": 37,
    "titulo": "predição radar do míssil de cruzeiro tomahawk em banda l baseado na rcs dinâmica",
    "autor": "newton a. s. gomes, lucas p. lima, renan m. richter, braulio h. k. lopes e maurício r. baldan",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2022/st/225968_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Os mísseis de cruzeiro são armamentos de uso tático e poucos países possuem essa tecnologia. O seu uso vem sendo crescente no decorrer dos anos e desenvolver uma forma de detectá-lo é importante para capacitar um sistema anti-aéreo de defesa. Esse trabalho propõe realizar a predição radar do míssil de cruzeiro Tomahawk baseado na RCS dinâmica na frequência de 1,32 GHz através de simulações eletromagnéticas. Através de um radar hipotético foi simulado o alcance de detecção do míssil, que voa próximo de 100 ft, sendo obtido uma degradação do alcance na aproximação frontal no valor de 37,8% e na evasão esse valor é um pouco maior, 52,2%. Essa condição é devido ao efeito da RCS dinâmica do míssil, sendo obtido um valor médio frontal de 1,41 m2 e de 0,41 m2 na condição traseira.",
    "texto": "I. INTRODUÇÃO Os mísseis de cruzeiro tem a sua origem nas bombas guiadas V-1, desenvolvidas pela Alemanha no período da II Guerra Mundial. Foram empregadas contra alvos terrestres, especificamente, na cidade de Londres, sendo lançado aproximadamente 21.000 unidades da V-1, percorrendo uma distância média de 200 km (108 NM) [1]. O míssil de cruzeiro é definido por ser um armamento aéreo que mantém um voo com uma velocidade quase constante, nas condições subsônicas, supersônicos ou hipersônicas, tendo uma trajetória retilínea por um longo período de tempo, uma alta manobrabilidade, em baixa altitude, avançando nas defesas do inimigo na busca de um alvo pré-definido [2] [3]. Nos últimos anos, o desenvolvimento tecnológico dos mísseis de cruzeiro tem sido progresivo, havendo versões para aplicações anti-navio (ASCM - Anti-Ship Cruise Missiles) e de ataque a alvos terrestres (LACM - Land-Attack Cruise Missiles). Vários países como Estados Unidos (AGM-158 e RGM-109), Rússia (Kalibr), Inglaterra/França (Storm Shadow), Índia (PJ-10 Brahmos), China (YJ-12), Turquia (SOM B2) e Alemanha/Suécia (KEPD 350) empregam mísseis de cruzeiro em suas forças armadas [4]. Em 1999, o Exército Brasileiro (EB) iniciou as tratativas junto a empresa Avibrás Indústria Aeroespacial S/A para o desenvolvimento de um míssil de cruzeiro nacional, chamado de AV-TM 300. Esse míssil incorpora capacidades tecnoló- gicas semelhantes a versão BGM-109 Tomahawk americana, sendo o AV-TM 300 lançado de terra pelo sistema ASTROS que é construído pela Avibrás e operado pelo EB [5]. Diante da proliferação do uso operacional de mísseis de cruzeiro, o desenvolvimento de defesas anti-aéreas, baseado em sinais de radar, é necessário para detectar essa ameaça antes que algum alvo seja atingido [6]. A predição radar de mísseis é fundamentado pela forma como o míssil reflete as ondas de radar. Essas informações podem ser obtidas através de medidas em câmara anecoica [7], contudo, nem sempre é possível ter acesso a um artefato original para realizar tais medições, assim, uma outra opção é estimar a RCS (Radar Cross Section - Seção Reta Radar) através de simulações eletromagnéticas computacionalmente [8] [9]. Este trabalho tem o propósito de estimar a RCS e a predição de detecção do míssil de cruzeiro BGM-109 Tomahawk em função de um radar hipotético na banda L, de baixa densidade espectral de potência empregando simulações eletromagné- ticas. Na seção II é apresentado a fundamentação teórica, iniciando com o míssil de cruzeiro BGM-109 Tomahawk, seu histórico de criação bem como seu princípio de funcionamento operacional, o conceito da equação radar, da RCS e da probabilidade de detecção de um alvo. Na seção III é discutido a modelagem estática e dinâmica da RCS do míssil. Ao final, são apresentados os resultados e discussões, seção IV, e na seção V as conclusões deste trabalho. II. FUNDAMENTAÇÃO TEÓRICA A. Míssil de Cruzeiro Tomahawk O Tomahawk, chamado de TLAM (Tomahawk Land Attack Missile - Míssil de Ataque Terrestre Tomahawk), é um míssil de cruzeiro guiado com precisão, de longo alcance, contra alvos terrestres e navais em condições climáticas adversas, desenvolvido inicialmente pela empresa General Dynamics, posteriormente pela McDonnell Douglas Corporation e Hughes Aircraft Corporation, sendo atualmente fornecido pela empresa Raytheon Missiles & Defense, Fig. 1. É uma armamento que emprega ogivas convencionais lançado de navios de superfície e submarinos (SLCM - Sea-Launched Cruise Missile - Míssil de Cruzeiro Lançado no Mar) nos modelos BGM-109 A à F e RGM/UGM-109 A à E, de terra (GLCM - Ground-Launched Cruise Missile - Míssil de Cruzeiro Lançado do Solo) na versão BGM-109G e de aeronaves (MRASM - Medium-Range Air-to-Surface Missile - Míssil Ar-Superfície de Médio Alcance) nas versões AGM- 109 C/H/I/J/K/L [10]. Entrou em serviço operacional em 1983 e teve a primeira ação em combate na Guerra do Golfo em 1991. Os Tomahawks foram posteriormente empregados extensivamente no Iraque no início dos anos 1990 e durante a Guerra do Iraque (2003 − 2011). Também foram utilizados na Bósnia (1995), Líbia (1996 e 2011), Sudão (1998), Iugoslávia (1999), Iêmen (2009 e 2016), Afeganistão (1998-2001) e Síria (2014, 2017 e 2018). Os Tomahawk estão disponíveis em uma série de variantes, como as Block II (1984), III (1993), IV (2004) e V (2021), sendo as Block IV e V as versões atualmente operacionais nas forças armadas americanas e inglesas. Contudo, apenas as versões navais estão sendo empregadas efetivamente contra alvos navais e terrestres [1]. A sua navegação é realizada por sistemas inerciais, GPS (Global Positioning System), sistema TERCOM (guiamento por imagens de solo e radar-altímetro) em conjunto com o sistema DSMAC (correlação de imagens digitais), sistema SATCOM e link de dados para atualização de rota, adicionado por um radar passivo para atacar alvos móveis terrestres e marítimos com precisão. Na Fig. 2 é apresentado uma diagramação do emprego do Tomahawk em um teatro de operações onde 1 corresponde ao lançamento do míssil de um navio, em 2 ocorre a primeira correção de rota através do sistema TERCOM, em 3 ocorre uma segunda correção com o TERCOM e GPS (NAVSTAR) e em 4 a correção final com o sistema DSMAC [12]. Devido ao seu emprego tático apresentado na Fig. 2, a altitude de voo operacional é definida entre 98 ft (30, 0 m) e 164 ft (50, 0 m), voando a uma velocidade média de 480 kt (888 km/h) e tendo um alcance que varia de 486 NM (900, 0 km) à 1350 NM (2500, 0 km) em função do modelo do míssil [11]. B. Equação Radar O radar possui um princípio de funcionamento baseado na transmissão e recepção de ondas eletromagnéticas em uma determinada frequência para detecção e estimativa de distância, azimute e velocidade relativa. Possuem antenas direcionais que transmitem sinais de forma monoestática ou biestática, em um volume do espaço, em busca de alvos cujas ondas eletromagnéticas são refletidas em função da sua geometria, do material do qual são construídos, dos ângulos e da frequência da onda incidente [14]. O alcance de um alvo em função do tempo é definido pela equação radar, (1), que determina a distância máxima possível que um radar é capaz de detectar, onde Pt é a potência do transmissor, G é o ganho da antena, λ representa o comprimento de onda, Pr a potência mínima que sensibiliza o receptor do radar e σ a seção reta radar do alvo [14]. Conforme em (1), a única variável que não depende o sistema radar é o valor da RCS (σ), que está relacionada exclusivamente ao alvo a ser engajado. Desta forma, há um binômio radar-alvo para cada condição de emissão realizada pelo radar. Neste trabalho é utilizado o conceito de um Radar Hipoté- tico no intuito de desenvolver o conceito do binômio radaralvo, sendo seus dados apresentados na Tabela I. Os radares possuem uma capacidade de determinar um alcance máximo que é definido pela sigla AMNA (Alcance Máximo Não Ambíguo) que para o Radar Hipotético empregado nesse trabalho é de 32 NM (60, 0 km). Esse valor está correlacionado ao IRP (Intervalo de Repetição de Pulso) que representa a taxa de emissão de um pulso radar [14]. Há também uma distância mínima que o radar inicia a sua detecção que é determinada pela largura de pulso (LP) da onda eletromagnética emitida pelo transmissor, que no caso do radar hipotético é no valor próximo de 2 NM (3, 7 km) [14]. C. Radar Cross Section - RCS A RCS de um alvo representa um valor numérico que determina o grau de espalhamento que este alvo gera a uma onda eletromagnética, emitida por um radar, em um determinado instante de tempo. Em (2) é apresentado a equação que define a RCS em coordenas esféricas [15]. Conforme em (2), a RCS (σ) corresponde analiticamente a relação entre o campo elétrico espalhado pelo alvo (E⃗s) e o campo elétrico incidente (E⃗i) pelo radar em uma determinada frequência em função dos ângulos azimutais (ϕ) e de elevação (θ). O valor da RCS em (2) é dado em m2, mas esse valor também é apresentado na unidade de dBsm, definido por (3). Os valores da RCS, quando estão abaixo de 1m2, são normalmente empregados na unidade de dBsm. Este trabalho utiliza os valores da RCS em dBsm [15]. D. Probabilidade de Detecção - Pd Em função de uma trajetória realizada pelo míssil, a densidade de potência é correlacionada a sequência de pulsos emitidos pelo radar, ocorrendo um espalhamento não-linear no alvo, em função do tempo, para um conjunto de ângulos de azimute (ϕ) e de elevação (θ), sendo gerado uma flutuação da RCS chamado de cintilação [16]. Devido a essa condição, a RCS é modelada como um processo estocástico. As funções densidade de probabilidade para essa flutuação são desenvolvidas por Swerling, denominadas casos de Swerling I, II, III, IV ou V [17]. A condição utilizada nesse trabalho é o caso V de modo que a relação sinal-ruído (SNR) disponível para o processo de detecção realizado pelo radar dependa somente da distância do alvo e de parâmetros estritos do radar. O limiar de detecção para a predição de detecção do míssil corresponde ao valor de 0, 5 [16]. A probabilidade de detecção (Pd) corresponde a função densidade de probabilidade de detectar um alvo realizado pelo receptor do radar em função da relação sinal-ruído (SNR) e a probabilidade de falso alarme (Pfa). Por meio do Swerling V, calcula-se a Pd para cada eco-radar, individualmente. Quando se fixa um instante qualquer de uma realização de um processo estocástico, obtém-se uma variável aleatória que, para os casos de Swerling, são do tipo Chi-quadrado, com o respectivo grau de liberdade d, onde obtém-se a função densidade de probabilidade do caso de Swerling V para d → ∞ [18]. A flutuação da RCS não altera a Pfa, pois esta variável depende apenas do limiar de detecção (Vth - Tensão de Threshold) adotado no receptor do radar, sem qualquer influência do alvo neste processo. III. MATERIAIS E MÉTODOS Nesta seção é apresentado o modelamento computacional do míssil de cruzeiro BGM-109 Tomahawk, sendo avaliado a modelagem e simulação da RCS do míssil nas condições estática e dinâmicas [19]. A. Modelagem Estática da RCS No intuito de compreender o efeito do espalhamento da onda eletromagnética na estrutura do míssil BGM-109 Tomahawk, foi utilizado um modelo CAD sem o uso do booster, em escala real, tendo um comprimento de 5, 56 m, um diâmetro de 0, 625 m e uma envergadura de 2, 67 m, Fig. 3. Na modelagem computacional foi empregado o software FEKO da empresa ALTAIR, sendo aplicado o método assintótico physical optics com discretizações de λ/8. Os mísseis são construídos com materiais baseados em ligas metálicas, como aço e alumínio [20], desta forma, a estrutura mecânica do Tomahawk foi modelada neste trabalho como um material metálico, denominado PEC (Perfect Electrical Conductor) que corresponde a um condutor eletricamente perfeito. Na Fig. 4 é apresentado um conjunto de vetores que modelam a propagação da onda do radar. O vetor que aponta para o míssil representa o vetor de Poynting (S) e o vetor perpendicular a S⃗ representa o campo elétrico incidente (Ei).  Tendo como referência os dados da Tabela I, a frequência de engajamento do radar hipotético é no valor de 1, 32 GHz com uma variação azimutal (ϕ) de 360◦, 0◦ ≤ ϕ ≤ 360◦, e uma variação de elevação (θ) de 34◦, 90◦ ≤ θ ≤ 124◦, Fig. 4. B. Modelagem Dinâmica da RCS Os mísseis de cruzeiro possuem a característica de realizarem voos de incursão a baixa altitude, com trajetórias retilíneas e curvilíneas, seção II-A. Esse trabalho avalia a condição de engajamento frontal a um radar em uma trajetória retilínea, conforme a Fig. 5. O processo de engajamento, Fig. 5, foi definido em 4 altitudes de voo relativas a altitude de fixação do radar no solo, correspondendo a variável Z, nos valores de 98 ft (30, 0 m), 164 ft (50, 0 m), 300 ft (91, 4 m) e 500 ft (152, 4 m). É avaliado a condição de engajamento na aproximação e na evasão para uma mesma altitude Z, sem obstáculos físicos, sendo os valores positivos de alcance R correspondendo a condição de aproximação ao radar e os valores negativos a condição de evasão, tendo o x = 0 o local que representa a posição física do radar. IV. RESULTADOS E DISCUSSÕES A. RCS Estática Conforme apresentado na seção III-A, foi desenvolvido a modelagem da RCS do míssil BGM-109, sendo definido os ângulos de azimute (ϕ) e de elevação (θ) utilizados nesse trabalho. Na Fig. 6 é apresentado o espectrograma da RCS do míssil. O espectrograma corresponde a distribuição da RCS em função dos ângulos de engajamento do vetor de Poynting gerado pelo radar. A legenda descrita na figura corresponde a escala de variação da RCS nas faixas angulares, medidas em dBsm. As cores tendendo para o azul representam uma menor RCS, cujo valor mínimo é de −48, 18 dBsm (0, 00002 m2) e quando ocorre uma variação para o vermelho, há um aumento da RCS do míssil, sendo seu valor máximo de 34, 12 dBsm (2582, 26 m2). Na Fig. 7 é apresentado a RCS estática na forma polar para um θ = 90◦, variando os ângulos ϕ. Nos ângulos de 85◦ ≤ ϕ ≤ 95◦ e 265◦ ≤ ϕ ≤ 275◦ a RCS é mais elevada sendo obtido um valor médio de 11, 47±4, 69 dBsm (23, 03± 18, 27 m2), correspondendo as regiões laterais do míssil. A região traseira, nos ângulos 0◦ ≤ ϕ ≤ 60◦ e 300◦ ≤ ϕ ≤ 360◦ representam as regiões com uma menor RCS, tendo um valor médio de −13, 21 ± 8, 32 dBsm (0, 16 ± 0, 15 m2). B. RCS Dinâmica e Predição de Alcance Foram simulados as trajetórias frontais ao radar hipotético nas altitudes de 98 ft (30, 0 m), 164 ft (50, 0 m), 300 ft (91, 4 m) e 500 ft (152, 4 m). Em cada altitude foram obtidos as flutuações da RCS em função da distância ao radar, apresentado nas Fig. 8, 9, 10 e 11. Os resultados das flutuações das RCS nas altitudes avaliadas são sintetizadas na Tabela II, sendo obtido o valor médio e o seu desvio-padrão para cada altitude bem como a média das RCS média de cada altitude e o seu desvio-padrão (σ¯ ± ∆σ).Conforme a Tabela II, na condição de aproximação ao radar, a RCS se eleva com o aumento da altitude, tendo um valor médio de 1, 50±0, 20 dBsm (1, 42±0, 07 m2) e na condição de evasão, a RCS diminui, tendo um valor médio de −3, 90± 0, 70 dBsm (0, 43 ± 0, 05 m2). Tendo como referência as RCS dinâmicas obtidas nas Fig. 8, 9, 10 e 11, são determinados as predições de alcance radar a partir do cálculo da probabilidade de detecção (Pd) pulso a pulso, utilizando o caso de Swerling V, ou seja, RCS definida em valor exato para um determinado pulso [21]. Nas Fig. 12, 13, 14 e 15 são apresentados as predições de alcance em função da posição relativa ao radar, que está referenciado na posição x = 0. Os valores de Pd variam de 0 à 1, sendo o valor 0, 5 a referência de detecção para o caso de Swerling V [16]. Na transição de 0 para 1, o míssil está na condição de detectado (seta para cima) e na transição de 1 para 0, está na condição de não-detectado (seta para baixo). O radar hipotético possui um AMNA de 32, 0 NM (60, 0 km), o que significa que o míssil, à essa distância, deveria ser detectado, contudo, nas condições de altitude avaliadas, a detecção foi iniciada a uma distância média de 19, 9 NM (36, 9 km), tendo uma diminuição no valor de 12, 1 NM (22, 4 km), o que representa uma redução do alcance em 37, 8%, na condição de aproximação. Na condição de evasão, o radar hipotético deveria manter a detecção até um alcance de 32 NM, contudo, o valor médio obtido na simulação foi de 15, 3 NM (28, 3 km), tendo uma degradação do alcance em 52, 2%. C. Síntese das Detecções A partir do conjunto de simulações de predição radar realizado, foram obtidos um conjunto de resultados que é sintetizado pela variação da Pd, sendo essa transição o local que determina a posição em que o míssil está sendo detectado pelo sistema radar. A variação da primeira e da última detecção, nas condições de aproximação e evasão, determina a variável ∆x, que representa a variação do alcance em que o radar mantém o míssil rastreado. Na Tabela III é apresentado a síntese de ∆x para cada altitude simulada e a média das médias das altitudes nas condições de aproximação e evasão. Fica evidenciado que a variação de ∆x permanece equivalente nas altitudes calculadas, tanto na condição de aproximação como na de evasão, independente da altitude Z de trajetória do míssil. Na Tabela IV é apresentado o tempo de detecção nas condições de aproximação e evasão. Na condição de aproximação, independente da altitude Z, o tempo de detecção é basicamente igual, sem varições. Essa condição implica que esse envelope de altitude Z, em uma condição operacional, não impacta na variação do alcance de detecção do míssil. Essa tratativa é estendida para a condição de voo na evasão. V. CONCLUSÃO Nesse trabalho fica evidenciado que o míssil de cruzeiro BGM-109 Tomahawk é detectado pelo radar de baixa densidade espectral de potência a uma distância média de 19, 9 NM (36, 9 km) na condição de aproximação e de até 15, 3 NM (28, 3 km) na condição de evasão. Esse resultado demonstra que o alcance foi degradado em 37, 8% na aproximação e de 52, 2% na evasão ao radar. Esse resultado está correlacionado a RCS dinâmica do míssil que possui um valor médio de 1, 50 dBsm (1, 41 m2) na condição de aproximação e de −3, 90 dBsm (0, 41 m2) na evasão quando o radar opera na frequência de 1, 32 GHz. A conclusão é que a variação da altitude de voo do míssil, nos valores simulados, não contribuem na variação do alcance e no tempo de detecção, que possui um valor médio de 2 min e 15 s na aproximação e 1 min e 41 s na evasão. O método de simulação eletromagnética utilizado na predi- ção radar, desenvolvido nesse trabalho, permite obter valores da RCS nas condições estáticas e dinâmicas bem como a estimação do alcance de detecção radar quando não é possível a obtenção desses dados medidos do míssil em câmara anecoica. Esses resultados capacitam um melhor planejamento operacional de uma defesa anti-aérea, apoiando o processo decisório para elevar a robustez contra mísseis de cruzeiro com os perfis funcionais do Tomahawk.  "
}