	{
		"id": 38,
		"titulo": "emprego da stft e da acf na identificação de codificações intrapulso de sinais radar e seu emprego nos futuros sistemas de elint",
		"autor": "Edgard Braz Alves, Jorge Amaral Alves, Jorge Costa Pires, José Victor de Pina Corrica, Marcos dos Santos, Arthur Pinheiro de Araújo Costa",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2022/st/225717_1.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 1,
		"resumo": "Com o desenvolvimento de Técnicas de Compressão de Pulso foram desenvolvidos radares de Baixa Probabilidade de Detecção (LPD) e Baixa Probabilidade de Interceptação (LPI) que dificultam a correta identificação das características de seus pulsos e, muitas vezes, impedem a detecção eficaz desses pulsos por sistemas de Medidas de Apoio a Guerra Eletrônica (MAGE) convencionais. Como forma de se antepor a estas dificuldades foram desenvolvidos sistemas MAGE modernos, dotados de Receptores Digitais (DRX) que possibilitaram o desenvolvimento de algoritmos de Inteligência Eletrônica (ELINT) intrapulso baseados no domínio da frequência e, portanto, adequados para a identificação das características dos pulsos de radares LPD e LPI. Este trabalho propõe dois algoritmos de ELINT intrapulso baseados na análise no domínio da frequência: a Transformada de Fourier de Tempo Curto (STFT) e a Função de Autocorrelação (ACF). Os resultados demonstram que tais algoritmos são adequados para inclusão nos futuros sistemas MAGE da Marinha do Brasil (MB).",
		"texto": "I. INTRODUÇÃO A evolução tecnológica dos sistemas e sensores empregados nas guerras atuais torna imperativo o desenvolvimento de projetos de pesquisa, desenvolvimento e inovação tecnológica de um país. Especificamente, o emprego de tecnologias inovadoras em sistemas modernos de Guerra Eletrônica (GE) radar resulta em ponto de inflexão nos resultados dos combates. Tais tecnologias inovadoras permitem o emprego mais eficaz da GE radar, uma vez que viabilizam, por exemplo, o emprego de técnicas modernas de Inteligência Eletrônica (ELINT - Electronic Intelligence) que são baseadas em algoritmos complexos de processamento digital de sinais, tal como a Transformada de Fourier de Tempo Curto (STFT - Short Time Fourier Transform), a fim de possibilitar uma análise no domínio da frequência, em tempo real, dos sinais radar recebidos pelo equipamento de Medidas de Apoio a Guerra Eletrônica (MAGE). O surgimento de radares modernos que empregam Técnicas de Compressão de Pulsos (PCT - Pulse Compression Technique) ou que transmitem em Onda Continua Modulada em Frequência (FMCW - Frequency Modulated Continuous Wave) resultaram na quebra de um paradigma, ou seja, eliminaram a vantagem existente do processo de detecção do MAGE em relação ao do radar. Tais radares são denominados radares de Baixa Probabilidade de Interceptação (LPI – Low Probability of Interception) e Baixa Probabilidade de Detecção (LPD – Low Probability of Detection). As tecnologias empregadas nestes radares comprometem muito a eficácia dos processos de detecção e de identificação executados pelos equipamentos MAGE convencionais, ou seja, equipamentos desprovidos de hardware (HW) específico para análise intrapulso de sinais radar. A existência de radares LPI e LPD instalados em meios navais ou mesmo em mísseis, tornou imprescindível o desenvolvimento de equipamentos MAGE modernos, dotados de Receptores Digitais (DRX – Digital Receiver) que possibilitam o emprego de algoritmos de ELINT adequados para a extração de características intrapulso de sinais radar. Em última análise, os sistemas de defesa de um pais devem ter capacidade para se contrapor às ameaças advindas dos mísseis. Os mísseis foram introduzidos nos cenários de guerra a partir da 2ª Guerra Mundial, e desde então, diversos países começaram a desenvolver mísseis mais potentes e dotados de novas tecnologias, tais como os Tomahawks americanos, os Scuds russos, os Exocets franceses, e os ASBM semelhantes aos DF-21 chineses [1]. Estes últimos se diferem dos demais pelo emprego de sistemas de guiagem baseados em radar FMCW e, portanto, pelo emprego de radar com tecnologia LPD. Como consequência, de modo a prover uma reação eficaz a mísseis dotados de sistemas de guiagem baseados em radares LPI ou LPD faz-se necessário dotar os equipamentos MAGE de capacidade de extração de características intrapulso presentes nos sinais dos radares LPI ou LPD, ou seja, dotar os equipamentos MAGE de um DRX e de algoritmos ELINT intrapulso baseados em análise no domínio da frequência. Este trabalho propõe o emprego de dois algoritmos de ELINT intrapulso: a Transformada STFT e a Função de Autocorrelação (ACF – Autocorrelation Function). Tais algoritmos foram aplicados na extração das características intrapulso de sinais de radares LPD e LPI simulados em ambiente computacional MATLAB. Os resultados obtidos com estes algoritmos permitem sugerir que tais algoritmos podem ser incorporados aos futuros equipamentos MAGE em desenvolvimento pela Marinha do Brasil (MB). Inicialmente, são apresentadas as principais características dos sinais transmitidos pelos radares LPI e LPD, a fim de enfatizar as razões pelas quais os tornam grandes ameaças aos meios navais. Em seguida, faz-se uma abordagem de uma possível arquitetura de MAGE dotado de DRX, a fim de exemplificar o aumento da capacidade de processamento digital de sinais adquirida com inclusão deste receptor, especificamente, a capacidade de análise de sinais no domínio da frequência por meio de transformadas rápidas de Fourier. Posteriormente, são apresentados os resultados com o emprego de dois algoritmos desenvolvidos em MATLAB e aplicados a sinais de radares LPD e LPI simulados. O desempenho dos algoritmos propostos é avaliado também em cenários com baixa Relação Sinal-Ruído (SNR – Signal to Noise Ratio). Foram simulados radares LPD e LPI com as seguintes modulações e codificações: Modulação Linear em Frequência (LFM – Linear Frequency Modulation); códigos Barker 2, 3, 7, 11 e 13; e códigos Frank 16 e 64. A. Tipos de Radares 1) Radares de Baixa Probabilidade de Interceptação (LPI) Radares LPI emitem sinais de difícil interceptação por um MAGE, ou seja, sinais tão fracos que os receptores dos MAGE não possuem sensibilidade para interceptá-los. Enquanto o MAGE intercepta um sinal em função da potência de pico deste, o radar tem o seu correto funcionamento determinado pela potência média transmitida [2]. Tal diferença de funcionamento possibilitou o desenvolvimento dos radares LPI que reduzem a potência de pico dos sinais transmitidos, porém mantêm a potência média transmitida no valor necessário para garantir o alcance especificado. Esta característica do processo de interceptação existente no receptor MAGE, ou seja, a interceptação do sinal a partir do estabelecimento de um limiar de detecção (threshold) é ilustrado na Fig.1. Nesta figura, nota-se que o sinal radar da Fig. 1a é detectado pelo MAGE, pois apresenta amplitude maior que o limiar de detecção do MAGE. Entretanto, o sinal da Fig. 1b não é detectado, pois sua amplitude além de ser menor que o limiar de detecção do MAGE, ainda está imerso em ruído. Mesmo que o limiar de detecção do MAGE fosse reduzido, ainda assim não seria possível a detecção, se fosse mantida apenas a análise no domínio do tempo. A redução da potência de pico dos sinais transmitidos pelos radares LPI pode ser obtida por meio das seguintes técnicas: Gerenciamento de Potência; Compressão de pulsos (PCT); redução de lóbulos secundários; e aumento da largura de banda do sinal. Neste trabalho, optou-se por abordar a técnica PCT. A PCT consiste em se transmitir um pulso longo com codificação digital em fase de modo que o eco recebido, após passar por um filtro de compressão na recepção, possa ser reconstruído como um pulso curto. O objetivo desta técnica é quebrar o paradigma existente entre a largura de pulso (associado ao poder de resolução em distância) e a potência média transmitida (associada ao alcance de detecção) de um radar. Em um radar pulsado e sem modulação intrapulso, quanto mais estreito for o pulso melhor será a resolução em distância; da mesma forma, quanto maior a potência média transmitida maior será o alcance de detecção. Por exemplo, um navio operando em regiões de entrada de porto, ou seja, com grande tráfego de navios, emprega seu radar em pulso estreito de modo a ter uma resolução em distância de poucos metros. Entretanto, em alto mar os navios operam com pulsos largos de modo a maximizar o alcance de detecção radar. Em radares militares, de modo geral, deseja-se maximizar o alcance de detecção radar sem degradar muito a resolução em distância. Este objetivo é alcançado com o emprego da PCT. Uma vez escolhido o código da modulação em fase a ser adotado pelo radar na transmissão, o pulso largo é dividido em subpulsos de igual duração. Cada um destes subpulsos recebe uma fase específica, definida de acordo com o código escolhido. Portanto, por exemplo, para um código de comprimento 7 teremos 7 subpulsos com suas respectivas fases definidas pela sequência do código escolhido. A modulação em fase mais usada emprega duas fases sendo denominada codificação binária que associa os valores +1 e - 1, da sequência do código, às fases 0º e 180º, respectivamente. Portanto, neste caso, os subpulsos são transmitidos alternando suas fases entre 0º e 180º, de acordo com a sequência do código adotado. A Fig. 2 ilustra este procedimento para o código Barker-7, cuja sequência é definida como: +1, +1, +1, -1, -1, +1, -1 [3]. A modulação em fase pode ser feita também empregando códigos com mais de duas fases, ou seja, empregando códigos polifásicos. Os códigos Frank são os códigos polifásicos mais empregados em radar [4]. A escolha do código ótimo a ser empregado na transmissão do sinal de um determinado radar é feita com base na relação de compromisso entre a complexidade da geração do código e as características obtidas com a ACF deste código. As ACF ideais para serem empregadas em PCT são aquelas que produzem lóbulos centrais estreitos e lóbulos laterais de baixa amplitude [5]. Dentre os códigos disponíveis para emprego em PCT, este trabalho focou nos códigos Barker e Frank. A Fig. 3a ilustra um sinal LPI utilizando PCT empregando o código Barker-7 no domínio do tempo e na Fig. 3b tem-se a sua respectiva ACF. 2) Radares de Baixa Probabilidade de Detecção (LPD) Os radares LPD empregam ondas continuas (CW – Continuous Waves) moduladas em frequência (FM – Frequency Modulated) ou moduladas em fase. Sua principal característica é possuir potência de pico idêntica a sua potência média. Esta baixa potência de pico dos sinais radar transmitidos dificulta a sua detecção pelo MAGE [6] Os radares LPD mais conhecidos são os FMCW, também denominados Chirp [7]. A Fig.4 ilustra o sinal de um radar LPD (FMCW) empregando LFM. Na Fig. 4a tem-se o sinal LPD no domínio do tempo e na Fig. 4b a respectiva ACF. Percebe-se que a ACF de um sinal LPD, como a da Fig.4b, possui um lóbulo principal bastante estreito e, além disso, não apresenta lóbulos laterais elevados como ocorre com os sinais LPI, como o da Fig.3b. Estas diferenças são consideradas como critério para classificação automática dos sinais detectados por um MAGE. B. MAGE de Alto Desempenho (com DRX) Os equipamentos MAGE dotados de DRX são capazes de realizar funções ELINT intrapulso devido a sua rápida conversão analógico-digital e também devido a sua capacidade de análise, em tempo real, no domínio da frequência. Desta forma, tais MAGE apresentam alto desempenho na interceptação de sinais com SNR baixos e, portanto, são adequados para a detecção de sinais LPD e LPI [8]. A Fig.5 apresenta uma arquitetura de MAGE dotado de DRX [8]. Nesta figura é possível a identificação dos blocos básicos que constituem um MAGE com DRX: Analisador de Espectro; Circuito de Detecção e Medição; e o Conversor Analógico-Digital (A/D). Com base nesta arquitetura percebe-se que a principal vantagem do MAGE dotado de DRX está na sua capacidade de processamento digital de sinais e, consequentemente, na viabilidade da análise dos sinais radar no domínio da frequência em tempo real. II. RESULTADOS A arquitetura de ELINT proposta neste trabalho foi desenvolvida em ambiente computacional MATLAB e pode ser visualizada através da Fig. 6. Inicialmente, faz-se a simulação dos sinais LPI ou LPD contendo as codificações e modulações desejadas. As seguintes codificações e modulações foram simuladas: LFM; Barker 2, 3, 7, 11 e 13; e Frank 16 e 64. Em seguida, os sinais são somados ao ruído branco simulado. Foram testadas as seguintes SNR: +10 dB, 0 dB e - 10 dB. Após a etapa de configuração, o sinal radar simulado é submetido ao ELINT proposto, ou seja, assume-se que o sinal atinge a antena do MAGE, e esta antena transfere o sinal ao DRX que executa as operações de ELINT propostas. As operações de ELINT propostas são: o cálculo da STFT e o cálculo da ACF. A partir das características das ACF e dos espectrogramas foi possível identificar as codificações intrapulso existentes no sinal radar simulado. A. Identificação da Modulação LFM e da Codificação Frank Os espectrogramas obtidos com a aplicação da STFT nos sinais simulados fornecem as informações suficientes para a correta identificação da codificação Frank, da modulação LFM, bem como do sinal sem modulação/codificação intrapulso. O sinal sem modulação intrapulso é identificado pela presença do segmento de reta horizontal que pode ser visualizado a partir do espectrograma da STFT do sinal radar simulado. Esta característica é ilustrada na Fig. 7. Na Fig. 7a pode-se identificar que a frequência da portadora do sinal radar está fixa em 2,4 GHz, ou seja, não varia. A modulação LFM é identificada pela presença do segmento de reta inclinado que pode ser visualizado a partir do espectrograma da STFT do sinal radar simulado. Esta característica é ilustrada na Fig. 8. Na Fig. 8a pode-se identificar que a frequência da portadora do sinal radar está centrada em 170 MHz e varia linearmente entre 160 e 180 MHz. A codificação Frank é identificada pela presença de 02 (ou mais) segmentos de reta, inclinados e paralelos entre si, no espectrograma da STFT do sinal simulado. Esta característica é ilustrada na Fig. 9. Na Fig. 9a pode-se identificar que a frequência central da portadora vale 9,6 GHz. A codificação Frank apresenta a característica de, partindo da frequência central, por exemplo 9,6 GHz, variar linearmente e de modo crescente a sua frequência, enquanto que, simultaneamente, a potência do sinal começa a ser transmitida em outra linha crescente, paralela, e a uma pequena distância em frequência abaixo da linha inicial de transmissão, até que toda a potência desse sinal se concentre nesta segunda linha. Neste momento, o sinal atinge a frequência central do intervalo de variação, momento este que coincidirá com o ponto final do intervalo de tempo de transmissão do sinal. B. Identificação das Codificações Barker As ACF obtidas a partir dos sinais simulados fornecem as informações suficientes para a correta identificação da codificação Barker, bem como permitem calcular o comprimento N de cada codificação Barker, conforme ilustrado na Fig. 10. O comprimento N da codificação Barker é obtido pela contagem de lóbulos adjacentes ao lóbulo central até que ocorra o primeiro lóbulo lateral. Na Fig. 10a pode-se verificar a seguinte contagem dos lóbulos adjacentes para a codificação Barker-11: 05 lóbulos a direita do lóbulo central; 05 lóbulos a esquerda do lóbulo central; e o lóbulo central. Obtendo-se assim o comprimento N=11. Este procedimento é válido para a determinação dos demais comprimentos das codificações Barker. C. Robustez da proposta de ELINT com baixos SNR Neste trabalho, foi testada a capacidade de identificação das diferentes codificações presentes em um sinal radar em um ambiente com ruído aditivo branco. Foram testadas as seguintes SNR: +10 dB; 0 dB e -10 dB. A robustez da proposta de ELINT apresentada neste trabalho pode ser visualizada na Fig. 11. A Fig. 11a apresenta o gráfico, no domínio do tempo, de um sinal com codificação Frank-64 e SNR de -10 dB. A Fig. 11b apresenta a respectiva ACF deste sinal. Observando o sinal no domínio do tempo não é possível identificar a presença do sinal radar com codificação intrapulso. Entretanto, ao observarmos a ACF deste mesmo sinal é facilmente identificável a presença da codificação Frank. Portanto, com baixos valores de SNR, muitas vezes não é possível a identificação, no domínio do tempo, do sinal radar com codificação intrapulso. Concluindo, a detecção do sinal radar presente em um ambiente ruidoso pode ser feita por meio da ACF devido às propriedades gerais da ACF, uma vez que o ruído branco não é correlacionado. III. CONCLUSÕES Ameaças modernas, que fazem uso de radares LPI ou LPD em seus sistemas de navegação e de armas, têm se tornado cada vez mais presentes no cenário mundial. Como exemplos destas ameaças, podemos citar os mísseis ASBM, mísseis antinavio e mísseis antiaéreos dotados de sistemas de guiagem baseados em radares LPI/LPD. Diante deste contexto, a modernização dos sistemas MAGE se torna essencial. Inicialmente, este trabalho apresenta uma proposta de ELINT baseada no cálculo da ACF e da STFT, e sugere que esta proposta seja incorporada a um sistema MAGE moderno dotado de DRX. Resultados obtidos com sinais radar LPI e LPD simulados indicam que a proposta deste trabalho é efetiva, permitindo a identificação das codificações intrapulso presentes no sinal radar. O desempenho da abordagem proposta é avaliado na identificação das codificações Barker, Frank e LFM presentes no sinal radar, podendo ser expandido para outras codificações e modulações. A robustez dos algoritmos de ELINT propostos é verificada em um ambiente ruidoso, considerando valores baixos de SNR, tal como, com SNR = -10 dB. Os resultados apresentados neste trabalho permitem sugerir a incorporação dos algoritmos de ELINT intrapulso propostos nos futuros equipamentos MAGE em desenvolvimento pela MB, como, por exemplo, no futuro MAGE MK3. Este MAGE disporá de um sistema moderno de ELINT que conferirá à Esquadra da Marinha a capacidade de se antepor a quaisquer ameaças modernas. Esta tecnologia elevará a MB, em matéria de GE, a uma posição de destaque dentre as esquadras das principais potências mundiais."
	}
