{
    "id": 39,
    "titulo": "aplicação da comunicação óptica inter-satélite na formação em voo em missão de geolocalização",
    "autor": "alessandro r. santos, thais c. franco, willer g. santos e vilson r. almeida,",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2022/st/226613_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Com a formação em voo de satélites é possível realizar a geolocalização de alvos na superfície terrestre. Baseado na missão ITASAT-2 um estudo teórico foi realizado para verificar a precisão da geolocalização em cada tipo de formação em voo por meio de simulações computacionais que envolveram técnicas de localização eletrônica. Este artigo complementa o estudo considerando o emprego da Comunicação Óptica InterSatélite (Inter-satélite Optical Communication – ISOC) nas topologias de formação em voo, a fim de determinar a mínima potência de transmissão óptica a ser empregada em função da distância relativa entre satélites na ocasião que foi obtida a melhor precisão de geolocalização do alvo. Os resultados deste artigo mostram que a mínima potência óptica transmitida é influenciada pela precisão da geolocalização e pelo erro de precisão de apontamento do feixe óptico entre os satélites.",
    "texto": "I. INTRODUÇÃO Uma das possibilidades de emprego da formação em voo de satélites é a geolocalização de alvos na superfície terrestre. Em busca de conhecer a precisão de geolocalização obtida na formação em voo, L. M. dos Santos [1], apresentou em sua Dissertação de Mestrado Estudo de topologias de formação em voo para uma missão espacial de geolocalização composta por três satélites, um estudo baseado na missão ITASAT-2, que tem como um dos objetivos principais a capacidade de geolocalizar uma fonte emissora eletromagnética na superfície da Terra. Realizando simulações computacionais das topologias de formação em voo Projected Circular Orbit (PCO), Non Coplanar Oscillator (NCO), Natural Motion Circumnavigation (NMC) e String of Beads (SOB) , uso da dinâmica do movimento orbital e de um algoritmo de geolocalização baseado em medidas combinadas de Time Difference of Arrival (TDOA) e Frequency Difference of Arrival (FDOA), obteve as precisões de geolocalização em nas topologias de formação em voo citadas [1]. A partir dos resultados obtidos em [1], este artigo apresenta uma análise de emprego da Comunicação Óptica Inter-satélite (Inter-satellite Optical Communication – ISOC) na missão espacial de geolocalização, determinando a mínima potência óptica de transmissão a ser empregada em função da distância relativa entre os satélites que ofereça a melhor precisão de geolocalização nas topologias PCO, NCO, NMC e SOB. Esta mínima potência óptica transmitida a ser determinada, permitirá verificar a viabilidade de emprego de dispositivos transmissores fabricados por nanofotônica em Silício, como as antenas do tipo Matriz de Fase Óptica (Optical Phased Array - OPA) que utilizam baixa potência de transmissão, na escala da miliwatts (mW) [2]. Este trabalho é dividido nas seguintes seções: comunicação óptica intersatélite, topologia de formação em voo, dinâmica do problema de dois corpos, dinâmica relativa, resultados e conclusão. II. COMUNICAÇÃO ÓPTICA INTERSATÉLITE Em missões espaciais que utilizam uma formação em voo, a Comunicação Óptica Intersatélite (Inter-satellite Optical Communication – ISOC) é uma das formas utilizadas para conectar um satélite aos demais, para transmitir dados por meio de feixe de luz como portadora, na faixa do visível, infravermelho ou ultravioleta. O ISOC usa o sistema de linha de visada (Light-of-Sight), composto do transmissor, do canal de propagação e do receptor como mostra a Fig. 1: Para conhecer o desempenho do link entre satélites em uma missão espacial, é necessário definir os requisitos dos elementos de carga útil do subsistema de comunicação óptica a laser, tais como: potências transmitida, recebida e comprimento de onda; diâmetro de abertura de transmissão e de recepção do feixe óptico; verificação de perdas decorrentes do canal de propagação; erros intrínsecos ao dispositivo, como erro de apontamento; e sensibilidade do receptor [3]. Para isso, recorrendo à teoria de propagação de feixes ópticos gaussianos no espaço livre [4], é possível chegar a uma expressão analítica da potência recebida 𝑃𝑟(𝜌𝑚𝑛) em função da distância relativa entre os satélites transmissor e receptor [5]: onde 𝑃𝑡 é a potência transmitida, 𝑊𝑅(𝑀𝐼𝑁)(𝜌𝑚𝑛) = 𝑊𝑇⁄𝜆𝜌𝑚𝑛 é o menor raio do feixe de laser que pode ser recebido pelo receptor, 𝑊𝑇 é o raio do feixe de saída do transmissor, λ é o comprimento de onda, d o diâmetro do fotodetector e 𝜌𝑚𝑛 (m,n = 1, 2 e 3) é a distância relativa entre os satélites S1, S2 e S3. A fim de verificar a influência da precisão do apontamento do feixe na potência de transmissão, é utilizado o ângulo de precisão de apontamento do feixe óptico, 𝜃𝑃, que corresponde à metade da largura angular de meia potência (Full Width at Half Maximum Angle – FWHM), 𝜃𝐹𝑊𝐻𝑀 [6]: Este ângulo mostra que o erro de apontamento causa uma redução (perda) de transmissão tolerável máxima correspondente a 50% (3 dB) do valor da irradiância de pico [7], [8]. Logo, reescrevendo (1) como potência a ser transmitida em função da distância relativa entre os satélites 𝑃𝑡(𝜌𝑚𝑛), e inserindo o ângulo de precisão de apontamento, chega-se a seguinte equação: III. TOPOLOGIA DE FORMAÇÃO EM VOO A distância relativa 𝜌𝑚𝑛 utilizada para determinar a potência mínima de transmissão é obtida por meio da topologia de formação em voo implementada entre os satélites. Conceitualmente, formação em voo é definida como um conjunto formado por mais de um satélite, os quais possuem estados dinâmicos acoplados por uma lei e controle em comum [9]. Para o estudo de formação em voo destinado para missão de geolocalização [1], foram utilizadas quatro diferentes topologias representadas esquematicamente na Fig. 2: String of Beads (SOB), Non Coplanar Oscillator (NCO), Projected Circular Orbit (PCO) e Natural Motion Circumnavigation (NMC). Na topologia SOB (Fig. 2.a) os três satélites rastreiam a mesma órbita e são espaçados por pequenas separações angulares na anomalia média, o que resulta na necessidade de pouca coordenação entre eles. Nesta abordagem, os satélites se movem em uma mesma velocidade orbital, logo a distância relativa entre eles é fixa. Já a dinâmica utilizada para descrever o sistema parte do problema de dois corpos no Sistema de Coordenadas Inerciais Centrado na Terra (ECI). Na configuração NCO (Fig. 2.b), dois satélites rastreiam a mesma órbita (como a SOB) e o terceiro satélite rastreia outra órbita, cujo plano orbital difere da primeira por pequenas alterações no ângulo de ascensão reta ou de inclinação, realizando um movimento oscilatório em relação aos dois satélites coplanares [1], [9]. A dinâmica abordada também parte do problema de dois corpos no ECI. Diferente das topologias apresentadas anteriormente, a PCO utiliza uma dinâmica relativa em um sistema de coordenadas Local-Vertical-Local-Horizontal (LVLH). Esta abordagem centrado na origem do sistema LVLH, é controlado para uma órbita nominal desejada enquanto seguidores controlam seus próprios estados em relação ao líder, ou seja, os satélites seguidores percorrem uma órbita relativa circular em torno do satélite líder, quando projetada no plano horizontal y-z do sistema LVLH. Por fim, na topologia NMC (Fig. 2.d) os satélites de formação controlam suas órbitas circulares em relação a um satélite virtual (líder virtual) centrado na origem do sistema LVLH [1], [9]. Nesta abordagem, os satélites seguidores também descrevem uma órbita relativa circular em torno do satélite líder no plano horizontal y-z. IV. DINÂMICA DO PROBLEMA DE DOIS CORPOS Utilizado na abordagem SOB e NCO, o problema de dois corpos é uma idealização da órbita que permite uma solução analítica para as equações do movimento através de uma figura geométrica simples (círculo, elipse, parábola, hipérbole). Nesta representação, são consideradas apenas as forças gravitacionais entre dois corpos, que são tratados como esferas de massa concentradas em seus centros. A dinâmica de um satélite em uma trajetória orbital ao redor da Terra no ECI pode ser expressa pela seguinte expressão: onde, 𝒓 é o vetor posição (𝑟 = [𝑋 , 𝑌, 𝑍]𝑇), µ é a constante gravitacional, r é o valor absoluto de 𝒓, i.e., 𝑟 = √𝑋² + 𝑌² + 𝑍² e 𝒂𝒑 são as forças perturbadoras, que no caso do problema de dois corpos tem valor nulo. O movimento dos satélites se afasta da órbita nominal pré- estabelecida, devido a ação de diversas forças externas, alterando sua trajetória, também chamadas de forças perturbadoras. A solução do problema considerando as principais perturbações pode ser obtida usando como ponto de partida a representação do problema de dois corpos (4) e as perturbações podem ser adicionadas ao problema como forças adicionais (𝒂𝒑). Neste estudo, consideram-se as forças perturbadoras devido à não homogeneidade da Terra, descrita pelo harmônico 𝐽2 (𝒂𝐽2) e devido ao arrasto aerodinâmico (𝒂𝒂𝒕𝒎): Chobotov [10] descreve como o achatamento da Terra afeta o potencial gravitacional circundante. Os harmônicos zonais de um esferoide de revolução podem ser escritos por: onde, 𝑟𝑒𝑞 é o raio médio da Terra, 𝑃𝑛(𝑤) é o Polinômio de Legendre de 𝑛𝑡ℎ ordem e 𝐽𝑛 são constantes. Para esta análise, utiliza-se o termo de segunda ordem 𝐽2 = 1082.63 × 10−6. Deduzindo (6) para 𝐽2, a expressão obtida para a aceleração harmônica é: Satélites em órbitas terrestres baixas também experimentam forças de arrasto atmosférico que podem diminuir a vida útil da missão. A aceleração criada pelo arrasto pode ser expressa por [11] : onde Cd é o coeficiente de arrasto, A é a área de superfície do satélite, m é a massa do corpo do satélite, ρ é a densidade atmosférica local, 𝑣𝑟𝑒𝑙 é a magnitude da velocidade relativa da espaçonave e 𝒗𝒓𝒆𝒍 é o vetor que descreve a velocidade relativa à atmosfera. V. DINÂMICA RELATIVA As topologias PCO e NMC são desenvolvidas a partir da dinâmica relativa no sistema LVLH [11]: Na qual, 𝝎 é o vetor velocidade angular do sistema LVLH com relação ao sistema inercial (ECI),  trata-se da aceleração relativa da força gravitacional de atração entre os satélites e a Terra, é a aceleração relativa perturbadora devido à não homogeneidade da Terra, descrita pelo harmônico 𝐽2 e  𝒂𝒕𝒎 é a aceleração relativa provocada pelo arrasto atmosférico. Define-se  como: Desconsiderando-se 𝝆̈ 𝑱𝟐 e 𝝆̈ 𝒂𝒕𝒎 da (9) é possível realizar algumas manipulações algébricas, chegando ao conjunto de equações conhecido como equações de Clohessy-Wiltshire ou equações CW [10]: Logo, para que haja uma projeção circular no eixo y-z para representar a formação PCO e NMC, as seguintes considerações devem ser obedecidas [9]: sendo, 𝑛0 = √𝜇⁄𝑎, 𝑥, 𝑦, 𝑧 os componentes da posição relativa no sistema LVLH e 𝑥̇ , 𝑦̇, 𝑧̇ os componentes da velocidade relativa. O módulo da distância relativa entre o líder e o seguidor é igual a: Por fim, semelhantemente ao apresentado na seção IV, os satélites de formações PCO e NMC também sofrerão a atuação de perturbações orbitais. Deste modo, define-se a aceleração de J2 (𝝆̈ 𝑱𝟐) como [12]:Sendo, s=sen, c=cos, 𝑖0 o ângulo de inclinação da órbita circular do líder, 𝜃0 argumento de latitude do líder e 𝐾 = 6𝐽2𝜇𝑟𝑒𝑞2 𝑟5 . Já a aceleração provocada pelo arrasto atmosférico (𝝆̈ 𝒂𝒕𝒎) é definida por [12]: onde, 𝛼 e 𝛽 são coeficientes balísticos, 𝜔𝑥 e 𝜔𝑧 são as componentes do vetor de velocidade angular 𝝎 no sistema LVLH com relação ao sistema inercial (ECI) em x e em z, respectivamente, 𝑅𝑜𝑠𝑐 é o raio oscilatório da órbita do líder devido à perturbação pelo 𝐽2 e 𝑅̇𝑜𝑠𝑐 sua deriva temporal. IV. RESULTADOS Recorrendo às simulações de L. M. dos Santos. [1], foi considerada quatro topologias de formação em voo apresentadas na Seção II entre três CubeSats 12U, fazendo uso da dinâmica do movimento orbital e de um algoritmo de geolocalização baseado em medidas combinadas de Time Difference of Arrival (TDOA) e Frequency Difference of Arrival (FDOA), cuja fonte emissora está na superfície terrestre e localizada em São José dos Campos-SP. Na referência [1] foi considerado também o modelo não-esférico da Terra, a fim de que a distância da fonte emissora ao centro do planeta seja o mais real possível e efeito das perturbações (J2 e arrasto atmosférico). Utilizando este cenário, complementa-se na missão de geolocalização, o emprego de comunicação óptica no espaço livre por meio do enlace de ISOC entre CubeSats para haver uma troca de informações entre si (ex: troca de dados sobre o posicionamento do alvo, controle de atitude relativa, manutenção de distância relativa, etc.) sendo que em cada satélite há um sistema de transmissão e recepção embarcado com as características apresentadas na Tabela I. Desta forma, a combinação dos resultados obtidos em [1], que determina a distância relativa que oferece a melhor precisão de geolocalização em cada topologia de formação em voo, com os parâmetros apresentados na Tabela 1, provê a potência mínima de transmissão 𝑃𝑡 sem perdas e com perdas de 3 dB causadas pelo erro de precisão de apontamento do Laser. Nas subseções a seguir são apresentados os resultados para cada tipologia de formação em voo. A. Formação SOB e NCO Para as topologias SOB e NCO, a inclinação da órbita dos satélites é de 50° e a altitude é de 400 km. Considerando 𝜌12 = 𝜌13, as distâncias relativas entre os satélites líder e seus seguidores foi variada entre 0,1 a 1000 km, onde a melhor precisão obtida foi de 257,1 m a uma distância relativa igual a 343,53 km na formação SOB. Na formação NCO, a melhor precisão foi de 70,12 m com uma distância relativa igual a 649,62 km [1]. Por meio do gráfico apresentado na Fig. 3, mostra-se que para a distância relativa de 343,5343 km da topologia SOB a potência mínima a ser transmitida para ocorrer o enlace de ISOC sem perdas é igual a 19,8 mW. Considerando a perda por precisão de apontamento do Laser, a potência mínima necessária passa para 39,6 mW. Na topologia NCO, na distância relativa que se chega a melhor precisão de geolocalização do alvo, a potência mínima de transmissão é igual a 70,8 mW no enlace de ISOC sem perdas. Para o caso de enlace com perdas de apontamento do Laser, a potência mínima a ser transmitida aumenta para 141,6 mW. B. Formação PCO Na topologia PCO, foi avaliada a precisão da geolocalização variando as distâncias relativas entre satélite líder e seus seguidores, 𝜌12 e 𝜌13, entre 0,1 a 250 km, cuja altitude e inclinação da órbita do líder são respectivamente iguais a 400 km e 50°. Além disso, foi mantido fixo o ângulo inicial do satélite seguidor, S2 , em 𝛼12 = 0° e variou-se o ângulo de fase inicial do satélite seguidor, S3, realizando a análise apenas no ângulo de fase entre os satélites seguidores, 𝛼23, [1] como mostra a Fig. 2.c. Nesta análise, foi considerado dois casos: 0° ˂ 𝛼23 ≤ 180° e 0° ˂ 𝛼23 ≤ -180°. No primeiro caso, para o ângulo de fase 𝛼23= 75,18°, a melhor precisão de geolocalização obtida foi de 68,87 m. No segundo caso, para 𝛼23= -100,58°, a melhor precisão é igual a 58,28 m [1]. As fases obtidas são apresentadas no gráfico da Fig. 4, que mostra a distância relativa 𝛼23 correspondente a cada fase dos satélites e precisão da geolocalização. Logo, para a fase 𝛼23= 75,18°, correspondente a precisão de 68,87 m, a distância relativa entre os satélites seguidores, 𝜌23, é igual a 304,5 km e para a fase 𝛼23= -100,58° com precisão igual a 58,28 m, 𝜌23 é igual a 385,36 km. Obtida as distâncias relativas entre os satélites para cada ângulo de fase citados, é possível chegar ao mínimo valor de potência a ser transmitida para ocorrer o enlace entre os satélites, recorrendo a (3), cujos resultados são apresentados no gráfico da Fig. 5 em duas curvas: a primeira curva, em azul, representa a potência mínima a ser transmitida pelos satélites sob erro de precisão de 3 dB do Laser, cujo 𝜃𝑃= 5,984 µrad e a segunda curva, em vermelho, mostra o mesmo resultado sob 𝜃𝑃= 0 µrad. Os resultados obtidos mostram, quando o enlace está sob perdas do Laser, é necessário aplicar no mínimo o dobro de potência de transmissão para obter o mesmo alcance em um caso que não há perdas. Além disso, quanto maior a precisão da geolocalização, maior o consumo de potência. Em números, a potência mínima a ser transmitida são apresentadas na Tabela II. C. Formação NMC Na topologia NMC, foram consideradas as mesmas características utilizadas na topologia PCO: variação da distância relativa entre 0,1 a 250 km, com inclinação orbital de 5° e altitude de 400m, como mostra a Fig. 2.d. Para este caso, foi fixado 𝛼1= 0° e variado o ângulo de fase entre os satélites S2 e S3, de forma que 𝛼12= 𝛼13. Foram realizadas duas simulações: a primeira, considerando 𝛼23=120°, onde apresenta uma precisão de aproximadamente 47,2 m. Como a precisão de geolocalização é melhorada quando se aumenta a distância relativa entre os satélites, logo o ângulo de fase foi aumentado na topologia NMC para 𝛼23=123,16°, oferecendo uma precisão igual a 47,15m [1]. A partir destas informações, é possível conhecer a distância relativa 𝜌12, 𝜌13 e 𝜌23 entre os satélites, fundamentais para estabelecer o enlace ISOC. Logo, as respectivas distâncias relativas são apresentadas no gráfico da Fig. 6: O gráfico mostra que para a topologia NMC que contém as fases relativas 𝛼13 = 𝛼12 = 𝛼23=120°, as distâncias relativas entre os satélites são iguais a 433,01 km. A segunda análise, formada pelo conjunto das fases 𝛼23=123,16° e 𝛼12 = 𝛼13=118,41°, mostra que as distâncias relativas são respectivamente iguais a 𝜌23 = 439,75 km e 𝜌12 = 𝜌13= 428,37 km. Logo, a partir das distâncias relativas entre os satélites, obtém-se as potências mínimas de transmissão, como mostra o gráfico da Fig. 7 que apresenta duas curvas: a azul que mostra a potência mínima de transmissão com erro de apontamento do feixe Laser de 3 dB, e a curva vermelha, que não possui influência do erro de apontamento do feixe Laser. Os resultados obtidos também demonstram que a potência mínima a ser transmitida sob efeito de perturbações é o dobro da potência sem este efeito e quanto maior a precisão de geolocalização, maior a potência, como mostra a Tabela III V. CONCLUSÕES Os resultados apresentados neste artigo mostram que as potências de transmissão variam na ordem de centenas de miliwatts dependendo da topologia escolhida para a formação em voo, possibilitando o enlace entre os satélites com uma potência de recepção mínima de -46 dBm. Neste cenário, foi observado que quanto maior a precisão de geolocalização, maior o consumo de potência dentro da formação em voo, pois esta precisão vem do aumento do ângulo de fase entre os satélites, obrigando o aumento da distância relativa entre eles. Logo, partido do raciocínio ângulo de fase x distância relativa, as topologias PCO e NMC que apresentaram o menor e o maior consumo de energia, respectivamente. O erro de precisão também teve um grande fator no enlcace, sendo observado que a potência mínima a ser utilizada sob o efeito deste erro é dobrada em relação a potência mínima sem efeito do erro de 3 dB. Mesmo com efeito do erro de precisão que provoca o aumento da potência, ainda é possível realizar enlaces de comunicação óptica com baixa potência de transmissão, não sobrecarregando, portanto, o subsistema de energia de um CubeSat.  "
}