{
    "id": 41,
    "titulo": "projeto de blindado centauro ii é apresentado em feira de indústria de defesa",
    "autor": "Noticiário do Exército",
    "url": "https://www.eb.mil.br/web/noticias/noticiario-do-exercito/-/asset_publisher/U3X7kX8FkEXD/content/id/16576263",
    "tipo_documento": "Notícia",
    "rotulo": 3,
    "resumo": 0,
    "texto": " Rio de Janeiro (RJ) – Um equipamento que está em fase de aquisição pelo Exército Brasileiro foi apresentado na edição 2023 da LAAD Defence & Security, maior e mais importante feira de Defesa e Segurança da América Latina. A Viatura Blindada de Combate de Cavalaria Média Sobre Rodas 8×8 Centauro II deverá substituir o blindado Cascavel, modelo que é usado pelo Exército Brasileiro desde a década de 1970. O Exército Brasileiro adquiriu duas amostras do Centauro II, que foram recebidas no fim de janeiro. Uma equipe do Centro de Avaliações do Exército (CAEx) está na Itália, sede do Consórcio CIO, para a avaliação da viatura. A previsão é que até o fim do ano as duas amostras do Centauro II cheguem ao Brasil para que o processo seja concluído. O projeto de aquisição prevê a produção da plataforma veicular e da torre do canhão de 120 milímetros no Brasil, promovendo a geração de postos de trabalho qualificados, além da transferência de tecnologia e conhecimento para a indústria nacional, tanto para a produção quanto para o suporte logístico. O Brasil estará preparado para a produção nacional de munições de 120 milímetros, reforçou Humberto Spinetti. Durante a feira, o Comandante do Exército Brasileiro, General de Exército Tomás Miguel Miné Ribeiro Paiva, recebeu uma maquete do blindado Centauro II. A entrega foi realizada pelo vice-presidente do Consórcio CIO (Iveco-Oto Melara) Giovanni Luisi, pelo presidente da IDV América Latina, Humberto Spinetti, e pelo presidente da Leonardo do Brasil, Francesco Moliterni. Substituição da VBR-MSR EE-9 Cascavel A aquisição da nova viatura blindada de cavalaria tem o objetivo de substituir o Cascavel. Durante algum tempo, os dois modelos serão usados simultaneamente, já que um contrato de modernização do Cascavel pode estender a vida útil das viaturas por mais 15 anos. A ideia é que o Cascavel seja um meio de evolução até termos um número considerável da viatura Centauro, explicou o Diretor de Fabricação do Exército, General de Divisão Tales Villela. Para o presidente da IDV América Latina, é o início de um novo ciclo de aquisição de viaturas de cavalaria para missões de reconhecimento, adotando uma viatura que é o estado da arte em nível global. "
}