{
    "id": 45,
    "titulo": "classificação de alvos em imagens sar com técnicas de machine learning",
    "autor": "fabiano gabriel da silva, bruna gregory palm e renato machado",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2021/st/217773_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Atividades marítimas que vão desde o transporte de mercadorias até a produção de petróleo e gás natural são cada vez mais presentes em águas brasileiras. O monitoramento dessas atividades é de fundamental importância para coibir ações ilícitas ou ilegais. O aumento da disponibilidade de dados de sensoriamento remoto permite que imagens de radar de abertura sintética (SAR - Synthetic Aperture Radar) possam ser exploradas na vigilância marítima. Este trabalho considera o problema de classificação de plataformas de petróleo e navios localizados no litoral dos estados do Rio de Janeiro e Espírito Santo. Para o estudo, utilizaram-se imagens SAR com polarização VH. Duas técnicas de machine learning foram avaliadas, a saber, Random Forest e K-nearest neighbors, com as quais pode-se obter taxas de acurácia de 81,8% e 79,2%, respectivamente.",
    "texto": " I. INTRODUÇÃO Nos oceanos encontram-se riquezas naturais como gás, petróleo, fauna e flora marinha. As vias marítimas também são utilizadas para o comércio exterior [1]. De acordo com o Boletim Mensal [2], a produção nacional em maio de 2021 foi de 2,932 MMbbl/d (milhões de barris por dia) de petróleo e 135 MMm3/d (milhões de m³ por dia) de gás natural. Nos campos marítimos foram produzidos 96,9% de Petróleo e 83,1% de gás natural. As águas brasileiras têm importância estratégica e econômica para o país. Diante desse contexto, torna-se necessária a vigilância constante das águas marítimas brasileiras para se evitar e combater a exploração ilegal de seus recursos naturais. Uma das alternativas para realizar tal tarefa é através do uso de imagens de Radar de Abertura Sintética - Synthetic Aperture Radar (SAR). Desde o primeiro lançamento do satélite SEASAT em 1978, houve um aumento do número de sistemas SAR orbitando a Terra, como por exemplo: a série ERS-1, ERS-2, ENVISAT e Sentinel-1 da Agência Espacial Europeia; os sistemas canadenses RADARSAT-1, RADARSAT-2; os italianos COSMO-SkyMed; os alemães TERRASAR-X e TANDEM-X e os sistemas chineses GAOFEN-3 SAR. A nova geração de sistemas SAR Sentinel-1A e Sentinel-1B foram lançados pela Agência Espacial Europeia em 2014 e 2016, respectivamente [3]. Por exemplo, em [4] encontra-se uma avaliação de desempenho operacional para detecção de navios considerando imagens SAR de oito sistemas satelitais. As imagens SAR podem ser utilizadas para detecção de alvos marítimos. De forma simplificada, pode-se dizer que os navios aparecem como pontos brilhantes associados aos altos valores de retroespalhamento (backscattering), enquanto as superfícies da água aparecem como áreas escuras caracterizadas por baixos valores de retroespalhamento [5]. A qualidade das imagens é influenciada pelo speckle noise que é um tipo de ruído multiplicativo gerado pela variação do backscatterer em superfícies não homogêneas, o que acaba dificultando a detecção e classificação de alvos em imagens SAR [6]. A abordagem com base em Machine Learning (ML) é capaz de detectar com eficiência navios a partir de imagens SAR. ML é um ramo da inteligência artificial (AI) que pode ser dividido em algumas subclasses, dentre elas: aprendizado supervisionado, aprendizado não supervisionado e aprendizado com reforço [7]. Tais técnicas incluem redes neurais profundas (Deep Learning) (DL), redes neurais artificiais (ANN) e métodos de máquina de vetores de suporte (SVM) [8]. Um tipo especial de aprendizado de máquina que considera o uso de redes neurais artificiais é o DL. As redes neurais artificiais são uma subárea de ML que, por sua vez, é uma subárea da estatística e da AI. De uma forma geral, pode-se dizer que DL é uma classe específica de redes neurais artificiais que abrange algoritmos de ML, aplicáveis ao processamento de linguagem natural, visão computacional e robótica [9]. Neste artigo, considera-se o ambiente marítimo no litoral dos estados do Rio de Janeiro e Espírito Santo, focando no problema de classificação de plataformas de petróleo e navios. Para o estudo, consideraram-se imagens SAR com polarização VH. O restante do artigo está organizado da seguinte maneira. A Seção II apresenta o material e métodos considerados. A Seção III traz alguns resultados e discussões preliminares. Finalmente, a Seção IV conclui o artigo. II. MATERIAL E MÉTODOS Nesta seção são apresentadas as informações e características sobre a missão Sentinel-1 e a metodologia empregada neste trabalho. A. Missão Sentinel-1 A missão Sentinel-1 é formada por uma constelação de dois satélites em órbita polar, operando dia e noite, realizando imagens de radar de abertura sintética na banda C. O satélite que é apresentado na Figura 1 possui um sensor SAR capaz de gerar medições em média e alta resolução [10]. Na Tabela I são apresentadas algumas características do sistema Sentinel-1 [11]. Dentre as principais características, consideram-se a banda de operação, largura de banda, tamanho da antena, peso da antena, frequência de repetição dos pulsos e massa total. B. Metodologia Neste estudo, foram consideradas imagens SAR de média resolução do sistema Sentinel-1. A metodologia para classificação de alvos é sintetizada na Figura 2 e discutida em maiores detalhes a seguir. Aquisição de imagens: Utiliza-se um dataset composto por 400 imagens SAR de alvos marítimos com polarização VH. Há dois tipos de alvos nas imagens, ou seja, plataformas e navios. Há 200 imagens (patches) com plataformas e 200 patches com navios. As imagens analisadas estão em Tagged Image File Format (TIFF). Todas as imagens foram pré-processadas e calibradas. As imagens originais do tipo amplitude foram transformadas em imagens do tipo sigma-zero (dB) [12]. A Figura 3 apresenta uma comparação entre a imagem ótica e sua respectiva imagem SAR com plataformas Floating Production Storage and Offloading (FPSO) P-58, Floating and Production Unit (FPU) P-53 e Semissubmersível (SS) P-56 que compõem o dataset. Essas imagens tiveram como base o produto GRD (Ground Range Detected), modo IW (Interferometric Wide Swath Mode) [13]. Extração de atributos: A extração de atributos (features) das imagens foi realizada através da rede neural convolucional - Convolutional Neural Network (CNN), VGG-16, disponível no software Orange Canvas [14].  Definição dos grupos de treinamento e teste: Seguindo a metodologia proposta em [12], realizou-se a separação dos dados de forma aleatória em cinquenta grupos (G1 a G50). Cada grupo é composto por um conjunto de treinamento, formado por 320 imagens, e por um conjunto de testes, formado por 80 imagens. Os conjuntos de treinamento e teste são gerados aleatoriamente cinquenta vezes para compor os grupos. O total de imagens de cada grupo é 400, somatório do conjunto de treinamento mais o conjunto de testes. Ou seja, do total de imagens (400), 80% são selecionados aleatoriamente para formar 320 imagens de treinamento e o restante, 20%, são de teste.  Escolha de classificadores: Para a classificação dos alvos foram utilizados os métodos Random Forest (RF) e K-nearest neighbors (KNN) com os seguintes critérios de avaliação: AUC (Area Under the Curve) é a área formada abaixo da linha ROC (Receiver Operating Characteristic). Quanto maior a área, melhor o classificador; CA representa a acurácia global. É a proporção de amostras corretamente classificadas perante o número total de amostras em um teste; F1 Score é o indicador que mede a relação entre os alvos corretamente classificados com a média aritmética do total de amostras classificadas como alvos somadas ao total de amostras que verdadeiramente são alvos; Precision é a taxa de alvos corretamente classificados sobre a soma das amostras classificadas como alvos; Recall, também conhecida como Sensivity ou true positive rate, indica a proporção de alvos corretamente classificados sobre o total de alvos presentes no teste. Como parâmetros, foram utilizados o quantitativo de 50 para número de árvores no Random Forest e 7 para o número de vizinhos no KNN. Classificação: É a última etapa do processo, consistindo na execução dos dois classificadores com base nas amostras de treinamento e teste. Por fim, são apresentados os resultados, distribuídos nos cinco indicadores de desempenho apresentados anteriormente. III. RESULTADOS E DISCUSSÕES  Nesta seção, apresentam-se os resultados das classificações com os algoritmos Random Forest e KNN por meio dos indicadores de desempenho AUC, CA, F1 Score, Precision e Recall. Também são apresentadas medidas estatísticas, histograma de distribuição da acurácia e gráfico boxplot comparando os dois indicadores analisados.  A Tabela II apresenta os resultados de classificação para os cinco indicadores de desempenho. O Random Forest é o melhor classificador com AUC de 0,905. A acurácia do Random Forest de 0,818 informa que o classificador tem mais amostras corretamente classificadas, em relação ao total de amostras. A precisão do Random Forest é informada pelo indicador Precision, com 0,822. Ou seja, o classificador tem maior taxa de acerto de alvos corretamente classificados sobre a soma das amostras classificadas como alvos. A maior sensibilidade entre os classificadores foi obtida pelo Random Forest, sendo informada pelo indicador Recall com 0,818. Essa métrica identifica os alvos verdadeiros sobre o total de alvos existentes no teste. O F1 Score do Random Forest indica que o classificador possui maior balanceamento quando comparado com o Precision e o Recall.  A Tabela III apresenta os resultados obtidos para classificação. A maior média entre os classificadores é do Random Forest, com 0,818. O desvio padrão do Random Forest indica uma maior distância entre os dados e a média. A mediana do Random Forest informa que os dados estão centrados em torno de 0,812. O menor valor entre os classificadores é do KNN, com 0,725, e o maior valor do Random Forest, com 0,950. A distância interquartil (diferença entre o 3º e o 1º quartil) do Random Forest é a maior de todas, com 0,050. Esse resultado indica que há maior dispersão dos dados no Random Forest.  De acordo com a Figura 4, percebe-se que a média é superior à mediana no Random Forest. Também percebe-se que no Random Forest os valores mínimo e máximo da acurácia são superiores aos do KNN. De acordo com o histograma de distribuição apresentado na Figura 5, percebe-se que a acurácia do classificador KNN se concentra entre 0,75 e 0,80. Para o classificador RF, a acurácia se concentra entre 0,80 e 0,85.  Os resultados obtidos neste trabalho corroboram com os que foram alcançados pela pesquisa realizada em [12]. É evidenciada a capacidade de extração de atributos com a rede VGG-16 e o reconhecimento dos alvos através dos algoritmos de machine learning. O classificador Random Forest obteve acurácia de 81,8%, sendo superior à do classificador KNN, que obteve 79,2%.  Quando se trabalha com machine learning é importante salientar que a quantidade de imagens é fundamental para o treinamento dos classificadores. Neste trabalho foram utilizadas 400 imagens. O dataset poderia ser ampliado para avaliar se os classificadores teriam melhores resultados.  IV. CONCLUSÕES  Nesse estudo realizou-se a avaliação de classificadores de alvos marítimos, compostos por plataformas de petróleo e navios, utilizando imagens SAR polarimétricas. Utilizou-se a rede neural convolucional VGG-16 para extração de atributos das imagens. A classificação foi realizada através de duas técnicas de machine learning, Random Forest e KNN, que consideraram os atributos extraídos pela rede VGG-16. A rede CNN VGG-16 se mostrou eficiente para extração de atributos representativos para identificar alvos. O classificador Random Forest foi o que apresentou melhor acurácia de 81,8%, enquanto o classificador KNN apresentou acurácia de 79,2%. Realizou-se uma análise preliminar considerando os resultados da pesquisa produzida em [12]. Como trabalhos futuros, pretende-se comparar as técnicas avaliadas neste estudo com outras técnicas, bem como comparar os desempenhos obtidos para classificação de alvos marítimos em imagens SAR polarimétricas.   "
}