{
    "id": 46,
    "titulo": "aplicação da comunicação óptica intersatélite em missões de formação em voo de pequenos satélites",
    "autor": "alessandro r. santos, willer g. santos e vilson r. almeida,",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2021/st/217140_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Este artigo tem como objetivo apresentar a aplicação da tecnologia fotônica em missões espaciais de formação em voo entre pequenos satélites, do tipo CubeSat, por meio da Comunicação Óptica Intersatélite (Intersatellite Optical Communication - ISOC) e aplicação da Nanofotônica por meio do Optical Phased Array, que é uma alternativa para sanar as deficiências encontradas nos dispositivos transmissores atualmente utilizados para este tipo de missão.",
    "texto": "I. INTRODUÇÃO As missões espaciais envolvendo pequenos satélites, especialmente aqueles do tipo CubeSat, vem sendo atrativas em virtude da redução de custos no desenvolvimento, lançamento, operação, e manutenção destes. Pela mesma justificativa, o interesse dos pesquisadores e agências espaciais pelo emprego de vários satélites operando em conjunto, tal como um sistema espacial distribuído [1], vem crescendo a cada ano. Para uma missão espacial com vários satélites de pequeno porte operar em conjunto de forma coordenada, é necessário haver uma formação entre eles quando estiverem em órbita. Assim, estes tipos de missões, denominados de formação em voo (Formation Flying), podem ser definidos como um conjunto formado por mais de um satélite, onde seu estado dinâmico está sobre um controle único e acoplado [2]. Isto significa que em uma formação, um satélite denominado como líder, precisa enviar as informações de controle para os demais satélites da formação, denominados de seguidores. O enlace de comunicações entre satélites em formação em vôo é de suma importância, pois é o meio de transferência de dados, comandos, manutenção da posição e avisos de falhas entre o líder e os seguidores. Logo, em muitas missões é necessário ter uma grande largura e alta taxa de transmissão de dados para atender as necessidades da missão espacial. Para satisfazer tal requisito, algumas missões espaciais, em especial envolvendo CubeSats, estão recorrendo as comunicações ópticas, pois além de atender estas necessidades, sua faixa de frequência está livre das regulamentações oficiais [3]. Recorrendo aos conceitos deformação em voo, este artigo tem a intenção de apresentar uma aplicação da fotônica, por meio da Comunicação Óptica Intersatélite (Intersatellite Optical Communication - ISOC), fundamental para transmissão de dados e manutenção de posição entre satélites que utilizam comunicação óptica neste tipo de missão. Missões espaciais e experimentos com dispositivos fotônicos espaciais e experimentos com dispositivos fotônicos desenvolvidos para esta tarefa são apresentados, como também o conceito do Optical Phased Array (OPA), como uma alternativa para os atuais transmissores com a finalidade de reduzir o peso, dimensões e mitigar as interferências no feixe óptico durante a transmissão. II. FORMAÇÃO EM VOO A vantagem de criar missões espaciais com um conjunto de pequenos satélites do tipo CubeSat voando em formação, em relação a um único satélite de grande porte, está correlacionada a: reduzir custos da missão; prover uma maior flexibilidade na área de cobertura a ser explorada, pois com um satélite de grande porte, seria necessário aumentar as suas dimensões nos componentes, como antena, transmissores e receptores, por exemplo, além de aumentar o peso e consumo de energia; e incluir uma capacidade para transferir as tarefas para outro satélite, em caso de falhas, reduzindo seu desempenho, porém, sem colocar a missão em risco. Tais vantagens induzem às seguintes dificuldades tecnológicas: alta precisão de navegação relativa; capacidade de comunicação distribuída; capacidade a bordo de detecção de falhas; otimização da trajetória e controle; e sincronização de atitude [2]–[10]. A formação em voo possui um grande potencial de emprego, em especial em aplicações de observação da Terra, interferometria, Radar de Abertura Sintética (Syntetic Aperture Radar – SAR) e exploração humana. Para chegar a uma configuração de formação em voo adequada as necessidades da missão, é necessário realizar o design e avaliação das órbitas por meio da dinâmica do movimento relativo. Para o desenvolvimento deste trabalho, foi utilizado um conjunto de equações lineares de movimento relativo considerando dois satélites, modelados como pontos de massa, sob influência de um campo gravitacional uniforme. Estas equações são denominadas de equações de Clohessy & Wiltshire (CW) e são descritas no sistema de coordenadas girante LVLH (Local Vertical Local Horizontal) centrado no líder, onde o eixo x aponta na direção radial a partir do centro de massa da Terra, o eixo z aponta na direção do momentum angular orbital, e o eixo y completa o sistema dextrogiro. No modo não perturbado, ou seja, sem influências de forças externas, as equações CW são expressas por [2]: cuja as soluções são representadas pelas equações de Hill [2]: onde: x y z , , : componente de posição relativa nos eixos x, y e z no sistema de referência LVLH; x y z   , ,  : componentes de velocidade relativa nos eixos x, y e z;   x y z , ,: componentes de aceleração relativa nos eixos x, y e z; n : movimento médio;   GM : coeficiente gravitacional da Terra; e a0 : semieixo maior da elipse, correspondente a posição do satélite líder. Além do design da formação em voo, durante o projeto de concepção de uma missão espacial [11], os subsistemas do CubeSat devem atender aos requisitos de missão necessários para que esta seja executada de acordo com as necessidades dos stakeholders. Um dos vitais subsistemas para a realização de missões de formação em voo é o de Comunicações, pois todas as informações do veículo espacial como, atitude, distância, velocidade relativas oriunda do satélite líder, dados coletados durante a observação, e alertas de falhas, trafegarão por meio do enlace entre o CubeSat líder e seus seguidores [12]. Por meio da fotônica, a comunicação óptica no ambiente espacial é uma realidade e em especial na formação em voo de pequenos satélites, como, por exemplo, a Comunicação Óptica Intersatélite. III. COMUNICAÇÃO ÓPTICA INTERSATÉLITE Para missões espaciais que utilizam comunicações ópticas em formação em voo, a Comunicação Óptica Intersatélite é a forma utilizada para se conectar um satélite ao outro, a fim de transmitir dados por meio de feixe de luz entre a faixa do visível ao ultravioleta como portadora, seja na mesma ou em diferentes órbitas, a centenas ou milhares de quilômetros entre si. O conjunto de ISOC é composto pelo transmissor, canal de propagação e receptor, como mostra o diagrama esquemático na Fig. 1. Transmissor O processo de transmissão ocorre da seguinte forma: o ISOC recebe dados dos subsistemas de Telemetria, Rastreio e Comando (Telemetry, Tracking and Control – TT&C) e Comunicação do satélite. Estes dados são modulados por meio do modulador, sendo que a portadora do sinal é a fonte óptica, que pode ser um feixe de Laser ou um diodo emissor de luz (Light-Emitting Diode – LED). Assim, o feixe óptico que contém os dados é transmitido através do espaço para o receptor. O dispositivo fotônico transmissor utilizado neste enlace gera um feixe de luz muito estreito, necessitando, assim, ter uma boa precisão em seu apontamento, aquisição e rastreio (Aquisition, Tracking and Poiting - ATP) para o sinal óptico chegar ao receptor com a menor perda possível. Porém, isto ainda é um desafio obter esta precisão e, consequentemente, um melhor desempenho no enlace, pois é necessário mitigar as vibrações do sistema de apontamento e o ruído de fundo causado pelo transmissor, receptor e do próprio sinal (shot noise) [3]. Outro desafio é o problema do desempenho do enlace causado pelo movimento dos satélites durante a formação em voo. Este problema está atrelado ao movimento relativo entre os satélites, que pode gerar uma defasagem na distância entre o satélite seguidor e o líder, fazendo-os perder o apontamento do dispositivo transmissor; e a diferença de velocidade entre satélites, gerando assim uma mudança na freqüência do sinal recebido causado pelo efeito Doppler [3]. Canal de propagação No ISOC, o espaço livre é o canal de transmissão do feixe óptico [13]. Para os CubeSats que operam em baixa órbita (Low Earth Orbit – LEO), na altitude entre 160 a 2000 km acima da superfície da Terra, o vácuo é o meio de propagação do feixe óptico, ficando isento dos efeitos de atenuação, absorção e espalhamento que ocorrem na atmosfera terrestre. Porém, na região da ionosfera, onde localiza-se a órbita LEO, há várias formas de perturbação que podem comprometer o desempenho do enlace, tal como arrasto atmosférico, radiação solar, Bolhas de Plasma e perturbação gravitacional do termo J2. Estes efeitos podem alterar a qualidade do sinal, aumentado a probabilidade de falhas, além de influenciar nos componentes e na precisão de apontamento, rastreio e aquisição dos dados [12]-[14]. Atualmente, a solução utilizada é recorrer a manobras orbitais, por meio de propulsores, para retornar os satélites à formação original (formation-keeping) [15]-[17]. Receptor Chegando ao receptor, o sinal óptico passa pelo fotodetector, que tem a função de converter o sinal óptico para um sinal elétrico. Antes de chegar ao subsistema TT&C (comunicações), ele pode passar por filtros, amplificadores e outros componentes a fim de melhorar a qualidade do sinal recebido. IV. ENLACE DE ISOC O ISOC utiliza o sistema de linha de visada (Light-ofSight – LOS) ou feixe direto, permitindo alcançar distâncias entre centenas a milhares de quilômetros. Para conhecer o desempenho do enlace entre CubeSats em uma missão espacial, é necessário definir os requisitos dos elementos da carga útil (payload) do subsistema de comunicação óptica do Laser, como: potência e comprimento de onda; ganho das antenas de transmissão e recepção; verificação das perdas oriundas do canal de propagação; erros intrínsecos ao dispositivo, como erro de apontamento; rendimento do transmissor e receptor; e sensibilidade do receptor. Com a definição destes parâmetros, é possível verificar a quantidade de potência recebida pelo receptor em um enlace de ISOC entre CubeSats, por meio da seguinte equação [18]: onde: PR é a potência recebida pelo receptor; PT é a potência transmitida; ηT é a eficiência óptica do transmissor; ηR é a eficiência óptica do receptor; GT é o ganho do transmissor; GR é o ganho no receptor; LT é o erro de apontamento do transmissor; LR é o erro de apontamento do receptor; λ é o comprimento de onda; e ρ é a distância relativa entre os satélites. O ganho do transmissor GT e do receptor GR é representado, respectivamente, pelas equações: sendo DT o diâmetro da lente do transmissor; e DR o diâmetro da lente do receptor. Os fatores de perdas de apontamento na transmissão LT e recepção LR são expressos na seguinte forma: onde, θT é o erro de apontamento do transmissor; e θR é o erro de apontamento do receptor. Por meio das equações acima, observa-se que há uma relação entre a potência recebida e a distância do enlace. V. DESENVOLVIMENTO DO ISOC EMPEQUENOS SATÉLITES Em 2015, a NASA por meio da Missão Optical Communication and Sensor Demonstration – OCSD realizou o experimento de ISOC entre os CubeSatsAeroCube-7, AeroCube-11 e o ISARA. Como o ISARA não possui um sistema de recepção para coletar o sinal óptico oriundo dos CubeSats, foi utilizada uma de suas câmeras instalada a bordo como receptor, pois como ela operava na faixa do infravermelho próximo, era sensível ao comprimento de onda de 1064 nm do Laser do AeroCube-7 e AeroCube-11. As imagens coletadas do Laser pela câmeraeram convertidas em sinais de radiofrequência (RF) e usadas para avaliara capacidade de rastreio e apontamento dos satélites por meio da intensidade do sinal óptico [19]. Em 2017, K. Iwamoto et al. [20], [21] realizaram um estudo experimental de ISOC para pequenos satélites; nesse estudo, foi proposto um enlace de 4500 km entre satélites com uma taxa de bits de dezenas de Mbps, utilizando sistemas deapontamento com micro atuadores e estabilizadores que resultou em uma precisão de 10µrad, cobertura angular de ± 500 mrad e velocidade angular de 35 mrad/s. R. Morgam [22], apresentou, em 2017, um projeto transceptor de ISOC entre CubeSats denominado Free Space Lasercomm and Radiation Experiment – FLARE. O módulo transceptor do FLARE foi projetado para suportar uma taxa de dados de 20 Mbps a uma distância entre 20 a 500 km entre os satélites, utilizando uma potência menor que 20W. O dispositivo consistia em um conjunto óptico composto de dois sistemas micromecânicos e conjunto de espelhos para realizar o controle e direcionamento do feixe de Laser para o receptor. Ao tentar desenvolver um sistema satelital composto de CubeSats e uma estação terrena para trafegar imagens hiperespectral ou SAR vinda do espaço, R. Welle et al., em 2017 [23], viram a necessidade de utilizar a comunicação óptica com uma rede de CubeSats repetidores em baixa órbita para fluir a grande taxa de dados vindas destas imagens. Baseando-se nos sistemas satelitais que utilizam o ISOC e uma comunicação Terra-Espaço para grandes satélites, concluíram que o principal desafio era criar um sistema de apontamento do feixe composto de dois estabilizadores, que seria inviável implementar em CubeSats em virtude do peso e dimensões do dispositivo. Desta forma, foram realizados dois experimentos para sanar esta deficiência: o primeiro foi criar um sistema de apontamento com um único sistema de estabilização, combinado com a rotação do satélite sobre o eixo de recepção, para o caso Terra-Espaço. O segundo experimento foi a utilização de um enlace de ISOC entre dois CubeSats, sem sistema de estabilização dos feixes, voando próximos, sendo um sistema atuando como receptor e outro como transmissor. Em 2018, Cahoyet al. [24], apresentaram a missão CubeSat Laser infrared Crosslink (CLICK), realizada por uma parceria entre a NASA, Massachussetts Institute of Technology – MIT e a University of Florida. A missão proposta será dividida em duas fases: a primeira, com previsão de lançamento em 2023, a CLICK A, composta por dois CubeSats 3U, tem por objetivo apresentar o desempenho e a precisão do sistema de apontamento e controle do direcionamento do feixe entre os CubeSats e a estação de solo. A segunda fase da missão, CLICK B/C, tem como objetivo demonstrar o enlace de ISOC propriamente dito, isto é, efetuar a transmissão e recepção entre dois CubeSats 3U na mesma órbita para demonstrar o ISOC bidirecional a uma distância entre 25 e mais de 580 km entre satélites com uma taxa de transmissão de 20 Mbps. No mesmo ano, J. E. Velazco e J. S. de La Vega [25], [26] apresentaram o projeto da Missão Q4, liderada pela Jet Propulsion Laboratory – JPL. Esse projeto visa um enlace de 4 CubeSats que empregam o ISOC com um dispositivo de transmissão e recepção óptica realizando cobertura de 360º, e com uma taxa de dados acima de 1Gbps a uma distância acima de 200km entre os satélites. A National Institute of Information and Communications Technology (NICT) e a Universidade de Tóquio criaram uma missão entre o CubeSOTA, um CubeSat 3U em órbita LEO e o satélite ETS9-HICALI de órbita GEO, por meio do ISOC com taxa de transmissão de dados igual a 10Gbps. O lançamento está previsto para 2023 [27]. Outra abordagem de estudo em ISOC para CubeSat é o desenvolvimento de dispositivos de transmissão de luz na faixa do visível, por meio de LED para enlaces de curto e médio alcance, substituindo assim o Laser, em virtude do requisito de alta precisão de apontamento, e o RF, devida a limitada capacidade de transmissão (largura de banda). Assim, em 2018, D. N. Amanor [28], apresentou um modelo analítico de ISOC utilizando luz na faixa do visível, a fim de avaliar a viabilidade e desempenho do enlace em diversos tipos de modulação e detecção direta, obtendo uma taxa de dados de 2Mbits/s a uma distância de 0,5 km, com uma taxa de erro de bits (Bits Error Rate – BER) de 10-6. Griffiths et al. [29], [30], demonstraram experimentalmente um transceptor de comunicação óptica que utilizava LED e fotodetectores Single-Photon Avalanche Diode (SPAD) em silício, que aumentava a sensibilidade de recepção do sinal, chegando a valores de –55,2 dBm, permitindo alcances maiores que 1 km no enlace e recebendo uma taxa de 100 Mb/s. Em 2021, A. Anzagira e W. Edmonson [31] apresentaram um estudo teórico sobre o emprego de LED em ISOC, recorrendo ao Non-Orthogonal Multiple Access (NOMA), que é um método que permite transmitir vários dados simultaneamente do satélite líder para os seguidores, direcionando o sinal específico para cada satélite. Esta transmissão gerou uma taxa de 2Mbit/s. VI. DISPOSITIVOS DE TRANSMISSÃO DE ENLACESDE COMUNICAÇÃO ÓPTICA INTERSATÉLITE UTILIZANDO OPA Na seção anterior, observa-se que todos os componentes do dispositivo de transmissão do CubeSat são formados por partes mecânicas e lentes, afetando o apontamento do instrumento devido às vibrações que ocorrem durante o movimento do sistema ATP, reduzindo assim a precisão do direcionamento do feixe óptico no satélite receptor. Além do consumo de energia do satélite. Um dispositivo fotônico alternativo para reduzir estes efeitos é o desenvolvimento de um Optical Phased Array (OPA). O OPA é um dispositivo fotônico que não possui partes mecânicas, sendo construído em dimensões micrométricas, fabricado no conceito de nanofotônica em silício. Sendo o princípio de funcionamento semelhante às antenas Phased Array na faixa de Rádio Frequência (RF), a diferença está no direcionamento dos feixes, que é por meio do controle da fase da luz irradiada por cada antena óptica. Em comparação aos dispositivos de comunicação óptica tradicionais, o OPA tem a vantagem de apresentar alta velocidade de direcionamento, além de multi-direcionamento do feixe, pequenas dimensões e peso, sendo características essenciais para aplicações espaciais, em especial em CubeSats [32]. A Fig. 2 mostra uma representação esquemática do OPA com o modulador de fase (phase shifter) em forma de guia espiral de Arquimedes: A justificativa do sistema de apontamento não possuir partes mecânicas vem do modulador de fase, pois funciona por meio da alteração do índice de refração do material que é construído o guia, alterando assim a propagação da luz. Este processo pode ser realizado por meio de dois tipos de efeitos: eletro-óptico ou termo-óptico. O termo-óptico, é o efeito onde a variação do índice de refração do material nmaterial, é totalmente dependente da temperatura T aplicada neste corpo. A temperatura é oriunda do aquecimento do material condutor do feixe óptico por meio de aquecedores (heater), que faz gerar a relação n-T, representado pelo coeficiente termo-óptico (Termo-Optical Coefficent - TOC), expresso por ∂n/∂T [33]. Na natureza, cada material possui seu coeficiente termo-óptico, e por meio deste valor é possível saber como a temperatura irá influenciar no índice de refração do material. Assim, é possível conhecer tão quanto será a variação de fase ∆ϕ do feixe de luz em função da temperatura T, comprimento L do guia em um comprimento de onda λ por meio da seguinte equação [34],[35]: onde se busca alcançar uma variação de fase ∆ϕ = π, em função da variação da temperatura. Por meio de simulações, é possível obter a variação de temperatura no guia de onda necessária para obter o valor de ∆ϕ e a distribuição de calor. Como exemplo, a Fig. 3 representa um guia de ondas a uma temperatura ambiente de 300 K. Independentemente da abordagem de excitação por aquecimento (elétrica ou óptica), postula-se que uma potência de 7,02 mW foi utilizada para o aquecimento a fim de obter um ∆ϕ = π no comprimento de onda de 1,55 µm. Portanto, a distribuição de calor ao longo do guia de ondas em espiral é mostrada na Fig. 3. Por meio da figura acima, observa-se que a mudança de temperatura se concentra no centro do guia de onda espiral e se dissipa principalmente pelas camadas laterais (Si3N4 e Si), e com menor intensidade em direção ao substrato de Si e a variação da temperatura, com um pico de 29 K, está distribuída ao longo do guia de ondas, o que é suficiente para gerar uma modulação de fase óptica de π radianos.Logo, com a potência aplicada no dispositivo para gerar o calor e variação de fase (linha vermelha) resultará na direção de apontamento do feixe (linha verde) de Laser, como mostra o gráfico da Fig. 4: Por meio do gráfico apresentado, observa-se que ângulo de apontamento θ atinge o ângulo de apontamento máximo de 90º, para o valor de ∆ϕ = π e potência térmica de Pπ = 7,02 mW. VII. CONCLUSÃO Neste artigo, foi apresentado o emprego da tecnologia fotônica em missões espaciais em formação em voo de pequenos satélites, onde o maior desafio é o feixe direcional, proveniente de dispositivos de transmissão, livre de interferências e perdas na recepção. A nanofotônica integrada em silício que permite construir dispositivos em dimensões reduzidas, como o Optical Phase Array (OPA), não possui componentes mecânicos para o direcionamento do feixe, sendo uma forma para mitigar os efeitos causados pelo ambiente espacial na transmissão do sinal, como também aproveitar o espaço reduzido do CubeSat.   "
}