	{
		"id": 47,
		"titulo": "formulação matemática para o planejamento de rota para veículos aéreos em cenários de dqbrn",
		"autor": "Maria José Pinto, Cláudio Antônio Federico, Mônica Maria De Marchi, Ana Cláudia Iwazaki Hayashi",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2021/st/217784_1.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 1,
		"resumo": "Este trabalho busca apoiar o processo de tomada de decisão em cenários de Defesa QBRN – DQBRN (Defesa Química, Biológica, Radiológica e Nuclear), através do planejamento de rotas seguras para veículos aéreos de forma a minimizar o nível de dose acumulada de radiação na tripulação. Uma formulação matemática é apresentada para o problema e aplicada em um exemplo ilustrativo onde algumas análises são feitas. Além disso, uma visão mais ampla do problema é apresentada mostrando outros fatores importantes que também afetam o comportamento, o formato, a concentração e a abrangência da pluma." ,
		"texto": "I. INTRODUÇÃO Acidentes nucleares como Fukushima e Chernobyl trouxeram à tona a vulnerabilidade de países em efetuar ações de resposta e mitigação de danos provocados por acidentes daquela magnitude. Mostraram, ainda, que as consequências ambientais, econômicas e sociais são devastadoras e potencialmente irreparáveis. Desta forma, estudos têm sido realizados buscando gerar consciência situacional que auxilie no processo de tomada de decisão e resulte numa preparação efetiva para o enfrentamento de situações neste tipo de contexto. Em particular, softwares e metodologias têm sido desenvolvidos no esforço para simular a liberação e disseminação de plumas radiológicas e nucleares que mostrem, de forma antecipada, o nível de contaminação e de radiação esperado em uma determinada área. Ainda, o uso de meios aéreos tripulados em cenários desta natureza pode ser fundamental para reduzir o tempo de resposta nas operações de resgate e de atendimento e reduzir o risco envolvido neste tipo de operação. Este risco pode ser ainda menor se as rotas forem geradas de forma a considerar as informações prognósticas sobre o conteúdo da pluma e sua dinâmica no meio ambiente, pois permitem minimizar a exposição acidental das aeronaves, pilotos e tripulação e tem impactos positivos sobre o controle dos riscos à saúde e à segurança da missão. O Instituto de Estudos Avançados (IEAv) provê suporte técnico-científico ligado à atuação da Força Aérea Brasileira (FAB) em cenários de DQBRN, conforme a Diretriz COMAER DCA 1-6 [1] e, atualmente, é o responsável na FAB pelo prognóstico de plumas de agentes DQBRN na atmosfera, para apoiar o planejamento de missões. Para esta função, o IEAv mantém e opera o software ARGOS [2], que foi desenvolvido para dar suporte à decisão no caso de incidentes envolvendo dispersão atmosférica de materiais QBRN. Este software permite obter uma visão geral do cenário e, no caso de um incidente, criar um prognóstico de longo prazo de como a situação pode vir a se desenvolver, calcular as consequências do evento, permitindo nortear a preparação de equipes para atuar nesses eventos e orientar contramedidas para minimização de danos. Em relação ao uso para estimativas em território brasileiro, o software é abastecido com previsão meteorológica numérica fornecida pelo NOMADS (NOAA National Operational Model Archive and Distribution System) ou diretamente pelo INPE (Instituto Nacional de Pesquisas Espaciais), o que confere maior aproximação com a realidade em caso de eventos que possam ocorrer em território nacional. A Fig. 1 ilustra a simulação da evolução temporal de uma pluma radioativa, gerada pelo software ARGOS, para uma simulação hipotética. Desta forma, utilizar estas informações para gerar rotas aéreas com mínima exposição ao risco de contaminação é determinante no processo de tomada de decisão neste tipo de cenário, tanto para evitar a exposição ou contaminação acidental, quanto para minimizar as doses, contaminações e riscos em exposições planejadas, tanto das aeronaves quanto das pessoas envolvidas (piloto e tripulação), por exemplo, em missões de resgate. Cabe ressaltar que estes cuidados são decorrentes da experiência pregressa no uso de aeronaves em diversos cenários de plumas radioativas, dos quais pode-se citar Chernobyl, onde houve o emprego de aeronaves em um ambiente extremamente agressivo em termos de taxas de dose e contaminação e, mais recentemente em Fukushima, onde há registros de contaminação de aeronaves participantes das operações de recuperação. O planejamento de rotas de veículos tratado neste trabalho tem como objetivo gerar uma rota, saindo de um ponto inicial e chegando a um ponto de destino. Este problema pode ser visto como um caso particular do Problema de Caminho Mínimo (PCM), um problema clássico de Pesquisa Operacional que, de maneira geral, busca gerar rotas eficientes de forma a atender um objetivo (p. ex., minimizar a distância total percorrida) e tem sido bastante estudado na literatura [3]. No entanto, a aplicação em cenários de DQBRN requer considerações específicas devido aos fatores de riscos envolvidos. Com isto, busca-se gerar rotas que resultem numa menor exposição a estes fatores [4][5]. De nosso conhecimento, são poucos os trabalhos na literatura que buscam otimizar rota em cenários de DQBRN [6][7] e, nestes trabalhos, as rotas são geradas considerando deslocamento no solo. Com isto, este trabalho pretende contribuir auxiliando o processo de tomada de decisão no planejamento de rotas para veículos aéreos em navegação por mapa na presença de pluma radiológica ou nuclear, buscando minimizar o nível de dose de radiação na tripulação. Uma formulação para o problema é apresentada na Seção II e, na Seção III, o modelo é aplicado em um exemplo ilustrativo, onde algumas análises são feitas. Na Seção IV uma visão mais ampla do problema é apresentada para mostrar outros fatores fornecidos pelo software ARGOS que podem influenciar no planejamento final da rota. Nesta seção algumas propostas para trabalhos futuros também são apresentadas. A Seção V apresenta as considerações finais. II. FORMULAÇÃO MATEMÁTICA Como a rota a ser gerada considera um veículo aéreo, a autonomia do veículo precisa ser respeitada, mas o objetivo principal, para o contexto de DQBRN, não é minimizar a distância percorrida, mas sim garantir que a rota seja feita com o menor índice de contaminação e, consequentemente, a menor dose acumulada. O modelo matemático irá considerar que o ambiente de navegação será discretizado através de uma matriz de dimensão M  N, onde M representa as linhas e N as colunas da matriz e que o tamanho da célula é fixo e igual a w. Ainda, a rota a ser gerada deverá sair do ponto origem O e chegar ao ponto de destino D. Desta forma, o problema pode ser representado como um problema de grafo, onde os nós representam os centros das células de discretização do ambiente e os arcos/arestas representam as ligações entre estas células. Cada célula do grafo conterá o nível de radiação (taxa de dose) devido à pluma radiológica. Em uma situação real, estes valores de radiação são fornecidos pelo software ARGOS. Considere que a taxa de dose recebida em uma determinada célula dependerá não somente da taxa de dose daquela célula, mas também do tempo que o veículo aéreo permanece naquela célula recebendo a radiação. Com isto, a dose acumulada Dij para a rota indo do nó i para o nó j do grafo pode ser definida como: onde: G: conjunto de nós do grafo que fazem parte do caminho (i, j), inclusive os nós intermediários 𝑅𝑘 : taxa de dose (nível de radiação) da célula que contém o nó k 𝑇𝑘 : tempo que o veículo aéreo permanecerá na célula que contém o nó k, recebendo a radiação Rk Desta forma, 𝑇𝑘 depende do espaço percorrido dentro da célula k e da velocidade do veículo, ou seja: Além disso, o espaço percorrido dependerá da vizinhança escolhida, conforme mostra a Fig. 3, que ilustra diferentes tipos de vizinhança que podem ser exploradas caso o veículo esteja no nó i. Desta forma, se considerarmos que o grafo possui n nós e que o objetivo é minimizar a taxa de dose acumulada no caminho total percorrido entre estes nós, o modelo matemático para o problema é descrito como: onde: 𝑉𝑖: representa o conjunto dos nós vizinhos do ponto i, de acordo com a vizinhança escolhida, como as vizinhanças ilustradas na Fig. 3 𝐴: autonomia do veículo aéreo 𝑐𝑖𝑗: tempo gasto pelo veículo para ir do nó i ao nó j (depende da velocidade do veículo e da distância entre os nós) 𝑥𝑖𝑗: variável de decisão que indica se o arco (i,j) fará parte da rota (𝑥𝑖𝑗 = 1) ou não (𝑥𝑖𝑗= 0) O objetivo (2) consiste na minimização da dose acumulada na missão. As restrições (3) garantem o fluxo, ou seja, que a rota saia do nó origem e chegue ao nó destino, passando pelos nós intermediários. As restrições (4) garantem que o veículo terá autonomia para fazer todo o percurso. As restrições (5) indicam que as variáveis de decisão são binárias. Para ilustrar como é definida a dose acumulada Dij da rota indo do nó i para o nó j, considere o caso particular onde o veículo somente pode caminhar entre nós adjacentes do grafo. Observe que, neste caso, não existirão nós intermediários entre os nós i e j do grafo e a relação (1) passa a ser definida como: Assim, se considerarmos a vizinhança (a) ilustrada na Fig. 3 e que o tamanho da célula de discretização do ambiente de navegação é w, teremos: Para o caso particular que está sendo considerado, em que o veículo somente pode caminhar entre nós adjacentes do grafo, o valor de P é: Para o grafo completo, a dose acumulada Dij deve ser calculada para todos os pares (i, j) do grafo e a taxa de dose de todas as células que contém os nós pertencentes ao caminho entre os nós i e j, devem ser consideradas em (1). III. APLICAÇÃO DA METODOLOGIA - EXEMPLO ILUSTRATIVO A Fig. 4 mostra uma matriz como sendo a grade da discretização da área de navegação da região a ser explorada pelo veículo aéreo. Neste exemplo ilustrativo as células mostram valores fictícios do nível de radiação (taxa de dose) devido à pluma radiológica. Para este exemplo, teremos então n = 24 nós no grafo. O modelo (2)-(5) foi implementado utilizando o AMPL com solver CPLEX [8], onde os valores para Dij foram calculados previamente e fornecidos como dado de entrada para o modelo. Foi considerado que a rota será gerada considerando a vizinhança (a), ilustrada na Fig. 3. Para este exemplo fictício, consideramos que as células possuem dimensão 1 e a velocidade do veículo é constante e igual a 1. Considerando, inicialmente, que a rota pode utilizar somente os nós adjacentes de cada nó, a solução obtida está apresentada na Fig. 5 onde os pontos de origem O e destino D são apresentados, juntamente com a rota gerada (destacada em vermelho). Esta solução apresentou uma dose acumulada de radiação de 22,9 µSv. Se permitirmos que a rota seja gerada entre quaisquer nós do grafo, por exemplo, em um ambiente de navegação livre de obstáculo, é possível gerar uma rota com menor dose acumulada de radiação, no caso, de 21,7 µSv (apresentada na Fig. 6), a qual seria viável e com resultado melhor do que a solução anterior. Em ambos os casos, a autonomia não limitou a solução. Entretanto, se reduzirmos a autonomia da aeronave, o que poderia acontecer em uma situação real, por exemplo, para a rota de retorno, a solução também sofre alteração. As Figs. 7 e 8 apresentam, respectivamente, a solução permitindo que a rota seja gerada somente entre nós adjacentes (valor da função objetivo 57,2 µSv) e para o grafo completo (valor da função objetivo 34,3 µSv) quando a autonomia é menor do que a obtida nas soluções anteriores. Desta forma, em ambos os casos, a limitação da autonomia da aeronave resultou no aumento da dose acumulada de radiação. Isto mostra a importância de levar em consideração a autonomia do veículo ou utilizar veículos que consigam fazer toda a trajetória sem nenhuma limitação. Os testes computacionais para este exemplo ilustrativo foram realizados em um ultrabook Samsumg, com processador Intel Core i5-3317U CPU @ 1,70GHz e memória RAM de 4GB, SO Microsoft Windows. O tempo médio para obter os resultados apresentados nas Figs. 5 a 8 foi de 0,19s, aproximadamente. IV. OUTROS ASPECTOS DO PROBLEMA E TRABALHOS FUTUROS Os dados gerados pelo software ARGOS permitem visualizar as áreas onde a pluma radiológica está concentrada em diferentes momentos. Assim se os valores de radiação forem medidos durante duas horas (por exemplo, de uma até três horas da tarde) e os valores de taxa de radiação forem fornecidos no tempo inicial e a cada meia hora, teremos 5 valores de taxas de doses para cada nó e não somente um valor como na Fig. 4. As Figs. 9 e 10 ilustram diferentes momentos da pluma. O software também apresenta os valores de radiação em diferentes altitudes de navegação. O modelo matemático considerou uma única altitude de navegação, mas em aplicações reais, pode ser interessante navegar utilizando altitudes diferentes desde que fazer esta mudança resulte em um nível de contaminação ou taxa de dose menor, que é o objetivo do problema. Ainda, neste caso, é importante incluir fatores relacionados às características cinemáticas e dinâmicas do veículo, além da autonomia, para verificar a viabilidade de determinadas manobras necessárias nesta situação. Outro fator que influencia o resultado é a velocidade do veículo. Neste trabalho, esta velocidade foi considerada um valor fixo. Mas se velocidades maiores fossem definidas para células do ambiente de navegação com valores maiores de radiação, a solução poderia ser melhor em termos de contaminação. Com isto, uma possibilidade seria considerar a velocidade como uma variável de decisão do problema. O modelo (2)-(5) precisaria ser adaptado para levar em consideração estes fatores, ou seja, para ser aplicado em uma situação real, é necessário considerar que a pluma sofre alterações com o tempo e que o veículo pode navegar em diferentes altitudes e velocidades. Em relação à altitude e tempo, uma primeira proposta seria incluir nós fictícios nas mesmas posições de latitude e longitude que receberiam os diferentes valores de taxa de dose para cada momento e cada altitude de navegação. A dificuldade, neste caso, é encontrar uma solução para o problema em um tempo computacional aceitável, dependendo do total de nós. Ainda, a cada nó visitado no trajeto, o valor a ser utilizado entre os diferentes momentos dependerá do instante que a rota foi iniciada e do tempo gasto até aquele nó. Para modelar esta restrição, será preciso utilizar uma variável que contabilize o tempo a cada nó visitado. Mas estes valores não poderão ser definidos a priori, como no caso de Dij pois a sequência de nós do grafo é definida durante a execução do método. Além das adaptações para incluir os fatores tempo e altitude, seria interessante adaptar a metodologia para permitir que a rota percorra qualquer espaço do mapa, não sendo necessário passar somente pelos centros das células geradas pela discretização do ambiente de navegação, como considerado neste trabalho. Ainda, neste tipo de contexto, pode ser necessário fazer replanejamentos de rota caso ocorra, por exemplo, alguma alteração do ambiente de navegação ou do formato da pluma. Para isto, o uso de métodos heurísticos pode ser interessante pois geram soluções boas em um tempo computacional aceitável. Em [9], tratamos o problema utilizando a heurística RRT (do inglês, Rapidly exploring Random Trees). A RRT implementada ainda não inclui também os fatores tempo e altitude, mas considera a possibilidade de existir obstáculos no ambiente de navegação e, com isto, pode ser aplicada também em navegação a baixa altitude e/ou em áreas urbanas, onde prédios ou montanhas poderiam ser considerados obstáculos para a navegação, dependendo da altitude de navegação. O modelo matemático proposto poderia ser também aplicado neste tipo de contexto onde, novamente, o grafo não seria completo e a matriz de adjacência teria somente os nós pertencentes às células livres para navegação, ou seja, sem obstáculos. De qualquer forma, em ambas as metodologias, a rota gerada precisa ainda ser transformada em uma trajetória segura e dinamicamente viável através da aplicação de métodos de suavização que se baseiam nas características cinemáticas e dinâmicas do veículo para evitar colisões com os obstáculos. Outros fatores, levantados por [10] poderiam ainda ser considerados para que a situação se aproxime mais da condição real, tais como o nível de contaminação na estrutura da aeronave e, consequentemente, a taxa de dose interna, que deve aumentar progressivamente ao longo da missão em decorrência da deposição de contaminantes nas superfícies da aeronave devido ao sobrevoo em espaço contaminado, ou da presença de vítima contaminada, que contribui com uma taxa de dose adicional na segunda parte de uma missão de resgate, ou ainda, da possibilidade de dose interna adicional nos tripulantes por inalação de materiais dispersos no ar, no caso da ineficiência ou do não uso de EPIs (Equipamentos de Proteção Individual). Todos estes fatores indicam um cenário complexo, que demanda esforços de pesquisa e oferece amplas oportunidades para o desenvolvimento de tecnologias de apoio além de resultar no ganho de consciência situacional para os envolvidos neste tipo de cenário. V. CONSIDERAÇÕES FINAIS Este trabalho mostrou uma metodologia para geração de rotas levando em consideração fatores de risco quando da ocorrência de um acidente QBRN, aumentando assim a segurança do voo. Um exemplo ilustrativo foi apresentado para mostrar a aplicação do modelo matemático proposto, considerando o caso particular onde o veículo pode caminhar somente entre nós adjacentes do grafo e permitindo uma navegação livre entre quaisquer nós do grafo. Também foi ilustrada a influência da autonomia do veículo na geração da rota. O próximo passo do trabalho será, além da implementação das propostas futuras descritas na seção IV, aplicar o modelo em cenários reais, com dados disponibilizados pelo software ARGOS, para validação da metodologia proposta."
	}
