{
    "id": 48,
    "titulo": "avaliação da redução de seção reta radar (srr) de superfície metálica irradiada na banda x pelo emprego de materiais absorvedores de radiação eletromagnética (mare)",
    "autor": "marcelo chagas de lima, ana paula santiago de falco, ali kamel issmael junior, marcelo da silva matias, andré paim gonçalves, roberto da costa lima, priscila richa, elvia leal, ana c. figueiredo de melo costa",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2021/st/216677_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "O objetivo deste artigo é apresentar os resultados das medidas de redução de Seção Reta Radar (SRR) de Materiais Absorvedores de Radiação Eletromagnética (MARE) realizadas pelo método da perda de inserção em ambiente laboratorial semianecóico, na banda X (de 8,2 a 12,4 GHz) e subsidiar a continuidade da atividade pela realização da Avaliação Operacional (AvaOp) desses itens em ambiente operacional. Os testes laboratoriais realizados visam buscar subsídios para refutar ou confirmar a seguinte hipótese: Os MARE construídos contribuem para a redução da SRR de meios navais constituídos por estruturas metálicas.",
    "texto": " I. INTRODUÇÃO A redução de SSR é um importante recurso tecnológico furtivo para aeronaves, mísseis, navios e outros veículos militares. Com valores menores de SSR, os veículos podem ter maior probabilidade de evitar a detecção por radar, seja de instalações terrestres, armas guiadas ou outros veículos. A concepção da assinatura reduzida também melhora a capacidade de sobrevivência global das plataformas através da melhoria da eficácia das suas contra-medidas de radar [1]. Com o intuito de proteger as plataformas navais, as placas elastoméricas de MARE tem a perspectiva de utilização como revestimento de meios operativos pela Marinha do Brasil (MB), de forma a aumentar a furtividade desses meios contra detecção radar, implementando a redução da Seção Reta Radar (SRR ou RCS em inglês). Tais placas empregam o conceito de revestimentos finos feitos apenas de dielétricos e condutores com uma largura de banda de absorção estreita em torno da ressonância. A avaliação dessas placas se tornou necessária, e para isso foi desenvolvida uma metodologia com duas fases. A primeira foi efetuar testes em ambiente controlado, onde um setup de medidas de SRR empregando câmara semi-anecóica e alvos metálicos em escala reduzida com e sem o revestimento de MARE. A segunda será em ambiente operacional em mar aberto sem a presença de interferência de terra e de outros meios. Tal fase empregará meios navais para a realização de corridas de teste explorando diversos ângulos de incidência e o efeito de multicaminho (multipath) da onda de Radiofrequência (RF). Com isso, será verificado a variação do alcance de detecção Radar de um alvo com e sem revestimento de MARE, irradiado por radar construído na faixa de frequência de ressonância do MARE fabricado. II. DESENVOLVIMENTO A primeira fase foi conduzida em ambiente controlado visando obter quantitativamente os valores de redução de Seção Reta Radar (SRR) obtida pelo emprego do MARE como revestimento em alvos metálicos disponíveis em geometrias planas. Foram avaliadas seis amostras que, por serem para uso militar naval possuem grau sigilo, foram identificadas no artigo com letras em sequência, e mediante aos dados de caracterização dielétrica e do levantamento da absorbância dessas placas, obteve-se que elas se constituem de MARE ressonantes em faixa estreita, concebidas para atenuar irradiação em ângulo de incidência normal, na faixa de frequência de 8,2 a 12,4 GHz (Banda X). Em função da facilidade logística e economicidade, optouse por se seguir inicialmente fase I (em ambiente controlado), cujos resultados podem justificar a execução da fase II (em ambiente operacional controlado) futuramente. A. METODOLOGIA 1) Local dos Testes: Foi realizado no Laboratório de Guerra Eletrônica (LabGE) do Instituto Tecnológico de Aeronáutica (ITA), posto que o mesmo dispunha de todos os equipamentos para a realização de medidas por perdas de inserção empregando câmara semi-anecóica. 2) Setup Experimental: Para a realização da verificação da redução de SRR por meio da medida da potência refletida, foram utilizados os seguintes equipamentos: a) Câmara semi-anecóica; b) Suporte de alvo cilindro, revestido de material absorvedor, com base rotativa; c) Analisador de Espectro, Keysight Modelo E4407B (de 9 kHz a 26,5 GHz) como gerador de sinal de Radiofrequência (RF); d) Gerador de sinais vetorial, Keysight modelo E8257D PSG (de 250 kHz a 20 GHz) como medidor de recepção de sinal RF; e) Alvo de referência, empregado na calibração do dispositivo: Refletor de Luneberg; f) Alvos metálicos a serem revestidos por MARE sobrepostos; e g) Antenas tipo corneta Spectrum Technologies modelo DRH 0118 para transmissão e recepção de sinais RF. 3) Técnica de medição de redução de SRR: A técnica de medição de redução de SRR foi realizada em três fases: Determinação da Condição de Campo Distante, Calibração do Setup Experimental e Medidas, conforme descrito a seguir. a) Fase de Determinação da Condição de Campo Distante: Para que a condição de campo distante fosse atendida, os alvos e as antenas foram posicionados a uma distância maior que (D) dada pela seguinte relação matemática: Onde L e λ são respectivamente a largura da antena (22 cm) e o comprimento de onda médio de banda X (0,0375 m). A Equação (1) é a expressão matemática que define a distância (D), a partir da qual obtém-se a condição de campo distante entre um alvo e as antenas irradiadoras. A distância D a ser empregada entre o alvo e a antena varia de acordo com a frequência, conforme valores descritos na Tabela I: É requisito necessário para o método de medidas de SRR que as ondas eletromagnéticas cheguem com uma frente plana na face do Material Sobre Teste (MUT), tomando como referência os valores de distância (D), entre o alvo e a antena, descritos na Tabela 1. Para obtenção experimental dos valores de redução de SRR, foi utilizado inicialmente o alvo metálico quadrado simples de 10 cm de lado, denominado nas medidas por substrato metálico. Este foi apoiado no suporte, fixado no centroide do interior da câmara semi-anecóica, conforme o apresentado na Figura 1. b) Fase de Calibração do Setup Experimental: Inicialmente foi medido o nível de reflexão da câmara semi-anecóica, vazia, sem o suporte. Foi obtido, o valor de - 60dBm, valor esse coincidente com a sensibilidade do analisador de espectro gerador de sinais vetorial, Keysight modelo E8267D PSG, empregado como receptor de sinal no setup de medidas. Nessa fase pode-se certificar que a antena transmissora estava irradiando somente na direção do fundo da câmara e que inexistia a presença de lóbulos secundários na antena transmissora que interferissem na medida da antena receptora. Na sequência realizou-se a medida da câmara semianecóica com o suporte, sem os alvos, para que fosse verificada a presença de sinais espúrios ou ruídos que pudessem interferir ou alterar o valor das medidas dos alvos. Foi obtido o valor de -55 dBm, assegurando-se a qualidade do suporte empregado para as medidas dado a sua pouca influência nos resultados obtidos, quando comparados com a câmara vazia. Em seguida, foi feita, conforme apresentam as Figuras 2 e 3, a medida do alvo padrão (o refletor de Luneberg). O refletor de Luneberg, ao ser medido na frequência padrão de 9,375 GHz, obteve como valor da potência refletida 47,94 dBm, valor condizente com o valor padrão descrito na documentação do fabricante [3]. c) Fase de medidas: Como pode ser visto na Figura 4, para a realização das medidas foram utilizadas duas antenas: uma para transmissão ligada ao gerador de sinais e outra para recepção ligada ao receptor de sinais. B. MEDIÇÕES Para a realização do experimento, o alvo da Figura 1 foi iluminado por ondas transversais elétricas (TE), nas frequências de 8 GHz a 12 GHz, em intervalos de 0,5 GHz. A Largura de Banda Ressonante (BW) de 3 MHz, a potência 15dBm e a modulação em Ondas Contínuas (CW) são necessárias para que a onda irradiada sobre os alvos, mantida durante todo o experimento, não apresente harmônicos, nem respostas espúrias ou transientes. Após obtidas as medidas de potência refletida em dBm para toda a faixa de frequências para a placa metálica, foram sobrepostos à essa placa um material polimérico sem o preenchimento de MARE, e todos os seis MARE (amostras A a F) disponíveis para medida, obtendo-se os seguintes resultados, descritos na Tabela II: Para melhor visualização das medições, apresenta-se o gráfico da Figura 5. C. RESULTADOS E ANÁLISE A caracterização da SRR de alvos pode ser feita a partir da comparação da potência refletida de um alvo revestido por MARE (PA) e a potência refletida do alvo padrão metálico (Pref). Sendo os alvos revestidos por MARE e o alvo padrão iluminados a uma mesma distância das antenas, pode-se denotar matematicamente que a SRR do alvo a ser caraterizado é dado por [2]: Assim, a partir das medições realizadas, são apresentados na Tabela III, os resultados de frequência em que a onda TE incidente (fmáx) apresenta máxima atenuação para os Materiais submetidos a teste (MUT) em GHz e o percentual de redução da SRR em relação ao alvo metálico: Para se ter uma base de comparação com meios operativos, os valores típicos de SRR em termos de dBm [2] são apresentados na Tabela IV: Os resultados de redução de SRR em dBm apresentados nas Tabelas II e III, indicam que os MARE A e F obtiveram os melhores resultados, possuindo elevado potencial para reduzir SRR de diversos meios que possuam características como as da Tabela IV, na Banda X (8,0 e 12,0 GHz), especialmente navios. Já os demais MARE possuem potencial para emprego em meios com SRR abaixo de 30 dBm. Os bons resultados obtidos em ambiente laboratorial, validam a necessidade da realização de testes de mar com os referidos MARE de forma a averiguar-se a efetiva redução de SRR em alvo representativo, observadas as condições atmosféricas específicas de um ambiente naval. Vislumbra-se para o próximo ano de 2022 a realização destes testes de mar com a utilização de um balão inflável que é de uso da MB como alvo de oportunidade para a realização de tiro de superfície e verificação de sistemas, conhecido como balão alvo (Killer Tomato) [4], conforme a Figura 6. III. OBSERVAÇÕES FINAIS Os resultados obtidos foram considerados satisfatórios e permitem concluir a validade da hipótese de que todos os MARE fabricados contribuem para a redução da SRR de meios navais constituídos por estruturas metálicas na Banda X. Conforme mencionado anteriormente, este trabalho não esgota o tema, e espera-se que com a realização dos testes de mar, seja comprovada, em ambiente operativo naval, a eficiência do uso desses MARE e que eles possam, em curto e médio prazo, serem empregados na MB para aumento da discrição de seus meios navais.   "
}