{
    "id": 49,
    "titulo": "transmissão de dados radar por meio de rádio frequência na faixa de hf",
    "autor": "márcio gonçalves ramos, pablo pontes arraes",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2020/st/ST_05_2.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 3,
    "resumo": "No protocolo de dados radar ASTERIX são transmitidas mensagens codificadas que contém informações técnicas e operacionais que são interpretadas pelos sistemas de tratamento e visualização de dados radar, aplicados nos serviços de controle de tráfego aéreo e atividades de defesa aérea. Visando a aplicação do rádio enlace de dados radar na faixa de HF (High Frequency) como meio de comunicações seguras entre um determinado sítio radar e uma bateria de artilharia de defesa antiaé- rea desdobrada, foi desenvolvido um conversor de barramento serial RS-232 para ethernet e uma aplicação em software para compatibilizar o protocolo ASTERIX de modo que os dados radar sejam trafegados de forma íntegra e segura por um canal de banda estreita, sem afetar o desempenho operacional da missão de defesa antiaérea. Este artigo descreve a metodologia aplicada durante o desenvolvimento do projeto, bem como o desempenho do sistema em uma missão conjunta, coordenada pelo Ministério da Defesa.",
    "texto": " I. INTRODUÇÃO Os sistemas de radar usam ondas eletromagnéticas para obter as informações sobre a distância, a altitude, a direção e a velocidade de um alvo aéreo, bem como as informações sobre condições meteorológicas, necessárias às operações de defesa antiaérea. Em termos funcionais, os radares de defesa aé- rea desempenham funções de vigilância, de alarme local, de direção de tiro e de controle de tráfego aéreo. Em geral, essas funções podem ser executadas por radares diferentes, mas algumas delas podem ser executadas pelo mesmo radar. A aquisição de objetivos para o emprego dos mísseis superfície-ar, normalmente, é realizada por um radar de vigilância que proporciona boa cobertura do espaço e orienta o alvo para o sistema de guiamento do míssil, até este se fixar sobre aquele. Antes do engajamento, os potenciais alvos, especialmente as aeronaves militares, podem ser identificados através de um sistema IFF (identificação de amigo ou inimigo). A consciência situacional do espaço aéreo é fundamental para a tomada de decisão em uma ação de defesa aérea e os sistemas de comunicações devem transmitir as informações necessárias entre os sensores de vigilância, os centros de controle e o comando dos diversos elementos que constituem o escalão considerado. O emprego dos meios de comunicações deve ser de forma rápida, segura e eficiente, permeado por ações de guerra eletrônica que visam a sua neutralização ou degradação, desta forma, é imperativo que todas as transmissões, quer sejam por voz ou dados, contenham algoritmos de criptografia. [1] As características do enlace de dados radar na faixa de rádio frequência em HF se encaixam no contexto de agilidade, eficiência e segurança exigidos e é um meio promissor para compor uma estrutura de defesa antiaérea, quer seja como meio principal ou redundante. II. ESTRUTURA DO PROTOCOLO ASTERIX A estrutura do protocolo ASTERIX foi definida pela EUROCONTROL e está dividida em várias categorias que seguem uma padronização conforme a aplicação dos dados contidos no quadro do protocolo implementado nos diversos serviços pertinentes ao controle de tráfego aéreo. [2] A EUROCONTROL é uma Organização Intergovernamental formada por 41 membros. Desde 2015, o Brasil, através do Departamento de Controle do Espaço Aéreo (DECEA), integra o grupo com um acordo que refere-se ao estabelecimento de um framework para cooperação mútua no domínio da navegação aérea. [3] Nos sistemas de Defesa Aérea empregados no Brasil, os dados radar no protocolo ASTERIX são trafegados em modo síncrono, através de uma interface serial RS-232, encapsulados no protocolo de enlace HDLC, a uma taxa de 19200 bps. A Fig. 1 apresenta a localização dos radares que utilizam o protocolo ASTERIX no Brasil. Os radares no Brasil utilizam as categorias 34 e 48 do protocolo ASTERIX, elas são utilizadas para trafegar os dados das mensagens monorradar. Uma amostra da estrutura do protocolo ASTERIX na categoria 48 está descrita na Tabela I. III. TRANSMISSÃO DO PROTOCOLO RADAR POR UM RÁDIO ENLACE EM HF Para transmitir os dados radar que trafegam em uma porta serial RS-232 síncrona, foi desenvolvido um conversor serial síncrono para assíncrono, utilizando o microcontrolador PIC16F628A. Após convertido para assíncrono, os dados são capturados pela porta serial do computador, e através do controle efetuado pela aplicação em software, denominada Servidor, os dados da interface serial assíncrona são transmitidos pela interface ethernet para um determinado IP, usando o protocolo de rede UDP. Posteriormente, em um ponto da rede segmentada, uma aplicação denominada Conversor, recebe os dados pela porta ethernet e retransmite pela interface serial assíncrona, conectada ao MODEM\rádio HF. Esta aplicação efetua o controle de fluxo na interface serial do MODEM através da sinalização RTS (Request to Send), que ao mesmo tempo, efetua o chaveamento da transmissão do rádio HF e mantém a emissão por trinta e dois segundos e fica por quatro segundos sem transmitir. Assim os dados são trafegados pelo rádio transmissor e entregues ao receptor em uma transmissão broadcast. Para se estimar a probabilidade de sucesso na comunicação, realiza-se um cálculo, levando-se em considera- ção o padrão de forma de onda adotado no enlace HF, a largura de banda do canal, a taxa de transmissão, a razão sinal-ruí- do (SNR) e a seleção da melhor faixa de frequência a ser utilizada. Para esse conjunto de parâmetros, a otimização é feita respeitando-se as características técnicas do transmissor, receptor e antenas utilizadas no rádio enlace. A Fig. 2 mostra o conversor síncrono/assíncrono em funcionamento. Os LEDs indicam a presença do sinal de sincronismo e os dados radar no protocolo ASTERIX trafegando. A Fig. 3 mostra a interface do software Servidor transmitindo os dados radar para os hosts de destino na rede segmentada. IV. REQUISITOS MÍNIMOS PARA A CAMADA FÍSICA A aplicação foi desenvolvida para funcionar com os seguintes padrões para a camada física: Rádio HF – Modulação em Amplitude Single Side Band (AM-SSB), Upper Sideband (USB) e lower Sideband (LSB), com largura de banda de 3 kHz. MODEM HF – Porta serial nativa para a transferência dos dados no barramento RS-232, forma de onda com padrão MIL-STD-188-110B e taxa de transmissão até 9600 bauds com Interleaving Short para a correção de erros no enlace de dados. Essas características foram definidas após a verificação dos padrões (Modelo OSI) de camada física existente na For- ça Aérea e posteriormente, foram analisados os resultados obtidos nos ensaios realizados em laboratório, seguindo a recomendação ITU-R F.339-8, onde pode ser verificada a melhor razão sinal-ruído (SNR) para uma determinada taxa de bit transmitido, largura de banda do canal e modulações utilizadas pelo MODEM. [4] No desenvolvimento, priorizou-se a forma de onda que apresentou a melhor eficiência e robustez. Esses parâmetros foram medidos com um analisador de dados, durante os testes de enlace realizados em campo. A Fig. 4 mostra a instrumentação utilizada para a medição da taxa de erro no enlace de dados. V. A INTEROPERABILIDADE DA CAMADA FÍSICA A camada física utilizada pelo sistema segue o modelo TCP/IP, possui padrões definidos em normas militares e interfaces de comunicações com sinalizações e protocolos conhecidos. Essas características, aliadas ao protocolo da aplicação desenvolvida, permitem a interoperabilidade na comunicação de dados entre os diferentes fabricantes de rádios/MODEM utilizados pelas Forças Armadas Brasileira − FFAA. A Fig. 5 mostra a bancada de desenvolvimento e testes operacionais do sistema, em ambiente controlado, os rádios utilizados são empregados pelas FFAA. Cada Força Singular utiliza o equipamento que atenda seus requisitos operacionais e suporte as condições ambientais que lhe for submetido. Fatalmente, uma empresa não desenvolve equipamentos que atendam, ao mesmo tempo, todos os requisitos exigidos pela Marinha do Brasil, Exército Brasileiro e Força Aérea Brasileira, entretanto, é necessário que esses fabricantes construam equipamentos com padrões que permitam interoperabilidade. O software Conversor possui uma interface gráfica que indica o estado das principais sinalizações existentes nas interfaces serial e ethernet. Desta forma, o operador do equipamento pode observar o fluxo de dados e o correto funcionamento do sistema. Em caso de uma perda eventual do enlace, os LEDs indicarão a ausência de portadora e fluxo de dados. A Fig. 6 mostra os frames apresentados durante o enlace de dados e a indicação de fluxo de bytes nas interfaces utilizadas. VI. PREDIÇÃO DA PROPAGAÇÃO IONOSFÉRICA A propagação em HF ou propagação ionosférica é possí- vel graças à existência de uma camada da atmosfera, situada aproximadamente entre 60 e 800 km de altura (existem divergências entre diversos estudos, quanto a altura exata dessa camada), que se torna ionizada, devido a diversos fatores, normalmente a ação dos raios solares. A ionosfera apresenta variações diurnas, variações anuais e uma terceira variação que acompanha a periodicidade da atividade solar, com cerca de onze anos. A atividade solar é medida, principalmente, pelo número de manchas observadas através de imagens capturadas da superfície do sol. A atividade solar desempenha um papel significativo na densidade de elétrons livres nas diversas camadas da ionosfera, o principal indicativo é o número de manchas solares que, inclusive, é um parâmetro utilizado nos cálculos de predição HF. Os outros indicativos estão relacionados às características técnicas do transmissor, do receptor, o tipo de antena utilizada e a posição geográfica das estações envolvidas no enlace. A frequência utilizada no enlace é denominada Frequência Ótima de Trabalho (OWF – Optimum Working Frequency) e está compreendida entre a Máxima Frequência Utilizável (MUF – Maximum Usable Frequency) e a Mínima Frequência Utilizável (LUF – Lowest Usable Frequency). Na quase totalidade dos casos, estas frequências estão localizadas na faixa entre 2 e 30 MHz. A predição do valor da MUF da camada mais elevada da ionosfera envolve cálculos bastante complexos, dependendo de um grande número de fórmulas e gráficos que requer o uso de software específico. Por este motivo, a título da importância dos parâmetros mencionados, segue a lista de alguns softwares utilizados para o cálculo da previsão de frequência: ITS HF, WSAPS e PROP MAN 2000. Estas são as principais ferramentas utilizadas para fazer a predição da propaga- ção ionosférica, com relativa antecedência ao período da missão. A margem de erro desses softwares é, aproximadamente, de 10%. O método mais preciso para o cálculo da predição de propagação ionosférica é o recomendado pela União Internacional de Telecomunicações – UIT. Este método está contido na Recomendação ITU-R P.533 e utiliza várias outras Recomendações que fornecem informações complementares. [5][6] A Fig. 7 mostra a predição da propagação ionosférica usando a ferramenta computacional REC-533, contida no software ITS HF. VII. EMPREGO DO SISTEMA EM EXERCÍCIO OPERACIONAL. O Ministério da Defesa planejou e coordenou o exercício operacional conjunto Escudo Antiaéreo 2019 que teve a participação de tropas da Marinha do Brasil, Exército Brasileiro e Força Aérea Brasileira, em todas as regiões de defesa aeroespacial do país. Os meios antiaéreos estiveram desdobrados em Santiago – RS, Taubaté – SP, Porto de Sepetiba – RJ, Barra do Garças – MT e Boa Vista – RR. Com a autorização da direção do exercício operacional, o Sistema de Transmissão de Dados Radar por Rádio Frequência na Faixa de HF foi empregado na Operação Escudo 2019. Durante o período da missão, a prova de conceito do sistema foi posta em prática e atuou como redundância do enlace via satélite em banda X que, efetivamente, utiliza o Satélite Geoestacionário de Defesa e Comunicações Estratégicas (SGDC). Os militares do Primeiro Esquadrão do Primeiro Grupo de Comunicações e Controle (1º/1º GCC) instalaram o sistema nas localidades de Barra do Garças – MT, Santiago – RS e Boa Vista – RR. Os dados dos radares de interesse foram transmitidos por HF, a partir da Estação Profeta, localizada no Rio de Janeiro, nas instalações da ALA12. Em um dia determinado pela direção do exercício, o enlace via satélite foi, propositalmente, desligado para que todas as coordenações de emprego da artilharia antiaérea e a transmissão dos dados do radar de área fossem efetuadas pelo rá- dio enlace na faixa de HF. O conceito do sistema redundante mostrou-se bastante eficiente, cumprindo os principais requisitos técnicos e operacionais definidos no escopo do projeto. Dois computadores com o software VISIR (utilizado para visualização dos dados radar) foram instalados para receber os dados de um determinado radar, o primeiro computador recebeu os dados pelo enlace via satélite e o segundo, pelo enlace de dados em HF. Com o auxílio da função Vetor Medida, utilizada no software VISIR, os operadores artilheiros compararam a radial e distância de uma determinada pista radar, até um ponto de referência no mapa e verificaram que não havia diferença nas medidas apresentadas. A Fig. 8 mostra o artilheiro no Centro de Operações Militares em contato pelo rádio HF com o Grupo de Defesa Antia- érea desdobrado. Ele estava coordenando uma ação de Defesa Antiaérea em uma simulação de ataque aéreo às instalações de Barra do Garças. Durante o exercício simulado, a artilharia antiaérea logrou êxito na defesa antiaérea e conseguiu abater a aeronave hostil. A Fig. 9 mostra o diagrama de enlace para o funcionamento do Sistema de Transmissão de Dados Radar por meio de Rádio Frequência na Faixa de HF. VIII. BENEFÍCIOS DO SISTEMA PARA AS FFAA 1) Aproveitamento do grande parque de rádios militares disponíveis que atendem aos requisitos mínimos da camada física para operação do sistema; 2) Alcance em todo o território nacional, mesmo em locais de alta densidade florestal, devido a sua capacidade de propagação ionosférica; 3) Adequação às baixas taxas de transmissão dos dados originados de um radar de vigilância; 4) Emprego de plataforma computacional não especializada (Commercial off-the-shelf – COTS) e independente de placas/interfaces específicas, podendo inclusive ser instalado e operado em um notebook, facilitando seu emprego em ambiente operacional; 5) Softwares de domínio do Comando da Aeronáutica (COMAER), podendo ser atualizado e customizado de acordo com as demandas operacionais em vigor; 6) Simples de configurar e operar, sem necessidade de um operador especializado; 7) Possibilidade de emprego pelas três Forças Singulares como meio de interoperabilidade em HF; 8) Emprego em benefício das Artilharias Antiaéreas das FFAA para recebimento de dados de qualquer radar fixo, com fins de ampliar a consciência situacional das equipes desdobradas; e 9) Emprego como meio seguro e eficiente de contingência às comunicações de longa distância, como por exemplo, o enlace via satélite. IX. FUTURO DO PROJETO Visando melhorias na taxa de transmissão, segurança das comunicações e facilidade na operação do sistema, o projeto prevê a utilização de um terminal de data link que permitirá ser instalado em qualquer rádio militar, independente do seu fabricante. Esse terminal será composto por um computador, software computacional e um MODEM embarcado. O MODEM terá a arquitetura de um rádio definido por software (SDR – Software Defined Radio), utilizará forma de onda militar adaptativa de banda estreita e banda larga, o software instalado possuirá um algoritmo de controle do canal de comunicações e fará a sondagem ionosférica para a escolha da melhor frequência, com o objetivo de trafegar os dados radar com a máxima eficiência. O objetivo é produzir um equipamento compacto, com as interfaces de comunicações necessárias para ser instalado em qualquer sistema de rádio comunicações e prover compartilhamento dos dados com sistemas de terceiro que utilizem os barramentos serial RS-232 e ethernet. Desta forma, será cumprido o requisito de interoperabilidade entre os diferentes fabricantes de equipamentos de rádio frequência das FFAA. O terminal de data link facilitará a instalação do sistema de recepção dos dados radar empregado em uma unidade de artilharia antiaérea desdobrada. Além da visualização dos dados radar poder ser efetuada através dos softwares já existentes e utilizados pela Defesa Aérea, está sendo desenvolvido um sistema de visualização de dados radar que usará uma interface gráfica georreferenciada, visando a melhor consciência situacional do cenário operacional, através de imagem satélite em três dimensões ou por mapa bidimensional. A Fig. 10 mostra um exemplo dessa aplicação. A Fig. 11 mostra o módulo MODEM SDR que está instalado nos mais novos rádios HF, adquiridos pelo 1º/1º GCC. Esse módulo possui interfaces de controle serial e ethernet, é possível programar várias formas de ondas para diferentes aplicações em HF, incluindo o protocolo ALE (Automatic Link Establishment), fundamental para o enlace automático de voz e dados. A taxa de transmissão pode variar de 75 bps a 120 kbps, usando a forma de onda militar MIL-STD-188- 110C-D. A Fig. 12 mostra o vídeo mapa de um cenário hipotético utilizado na visualização radar de uma artilharia antiaérea desdobrada. A tela do sistema de visualização radar está com uma imagem satélite georreferenciada em duas dimensões e as áreas delimitadas pelos círculos concêntricos representam o Volume de Responsabilidade da Defesa Antiaérea (VRDAAe). [7] O VRDAAe é a porção do espaço aéreo sobrejacente a uma defesa antiaérea, onde vigoram procedimentos específicos para o sobrevoos de aeronaves amigas e para o fogo antiaéreo. O raio do cilindro interno corresponde a maior distância de desdobramento das Unidades de Tiro (UT), medida a partir do centro da defesa antiaérea, somada ao valor da altura. [8] X. CONCLUSÃO A ionosfera é uma região vulnerável a diversos fenômenos, tais como a variação de intensidade dos raios solares, o número de manchas solares e o vento solar. Apesar da instabilidade e variação constante, essa região proporciona propaga- ção de ondas de rádio a longa distância (1000 km – 9000 km) na faixa de HF (2 MHz a 30 MHz), através de refrações sucessivas em suas próprias camadas. Para a transmissão de sinal no meio ionosférico, é desnecessário utilizar repetidores para atingir o alcance pretendido, como consequência, o enlace em HF é de baixo custo quando comparado com outros sistemas de comunicações, como, por exemplo, satélites ou circuitos que utilizam enlaces terrestres consecutivos. O uso do enlace de dados na faixa de HF é muito importante, especialmente para países de grande extensão territorial que possuam áreas de responsabilidades para controle de trá- fego aéreo e defesa aérea, situadas em regiões de floresta, oceânicas, desértica, áreas polares ou quaisquer outras desprovidas de telecomunicações. O custo e a disponibilidade das comunicações em HF e a independência de sistemas intermediários, tornam este meio muito atrativo. Os equipamentos de comunicações em HF foram aprimorados com os avanços tecnológicos, destacando-se a arquitetura dos rádios definidos por softwares, canais de banda larga, formas de ondas que atingem taxas de transmissões mais elevadas e os sistemas de enlace automático que fazem o gerenciamento das frequências. Essas características dispensam operadores especializados e com experiência para viabilizar o enlace de dados. Além disso, as ferramentas baseadas em software, como o ITS HF proporcionam uma confiável predi- ção do enlace ionosférico e, associados ao protocolo desenvolvido para transmitir os dados radar, tornam as comunica- ções bastante robustas. Essas ferramentas foram utilizadas nos experimentos realizados durante o desenvolvimento, o que facilitou o estabelecimento dos enlaces e proporcionou a transmissão dos dados radar e a comunicação de voz com excelente qualidade. [9] Durante a Operação Escudo Antiaéreo 2019 o enlace de dados radar em HF funcionou paralelamente ao sistema via satélite, sem interrupção por falha ou pane dos equipamentos, confirmando, desta forma, a viabilidade, disponibilidade e eficiência do sistema. Para permitir a evolução do projeto é necessário aprofundar os estudos de propagação em todo o território nacional, devido à sua dinamicidade e variabilidade. As medidas realizadas durante o desenvolvimento apontaram pequenas diferenças na predição dos enlaces HF na recomendação ITU-R P.533-14 em relação às frequências utilizadas, o que indica haver divergências de comportamento ionosférico nas regiões do Brasil, principalmente no período noturno. [10] Para finalizar o projeto na sua plenitude, é preciso equipar todas as Organizações Militares de artilharia antiaérea com o mesmo sistema de enlace de dados e constituir uma rede de comunicações seguras de voz e dados em HF, que permita compartilhar os dados dos radares da Força Aérea Brasileira com a Marinha do Brasil e com o Exército Brasileiro, além de estabelecer comunicações de voz com os Centros de Opera- ções Militares e o Comando Aeroespacial. As estações de comunicações em HF são simples, práticas e de baixo custo. É importante que sejam feitos investimentos na exploração deste meio de comunicação que se confirma ser viável e seguro, de grande retorno e bastante vantajoso.   "
}