	{
		"id": 50,
		"titulo": "planejamento para emprego de sistemas espaciais (pemse): modelo matemático e adaptações",
		"autor": "Maria José Pinto, Mônica Maria De Marchi, Ana Cláudia Iwazaki",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2020/st/ST_11_2.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 1,
		"resumo": "Com o aumento do número de satélites e seu emprego em diferentes contextos cresce também a necessidade do desenvolvimento de ferramentas e/ou metodologias para apoiar o processo de tomada de decisão dentro do contexto espacial visando o planejamento para emprego deste sistemas. Desta forma, dado um horizonte de planejamento e uma constelação de satélites de observação da terra e de estações de solo heterogêneas, este trabalho tem como objetivo gerar o planejamento para aquisição e download de dados espaciais para o monitoramento de áreas de interesse (alvos) com diferentes prioridades. O objetivo do planejamento será maximizar o atendimento dos alvos de acordo com a prioridade, lidando com requisitos operacionais e com os requisitos dos cenários de aplicação. Neste trabalho, o modelo matemático desenvolvido até o momento para gerar este planejamento será apresentado juntamente com algumas adaptações. Um exemplo ilustrativo será utilizado para mostrar a importância de considerar as adaptações propostas.",
		"texto": "I. INTRODUÇÃO O Programa Nacional de Atividades Espaciais (PNAE) [1] busca enfatizar suas prioridades em relação às atividades espaciais e seu interesse estratégico no domínio das tecnologias espaciais visando fortalecer a autonomia e a soberania do país. Adicionalmente, a riqueza do país em recursos naturais torna fundamental o desenvolvimento de tecnologias que auxiliem em um monitoramento eficiente e eficaz do território brasileiro. Essa necessidade vem de encontro com a solicitação da Estratégia Nacional de Defesa (END) de uma maior capacidade de monitoramento do território e das fronteiras do nosso país [2]. Desta forma, pesquisas que busquem um melhor gerenciamento dos sistemas espaciais são essenciais para apoiar o processo de tomada de decisão em diversos cenários de aplicação, tanto no âmbito da defesa como no meio civil. Neste contexto, o PEmSE (Planejamento para Emprego de Sistemas Espaciais) visa otimizar o emprego dos sistemas espaciais. Especificamente, um modelo matemático foi proposto em [3] para gerar o planejamento para aquisição e download de dados para uma constelação de satélites de observação da terra e de estações de solo, com foco no monitoramento de áreas de interesse (alvos) que possuem prioridades diferentes, dentro de um horizonte de planejamento. Este modelo busca atender restrições operacionais referentes às oportunidades de contato entre o satélite e o alvo/estação de solo (janelas de visibilidade) e à capacidade de tempo de processamento, além de modelar requisitos do cenário, definidos pelo usuário, como o intervalo mínimo desejado de tempo entre observações sucessivas de um mesmo alvo (Revisit Time - RT) ou o prazo máximo para que os dados coletados estejam disponíveis (Due Time - DT). De nosso conhecimento, são poucos os trabalhos que tratam este problema de forma integrada, ou seja, considerando tanto a aquisição dos dados quanto a transferência dos dados coletados para as estações de solo [4]-[7]. E, nestes trabalhos, nem sempre um modelo matemático foi apresentado para o problema ou as restrições para tratar RT e DT foram consideradas. Novas restrições foram adicionadas ao modelo proposto em [3] para considerar o tempo de transição quando aquisições consecutivas de um mesmo satélite necessitam de diferentes modos de aquisição dado que a troca de um modo de aquisição para outro não é automática e nenhum dado pode ser adquirido durante este intervalo de tempo [8]. Além disso, a capacidade de armazenamento dos satélites foi modelada pois, dependendo do volume de dados adquiridos considerar a capacidade de armazenamento pode permitir que novos dados sejam adquiridos considerando que espaços de armazenamento são liberados à medida que os dados já coletados são descarregados para as estações de solo [9]. O modelo matemático proposto continua em evolução para obtermos um modelo robusto e que se adapte em diferentes situações. Este trabalho apresenta então algumas novas adaptações do modelo para tratar estas situações na Seção II. Na Seção III, o modelo é aplicado em um exemplo ilustrativo e, na Seção IV, algumas considerações finais e propostas de trabalhos futuros são apresentadas. II. MODELO MATEMÁTICO E ADAPTAÇÕES O modelo matemático proposto para tratar o problema em [3] e incluindo as adaptações propostas em [8] e [9] será apresentado a seguir. Neste modelo, as seguintes variáveis são consideradas: Neste modelo vamos assumir que a aquisição e o download de dados dependem, principalmente, do volume do da e, desta forma, consideramos que o tempo de processamento para adquirir e descarregar os dados será, respectivamente:  Considere ainda as seguintes variáveis de decisão: O modelo para gerar o planejamento para a aquisição e o download de dados é apresentado então a seguir. O objetivo do problema (1) consiste em maximizar a soma das prioridades dos alvos cujos dados tenham sido adquiridos e enviados para uma estação de solo. As restrições (2) garantem que a obtenção dos dados de um alvo é considerada completa somente se estes dados forem adquiridos e enviados a uma estação de solo. Além disso, estas restrições garantem que os dados de cada alvo serão adquiridos (por um satélite em uma janela de aquisição) e descarregados (para uma estação de solo em uma janela de download), no máximo uma vez. As restrições (3) garantem que, se os dados do alvo i são adquiridos a k–ésima vez (xikjt=1), estes dados podem ser adquiridos a (k+1)-vez ou não (xi,k+1,j,t=0 or xi,k+1,j,t=1), mas também garante que se for mais de uma vez a ordem das aquisições seguirão uma ordem cronológica, ou seja, não permite, por exemplo, que a segunda aquisição ocorra e a primeira não. As restrições (4) e (5) garantem que o tempo total para aquisição/download dos dados respeitem os limites das respectivas janelas de visibilidade. As restrições (6) garantem que o tempo de revisita entre as aquisições dos alvos de cada alvo seja respeitado (revisit time). As restrições (7) garantem que os dados adquiridos do alvo serão transferidos para a estação de solo dentro do prazo solicitado (due time). Vale ressaltar que as restrições (6) e (7) não são normalmente consideradas nos modelos da literatura. Entretanto, estes requisitos operacionais do cenário precisam ser abordados para derivar um modelo que possa ser aplicado na prática. As restrições (8) impõem a precedência entre aquisição e download, ou seja, os dados de um alvo específico podem ser transferidos de um satélite para uma estação de solo somente se já tiverem sido adquiridos anteriormente por aquele satélite. As restrições (9) garantem que o tempo de processamento total do satélite não exceda sua capacidade dentro do horizonte de planejamento. As restrições (10) garantem, para cada satélite j (j  S), que a quantidade de dados a serem coletados, em cada instante possível de aquisição, mais os dados armazenados (que corresponde ao total de dados coletados menos o total de dados descarregados para alguma das estações de solo até aquele instante), não exceda a capacidade do satélite. E, as restrições (11) garantem que o tempo de transição para permitir a mudança do modo de operação seja respeitado para adquirir alvos próximos que precisam ser adquiridos com modos de aquisição diferentes, ou seja, garantem que o início da próxima aquisição ocorra somente após a mudança do modo de operação, caso esta mudança seja necessária. No modelo (1)-(11) assume-se que 𝑎௧ > 0 e 𝑏ௗ > 0. Desta forma, 𝐴𝑊௜௞௝ = 𝐷𝑊௜௞௝௚ = 0 significará que os dados do k-ésimo alvo não serão adquiridos e nem descarregados. As janelas de visibilidade podem ser obtidas através de alguma ferramenta de modelagem de sistemas espaciais, como o STK (do inglês, Systems Tool Kit) [10]. Este tipo de ferramenta calcula, para determinados parâmetros do satélite/sensor, os diferentes períodos de tempo (janelas de visibilidade) que os alvos são cobertos (observados) dentro do horizonte de planejamento (para mais detalhes sobre os conceitos e modelos que definem esta cobertura, veja [11]). A primeira alteração sugerida no modelo (1)-(11), apresentado nos trabalhos anteriores, será para corrigir as restrições (6), que buscam atender a revisita dos alvos, pois da forma como foram definidas, verificamos que forçam que os alvos que precisam ser revisitados sejam revisitados todas as vezes pois, caso uma das visitas não seja possível, faz com que nenhuma das visitas aconteça. Entretanto, de um ponto de vista prático, pode ser interessante gerar um planejamento que não force todas as revisitas e sim mostre quantas revisitas serão possíveis dentro do horizonte de planejamento. Para isto, as restrições (6) precisam ser reescritas da seguinte forma: onde: R corresponde à um número suficientemente grande (por exemplo, R = 2H). Nas restrições (6) se xikjt for igual a 1(0) então xi,k+1,j,t também será igual a 1(0). Mas as restrições (6a) garantem que se xikjt for igual a 1, xi,k+1,j,t pode ser zero ou 1 pois AWi,k+1,j  0 (isto resulta do fato que, se xi,k+1,j,t=0, o lado direito das restrições (6a) será um valor negativo pois resultará, de forma simplificada, em AWikj+RTi –R). A segunda alteração no modelo será para corrigir as restrições (11) pois da forma como elas foram incluídas no modelo, acabam forçando que a k-ésima aquisição do alvo i ocorra sempre, independente da n-ésima aquisição do alvo r ter ocorrido ou não. Se ela ocorrer, a restrição resultará em 𝐴𝑊 ௜௞௝ > 0 pois o termo (𝐴𝑊௥௡ + 𝑀௥௝ + 𝑇𝑇௝) será > 0. E, se ela não ocorrer, a restrição resultará em 𝐴𝑊௜௞௝ ≥ 0 pois mesmo o termo restante (𝑀௥௝ + 𝑇𝑇௝) é sempre > 0. Desta forma, as restrições (11) deverão ser substituídas pelas restrições (11a): A próxima adaptação do modelo proposto está relacionada ao fato que estamos considerando download dos dados adquiridos para a estação de solo é feito em pacotes e, desta forma, os dados de alvos diferentes podem ser descarregados simultaneamente utilizando a mesma estação de solo, desde que o total de tempo necessário para descarregar estes dados respeite o tamanho da janela de visibilidade para download. Mas, a modelo permitia que isto acontecesse mesmo que o tempo de download fosse violado (como mostrará a próxima seção). Desta forma, as restrições (12) precisam ser incluídas no modelo: Cabe ressaltar neste caso que, na prática, dados desses alvos será seqüencial e, como tal, segundo alvo (ou segundo lote) começará somente após o término do primeiro e, os dados do terceiro começará somente após o segundo e assim por diante. Este atraso no início do download poderia comprometer o alguns dos alvos se fosse um tempo relativamente alto. Mas, considerando o tamanho das janelas de aplicações reais, este tempo pode ser considerado para o problema. Para ilustrar, considere que de download for de 100 Mbits/min e a janela para descarregamento de dados tiver 4 minutos alvos com 200 Mbits cada, por exemplo, descarregados usando essa janela de tempo pelas rest (12). Desta forma, os dados do segundo alvo de dados) começará 2 minutos após o término do p O modelo atual será composto então das restrições (1) (12), substituindo as restrições (6) pelas restrições (6a) restrições (11) pelas restrições (11a). III. RESOLUÇÃO DO MODELO Para mostrar a importância de considerar as alterações propostas na Seção II, utilizaremos o exemplo ilustrativo apresentado nos trabalhos anteriores [4] e [5] considera-se um horizonte de planejamento de três dias, três alvos (T1, T2 e T3), dois satélites (S1, S2) e uma estação de solo (ES). Considera-se ainda que, no período de planejamento, é possível observar 5 vezes o alvo T1; 2 vezes o alvo T2 e 4 vezes o alvo T3, resultando num total de 11 janelas de visibilidade para aquisição (A1 a A11). Além disso, os satélites S1 e S2 terão contato com a estação de solo 3 vezes durante o período, resultando num total de 6 janelas de visibilidade para download (D1 a D6). Estas janela apresentadas nas Tabelas I e II, respectivamente, onde as colunas Início e Fim representam o momento inicial e final da janela de visibilidade (em minutos), dentro do horizonte de planejamento de 3 dias (que corresponde a um total de 4.320 minutos) e a coluna Duração representa o tempo total (em minutos) de cada janela. Neste exemplo, a estação de solo somente pode atender um satélite por vez para realização de download Para facilitar a interpretação, o histograma de cobertura das janelas de visibilidade de aquisição e de apresentado na Fig. 1 A Tabela III apresenta os valores para RT e DT, para cada alvo. No caso, os valores de RT apresentados na tabela indicam de quanto em quanto tempo o alvo precisa ser visitado. Por exemplo, para o alvo T2 será de 3 em 3 dias (RT = 3) e, para o alvo T3, será de 2 em 2 d de RT e o total de dias do horizonte de planejamento definem o máximo de vezes que será possível adquirir os dados de cada alvo (representado na coluna AD da Tabela III) de DT indica o tempo máximo (em minutos), dentro do horizonte de planejamento de 3 dias, em que os dados coletados precisam ser descarregados para a estação de solo (ES). Para os alvos que precisam ser observados mais de uma vez durante o horizonte de planejamento, serão definidos valores de DT para cada uma das observações. O valor de DT apresentado na Tabela III não está contabilizando o tempo necessário para que a informação esteja efetivamente disponível para o usuário final, após o descarregamento destes dados para a estação de solo. Este tempo inclui, por exemplo, o tempo para que os dados coletados estejam disponíveis no centro de processamento de dados e o tempo para o processamento destes dados. Por exemplo, se este tempo for de 1 hora (60 minutos) para o alvo T1 e o usuário solicitou a segunda aquisição deste alvo para as primeiras horas do terceiro dia do planejamento, o modelo matemático considerará que os dados deste alvo precisam ser descarregados para uma estação de solo até, no máximo, no final do segundo dia de planejamento, como apresentado na Tabela III. Considere ainda que será necessário um tempo de 1 minuto para processar os dados dos alvos (tempo de aquisição) para ambos os satélites e 0,5 minutos para descarregar os dados (tempo de download), independente de qual satélite tenha adquirido os dados do alvo. Ainda, o tempo de transição para ambos os satélites fazerem a troca entre diferentes modos de aquisição será de 2 minutos (TTj = 2) e a capacidade de armazenamento será de 100 Mbits para os dois satélites (SC1 = SC2 = 100) e que os alvos T1, T2 e T3 possuem, respectivamente, um volume de dados de 10, 20 e 30 Mbits (V1 = 10; V2 = 20 e V3 = 30). O modelo (1)-(11) foi implementado e resolvido utilizando AMPL [12] e a Tabela IV mostra o planejamento gerado. Observe que a solução definiu a obtenção de todos os dados de todos os alvos. No caso, a primeira observação do alvo T1 e o alvo T2 foram descarregados utilizando a mesma janela de download D6. Isto acontece mesmo se incluirmos as restrições (12) no modelo porque o tamanho da janela D6 (5 minutos) permite que os dados de ambos os alvos sejam descarregados já que é necessário 0,5 minutos para fazer o download de cada um. Entretanto, se aumentarmos este tempo para 3 minutos para ambos os alvos e não incluirmos as restrições (12), a mesma solução descrita na Tabela IV será obtida mesmo agora não sendo mais possível utilizar a janela D1 para descarregar os dados dos alvos T1 e T2. Ao incluirmos as restrições (12) ao modelo (1)-(11), a solução apresentada na Tabela V é obtida. Observe que os dados do alvo T2 e a primeira aquisição do alvo T1 somente podem ser descarregados utilizando a janela de download D1 pois é a única janela possível para descarregar o alvo T2 e que permite atender o tempo entre diferentes aquisições do alvo T1 (revisit time) que seria de 1 em 1 dia (veja Tabela III). Desta forma, quando aumentamos o tempo para descarregar os dados destes alvos, não permitindo que ambos sejam descarregados na janela D1, o modelo define que somente a aquisição de um dos alvos seja atendida. Entretanto, observe que a solução esperada seria que as 3 aquisições do alvo T1 fossem atendidas ao invés da aquisição do alvo T2, a não ser que este alvo fosse prioritário em relação ao alvo T1, o que não é o caso. Mas isto não ocorreu por causa das restrições (11) pois forçam que se a aquisição dos dados do alvo T1 ocorrer, a aquisição do alvo T2 deve ocorrer (no tempo, o alvo T2 seria adquirido após o alvo T1). E como não podem ocorrer as duas aquisições, o modelo define então que o alvo T2 seja adquirido. Entretanto, ao substituir as restrições (11) pelas restrições (11a), as três aquisições alvo T1 passam a ser adquiridas e o alvo T2 deixa de ser adquirido como mostra a Tabela VI. Mas observe que o resultado da Tabela V, mesmo com as restrições (11) deveria ser diferente, pois a única aquisição que não seria possível de atender seria a última aquisição do alvo T1 (pois a Tabela IV mostra que a primeira e segunda aquisições seriam possíveis). Mas veja que, ao definir a aquisição do alvo T2 e não a terceira aquisição do alvo T1, nenhuma das aquisições foi feita para o alvo T1. Isto ocorreu devido às restrições (6) que forçam que nenhuma aquisição seja feita, caso uma ou mais aquisições não sejam possíveis. Mas como comentado, seria interessante para o decisor saber se existe a possibilidade de obter os dados do alvo T1 uma ou mais vezes durante o horizonte de planejamento mesmo que não todas as vezes desejadas. Para o exemplo ilustrativo, se substituirmos então as restrições (6) pelas restrições (6a), a solução apresentada na Tabela VII seria obtida incluindo duas visitas ao alvo T1. Imagine um caso mais extremo do que o apresentado no exemplo ilustrativo, onde seria desejado que um alvo fosse visitado 10 vezes durante o horizonte de planejamento mas que poderia ser visitado somente 8 vezes devido às demais restrições do problema. Neste caso, o modelo considerando as restrições (6) ao invés das restrições (6a), não indicaria nenhuma visita ao alvo, mas utilizando as restrições (6a), o planejamento mostraria as 8 revisitas ao alvo. E, caso todas as visitas desejadas inicialmente sejam realmente necessárias, o alvo poderia ser incluído no próximo planejamento para obter as demais revisitas. IV. CONSIDERAÇÕES FINAIS Neste trabalho, o problema de planejamento para aquisição e download de dados foi tratado visando auxiliar na tomada de decisão em contextos espaciais. Um exemplo ilustrativo foi utilizado para mostrar a aplicação das novas restrições propostas. O uso de um exemplo ilustrativo permite também observar que, mesmo para uma instância pequena com poucos satélites, alvos e estações de solo, a visualização das situações descritas não é simples e que o uso de uma metodologia levando em consideração todas as restrições do problema é importante. O próximo passo do trabalho será a realização de testes computacionais para validação do novo modelo, utilizando instâncias maiores. Dependendo da complexidade, serão também desenvolvidas abordagens heurísticas para tratar o problema. Abordagens heurísticas também serão necessárias em situações onde um replanejamento for necessário. A metodologia desenvolvida pode auxiliar no processo de tomada de decisão independente se o decisor é um usuário ou o proprietário do sistema espacial. Sob a perspectiva de um usuário que tenha à sua disposição diferentes fornecedores de produtos espaciais, onde cada fornecedor oferece uma lista de produtos com características específicas, o decisor pode utilizar a metodologia proposta para auxiliá-lo na decisão sobre qual o fornecedor poderá atender às suas necessidades em termos de tempo e características da sua demanda. Sob a perspectiva do proprietário do sistema, visando atender um conjunto de demandas de dados espaciais com características diferentes, a metodologia proposta pode auxiliar no planejamento para que a aquisição dos dados maximize o atendimento das demandas."
	}
