{
    "id": 51,
    "titulo": "análise do ruído de medida da pose compensada de um dispositivo de realidade virtual sobre plataforma 6dof",
    "autor": "natan l. viana, gabriela w. gabriel",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2020/st/ST_10_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Quando um equipamento de realidade virtual (do inglês, Virtual Reality - VR) é utilizado em aplicações de simulação em conjunto com uma plataforma de movimento, as leituras dos sensores advindos do equipamento de VR correspondem a uma composição das leituras do movimento da cabeça do usuário e do movimento da plataforma. Uma questão que surge neste cenário é como separá-las ou compensá-las de forma que o usuário possa manter suas referências visuais. Há na literatura soluções de código aberto que realizam essa compensação, porém com um nível perceptível de ruído, o que provoca certo desconforto visual, especialmente notável quando a plataforma está parada. Este artigo procura identificar as possíveis fontes desse ruído para o equipamento HTC Vive ProTM, visando investigar os fatores que o afetam e o efeito de cada um deles na posição compensada. A motivação por trás dessa análise é a possibilidade de reduzir a sensação de enjoo causada pelo uso prolongado dos equipamentos de realidade virtual. Essa implementação é especialmente interessante para o treinamento de pilotos, onde o realismo e a imersão são fundamentais para alcançar um treinamento eficiente.",
    "texto": "I. INTRODUÇÃO Os equipamentos de realidade virtual (do inglês, Virtual Reality - VR), inicialmente utilizados em ambientes de jogos, têm se tornado grandes aliados no treinamento de pilotos, uma vez que permitem exercitar situações de risco sem causar danos físicos. No entanto, para que este ambiente possa de fato permitir uma imersão realística da situação de voo, faz-se necessário dotar o ambiente do simulador com uma plataforma de movimento, permitindo aliar a sensação visual que o equipamento de VR promove à sensação física real do piloto. Diferentes estruturas podem ser utilizadas para esse fim, como, por exemplo, o sistema hexapod [1] e o uso de um braço robótico 7DoF [2], entre outras estruturas. Neste artigo, utilizamos uma estrutura composta por um dispositivo de VR HTC Vive ProTM acoplado a uma plataforma 6DoF, pela simplicidade e custo envolvidos. Plataformas do tipo 6DoF permitem a movimentação do usuário, localizado no espaço tridimensional, através de seis graus de liberdade, sendo três deles correspondentes aos movimentos de translação e três correspondentes aos movimentos de rotação. Há trabalhos na literatura que descrevem o uso desse tipo de plataforma em simuladores de aeronaves, como em [3]. A posição do dispositivo de VR é então composta por dois vetores: um que determina a posição do piloto que está fixo na plataforma (posição do controller) e outro que determina a posição da sua cabeça (posição do headset), que move-se em relação à plataforma. Neste ponto, surgem dois problemas decorrentes do ambiente escolhido: o primeiro deles corresponde à decomposição adequada de cada uma das componentes (headset e controller); o segundo corresponde a identificar as fontes de ruído para posteriormente caracterizá-los e filtrar as leituras de posição e orientação do corpo do piloto e da cabeça do piloto. Esses dois problemas levam a uma medida de posição equivocada e, se não forem adequadamente tratados, levam a uma sensação de desconforto conhecida como simulation sickness, uma vez que implicam em diferenças entre o ambiente virtual e o real, como apresenta [4]. Neste sentido, o objetivo deste trabalho é apresentar uma proposta para a separação das componentes de movimento, denominada posição compensada, e avaliar os ruídos que incidem em cada uma delas para, futuramente, obtermos uma caracterização adequada para aplicação em um ambiente de simulação de voo. II. O EQUIPAMENTO DE VR O dispositivo de VR HTC Vive ProTM consiste em um headset, H, um controller, C, e duas fontes emissoras de luz (lighthouses), L1 e L2. Estas últimas emitem de maneira síncrona feixes sequenciais de luz infravermelha na horizontal e na vertical, na frequência de 60Hz, com um flash de referência entre cada emissão. Estas emissões são captadas por vários fotodiodos que ficam tanto em H quanto em C (Figura 1). Cada sensor retorna uma informação de ângulo horizontal e ângulo vertical, calculado com base nos tempos que demoraram para ser atingidos pelos feixes horizontal e vertical desde o último flash. O problema de determinar a pose dos sensores a partir das fontes emissoras de luz é um problema conhecido como Perspective-n-Point (PnP), em que as informações dos sensores são combinadas para obtenção da posição e da orientação de cada um dos dispositivos rastreados. Este problema pode ser facilmente resolvido através de algoritmos, como o apresentado em [5]. Além disso, é importante observar que a própria unidade de medida inercial (IMU) do headset possui acelerômetros e giroscópios embutidos, com capacidade de atualização de leitura muito maior do que as das fontes L1 e L2. Deve-se notar, porém, que as leituras da IMU são acompanhadas de erro de integração, por construção. Desta forma, as leituras de posição e orientação do headset são obtidas através de uma fusão sensorial realizada pelo equipamento de VR, a qual não temos acesso. A taxa de leitura da pose de cada dispositivo é de fH = 1120Hz para o headset e fC = 369Hz para o controller. No entanto, antes de apresentar esses dados em tela, faz-se necessário realizar uma compensação da pose do headset e uma avaliação dos ruídos advindos de cada uma das medidas às quais temos acesso, o que será realizado nas seções a seguir. III. POSE COMPENSADA Considere as poses medidas de H e C. Desejamos encontrar a pose compensada de H em relação a C medida a partir de um referencial inercial fixo em uma das fontes de luz. Sendo CH o vetor que liga a posição de C até a posição de H, a posição compensada de H pode ser escrita como: CH' = R(φ, θ, ψ) * CH onde R(φ, θ, ψ), a ser apresentada mais adiante, representa a rotação de C medida a partir do referencial escolhido e escrita em função dos ângulos de rotação (φ, θ, ψ) em torno dos eixos x, y e z, respectivamente. Nota-se, neste ponto, que existem diferentes softwares disponíveis na literatura que realizam a compensação desejada, incluindo softwares gratuitos. Desta forma, a posição compensada do headset corresponde a um conjunto composto pela medida de sua posição relativa (CHx, CHy, CHz) e da orientação (φ, θ). A implementação computacional utiliza a teoria de quaternions, onde q = a + bi + cj + dk é um quaternion que representa a orientação de C, e q* é seu conjugado, de maneira que: q* = a - bi - cj - dk De posse da medida de translação (x, y, z) e da medida de orientação (φ, θ), que compõem a pose compensada, verificamos que a imagem do headset apresenta variações perceptíveis ao olho humano (jitter), o que incorre em problemas de simulation sickness. Através de uma verificação simples, medindo-se cada um dos conjuntos (posição e orientação) isoladamente, observou-se que somente há jitter quando há medida da posição compensada do headset. Além disso, analisando-se o espectro em frequência da posição compensada (Fig.2), em que H e C foram mantidos parados em um conjunto de 1800 medidas, notamos que esse ruído assemelha-se a um ruído branco. Essa observação nos remete ao uso de um Filtro de Kalman futuro para o tratamento das medidas realizadas, mas que, por enquanto, foge do escopo deste trabalho. A figura foi gerada aplicando a Transformada Rápida de Fourier sobre o conjunto de medidas. Nela, o eixo x mostra frequências até a metade da frequência média de amostragem, e o eixo y mostra as magnitudes dos ruídos das posições compensadas de H, denotadas aqui por (CHx, CHy, CHz). A faixa de frequências avaliada é delimitada pela frequência de leitura do simulador, no caso, de 45Hz. IV. ANÁLISE DO RUÍDO DE MEDIDA Esta seção tem como objetivo apresentar os fatores que podem afetar o ruído de medida de maneira significativa, bem como propor uma forma de embutir essa influência na medida de P. Ao obtermos conjuntos de medidas sucessivas para a posição P, observamos que três fatores influenciavam as variâncias das medidas realizadas: Orientação do dispositivo rastreado (headset e controller) em relação às fontes emissoras de luz; Oclusão dos sensores embutidos nos dispositivos rastreados; Distância do dispositivo rastreado para as estações emissoras de luz. Para cada um desses fatores, descrevemos a seguir seus efeitos sobre o ruído da medida de P. A. Orientação Relativa Em ensaios preliminares, verificou-se que, apesar da posição medida de C e H separadamente se assemelharem a um ruído branco, as orientações medidas apresentavam ruído maior em baixas frequências, como mostra a Fig.3. Mesmo assim, P, que depende da posição e da orientação de C e H, se assemelhava a um ruído branco. Esse fato, adicionado ao fato do jitter para essas medidas ser imperceptível ao olho humano, nos permite considerar uma primeira hipótese de que a variância referente às medidas de orientação é muito pequena se comparadas à variância das medidas de posição. A Fig.3 destaca a faixa de frequências em que a média do ruído não foi nula. Com isso, podemos escrever P como um vetor e, consequentemente, sua variância como: Var(P) = R * Var([φ, θ, ψ]) * R^T onde R1, R2 e R3 são vetores coluna e φ¯ = E(φ), θ¯ = E(θ), ψ¯ = E(ψ), e R¯ é a matriz de rotação construída com os valores médios dos ângulos φ, θ e ψ. Assim, podemos escrever a variância de P como sendo: Sob a hipótese de que a matriz de variância de CH não muda significativamente com a mudança de orientação do dispositivo rastreado. Para testar a hipótese, C e H foram posicionados sobre uma superfície giratória de frente para uma das fontes emissoras de luz, enquanto a outra foi mantida desligada. Foram realizados ensaios considerando pequenas rotações de -30°, -22,5°, -15°, -7,5°, 0°, 7,5°, 15°, 22,5°, 30° em torno do eixo de rotação da superfície, de forma que as rotações não alterassem a quantidade de sensores visíveis pela fonte emissora de luz e as distâncias envolvidas permanecessem praticamente inalteradas. Pequenas alterações nessas distâncias são esperadas uma vez que o conjunto rastreado não fica perfeitamente sobre o eixo de rotação da superfície giratória. Em cada ensaio, foram realizadas 1800 medições e foram calculados os valores médios e a variância da posição compensada P. A Fig.4 mostra a comparação entre as componentes da variância de P nos eixos x, y e z, dadas, respectivamente, por Var(Px), Var(Py) e Var(Pz), medidas e estimadas. As estimativas foram realizadas através de (6), considerando as estatísticas de CH para uma rotação nula e a matriz R calculada para φ = 0°, θ = 0° e θ assumindo valores no intervalo de (-36°, 36°). Além disso, de acordo com [6], o plano x-z do sistema de coordenadas da aplicação é levemente inclinado com relação ao solo, o que faz com que a rotação medida fisicamente nos ensaios não seja uma rotação perfeita em torno do eixo y. Portanto, alguma discrepância é esperada. Destes resultados, podemos concluir que a variância da medida aumenta à medida que os dispositivos rastreados giram em torno de seu eixo y, tanto para ângulos θ > 0 quanto para ângulos θ < 0. Além disso, uma informação importante que este ensaio nos dá é que, mesmo quando os efeitos de oclusão e distância para a fonte emissora de luz (lighthouses) não são levados em conta, o menor ruído sobre a posição medida ocorre quando o dispositivo rastreado está posicionado alinhado e de frente para a lighthouse. Essa informação possibilitará futuramente um melhor posicionamento delas no ambiente de simulação. Para computar o efeito da mudança de orientação de uma maneira mais geral, seria necessário conhecer como se comporta a matriz de covariância de dimensão 6 dada por (CHx, CHy, CHz, φ, θ, ψ), informação não disponibilizada pelo fabricante. Tomar a média móvel dos ângulos medidos, com tantos valores quanto necessário para fazer a variância dos ângulos ficar suficientemente pequena, poderia trazer maior adequação. Alternativamente, poderíamos trabalhar com a caracterização de CH e q separadamente, em vez de P. Nesse cenário, a filtragem seria feita antes da compensação de movimento. Essas são linhas a serem discutidas em trabalhos futuros de caracterização dos ruídos de medida. Por hora, é importante verificar que há influência (baixa, porém perceptível) da ordem de 10^-7 nas medidas de P em decorrência da orientação do dispositivo rastreado. B. Oclusão Em [7], são comparadas várias implementações de soluções para o problema PnP. Em decorrência dessa análise, duas características apontadas por [7] são de bastante relevância para a caracterização dos ruídos decorrentes das medidas em questão. A primeira delas é que os erros de medida, em geral, diminuem conforme cresce o número n de sensores. A segunda é que essa relação não faz distinção entre quais sensores estão visíveis, só importa quantos. Dessa forma, é esperado que a posição estimada de H seja menos ruidosa do que a de C, uma vez que H possui 32 sensores contra os 22 de C. Além disso, a frequência de atualização da medida de fH > fC, o que permitirá uma melhor estimativa da medida de H em relação à medida de C. Para verificar essas relações no dispositivo de VR da HTC Vive ProTM, tanto o controller quanto o headset foram dispostos em uma mesma orientação qualquer. Observamos que a variância do ruído sobre C é de uma ordem de grandeza maior do que a variância do ruído de H, exceto em casos muito específicos, como quando o usuário está olhando diretamente para o chão ou com as mãos sobre o headset. Os valores obtidos foram Var(C) ≈ 10^-7 e Var(H) ≈ 10^-8. Sendo assim, a Var(ΔCH) pode ser aproximada pela Var(C). Isso é vantajoso, pois H se move de maneira imprevisível, de acordo com a cabeça do usuário, enquanto C se move junto com a plataforma, de acordo com o que é comandado a ela. Uma caracterização importante relacionada à oclusão é verificar como o ruído que incide sobre a posição compensada P varia de acordo com o grau de oclusão dos sensores, medido em quantidades de sensores não visíveis pela fonte emissora de luz. Considerando as características apresentadas por [7], estruturamos o experimento com o controller C em uma posição fixa (parado), de forma que o número máximo de sensores estejam visíveis para a fonte de luz (lighthouse), no caso, 11 sensores. Assim, bloqueamos com uma fita escura os sensores em quantidades crescentes através de uma escolha aleatória. Foram realizadas 1800 medidas para cada quantidade de sensores ocultos. O resultado do experimento é mostrado nas Fig.5 e 6. Estas mostram que há uma tendência de aumento do ruído sobre a posição compensada com a oclusão, mas não mostra uma tendência clara para a orientação compensada, embora, para o segundo caso (orientação), a ordem de grandeza das variações seja significativamente maior. Deve ser notado que a quantidade de lighthouses, bem como a sua disposição no ambiente de simulação, influem diretamente na quantidade de sensores obstruídos. Em uma composição de duas lighthouses, em que conseguimos manter uma boa cobertura dos sensores pelas lighthouses, uma vez que em um ambiente de simulação as variações da plataforma serão consideradas pequenas, este efeito poderia ser desprezado. Para outros casos, em que há variações significativas da orientação dos controllers em relação às lighthouses, ou em casos em que se dispõe de apenas uma lighthouse, os efeitos da oclusão não são desprezíveis, exceto para pequenos ângulos em torno de uma posição central, e devem ser cautelosamente avaliados. C. Distância Por fim, o efeito da distância sobre a variância da medida de P parece ser o mais simples de ser equacionado. De fato, [6] indica que a Cov(C) varia de acordo com a posição do dispositivo rastreado em relação à lighthouse, aumentando com o aumento da distância entre eles. Para isso, devemos estimar a variância Cov(C) em função das coordenadas (Cx, Cy, Cz) de C em relação a uma das lighthouses e Cov(C) a matriz de covariância de C. A composição apresentada na Fig. 7, esquematizada na Fig. 8, foi utilizada para realizar as medidas das componentes de C. A partir dessas medidas, observamos experimentalmente (valores apresentados na Tabela I para as medidas nos eixos x e y e estendidos para o eixo z) que há uma proporcionalidade entre os quadrados das medidas de Cx, Cy e Cz e suas variâncias, sendo verificados experimentalmente com valores numéricos, em que um exemplo é apresentado na Tabela I com medidas nos eixos x, y e z. Desta forma, temos que Cov(C)x = Var(Cx), Cov(C)y = Var(Cy) e Cov(C)z = Var(Cz), sendo o primeiro termo das igualdades o valor medido e o segundo o valor estimado para cada componente de C. Assim, definindo α = tan^(-1)(Cy/Cx), teremos que Conforme [6], observa-se que há um direcionamento das elipses que determinam as variancias das medidas em torno de cada ponto do plano x-y, estando seu eixo maior, aproximadamente, sobre a reta que une a posição de C com a posição em que se encontra a lighthouse, conforme Fig. 8. Então, onde Var_xy = Var(Cx) - Var(Cy) e Cov_xy = Cov(Cx, Cy). Após algumas manipulações algébricas, podemos reescrever a equação (9) como que das relacões (7) e (8) levam a  Analogamente, todos os demais termos cruzados da matriz de covariância podem ser estimados a partir das variâncias de Cx, Cy e Cz. Os termos da diagonal, por sua vez, podem ser estimados a partir das distâncias Cx, Cy e Cz e da constante de proporcionalidade k(x; y; z) que relaciona as igualdades em (7). Matematicamente, para caracterizar a variância na medida de P decorrente da distância que a lighthouse se encontra do dispositivo rastreado (headset ou controller), é importante estabelecer uma constante de proporcionalidade adequada. Uma hipótese a ser verificada futuramente é a de que k varie com o quadrado da distância, indicando o uso inclusive de coordenadas esféricas em vez de coordenadas cartesianas. V. CONCLUSÕES O trabalho realizado apresentou um equacionamento da posição compensada da imagem de um dispositivo móvel de VR em relação a uma plataforma não inercial. Essa construção tem interesse prático na implementação de simuladores de voo necessários para o treinamento de pilotos, uma vez que permite agregar ao ambiente de simulação um maior realismo. Nesse equacionamento, verificamos que o conjunto de VR comercial apresenta ruído considerável no visor, o que leva a uma condição de simulation sickness. Dessa forma, este trabalho apresenta um estudo a respeito das características que deverão ser consideradas na determinação do ruído das medidas disponibilizadas pelo conjunto de VR, com a finalidade de filtrá-las e reduzir o efeito incômodo decorrente da imagem tremula. Verificamos que influenciam diretamente nas medidas da posição compensada a orientação do dispositivo rastreado em relação à fonte emissora de luz, a distância que este se encontra da fonte emissora de luz e a oclusão de parte dos sensores dos dispositivos rastreados, com ênfase nesta última em decorrência das magnitudes das variâncias obtidas em cada caso. Dados esses fatores, o próximo passo para a implementação do simulador é tratar as medidas obtidas de forma a reduzir o ruído na imagem apresentada ao usuário. Para isso, primeiro o ruído será caracterizado, sob a luz dos aspectos analisados, para posteriormente implementarmos uma filtragem adequada. "
}