	{
		"id": 53,
		"titulo": "formulação numérica unidimensional de linhas de transmissão não lineares giromagnéticas",
		"autor": "Ana Flávia Guedes Greco, Fernanda Sayuri Yamasaki, José Osvaldo Rossi, Elizete Gonçalves Lopes Rangel, Joaquim José Barroso, Edl Schamiloglu",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2020/st/ST_08_3.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 1,
		"resumo": "Geração de RF por linhas de transmissão não lineares (LTNLs) vem sendo objeto de estudo há décadas, e experimentos com essas linhas demonstraram sua operação bem sucedida nas bandas L (1–2 GHz) e S (2–4 GHz), permitindo assim diversas aplicações, como em sistemas embarcados no espaço usando sistemas compactos sem emprego de tubos eletrônicos a vácuo em satélites SARs, por exemplo, e em plataformas móveis de defesa. Com essa motivação, propõe-se neste artigo estudar os processos não lineares produzidos por essas linhas, e aqui descritos por um conjunto unidimensional (1D) de equações diferenciais, e comparar os resultados da formulação matemática com aqueles obtidos em um simulador de circuitos do tipo SPICE. ",
		"texto": "I. INTRODUÇÃO Linhas de transmissão não lineares (LTNLs) podem ser (a) discreta, composta por uma seção periódica de indutores (L) e/ou capacitores (C) não lineares ou (b) contínua, também conhecida como giromagnética, composta por um material cerâmico ferrimagnético à base de ferrita. E apesar destas linhas serem conceitualmente diferentes, seu princípio de operação é o mesmo, gerando na saída uma onda de choque com tempo de subida reduzido para a faixa de alguns nano segundos ou mesmo centenas de pico segundos [1–5]. Essa modificação no pulso, em linhas discretas deve-se à dependência não linear da permissividade dielétrica com a tensão e em linhas contínuas à dependência da permeabilidade magnética com a corrente. Contudo, neste artigo os estudos serão concentrados na linha contínua, uma vez que estudos feitos no Brasil e exterior, por meio de simulações numéricas computacionais e de experimentos práticos vêm demonstrando novas possibilidades para a conversão direta de pulsos em oscilações de RF nas bandas L (1–2 GHz) e S (2–4 GHz) utilizadas em diferentes aplicações, como por exemplo, em satélites radar SAR (Synthetic Aperture Radar) para sensoriamento remoto, plataforma móveis de defesa, na interrupção da comunicação em campos de batalhas e veículos espaciais, utilizando um sistema compacto com tamanho e peso reduzidos [6–11] Com essa motivação, propõe-se neste trabalho modelar e analisar linhas de transmissão não lineares giromagnéticas com base nas soluções analítica e numérica de equações diferenciais ordinárias no domínio do tempo, onde as variáveis de estado consideradas são a corrente Ik, a tensão Vk e a magnetização Mk, em cada seção k. Vale ressaltar que em todos os trabalhos até então consultados [12–16] os valores característicos dos componentes de cada seção são repetidos periodicamente ao longo da linha, portanto, constituindo uma das contribuições deste trabalho, as equações diferenciais foram deduzidas em uma formulação geral, em que os elementos do circuito são indexados individualmente. Assim, a cada componente pode ser atribuído um valor específico ou uma característica específica requerida de projeto. Além disso, deve-se notar que em muitas simulações de LTNLs é necessário um elevado número de seções, o que torna impraticável o uso de simuladores de circuito do tipo Spice (Simulation Program with Integrated Circuit Emphasis), utilizado neste trabalho como comparativo ao modelo aqui proposto. Por outro lado, tal número de seções e suas variações de topologia são facilmente tratadas com a formulação matemática a ser efetivada em um sistema de equações diferenciais aqui apresentado e implementado no software Mathematica [17]. Finalmente, ressalta-se que esta comparação (LT-Spice e Mathematica) proposta neste trabalho é importante do ponto de vista conceitual, mas pouco discutida na literatura. II. FORMULAÇÃO NUMÉRICA Nas últimas décadas, várias formulações foram desenvolvidas por outros pesquisadores [12–16] para descrever com acurácia os processos não lineares em LTNLs giromagnéticas. Dentre estas formulações, a mais interessante foi proposta por Dolan [12] que modela uma linha contínua como uma linha discreta LC em série com fontes de tensão, determinadas pela variação do fluxo de magnetização da ferrita, onde cada fonte de tensão é acoplada às seções da LTNL, conforme ilustra a Fig. 1 Em seu trabalho, Dolan [12] considera um caso particular para propagação de ondas em uma linha coaxial, onde os campos magnético e elétrico gerados não possuem componentes longitudinais, chamado de modo TEM (Transverse Eletromagnetic). Logo, considerando o modo TEM, as variações espaço-temporais da corrente e tensão podem ser escritas através das equações de Maxwell (leis de Ampère e de Faraday) [12] onde I representa a corrente, V a tensão, C0 e L0 a capacitância e a indutância por unidade de comprimento, respectivamente e ϕ o fluxo circunferencial por unidade de comprimento, que pode ser expresso na linha pela equação abaixo quando se consideram também os efeitos da magnetização da ferrita [12] De (3), temos que μ0 representa a permeabilidade do vácuo (4π x 10-7 H/m), dm e di os diâmetros externo e interno do cilindro coaxial de ferrita e dM dt a taxa de variação da magnetização, obtida diretamente da equação giromagnética unidimensional de Landau – Lifishitz – Gilbert (LLG), que descreve o movimento de precessão amortecido dos momentos de dipolo magnético da ferrita e que ocorre ao longo da linha, conforme o pulso de corrente se propaga, induzindo oscilações de alta frequência, representado pela Fig. 2 [18] e por (4) [13]: onde α representa a constante de amortecimento da precessão (0,1 – 1,0), γ a razão giromagnética do elétron (1,76 x 1011 rad/s/T), Ms a magnetização na saturação e H o campo magnético definido em termos do diâmetro efetivo do anel de ferrita e corrente I como [13] Contudo, considerando os efeitos da magnetização da ferrita, representadas pela equação do fluxo magnético, obtém-se uma formulação unidimensional (1D) com três equações e três incógnitas, para as seções inicial, intermediária e final, acoplando as duas equações de Maxwell à equação giromagnética LLG: onde, N representa o número de seções da linha, k uma seção genérica, Vk a tensão no k-ésimo nó, Vs a tensão da fonte podendo ser um sinal senoidal, ou uma forma arbitrária de pulso (trapezoidal, triangular, etc.), Ik a corrente no k-ésimo ramo série, Mk a magnetização do k-ésimo elemento, Rs e Rl a resistência no gerador e na carga, respectivamente, Lk a indutância por seção, expressa por: L L k 0. l N  e Ck a capacitância por seção, expressa por: C C k 0. l N  , onde l representa o comprimento da linha. III. SIMULAÇÃO NUMÉRICA Para validar o desempenho da formulação proposta, foi utilizada como referência o esquema de uma linha giromagnética implementada em um simulador de circuito do tipo SPICE, conforme ilustra a Fig. 3 [19] Neste esquema, as fontes de tensão (elementos não lineares) em série com o indutor linear, proposto por Dolan [13] são representadas por indutores não lineares definidos por [19]: onde Ls representa a indutância da linha na saturação por seção, µr a permeabilidade relativa do material magnético e Is a corrente de saturação da ferrita NiZn. Já na formulação proposta neste trabalho, as fontes de tensão são representadas pela equação do fluxo magnético, conforme mencionada na seção anterior, com base nos seguintes parâmetros apresentados na Tabela 1. Além disso, o conjunto de equações foi resolvido no software Mathematica, através de um método iterativo, com as seguintes condições iniciais: IV. RESULTADOS DA SIMULAÇÃO NUMÉRICA As Fig. 4 (a) e (b) mostram a comparação entre a simulação de circuito no LT-Spice (Linear TechnologySpice) e a simulação numérica no Mathematica, para o pulso de entrada (curva preta) e saída (curva vermelha). Analisando as Fig. 4 (a) e (b) é possível observar uma pequena diferença entre as profundidades de modulação da tensão (VMD) para o pulso resultante na saída (curva vermelha) entre as duas simulações, sendo mais profundo para a simulação feita no LT-Spice. Esta diferença nos resultados produzidos pelas duas simulações (LT-Spice e Mathematica) pode ser justificada pelo tipo de abordagem utilizada para descrever o material ferrimagnético não linear (ferrita). No caso do LT-Spice, a ferrita é representada for uma indutância não linear, enquanto na formulação analítica utiliza-se a equação giromagnética LLG. Além disso, em ambas simulações se nota que o pulso resultante na saída da linha (curva vermelha) tem um tempo de subida reduzido quando comparado ao do pulso de entrada (curva preta). Este efeito é conhecido como compressão de pulso ou pulse sharpening e é causado pela redução da permeabilidade da ferrita. Para a simulação no LT-Spice esta redução é de aproximadamente 0,57 ns e com um tempo de atraso de aproximadamente 11,2 ns e para a simulação no Mathematica, esta redução é de aproximadamente 0,47 ns e com um tempo de atraso de 12 ns. Ressalta-se ainda que este tempo de atraso τ é causado pelo tempo de propagação do pulso através da linha e determinado por [13]: onde N representa o número de seções usado para a simulação. Também é possível observar que em ambas as simulações, o pulso da saída (curva vermelha) tem um formato semelhante a uma onda de choque com oscilações de RF sobrepostas, sendo gerada pela precessão dos momentos de dipolos magnéticos da ferrita quando excitados pelo campo azimutal criado pelo pulso de corrente, cujo campo interage com o campo axial magnético externo e são reforçadas pela não linearidade do material magnético. Esta precessão induz uma oscilação de alta frequência no pulso à medida que se propaga através da linha. Essas oscilações de RF, na saída do pulso, podem ser expressas através da análise do domínio da frequência (FFT) representada na Fig. 5. Observa-se que para a formulação proposta é possível alcançar frequências de oscilações em torno de 0,8 GHz, mostrando-se um resultado bastante promissor para aplicações que exigem frequências acima de 0,5 GHz. V. CONCLUSÃO Para analisar detalhes importantes das LTNLs giromagnéticas, foi apresentada nesse trabalho uma formulação numérica unidimensional baseada nas equações de Maxwell, para corrente e tensão, acopladas à equação giromagnética LLG, que descreve a dinâmica de precessão dos momentos de dipolos magnéticos do material que preenche a estrutura coaxial da linha. A formulação proposta no Mathematica foi validada comparando os resultados com o simulado no LT-Spice. Além disso, para a simulação proposta neste trabalho são necessárias algumas informações relacionadas à equação do fluxo magnético que não foram fornecidas em [19], como a magnetização de saturação, diâmetros internos e externos da ferrita, sendo então, necessário fazer alguns ajustes. Contudo, a formulação apresentada se mostra bastante promissora, o que permitirá o aprofundamento na investigação do desempenho das linhas giromagnéticas em função dos parâmetros que influenciam a geração de RF e das limitações práticas verificadas experimentalmente, tais como: as perdas, não uniformidade da polarização magnética e a variação da temperatura. Além disso, através da análise do domínio da frequência feita para a formulação proposta, há indicativos que os efeitos produzidos pelas LTNLs giromagnéticas despontam para a possibilidade de geração de RF nas bandas L e S, variando os parâmetros da linha, tais como: a amplitude do pulso de entrada, aumentando-a consideravelmente ou as dimensões da ferrita (diâmetro interno e externo), diminuindo-a ainda mais. E finalmente, vale ressaltar que simuladores de circuito como LT-Spice também podem ser usados para analisar linhas giromagnéticas no domínio do tempo, o que de certa forma facilita a resolução do problema. Entretanto estes simuladores não são indicados quando há necessidade de um número elevado de seções, como por exemplo, no estudo da excitação de sólitons em LTNLs, que requer tipicamente linhas com 200 seções. Por outro lado, através das simulações numéricas, conforme proposta neste trabalho, é possível alterar os parâmetros com maior facilidade e rapidez. Além disso, o desenvolvimento de códigos propicia melhor análise e entendimento dos fenômenos envolvidos, auxiliando em muito o estudo e o projeto de linhas giromagnéticas para operação em alta frequência."
	}
