	{
		"id": 54,
		"titulo": "estudo preliminar teórico de filtro compressor de pulso totalmente fotônico",
		"autor": "André Paim Gonçalves, Renan Miranda Richter, Felipe Streitenberger Ivo, Alessandro Roberto Santos, Robson Ribeiro Carreira, Olympio Lucchini Coutinho",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2020/st/ST_09_3.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 1,
		"resumo": "Este artigo propõe um estudo breve e teórico para verificar a possibilidade de uso de laços dispersivos com a técnica de auto-homodinagem óptica para realizar compressão de pulso linearmente modulado em frequência de radares (Linear Frequency Modulated - LFM). O dispositivo proposto para estudo pretende superar as limitações dos dispositivos equivalentes implementados pela eletrônica tal como o filtro baseado em propagação de ondas acústicas de superfície. Essas restrições são em relação a largura de banda de RF, frequência da portadora do sinal radar e largura de pulso. Foi feita uma modelagem numérica do dispositivo proposto. Os resultados numéricos indicam a possibilidade de emprego do compressor de pulso fotônico em radares que estão sendo desenvolvidos com grade produto da largura de banda pela largura do pulso (Time Bandwidth – TBW).",
		"texto": "I. INTRODUÇÃO A técnica de compressão de sinais pulsados LFM de rádio frequência (RF), com o uso de meio dispersivo de propagação, têm sido amplamente utilizada nos sistemas de radares modernos para melhorar a resolução de seus alcances [1]. A compressão de pulso é implementada com o auxílio de um filtro casado. Esse filtro opera como uma linha de atraso empregando SAW (Surface Acoustic Wave). As componentes espectrais do sinal LFM sofrem retardos seletivos, isto é, a que foi gerada primeiro sofre menor retardo e a última recebe o maior retardo, de modo que todas cheguem ao mesmo tempo na saída da linha de retardo [2]. A filtragem feita empregando SAW garante uma otimização da relação sinal ruído (SNR), tornando o receptor robusto a ruídos e a com melhor resolução espacial do pulso. Um filtro típico que emprega linhas de retardo tem limitações tais como um pico de correlação de banda larga e baixa supressão de lóbulo lateral [1] e [2]. Por conseguinte, é desejável encontrar um filtro para compressão de pulsos de micro-ondas que ultrapassem essas limitações, bem como a limitação de banda de RF que estes têm. Por outro lado, na atual fase de desenvolvimento de sistemas de radar de banda larga, uma frequência central com dezenas ou mesmo centenas de GHz são muitas vezes necessárias [1] e [2]. Devido à limitação da largura de banda dos circuitos eletrônicos, o processamento de pulsos de micro-ondas LFM com alta largura de banda de frequência e grande duração é uma tarefa difícil [3] e [4]. A métrica chamada de produto TBW (Time -Bandwidth) é muito utilizada para inferir a capacidade de resolução espacial de um radar. Com o avanço da tecnologia baseada eletrônica digital, o processamento de sinais de micro-ondas que utilizam técnicas de processamento digital de sinais (DSP) tem demonstrado grande evolução [5] e [6], mas o desempenho ainda é limitado devido à baixa velocidade de amostragem em relação às bandas de frequências necessárias em radares modernos. A Microwave Photonics (MWP) surgiu nos anos 70 do século passado. Ela é uma área do conhecimento humano que emprega técnicas de fotônica para gerar, transmitir e processar sinais de RF. A MWP visa superar algumas limitações sofridas pela eletrônica quanto à banda de RF, às portadoras de RF maiores, ao volume, ao peso, ao consumo de energia e à velocidade de resposta [7]. O intuito desse trabalho é apontar as possibilidades e limitações do emprego de MWP para resolver o problema de compressão de pulsos de sinais de RF com modulação linear de frequência. O sistema proposto emprega um laço dispersivo e conversão de fase em intensidade somente de uma banda lateral do sinal óptico modulado pelo sinal de interesse. Essa conversão é conhecida com auto-homodinagem óptica [8]. A vantagem de utilizar o laço dispersivo é de gerar um efeito multiplicativo na dispersão óptica. A auto-homodinagem permite a saída do sistema somente do sinal que sofreu a compressão na banda base. Para verificar a viabilidade desse sistema, foi feita uma modelagem numérica do funcionamento e de suas limitações. II. MODELAGEM MATEMÁTICA DO COMPORTAMENTO DO COMPRESSOR DE PULSOS TOTALMENTE FOTÔNICO Um sinal óptico gerado por um diodo laser com o campo elétrico igual a: sendo que a amplitude de campo elétrico do sinal proveniente do diodo laser é 𝐸ை, sua frequência angular 𝜔ை, o tempo é 𝑡 e a fase é 𝜑௜, incide em um modulador de fase. Visando facilitar à análise do campo 𝐸ሬ⃗(𝑡)ை, considera-se a fase 𝜑௜ = 0 e sua orientação coincidente com a do corte que apresenta a melhor resposta do cristal de LiNO3 do modulador de fase, bem como do eixo cartesiano 𝑥ො. Considerando um sinal elétrico de RF, 𝐸ሬ⃗(𝑡)ோி, incidindo na entrada de RF de um modulador de fase, é definido como: onde a amplitude do campo elétrico do sinal de RF incidente é representado por 𝐸ோி, sua frequência angular é dada por 𝜔ோி, o tempo sendo apresentado por 𝑡 e seu valor está compreendido de –T/2 < t < T/2, isto é, a duração do sinal de RF e a fase do sinal de RF que varia no tempo sendo 𝜑ோி(𝑡) = 𝜇𝑡ଶ. O campo elétrico é considerado orientado no eixo x, coincidente com a orientação do cristal de LiNO3 do modulador de fase. No modulador de fase, o sinal óptico sofre uma alteração de fase na forma: Sabendo-se que:  onde V é o potencial elétrico, E é campo elétrico e d é a distância entre os eletrodos do cristal de LiNO3 do modulador de fase. O índice de modulação m é definido como: sendo 𝑉 గ é a tensão de meia onda do modulador de fase. Reescrevendo (3) de forma simplificada em função das séries de Bessel a partir de (4), (5) e (6) e considerando a condição especial de operação do modulador conhecida como regime de operação de pequenos sinais, em que m<<1, pode ser expressa por (7). Desta forma o sinal de saída do modulador no regime de operação de pequenos sinais pode ser expresso por: sendo que as funções de Bessel de primeira espécie e ordem 0 e 1 são respectivamente 𝐽଴(𝑚) e 𝐽ଵ(𝑚). Sabendo-se 𝜔௠௢ௗ = 𝜔ை + 𝜔ோி. O sinal óptico na saída do modulador de fase apresenta as bandas laterais iguais em amplitude e simétricas em fase, o que ocasiona um sinal DC na saída do fotodetector se as componentes espectrais não sofrerem mudanças na fase ou na amplitude. Este sinal de saída do modulador de fase é então acoplado a uma grade de Bragg uniforme em fibra óptica conforme Fig. 1 e sintonizada no ponto operação da grade indicado na Fig. 2. A sintonia ocorre quando o fasor da portadora óptica fica posicionada no limite superior da curva de refletividade da grade de Bragg uniforme ideal (Stop Band) e representada pela função degrau (tracejada de cor vermelha). Os fasores que apresentam comprimento de ondas compreendidos na stop band serão refletidos e os demais serão transmitidos. Os fasores com o numeral 2 não sofrerão conversão de modulação de fase em intensidade, pois estes não sofreram mudanças de fase e/ou de amplitudes suficientes para esta conversão. O sinal óptico quando se propaga na FBG tem a portadora e uma de suas bandas laterais refletidas, conforme a Fig. 2, e a outra banda lateral é transmitida. Esta última banda lateral será acoplada no laço dispersivo e no fotodetector. É importante observar que a FBG uniforme é projetada para possuir um alto coeficiente de refletividade óptica, sendo praticamente constante para a faixa de frequência equivalente à de RF na região da stop band. A sintonia do filtro óptico formado pela grade de Bragg é feita de modo que a frequência angular do diodo laser 𝜔ை assuma um valor tal que subtraído do sinal de RF, 𝜔ோி, fique na faixa espectral de refletividade máxima da grade conforme a Fig. 2. Esta sintonia fará com que somente a banda lateral superior do sinal incida no laço dispersivo e no fotodetector, seu campo elétrico é expresso por (8) conforme: onde este depende diretamente da resposta em frequência dos coeficientes de transmissão, 𝑡(𝜔) = 1 − 𝑟(𝜔), e fase, 𝜑(𝜔), da FBG. Relembra-se que a parcela do sinal referente à portadora óptica e à banda lateral inferior foram filtradas, isto é, 𝑡(𝜔଴) = 𝑡(𝜔଴ − 𝜔ோி) = 0. Observando que a grade de Bragg tem o comportamento uniforme, considera-se φ(𝜔଴ + 𝜔ோி) = 0 e t(𝜔଴ + 𝜔ோி) = Γ. Reescrevendo-se (8): O sinal óptico, composto pela banda superior da modulação do sinal de RF, incide no acoplador direcional e sofre uma divisão, uma parcela acopla no outro guia do acoplador que se propaga em loop dispersivo composto por dispositivo com grande dispersão. Esse sistema com o loop deverá ter um efeito multiplicativo da dispersão. Isso se deve ao sinal perfazer esse laço n vezes [2]. As perdas por inserção, amplificação e outras mais estão definidas no fator g em (10). O sinal que não acoplou no segundo guia do acoplador direcional incide no fotodetector sem ser comprimido no loop dispersivo, como o sinal está modulado em fase e não foi convertido de modulação de fase para intensidade devido à dispersão do loop, este por ocasião da saída no fotodetector será um sinal DC. A resposta modelada matematicamente do laço dispersivo ao impulso na sua entrada no domínio da frequência fica onde 𝛷଴ é a fase que representa o atraso do sinal (rad), 𝛷ଵ é a fase que representa o atraso de grupo do sinal (s) e 𝛷ଶ a fase que representa a dispersão de atraso de grupo (s2/rad). Transformando a resposta do Loop ao impulso do domínio da frequência para o domínio do tempo conforme [9]: obtém-se: Desenvolvendo (15) tem-se: Rearranjando os argumentos das fases que estão dentro da integral, tem-se: Visando facilitar a visualização da expressão e sua evolução matemática, substituíram-se os termos que estão fora da integral pela variável muda c conforme (18) e (19): Observando (19) e sabendo-se que sua integral pode ter seu resultado obtido por (20), aplica-se o recurso de substituição de variável dos termos que multiplicam 𝜔 e 𝜔ଶrespectivamente conforme (21) e (22) e sabendo-se da propriedade matemática expressa em (23), obtém-se (24). Reorganizando (24) para facilitar a aplicação dos resultados obtidos em (25) e (26) em (27) conforme: Com a simplificação de (27), obtém-se (28) conforme: Aplicando o valor obtido em (21) na primeira parcela do lado direito da igualdade em (20), tem-se: Realizando a substituição de variável nas parcelas que multiplicam t e os termos que não são multiplicados pelo tempo respectivamente encontra-se (30) e (31) respectivamente conforme: Aplicando todos os temos calculados em ℎ(𝑡) tem-se: O sinal óptico na saída do loop dispersivo (9) e o sinal representado por (32) aplicados em (33) resulta em (34), onde este último é o resultado da convolução de (9) e (32) conforme (33): Reorganizando (34) com o posicionamento dos termos que não depende de 𝜏 para fora da integral e ajustando intervalo da integral para a duração do sinal definido pela função 𝑅𝑒𝑐𝑡 ቂ்௧ቃ, onde ela vale 1 para o intervalo -T/2 < t < T/2, obtém-se: Substituindo (30) em (35) tem-se: Se considerar a situação onde os termos que multiplicam 𝜏ଶ são iguais [10], obtém-se: Ao atingir a condição (37), a expressão (36) passa a ser a Transformada de Fourier da envoltória do sinal de entrada definida pela função 𝑅𝑒𝑐𝑡 ቂ்௧ቃ. Esse fato se torna mais facilmente observável após a organização de (38) se tornando (39) e depois com o uso de substituição de variável conforme (40) em (41). Resolvendo (41), observa-se: e obtém-se: Com a reorganização de (43) é obtido o módulo do campo elétrico, ห𝐸ሬ⃗(𝑡)ௌห, incidente no fotodetector conforme: Sabendo-se que (45) representa o vetor campo elétrico incidente no fotodetector conforme: a partir de (45) foi possível determinar o vetor campo magnético, 𝐻ሬ⃗(𝑡)ௌ conforme: onde η é a impedância intrínseca do meio. Aplicando o conceito do módulo do vetor de Poyting definido em (50), as fases que estavam inseridas em c e 𝛾 desaparecem por conta de ambas ocorrerem em 𝐸ሬ⃗(𝑡)ௌ e 𝐻ሬ⃗(𝑡)ௌ ∗ e estarem com os seus valores simétricos. Resolvendo (47) é possível conhecer a intensidade do sinal óptico incidente no fotodetector representado por (51) conforme abaixo: Simplificando (48) tem-se: A expressão (49) apresenta uma função 𝑠𝑖𝑛𝑐ଶ que representa o quadrado da transformada de Fourier da envoltória do sinal de entrada. Esse resultado demonstra que o sinal na saída estará na banda base, depende de uma fase constante igual a ఃభ் ଶఃమ e a largura do sinal dependem de ఓ்మ ଶ , para t = T e utilizando (37), e é igual a ்మ ସ௡ఃమ . Como 𝛷ଶ < 1 e n, com grandes valores, fazem a relação apresentar valores maiores e assim a função 𝑠𝑖𝑛𝑐ଶ reduz sua duração do lóbulo principal. Tal fato indica que a envoltória tem sua largura de pulso reduzida. O parâmetro dispersão de atraso de grupo, 𝛷ଶ, pode ser calculado por: onde c୪୳୸ é a velocidade da luz no vácuo, D é a dispersão óptica dada em ps/nm e 𝜆େ୊୆ୋ é a o comprimento de onda central da grade de Bragg com chirp linear. Os valores de 𝜇 podem ser calculados a partir de (37) e de (50) resultando em (51) conforme [10] obtém-se: Cabe acrescentar que havendo o atraso das componentes espectrais do sinal LFM deslocado da portadora óptica, onde essas componentes incidem ao mesmo tempo no fotodetector permitindo o batimento entre elas. Se o sinal, por acaso, não sofrer o atraso correto para as suas componentes espectrais, não haverá o batimento entre elas, logo não sairá o sinal na banda base, e, sim, somente o sinal DC. Mesmo ocorrendo o batimento entre algumas das componentes do sinal LFM, o nível do sinal na banda base após o fotodetector será baixo. Os valores de dispersão óptica, D, empregadas nos cálculos apresentada na Tabela I foram retiradas de especificações de alguns fabricantes de grades de Bragg. A relação de equivalência entre comprimentos de ondas e frequências é de 0,8 nm para a 100 GHz de acordo com a norma ITU-T para dispositivos compostos por sílica. O valor de dispersão de 0,4 µs/MHz = 0,4 x106 ns/GHz é encontrado em dispositivos à SAW e serviu como referência para as comparações [11]. Comparando esse valor com os obtidos na Tabela I, percebe-se que para detecção de sinais radar típicos, encontrados no comércio, esse sistema ainda não poderá ser capaz de realizar compressão de pulso, pois precisaria dar mais voltas. Para dar mais voltas, haveria a necessidade de amplificação óptica com mais controle de ruído inserido no sistema. Em radares com grandes valores de TBW da ordem de 74.000, conforme [4] por exemplo, poderia realizar a compressão de pulso com menos dispersão. A dispersão cromática acumulada no laço dispersivo não consegue ser da ordem de grandeza da largura de pulsos de radares comerciais. Para largura de pulsos da ordem de nanosegundos, esses pulsos dependem de uma grande chirp rate para manter a TBW grande. Quanto maior for a banda abrangida pelo sinal, maior vai ser o efeito da dispersão do dispositivo. Há a necessidade de estudar a viabilidade de saber quantas voltas um laço dispersivo consegue manter com e sem amplificação. A estimativa de empregar um laço que dura 50 voltas foi uma estimativa conservadora baseada em [12]. III. CONCLUSÃO A crescente demanda de banda pelos sistemas de radares modernos, por conseguinte, portadoras de RF maiores, bem como larguras de pulsos maiores, estão demonstrando que dispositivos que dependam da eletrônica, não estão conseguindo superar suas limitações. Os dispositivos baseados em Microwave Photonics estão surgindo para ajudar a superar as limitações da eletrônica. O sistema proposto nesse trabalho mostrou-se com limitações para aplicação em radares atuais, contudo se mostrou como uma opção para detecção de radares com grandes TBW, onde a largura de pulso é pequena e a larguras de banda é muito grande. A limitação apresentada nesse artigo poderá ser superada com a construção de grades de Bragg com dispersões maiores ou com o uso de materiais mais dispersivos do que a sílica empregada nas grades. Há a necessidade de estudar a viabilidade de saber quantas voltas um laço dispersivo consegue manter com e sem amplificação. "
	}
