{
    "id": 55,
    "titulo": "localização de veículos aeroespaciais por triangulação de antenas",
    "autor": "arthur medeiros macedo, ginalber luiz de oliveira serra",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2020/st/ST_05_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 2,
    "resumo": "Este trabalho objetiva a estimacão de localização de foguete baseado na fusão de triangulação dos ângulos de azimute e elevação de todas as antenas instaladas no Centro de Lançamento de Alcântara (CLA), incluindo as antenas dos radares e antenas de telemedidas. A metodologia proposta inclui a modelagem do sistema dinâmico, aplicação de filtro discreto e fusão de dados. Os cálculos foram aplicados com os dados da Operação Falcão III 2018. Os resultados obtidos mostraram que a metodologia usada consegue estimar a posição do foguete de treinamento com curva similar ao sistema de radares do CLA.",
    "texto": " I. INTRODUÇÃO O Centro de Lançamento de Alcântara (CLA) tem como missão executar atividades de lançamento e rastreio de engenhos aeroespaciais [1]. Devido à sua localização geográfica próxima à linha do equador, os voos espaciais com órbitas de baixa inclinação com o equador podem se beneficiar da velocidade de rotação da Terra [2]. Considerando essa vantagem, dentre outras, como baixa densidade demográfica em áreas próximas e clima favorável, a posição geográfica do CLA é estabelecida como uma das mais apropriadas para atividades de lançamento de foguetes no mundo. Com o objetivo de manter operacional sua infraestrutura e seus recursos humanos, o Centro frequentemente realiza operações com foguetes de treinamento. O Foguete de Treinamento Básico (FTB) é um veículo suborbital instrumentado com telemetria na Banda S, apogeu de aproximadamente 30 km e disponibilidade de Carga Útil adicional (experimento) de 5 Kg [3]. Em operações de lançamento, o rastreio dos foguetes é uma atividade crítica, pois permite identificar a trajetória percorrida, verificando se esta compatível com a trajetória prevista para fins de segurança de voo aeroespacial, inclusive podendo causar a terminação do voo pelo oficial de segurança. Para a atividade de rastreio dos veículos lançadores de treinamento, o Centro possui um sistema com dois radares, sendo um radar de proximidade [4], em Alcântara, e outro radar de precisão localizado no município da Raposa. Cada radar estima a posição do foguete baseado em seus dados de azimute, elevação e distância calculada. Atualmente, o CLA possui sistema de telemedidas com 3 antenas fixas. Em algumas operações, uma antena móvel de telemedidas é instalada adicionalmente no Centro. Além disso, o Centro de Lançamento da Barreira do Inferno (CLBI), localizado em Natal-RN, possui antenas de telemedidas e de radar para rastreio. Observa-se que cada antena de telemedidas possui sistema de direcionamento de azimute e elevação automático em busca da direção com melhor nível de sinal ruído. Assim, cada antena de telemedidas estima a direção do foguete, contudo não possui dados relacionados à distância, diferentemente dos radares. Para estimar a posição do foguete baseado apenas em dados de ângulos, azimute e elevação das antenas, pode-se usar técnicas de triangulação entre diferentes antenas. Com o objetivo de se obter sistemas redundantes de rastreio do foguete além dos dados dos radares já disponíveis, a utilização de técnicas de triangulação entre as diversas antenas do Centro pode disponibilizar dados de localização. Tais dados de localização necessitam ter precisão compatíveis com a atividade espacial. Este trabalho propõe a triangulação de diversas antenas do centro, a fusão e filtragem dos resultados com um projeto de filtro de Kalman para o sistema dinâmico [6].  II. METODOLOGIA  Este trabalho calcula a estimacão da posição do foguete com base apenas nos dados de ângulos de azimute e elevação de cada antena. Os dados das triangulações foram filtrados dinamicamente, cujo modelo dinâmico foi obtido por identificação caixa branca do sistema. Os dados filtrados foram fundidos em apenas um resultado para melhorar a precisão da estimacão. Após a fusão dos dados, um novo filtro dinâmico foi aplicado para se obter uma resposta mais precisa e com menor variância.  A. Triangulação utilizando duas antenas Deve-se estimar a posição no espaço tridimensional baseado apenas em ângulos. Podemos definir a posição pela relação da soma vetorial entre os vetores de distância do foguete e das respectivas antenas. Na figura 1, pode-se observar a relação do triângulo pela equação que segue. Da1a2 será calculado mais adiante e representa a distância entre as antenas que estão sendo utilizadas na triangulação. P1 = 2 R(1×3) e P2 = 2 R(1×3) são vetores linhas dados pelas relações abaixo. Em que αi e βi ∈ R são os valores dos ângulos de azimute e elevação de cada antena, respectivamente. D1 e D2 ∈ R são as únicas variáveis desconhecidas, que são facilmente calculadas para cada posição do foguete usando as equações (2) e (3) aplicadas em (1). Após cálculo de P1, a posição do foguete em relação à rampa de lançamento xyz pode ser calculada conforme observado na figura 2 pela relação abaixo. Cálculo do vetor distância entre antenas: Para o cálculo de RAi definido como a distância entre a rampa de lançamento e a antena i, e Da1a2 já definido anteriormente, temos a seguinte relação. Assim, basta calcular os valores de RAi para cada antena para então se ter a posição do foguete por (4). Considerando que o valor de RAi não se altera, podemos utilizar dados de testes, cujos valores do vetor linha Pxyz(t) ∈ R(1×3), αi(t) e βi(t) são conhecidos, assim aplicamos (4) e (2) para tempos de amostragem t diferentes. Se consideramos apenas um instante de tempo, as equações (4) e (2) configuram um sistema linear com 3 equações e 4 incógnitas. Contudo, calculando novamente (4) e (2), para cada novo instante de tempo t, adiciona-se 1 incógnita e 3 equações, tornando o sistema sobredeterminado. Neste caso, deve-se usar a maior quantidade de dados disponíveis para teste e estimar o valor de RAi pelo método de mínimos quadrados [6]. Uma vez calculado o RA1 e RA2, podemos definir a posição por triangulação de duas antenas usando (5), (1), (2) e (3) seguindo as equações a seguir. Em que x^(t), y^(t) e z^(t) ∈ R são os valores da distância estimada do foguete em relação à rampa de lançamento no instante t. B. Identificação Caixa Branca do Sistema Dinâmico Após a estimacão da posição utilizando triangulação das antenas duas a duas, conforme discutido anteriormente, deve-se filtrar os dados para eliminar os ruídos da estimacão. Para isto, o filtro de Kalman discreto foi escolhido, o qual utiliza um modelo dinâmico do sistema em seu projeto. Para o modelo do sistema dinâmico, podemos considerar a dinâmica da posição do foguete no voo após a fase propulsada como um voo balístico com apenas a aceleração gravitacional no eixo vertical. Considerando o sistema discreto com tempo de amostragem Ts, a seguinte equação de diferença representa a dinâmica com aceleração constante igual a g. Este sistema dinâmico pode ser representado em espaço de estados segundo o seguinte sistema de equações: Em que as matrizes A ∈ R6×6, B ∈ R6×1, C ∈ R3×6, Xk ∈ R6×1 e Uk ∈ R são definidas abaixo. γwk e vk+1 representam os ruídos da dinâmica e ruído de medição respectivamente, ambos com média zero. Em que xk, yk e zk ∈ R são a posição do foguete em relação à rampa de lançamento no instante k. C. Filtragem dos Dados Uma vez estimada a posição através de técnica de triangulação por (4), os dados resultantes, modelados por (19), podem ser filtrados pelo filtro ótimo de Kalman discreto, que considera tanto os dados calculados da triangulação como o modelo da dinâmica do voo. O filtro de Kalman utilizado tem como dados iniciais o vetor de estado inicial X^+_0 e a variância inicial do valor medido P^+_0. Os demais passos são calculados iterativamente para cada intervalo de tempo de amostragem. Em que Q e R se relacionam com a variância dos ruídos da dinâmica e de medição respectivamente. O valor estimado da posição após aplicação do filtro é Y^k+1. D. Fusão dos Dados Após a filtragem dos dados triangulados pelo filtro de Kalman discreto para cada par de antenas, podemos utilizar todas as posições estimadas para calcular um valor final. Uma ideia inicial mais simples seria a média aritmética entre todas as posições estimadas pelas triangulações. Contudo, considerando que cada posição possui seu erro de estimacão, é mais coerente se utilizar dos valores de variância de cada estimacão para ponderar a média de forma que quanto maior a variância, menor o peso no resultado final. Em analogia, podemos considerar um circuito elétrico resistivo com n resistores em paralelo. A porcentagem da corrente total que passa em cada resistor é função de sua resistência. Neste caso, a corrente em um resistor de resistência Ri é i = R1i (R11 + R12 + ::: + R1n )−1I, em que I é a soma das correntes que passam por cada resistor. Voltando ao caso dos valores estimados para a posição do foguete, o peso da soma ponderada de cada estimacão com variância calculada em (23) é Pi+ e é φi. Assim, a estimacão final Y^P_xyz é a soma ponderada por φi de cada estimacão por triangulação Y^P^i_xyz de duas antenas calculada anteriormente. Em que N é o número total de triangulações estimadas inicialmente. III. RESULTADOS Este trabalho apresenta a implementação da proposta apre- sentada na seção anterior em dados da Operação Falcão III 2018 realizada no dia 7 de novembro de 2018 no Centro de Lançamento de Alcântara. Esta operação realizou o lançamento de um foguete de treinamento básico (FTB) com o objetivo de treinar o pessoal do Centro e operacionalizar a sua infraestrutura. Para o rastreio do foguete, o Centro atualmente utiliza seu sistema de radares, totalizando dois radares, um de proximidade (Adour) e um de precisão (Atlas). O radar Adour está localizado em Alcântara a menos de 10 km da rampa de lançamento, enquanto o radar Atlas está localizado no município da Raposa a menos de 30 km da rampa de lançamento. A trajetória rastreada estimada pelo sistema de radares é apresentada na figura 3. Cada radar do CLA, separadamente, estima a posição do foguete, seja por modo de funcionamento eco de pele ou seja através da comunicação do transponder radar embarcado. Ocorre que atualmente apenas a estimacão com maior nível de sinal ruído entre os radares é considerada como dado de localização do foguete no CLA. Além dos sistemas de radares, o CLA possui um sistema de telemedidas com um total de 3 antenas, sendo duas localizadas em Alcântara e uma no município da Raposa. Usualmente, o CLA também utiliza dados de antenas auxiliares em seus sistemas, a exemplo de dados de telemedidas e de radar de localização do Centro de Lançamento da Barreira do Inferno (CLBI), localizado em Natal ou antenas móveis instaladas para determinadas operações. Contudo, para a Operação Falcão III 2018, apenas as 3 antenas de telemedidas e 2 antenas de radar, já citadas, foram utilizadas. Neste trabalho, portanto, foram utilizados os dados das 5 antenas atuantes na Operação Falcão III 2018 para fins de estimacão da posição do foguete. Considerando que a triangulação de duas antenas, conforme já abordado na seção anterior, se baseia nos ângulos de elevação e azimute de cada antena, é importante que estas antenas estejam situadas em locais diferentes. Portanto, foram calculadas triangulações entre antenas considerando sempre uma antena situada no município de Alcântara e outra situada no município da Raposa. A tabela I identifica um nome para cada antena e seu respectivo município. Seguindo a metodologia proposta na seção anterior, foram calculadas as distâncias entre cada antena e a rampa de lançamento (RAi) baseado em dados de teste e utilizando o estimador de mínimos quadrados. A tabela II apresenta os valores calculados. De posse dos valores de RAi, estima-se a posição por triangulação das antenas da tabela I duas a duas considerando uma de Alcântara e uma da Raposa. Totalizam-se 6 trajetórias estimadas por triangulação seguindo as equações de (7) a (15). O gráfico destas trajetórias está apresentado na figura 4. Para definição do modelo apresentado em (19), falta apenas definir os valores da aceleração da gravidade g e do intervalo de amostragem Ts. Considerou-se g = 0,0098 km/s². Para Ts, foi considerado o maior intervalo de amostragem entre as duas antenas trianguladas. Definido o modelo dinâmico, e aplicando o filtro de Kalman discreto (23), obtêm-se as trajetórias trianguladas filtradas na figura 5. Após a filtragem, foi realizada a fusão das trajetórias utilizando (25), e realizada novamente a filtragem de Kalman, cujo resultado pode ser observado na figura 6. IV. ANÁLISE DOS RESULTADOS O sistema de radares do CLA apresenta a trajetória na figura 3. Observa-se que nos momentos iniciais, a trajetória apresenta distorções de rastreio. Essas distorções podem ser interpretadas como erro de medições devido à proximidade do foguete com o solo, a exemplo de reflexões de onda em construções e outros objetos. A figura 4 demonstra que as trajetórias trianguladas re- presentam uma trajetória próxima àquela considerando os dados do sistema de radares do CLA. Observa-se que as medições via triangulação apresentam elevado níveis de ruído oscilatório, cuja causa pode ser atribuída ao comportamento dos servomotores de cada antena na busca da direção de melhor sinal ruído. Ainda na figura 4, em análise detalhada da curva, é ob- servado um desvio crescente ao longo do tempo entre as trajetórias por triangulação e a trajetória pelo sistema de radares, cuja causa pode ser atribuída à não consideração da forma elíptica da superfície da terra. Esse desvio também é passado para o resultado final. Quanto ao modelo proposto, a dinâmica foi determinada com aceleração constante nos 3 eixos, ax = 0 m/s², ay = 0 m/s² e az = 0,0098 km/s². Essas acelerações foram validadas utilizando o estimador de mínimos quadrados com os dados da Operação Falcão III 2018 para estimar os valores do lado direito de (16), (17) e (18). Observa-se por (26) que os valores das acelerações propostas são semelhantes aos valores estimados. A figura 5 apresenta os dados filtrados. Se comparado com a figura 4, observa-se que os dados filtrados apresentam erro com menor variância, demonstrando a eficácia do filtro. A figura 6 apresenta os dados após fusão das trajetórias. Observa-se que a trajetória por triangulação é semelhante àquela calculada pelo sistema de radares do CLA. Observa-se também que a variância do erro é menor se comparado com as trajetórias filtradas da figura 5, demonstrando a eficácia da fusão. É importante observar que a fusão proposta neste trabalho pode ser estendida caso aumente a quantidade de antenas instaladas no Centro, proporcionando o aumento da precisão do resultado. V. CONCLUSÃO Este trabalho apresentou uma proposta de estimativa de localização de foguetes por triangulação de antenas base- ado apenas nos ângulos de azimute e elevação de cada antena. Observa-se na figura 6 que a trajetória estimada por triangulação se assemelha à trajetória estimada pelo sistema de radares do CLA. Os dados de localização são críticos para operações de lançamentos, sendo utilizados para o rastreio de veículos espaciais e verificação de suas trajetórias reais, além de subsidiar a segurança de voo na decisão de terminar o voo. A estimativa da localização proposta utiliza fusão de dados por diferentes pares de antenas, o que aumenta significativamente a precisão da estimativa da posição do veículo, portanto aumentando a capacidade de seu rastreio. À medida que novas antenas são instaladas e utilizadas para fins de triangulação, a fusão permite o aumento da precisão e a melhora da performance do rastreio. Por fim, o resultado da estimativa proposta se alinha com a ampliação da capacidade técnica do CLA ao aumentar a disponibilidade de informações de localização do Centro.    "
}