	{
		"id": 56,
		"titulo": " predição de detecção de aeronaves por manpads por meio do método de monte carlo",
		"autor": "Caio Augusto de Melo Silvestre; Eduarda de Proença Rosa Campos",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2020/st/ST_01_2.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 1,
		"resumo": "A crescente ameaça e emprego de MANPADS, demanda um planejamento de missões aéreas robusto, que aumente a probabilidade de sobrevivência da aeronave e de cumprimento da missão. Visando a propiciar uma ferramenta de auxílio ao planejamento de missões aéreas nesse tipo de cenário, foi desenvolvido um algoritmo para lidar com tais incertezas, denominado MAISA, que se baseia no Método de Monte Carlo. Este algoritmo leva em consideração fatores de posição do MANPADS, da aeronave, da transmitância atmosférica e do detector infravermelho do MANPADS e fornece ao planejador de missão aérea uma área de segurança que aeronave deve evitar de acordo com o risco de detecção desejado para a missão.",
		"texto": "I. INTRODUÇÃO Mísseis guiados por radiação infravermelha (IV), especialmente os do tipo MANPADS (Man-Portable AirDefense System), vêm se proliferando cada vez mais ao redor do globo, especialmente entre forças não governamentais. Milhares de MANPADS estão espalhados por toda a África, América do Sul e Oriente Médio e podem ser encontrados no mercado negro por cerca de US$ 5 mil [1]. Esses sistemas possuem uma relativa facilidade de emprego devido à sua portabilidade e mobilidade. Além disso, o processo de engajamento com o alvo é simples, visto que o míssil guiado é autônomo após o lançamento e passivo, pois não emite radiação para o seu guiamento. Logo, quando se busca planejar a rota de uma aeronave em um cenário operacional com a ameaça de MANPADS, deve-se levar em conta as diversas incertezas inerentes a este cenário. Trabalhos anteriores [2] [3], buscaram fornecer uma métrica de avaliação de susceptibilidade de uma aeronave à misseis infravermelhos, levando em consideração o envelope de detecção e o envelope cinemático do míssil, entretanto, se restringiram à análise de engajamentos ar-ar e não levaram em conta as incertezas inerentes ao cenário operacional de MANPADS. Com o intuito de lidar com essas incertezas, o planejamento de missões aéreas pode se valer do Método de Monte Carlo para o modelamento do cenário. Desta forma, todas as incertezas conhecidas do cenário são consideradas, fornecendo dados capazes de auxiliar à tomada de decisão com maior robustez. Este estudo apresenta o algoritmo empregado no Módulo de Ameaça Infravermelha Superfície-Ar (MAISA) que se vale do Método de Monte Carlo para lidar com a incertezas no cenário operacional em pauta. II. FUNDAMENTAÇÃO TEÓRICA Mísseis infravermelhos utilizam um sistema óptico para coletar a radiação infravermelha e direcioná-la para seu sensor, podendo ser constituído de uma matriz ou de um único detector. A radiação proveniente do alvo é então convertida em um sinal elétrico que é utilizado para a detecção e o rastreio do alvo. A. Assinatura infravermelha de aeronaves A assinatura infravermelha de um corpo consiste nas características espectroradiométricas inerentes a uma determinada fonte, tratando-se da intensidade radiante emitida pelo mesmo em diferentes ângulos de aspecto. Tal assinatura depende de diversos fatores, tais como temperatura, emissividade, formato e dimensões do objeto em questão [4]. No caso de aeronaves, as principais fontes de radiação são: (1) o metal aquecido do escapamento dos motores; (2) os gases de exaustão; e (3) a fuselagem de metal aquecida aerodinamicamente [5]. Além disso, é importante destacar que a banda utilizada pelo detector será fundamental para a determinação do envelope. Neste trabalho utilizam-se as bandas MWIR (Mid-Wavelength Infrared) entre 3 µm e 5 µm. Nessa banda, o principal fator contribuinte para a assinatura infravermelha da aeronave é a pluma de gases de exaustão [5]. B. Propagação na atmosfera Antes de chegar ao sensor infravermelho, o fluxo radiante radiado pelo alvo se propaga pela atmosfera terrestre, fazendo com que este fluxo seja absorvido seletivamente por gases atmosféricos, espalhado por partículas suspensas no ar ou até mesmo modulado por rápidas variações de propriedades atmosféricas [6]. Todos esses fatores compõem a transmitância atmosférica. No MWIR, a transmitância atmosférica é composta principalmente pelo processo de absorção, que predomina sobre o processo de espalhamento, devido à absorção realizada por moléculas de vapor de água e dióxido de carbono nesta faixa do Infravermelho [7]. C. Detecção de aeronave no infravermelho O fator determinante para a detecção de uma aeronave por um míssil infravermelho é o contraste entre a intensidade radiante emitida pela aeronave em relação à intensidade radiante emitida pelo plano de fundo que chega ao detector através da atmosfera. O alcance máximo de detecção de um detector infravermelho, é uma função do seu NEI (Noise Equivallent Irradiance), parâmetro de performance do detector que consiste no nível de irradiância incidente no detector capaz de gerar um sinal de saída maior que o ruído. Como a detecção da aeronave é realizada pelo contraste em relação ao plano de fundo, a irradiância que chega ao detector deve ser maior do que um valor de limiar (dado em função do NEI). Considera-se que o alcance máximo de detecção R é obtido por [2, 3], onde, Ic(θ,φ) é intensidade radiante de contraste, na banda espectral do detector, entre a aeronave e o plano de fundo, dada em função do ângulo de elevação φ e de azimute θ relativos ao míssil e a aeronave; (R,φ) é transmitância espectral efetiva na banda espectral do detector para a distância R e ângulo de elevação φ; e, por fim, o denominador da equação equivale ao limiar de detecção, dado pelo produto entre o NEI do detector e o valor de SNR, que consiste na relação sinal-ruído empregada para a consideração de detecção de um alvo. III. ALGORITMO MAISA Como é função da distância, (1) deve ser resolvida iterativamente, assim, utiliza-se (2) para se obter o valor de 𝑆𝑁𝑅∗, ou seja, o valor de sinal-ruído obtido em uma determinada posição da aeronave Panv e do míssil Pmis, Logo, considera-se que a aeronave será detectada, em determinada posição, quando SNR* for maior do que o limiar de SNR estabelecido pelo projetista do míssil, que a determina pela probabilidade de detecção e de falso-alarme desejada. Além disso, para prever a detecção de uma aeronave por MANPADS, deve-se levar em conta as diversas incertezas inerentes ao cenário operacional, como por exemplo:  Posição do MANPADS: dado à sua alta capacidade de mobilidade e camuflagem;  Posição da aeronave: o voo real possuirá variações em relação à rota planejada, devido à alta dinamicidade de missões aéreas;  Condições atmosféricas: afetam diretamente a propagação da radiação infravermelha emitida pela aeronave;  Assinatura infravermelha da aeronave: durante o voo, existe variação de regime de potência do motor e incertezas inerentes aos experimentos de medição ou simulação da assinatura; e  Tecnologia dos MANPADS: não é possível ter acesso aos parâmetros técnicos dos sistemas inimigos. A partir da resolução de (2), emprega-se o método de Monte-Carlo, no qual as entradas do algoritmo assumem valores aleatórios com distribuição normal. Para cada valor de SNR* obtido, verifica-se se este é maior do que um limiar de detecção, considerado para o míssil em questão. Após todas as rodadas de simulação, a probabilidade de detecção é calculada, baseando-se no número de situações em que o SNR foi maior do que o limiar de detecção. A Fig. 1 apresenta o fluxograma do algoritmo desenvolvido para aplicação do método de Monte Carlo, doravante denominado MAISA (Módulo de Ameaça de Infravermelha Superfície-Ar), para estimação do envelope de detecção. A. Aleatoriedade na posição da aeronave e do MANPADS Visando a robustez da missão, a rota planejada e aposição do MANPADS devem ser modeladas com incertezas devido à imprevisibilidade inerente a este cenário operacional. Para isso, considera-se que a posição da aeronave e do MANPADS sofrem um distanciamento aleatório, modelados por meio de de (3). onde, 𝑃ሬ⃗௢௕௝ é a posição do objeto, que pode ser o alvo ou o MANPADS, em coordenadas inerciais, ∆𝐸ሬሬሬሬ௢௕ఫ ሬሬሬሬ⃗ o erro gerado randomicamente a cada rodada de simulação e 𝑃ሬ⃗௢௕௝೑೔೙ೌ೗ a posição do objeto em coordenadas inerciais com o erro randômico. O erro ∆𝐸 ௔௡௩ ሬሬሬሬሬሬሬሬ⃗ é gerado por meio de (4). Onde, 𝜃 e 𝜙 são ângulos aleatórios distribuídos uniformemente no intervalo [0,2𝜋[ e 𝑟 é um valor dado por uma distribuição gaussiana com média 0 e desvio padrão entregues pelo usuário (um desvio padrão para a aeronave e outro para o MANPADS). B. Obtenção da assinatura infravermelha da aeronave As assinaturas no infravermelho dos alvos foram obtidas pela interpolação dos dados das Avaliações Operacionais realizadas pelo IAOp ou por simulação [3][8][9]. A Fig. 2 apresenta um dos exemplos de AIV utilizada, sendo o gráfico composto pela intensidade radiante (eixo z) para diversas elevações (eixo y) e ângulos de azimute (eixo x) medidos. Visando inserir incertezas associadas aos experimentos de medição de AIV de aeronaves ou à modelos de simulação de AIV, o usuário pode associar uma incerteza ao valor de AIV utilizado, fornecendo uma maior robustez no resultado fornecido pelo MAISA. C. Determinação da transmitância atmosférica Em relação à transmitância atmosférica, empregou-se o software MODTRAN para a obtenção dos valores de transmitância em função das diversas condições atmosféricas na banda do MWIR. A partir da atmosfera tropical, foram realizadas simulações variando-se as distâncias alvo-detector, de 0,25 a 15 km, e os ângulos zenitais, de 15° a 75°. Para cada uma destas, utilizou-se 18 cenários atmosféricos onde cada um possuiu diferentes porcentagens de concentração de vapor d’água, gás carbônico e aerossóis, os quais são os principais contribuintes no MWIR. Em cada um destes cenários o MODTRAN forneceu valores de transmitância espectral para a banda de interesse. Esses valores espectrais foram reduzidos a um valor unidimensional empregando-se o conceito de transmitância efetiva [11], assumindo uma resposta espectral linear do sensor, que consiste na relação entre a radiação emitida por um corpo negro transmitida pela atmosfera e radiação emitida por este mesmo corpo em uma temperatura específica. Assim, o valor escalar da transmitância atmosférica é ponderado pela distribuição espectral da fonte. A transmitância efetiva, para uma distância R, é obtida por (5), onde se assumiu um valor de temperatura para o corpo negro de 900 K, compatível com a temperatura dos gases de exaustão do motor de aeronaves, que é o principal contribuinte para assinatura infravermelha de aeronaves no MWIR. onde, 𝜏(𝜆, 𝑅) é a transmitância espectral para uma distância R fornecida pelo MODTRAN, 𝑀(𝑇, 𝜆) é dado pela lei de Planck que descreve a distribuição espectral da radiação de um corpo negro para uma temperatura T [6] e o intervalo compreendido entre 𝜆ଵ e 𝜆ଶ é o da banda MWIR considerado de 3 a 5 µm. A partir do processo descrito, são obtidos dezoito valores de transmitância efetiva para cada situação geométrica especifica, dada pela distância e ângulo zenital. As Fig. 3 e 4 apresentam os valores de média e desvio padrão da transmitância efetiva utilizados neste estudo. D. Incerteza nos parâmetros do MANPADS Para resolução de (2), o parâmetro inerente ao MANPADS é o NEI, que consiste no nível de irradiância mínimo e é equivalente ao valor RMS do ruído do detector, ou seja, para que um alvo seja detectado por um detector, o nível de radiação que chega do alvo deve ser maior do que o NEI. Nesse trabalho considera-se o valor de NEI de 2,5∙10-8 W/m2 para o míssil Stinger fornecido por [4]. Entretanto, esse valor varia não somente de acordo com o tipo de detector, como também, varia individualmente para cada detector fabricado. Logo, a partir de um valor de NEI, aplica-se uma variação aleatória desse parâmetro a cada rodada de simulação. Além do NEI, o limiar de detecção é um parâmetro de cada tipo de sistema MANPADS, já que é dependente da probabilidade de detecção e de falso alarme determinada pelo projetista do sistema. Nesse trabalho, considerou-se um valor de limiar de detecção de 5, que fornece uma probabilidade de detecção de 99% com uma probabilidade de falso alarme de 1% [9]. IV. SIMULAÇÕES Buscando analisar as informações fornecidas pelo MAISA como ferramenta de auxílio ao planejamento de uma missão aérea, assume-se um cenário hipotético onde uma aeronave deve realizar uma incursão em território onde existe uma ameaça do tipo MANPADS, cuja posição é incerta devido a sua alta mobilidade e camuflagem no terreno. Dado os parâmetros e incertezas apresentadas anteriormente, empregase o MAISA para avaliar a probabilidade de detecção da aeronave pelo MANPADS em cada posição da aeronave, a partir dos valores de entrada apresentados na Tabela I. Inicialmente, calculou-se o emprego do algoritmo sem assumir aleatoriedade nas variáveis de entrada, assim, foi obtido o mapa de contorno apresentado na Fig. 5, onde o valor de probabilidade de detecção é fornecido para cada coordenada de posição. A distância de detecção da aeronave pelo MANPDAS, neste caso, foi de 8700 m. Já assumindo as aleatoriedades dadas pelas incertezas do cenário operacional, foram obtidos os mapas de contorno da probabilidade de detecção para cada posição da aeronave com 50, 200 e 400 rodadas de simulação, os quais são ilustrados nas Fig. 6, 7 e 8 respectivamente. Buscando avaliar a quantidade necessária de rodadas de simulação, emprega-se como figura de mérito o erro absoluto relativo médio ∆ ௣,௤ entre os valores de probabilidade de detecção obtidos com duas diferentes quantidades de rodadas, 𝑃 ௗ௘௧ ௣ e 𝑃 ௗ௘௧ ௤ , obtido por (6), A Tabela II apresenta a média do erro absoluto relativo obtida para diferentes quantidades de rodadas de simulação. A partir dos valores apresentados na Tabela II, considerase neste estudo que 400 rodadas de simulação são suficientes para as análises posteriores pois o erro relativo foi menor do que 1%. Com a finalidade de auxiliar o planejamento de uma missão aérea, é necessário fornecer um valor absoluto de fácil interpretação ao tomador de decisão. Logo a informação contida no mapa de probabilidade de detecção apresentado na Fig. 8, deve ser reduzida para um parâmetro mais simples. Assim, é fornecido ao tomador de decisão um raio de segurança que delimita uma área que a aeronave deve evitar para manter o risco de detecção abaixo de um valor arbitrário. Neste trabalho considera-se o risco como 1%, 5% e 30%. A partir dos dados de probabilidade de detecção fornecidos pelo MAISA com 400 rodadas de simulação, que são apresentados na Fig. 8, aplica-se a operação lógica em cada coordenada de posição da aeronave, na qual é verificado se a probabilidade de detecção é menor ou igual aos valores de risco de detecção supracitados. Assim, obtém-se as distâncias de segurança apresentadas na Tabela III. A Fig. 9 apresenta o mapa de contorno de detecção com as circunferências de raios de segurança para o risco de detecção de 1%, 5% e 30% sobrepostas, ilustradas pelas linhas tracejadas nas cores vermelha, magenta e ciana respectivamente. Dessa forma, o tomador de decisão pode planejar a missão aérea e evitar as áreas demarcadas pelos raios de segurança obtidos, levando em consideração o risco de detecção desejável para a missão em tela. Caso as incertezas do cenário operacional não sejam levadas em consideração, o tomador de decisão pode colocar a missão aérea e a vida dos tripulantes em risco ao subestimar a distância de detecção do MANPADS. Ressalta-se que uma limitação deste algoritmo, que deve ser suplantada no futuro, é o fato de não se levar em consideração a influência da radiação refletida pela aeronave, oriunda do sol e do terreno, e do plano de fundo na detecção da aeronave. V. CONCLUSÃO A crescente ameaça e emprego de MANPADS, demanda uma doutrina de planejamento de missões aéreas mais robusta, que aumente a probabilidade de sobrevivência da aeronave e de cumprimento da missão. Visando a propiciar uma ferramenta de auxílio ao planejamento de missões aéreas nesse tipo de cenário, foi desenvolvido um algoritmo para lidar com tais incertezas, denominada MAISA. Pode-se verificar que a ferramenta MAISA é capaz de definir uma área de risco mapeando as probabilidades de detecção da aeronave pelo sistema de MANPADS. O algoritmo leva em consideração as variações de posição do MANPADS, da aeronave, da transmitância atmosférica e do NEI do detector do MANPADS. Com essa informação, no momento do planejamento, é possível definir a rota a ser traçada levando em consideração o risco aceitável para a missão."
	}
