	{
		"id": 57,
		"titulo": "pesquisa de nêutrons térmicos em aeronaves através de medidores embarcados e sua contribuição para a validação de resultados computacionais",
		"autor": "Evaldo C. F. Pereira, Adriane C. M. Prado1, Claudio A. Federico, Lester de A. Faria",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2020/st/ST_11_1.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 2,
		"resumo": "O presente trabalho objetiva a descrever o desenvolvimento de um dispositivo medidor dos níveis de fluência de nêutrons térmicos para emprego em aeronaves durante ensaios em voo, permitindo o levantamento real dos níveis de fluência de nêutrons térmicos incidentes na aeronave, auxiliando na investigação de possíveis discrepâncias nos resultados obtidos em simulações computacionais. O desenvolvimento proposto apresenta, em um volume físico reduzido, um setup de teste de radiação semelhante ao utilizado nos ensaios realizados atualmente no IEAv, no Laboratório de Radiação Ionizante (LRI), o qual é a referência de instrumentação em medições de colisões no padrão NIM (Nuclear Instrumentation Modules). O elemento sensor e detector de nêutrons empregado no dispositivo medidor é um tubo de gás 3He que possui grande robustez, estabilidade e operação bem conhecida. No entanto, o medidor projetado e proposto permite, ainda, a utilização de outros tipos de detectores para exploração de outras faixas de partículas e energias." ,
		"texto": "I. INTRODUÇÃO Com o avanço da microeletrônica e a redução nas dimensões dos footprints dos componentes dos circuitos integrados, colisões de nêutrons térmicos com circuitos integrados embarcados em aeronaves podem causar, desde a ocorrência de alterações temporárias de estado lógico de circuitos integrados, na forma de SEE ou SEU, até a destruição permanente do componente (SEB, SEGR) [1]. Na literatura são facilmente encontrados, e reportados, eventos ocasionados por falhas em equipamentos embarcados sem que haja explicação da ocorrência por defeito em componentes, trazendo a suspeita de que tais eventos sejam provocados por partículas ionizantes [1,6]. Os estudos dos efeitos da radiação sobre os seres vivos, identificados nas pesquisas de física nuclear, bem como aqueles para identificar os limites de exposição máxima e os efeitos da acumulação de radiação ionizante sobre os seres vivos (DOSE), demonstram a elevada importância das medições realizadas em locais de elevada altitude para a mitigação dos níveis de radiação sobre a tripulação e equipamentos embarcados em aeronaves. Alguns dos efeitos mais relevantes da radiação ionizante, bem como suas abreviaturas são descritos a seguir: TID – Total Ionization Dose: dose ionizante total, está relacionada à quantidade de energia da radiação ionizante por unidade de massa, sendo medida em rad, do inglês Radiation Absorved Dose. O rad é uma unidade do sistema centímetro-grama-segundo, CGS, e representa 100 erg de energia por grama do material. No sistema Internacional de Unidades – SI, é utilizado o Gray (Gy) para dose absorvida, sendo 1Gy equivalente a 100rad. Os efeitos da radiação ionizante relacionados a TID, se manifestam ao longo do tempo, sendo efeitos cumulativos proporcionais à dose absorvida pelo material. Nos componentes eletrônicos os efeitos dependem da quantidade de cargas livres formadas pela radiação ionizante que causou a ionização do material semicondutor, por exemplo, o silício - Si. SEE – Single Event Effects: efeitos de eventos simples, são efeitos causados pela radiação ionizante devido a uma colisão de partícula (íons pesados e prótons originados nos raios cósmicos, como por exemplo, explosões solares). Este tipo de efeito ocorre de forma geral nos dispositivos semicondutores, podendo ocasionar falhas permanentes nos dispositivos ou eventos temporários de funcionamento no dispositivo. Entre os tipos de efeitos SEE podemos citar os SEU – Single Event Upset, no qual a informação de um elemento de armazenamento é corrompida; MBU – Multiple Bit Upset, no qual a partícula causa alteração em mais de um bit de informação; SET – Single Event Transient, no qual a lógica combinacional do circuito é alterada pela partícula ionizante, devido à perturbação atingir energias que sejam suficientes para mudar o estado lógico de uma porta; SEL – Single Event Latchup, que é a alteração das características do transistor provocando uma impedância baixa entre a alimentação do dispositivo, podendo inclusive destruí-lo; SEB – Single Event Burnout, ou queima do transistor que ocorre quando a partícula tem energia suficiente para polarizar as junções do transistor; e SEGR – Single Event Gate Rupture, caracterizada pela ruptura da junção de porta de um transistor MOS devido à passagem da partícula ionizante. Estudos realizados e facilmente encontrados na literatura demonstram a natureza das radiações ionizantes (alfa, beta, gama, prótons, nêutrons, pions, pósitrons) presentes em aeronaves que operam em grandes altitudes. Tais estudos constatam a importância dos nêutrons térmicos, dentre todas as partículas nas radiações ionizantes no interior das aeronaves voando a grandes altitudes [1,2]. Atualmente, as ferramentas de simulação do ambiente e dos corpos no interior das aeronaves ganham, mais do que nunca, grande importância para o estudo das radiações ionizantes em sistemas embarcados em aeronaves, fazendo deste tema um ponto essencialmente relevante para o setor aeronáutico e de Defesa. Entretanto, materiais de complexa simulação necessitam de confirmação dos resultados encontrados nas mesmas. Isso pode ser feito por meio de medições em condições reais de voo. Tais medições auxiliam no desenvolvimento de novos materiais para a utilização em aeronaves, materiais estes com características estruturais tais que permitam a absorção, atenuação e blindagem de radiações ionizantes. Assim, podem ser desenvolvidas novas ligas metálicas, cerâmicas e poliméricas, contribuindo para o desenvolvimento de novas aeronaves, com melhores características em relação à radiação ionizante [3,4]. Adicionalmente à necessidade primária por um instrumento de uso nas campanhas de ensaios em voo onde é necessária uma plataforma que atenda longos períodos de medição sem qualquer conexão elétrica com o avião, também é desejável um medidor embarcado permanentemente que informe o piloto sobre níveis elevados de fluência de nêutrons em grandes altitudes de voo, identificando situações potencialmente perigosas de voo, para que o piloto tome ações de alteração de curso, se necessário. Tais fluências de nêutrons ocorrem em algumas regiões do Brasil onde a alta incidência de energias oriundas de radiações cósmicas pode danificar a aeronave e causar problemas de saúde na tripulação. Esses níveis de radiação elevados são oriundos das tempestades solares e causados pela deficiência de proteção nas camadas atmosféricas como na zona de anomalia magnética do atlântico sul [5]. Entendese que tal instrumento deva ter características adequadas que possibilitem sua operação permanente na aeronave. Um instrumento como o proposto também pode ajudar no desenvolvimento de técnicas de mitigação dos efeitos da radiação ionizante nos dispositivos eletrônicos projetados no âmbito do DCTA, bem como em ensaios em dispositivos eletrônicos COTS, regulamentados pela norma ESA 22900. Muitas vezes, devido a embargos tecnológicos, é necessário utilizar tais componentes, sendo sua validação essencial [6,7]. Adicionalmente, poderão ainda se beneficiar deste instrumento os estudos empreendidos nos veículos aeroespaciais que utilizem plataformas de monitoração como as propostas neste trabalho, entre as quais podemos citar os foguetes, satélites e aeronaves voando em grande altitude. Satélites como os desenvolvidos no INPE, o SGDC e seus sucessores poderão se beneficiar dos materiais desenvolvidos com o auxílio deste dispositivo de medição. Dessa forma, o presente trabalho visa a apresentar o desenvolvimento de um dispositivo medidor dos níveis de fluência de nêutrons térmicos para emprego em aeronaves, permitindo o levantamento in situ das características de fluência de nêutrons térmicos incidentes em locais específicos da aeronave, auxiliando na investigação de possíveis discrepâncias nos resultados obtidos em simulações computacionais e facilitando, no futuro, ao desenvolvimento de materiais e de novas topologias de aeronaves mais robustas a esse tipo de partículas. O resultado obtido com o dispositivo irá certamente contribuir para o conhecimento dos mecanismos, características e aplicações dos diversos materiais de utilização em aeronaves voando a grandes altitudes, promovendo a segurança da tripulação e dos equipamentos nela embarcados. II. REQUISITOS DE DESEMPENHO O objetivo do presente trabalho é a concepção de um instrumento de medição dos níveis de fluência de nêutrons térmicos utilizando como elemento sensor um detector a gás 3He polarizado para operar na região proporcional de operação [8] que tenha características técnicas que possibilitem sua operação embarcada em aeronaves. Este detector é sensível aos nêutrons térmicos que são capturados pelas moléculas de gás 3He existentes no seu interior. Essas capturas liberam um par de íons que são coletados como pulsos de descarga nos terminais do detector. Devido à operação na região linear do detector, a descarga da captura de um nêutron não provoca avalanche de descargas no interior do gás permitindo que capture diversos nêutrons sem apresentar latência que inviabilize a identificação de eventos simultâneos, ou quase simultâneos, como nas superposições de capturas de nêutrons. Outra característica do instrumento é que não opere com energia retirada da aeronave, que tenha alimentação autônoma a partir de baterias de íons de lítio para a realização de testes em voo em campanhas de longa duração. Da mesma forma, para não interferir com os equipamentos aviônicos embarcados, deve apresentar baixa emissão eletromagnética durante sua operação nos ensaios. Para permitir adequação aos níveis de energia dos nêutrons, o sinal gerado pelo detector deve ter possibilidade de ser atenuado para que os circuitos elétricos operem em sua região linear com níveis ideais para conversão digital. As ocorrências de capturas devem ter suas energias registradas digitalmente em mídia transportável para posterior análise. Opcionalmente devem poder ser transmitidas, via meio de comunicação, para a formação de um arquivo em dispositivo móvel de processamento remoto. Como características físicas, o dispositivo proposto deve apresentar, em um volume físico reduzido, um setup de teste de radiação semelhante ao utilizado nos ensaios realizados no Instituto de Estudos Avançados, IEAv, no Laboratório de Radiação Ionizante (LRI). Este setup de medição de radiação é a referência em medições de colisões no padrão Nuclear Instrumentation Modules - NIM. O dispositivo de medição de nêutrons térmicos originado a partir deste trabalho possibilitará efetuar levantamento dos níveis de fluência de nêutrons térmicos em regiões específicas da aeronave tanto para a tripulação e passageiros [8,9] quanto para equipamentos aviônicos embarcados, permitindo o levantamento real da fluência de nêutrons incidentes em diversas altitudes, bem como as possíveis discrepâncias encontradas em cálculos de fluência de partículas por meio de simulações computacionais. As medições reais deverão auxiliar no aperfeiçoamento de modelos de simulação, bem como no desenvolvimento de modelos para materiais de construção complexa e na mitigação dos efeitos da fluência de nêutrons sobre a tripulação e sobre os dispositivos aviônicos embarcados na aeronave. A necessidade deste dispositivo é justificada no momento em que há uma grande preocupação por parte das empresas fabricantes de aeronaves, e das instituições de pesquisa, que atuam nas áreas de manufatura aeronáutica, pela redução de peso por meio do emprego de novos materiais e do aumento da imunidade à radiação cósmica dos equipamentos aviônicos nelas embarcados. Dispositivos como este se mostram inovadores e ainda indisponíveis nas instituições de pesquisa e nas empresas aeronáuticas do Brasil, sendo de grande utilidade na pesquisa aplicada ao projeto de aeronaves, possibilitando um salto tecnológico na busca por novas tecnologias e métodos de fabricação. III. MEDIDORES PADRÃO NIM Os medidores de Nêutrons de Laboratório, como os instrumentos ORTEC, seguem o padrão Nuclear Instrumentation Modules – NIM. Estes equipamentos são configuráveis em Setups de Medição adequados às diferentes necessidades de detectores e fontes de radiação, tais como, radiação de nêutrons, radiações gama, entre outros. São usualmente instalados em um rack de 19 polegadas e alimentados por fontes de alimentação dedicadas e ajustáveis que distribuem a alimentação para os módulos nele instalados. Módulos típicos de serem instalados são os pré- amplificadores, amplificadores, fontes de alta tensão para polarização dos detectores e medidores, fornecendo saídas de sinal a cada módulo do Setup. No final do último estágio do setup o sinal de saída é direcionado para a entrada de um conversor análogo/digital – A/D que serve de unidade de aquisição para os programas de tratamento de dados instalados em um computador externo. Os dados recebidos do conversor análogo/digital são transmitidos para um computador externo. Os dados obtidos durante a medição são armazenados na memória do computador externo e são processados por programas específicos de cálculo de fluência e níveis de energia. A informação desejada é obtida em telas de medição. A configuração e parametrização do programa são feitas em telas de configuração e menus de operação que gerenciam os diversos parâmetros da medição. Este equipamento, que é a referência de comparação das medidas obtidas pelo medidor portátil, objeto do presente desenvolvimento, é alimentado pela rede AC comercial e demanda uma quantidade de energia da ordem de centenas de Watts para sua operação. IV. MEDIDORES EMBARCADOS Em comparação com o equipamento Ortec, o medidor portátil é um instrumento dedicado, para uma aplicação específico, e, sendo assim, tudo nele é otimizado para o fim para o qual se destina. Todos os módulos que são necessários para sua operação maximizam o uso da energia das baterias de íons de lítio para que possa ter autonomia para operar durante toda a campanha de testes em voo. Um aspecto muito importante que diferencia este do equipamento de referência Ortec padrão NIM é a aquisição de dados. O intrumento Ortec possui um conversor Análogo/Digital (A/D) com alta velocidade, o qual é alimentado pela porta USB do computador com capacidade de fornecer até 2,5W de potência (5W - com o uso de extensor), sendo os dados obtidos pelo módulo de conversão A/D armazenados em base de dados com alta capacidade (GigaBytes) do PC para posterior análise pelo aplicativo instalado. Em outras palavras, a abordagem demanda alta capacidade de memória, potência elevada para alimentar o sistema de aquisição, alta velocidade para fazer a aquisição dos dados e obter a informação de energia da captura do nêutron. Tais características inviabilizam sua operação por meio de baterias. Assim, se mostra necessário desenvolver uma abordagem alternativa para a aquisição e tratamento da informação da captura, de forma a viabilizar a operação do medidor. V. REQUISITOS DESEJÁVEIS EM MEDIDORES EMBARCADOS E RESULTADOS PRELIMINARES Os medidores, de uma maneira geral, têm como requisitos básicos: A. Precisão e Reprodutibilidade O instrumento requer que cada etapa do processo de medição seja bem caracterizada e definida. Fator importante para a obtenção da precisão necessária é que todos os elementos envolvidos no processo de medição tenham sua operação estável, fontes de referência bem definidas, processos de operação garantidos nas condições de operação do instrumento. A utilização de um detector de nêutrons, baseado em um contador proporcional de 3He, deve garantir a robustez, estabilidade e precisão da medida. Nesse sentido, baseado nos testes realizados no presente projeto, com auxílio de computador, foi desenvolvido um conjunto eletrônico robusto, cuja operação garante a estabilidade e reprodutibilidade das medidas efetuadas. Foram obtidos resultados bastante significativos de precisão dos valores medidos em comparação com os valores teóricos, memores que 1,8% de erro. A metodologia empregada no projeto permitiu obter um resultado bastante preciso, resultando em medidas com elevada estabilidade. B. Exatidão A captura do sinal vindo de detector é digitalizada por meio de conversor análogo-digital de 10 bits que fornece resolução de uma parte em 1024. Esta taxa permite a obtenção de um resultado com elevada exatidão. Os estágios de processamento do sinal analógico e aquisição digital com resolução alta garantem elevada precisão e estabilidade e exatidão na medida. C. Linearidade A escolha do detector proporcional no medidor baseia-se na característica do medidor de fornecer alta linearidade no sinal gerado. A polarização estabilizada do detector garante que o ganho do detector seja constante e a alta excursão permita a linearidade da medida. D. Sensibilidade O detector possui alta sensibilidade aos nêutrons térmicos enquanto o campo elétrico de polarização do gás 3 He garante alta sensibilidade ao medidor. E. Latência Os circuitos eletrônicos de aquisição analógica do medidor não apresentam latência no processamento de sinais oriundos do detector. No entanto, o circuito de conversão análogo/digital requer um tempo para efetuar uma conversão, além do tempo inerente ao setup de conversão. A metodologia empregada pelo medidor permite que a latência de captura entre uma partícula e outra seja muito pequena, da ordem de 3us. Este tempo é inferior ao tempo do pulso gerado pelo tubo detector, garantindo a operação do medidor sem perdas de amostras. F. Estabilidade A metodologia utilizada no projeto do medidor com sinais bem definidos para o processamento, fontes de alimentação de alta estabilidade e processo de conversão análogo/digital estável devem assegurar alta estabilidade às medidas. A tensão da bateria não é diretamente aplicada sobre os circuitos analógicos, fornecendo energia para as fontes auxiliares que têm alta regulação, mantendo-se estável por todo o período de descarga da bateria. Os circuitos de supervisão de energia indicam a hora da troca da bateria quando sua carga estiver esgotada VI. CONSTRUÇÃO DO MEDIDOR DE NÊUTRONS O trabalho foi organizado de forma a resolver um problema existente no Instituto de Estudos Avançados, na Área de Concentração CTE-F de Física e Matemática Aplicadas, relacionado a medições de fluência de nêutrons em aeronaves utilizando um detector proporcional de 3He. Um medidor de nêutrons portátil para ensaios em voo irá fornecer informações reais da fluência de nêutrons térmicos e servirá para avançar as pesquisas da Divisão de Física Aplicada na área de dosimetria, permitindo a comparação dos valores de fluência obtidos nos experimentos com os resultados obtidos por meio de simulação computacional baseado no software MCNP4, e ajudando a melhorar os modelos computacionais utilizados para prever exposição de equipamentos e tripulação à radiação ionizante, com o objetivo de auxiliar no desenvolvimento de técnicas de mitigação dos efeitos da radiação ionizante. As condições de operação do instrumento de medição de nêutrons estabeleceram uma especificação de requisitos que balizaram as características técnicas do trabalho e definiram os objetivos de cada uma das tarefas em que foi planejado o desenvolvimento do medidor. Uma vez definidos os blocos funcionais e suas dependências, foi dado início ao desenvolvimento de cada um deles separadamente e posteriormente os blocos foram sendo integrados até que o sistema completo fosse integrado. A Figura 4 mostra o diagrama em blocos do medidor. O medidor portátil de fluência de nêutrons, é composto pelos seguintes elementos, mostrados na Fig.4 que são: Pack de baterias de 12Vdc/16Ah, Detector 3He mod. SA-P4-0806- 271; Fonte de Alta Tensão de 1500Vdc, Fonte Auxiliar +/- 15V, +/-5V, Pré-Amplificador do Detector, Atenuador/Amplificador/Filtro, Processador Analógico e Processador Digital. A metodologia utilizada para a execução do presente trabalho consistiu em estabelecer objetivos de pesquisa em cada bloco baseados nas características necessárias, identificar a função do bloco com ensaios de caracterização dos elementos funcionais e definir a técnica de abordagem para a criação de cada bloco, dependendo da sua natureza. Os circuitos analógicos (fontes de alimentação, amplificadores, circuitos de discriminação) foram desenvolvidos com uso de Projeto com Auxílio de Computador – CAD, para a síntese de circuitos, criação de estímulos para teste dos circuitos e análise dos resultados. Foram montados e testados protótipos para integração final do medidor. Primeiramente, os protótipos foram montados em placa de circuito de prototipagem com as interligações feitas por fiação não impressa. Protótipos finais em circuito impresso com componentes de tamanho reduzido estão em fase de construção e serão destinados aos testes finais. Os circuitos microprocessados foram desenvolvidos com base nos circuitos de referência e os módulos funcionais de relógio em tempo real, sensores de temperatura e pressão e sistema de posicionamento global (GPS) adquiridos no mercado e interfaceados com circuitos de condicionamento de nível. Foram montados e testados protótipos para integração final do medidor. Os módulos de função específica adquiridos no mercado foram integrados em uma placa de circuito de prototipagem juntamente com o microcontrolador e constituem o conjunto do processador digital. Está prevista a fabricação de um protótipo com circuito impresso e todos os subconjuntos digitais interligados numa placa única de integração digital. Os programas de controle do medidor e de controle das interfaces foram integrados no Ambiente de Desenvolvimento Integrado - IDE do fabricante do Microcontrolador PIC16F877A, em linguagens C e Assembly do microcontrolador. Os módulos finalizados foram integrados em um case portátil para transporte cujas características de volume, peso e robustez são adequadas para operação embarcada em aviões, conforme as Fig.5 e Fig.6. VII. RESULTADOS OBTIDOS A Fig.7 mostra uma aquisição por osciloscópio do sinal do detector, mostrando a captura quase simultânea de dois nêutrons. (encavalamento de pulsos). O gráfico da Fig.8 foi gerado para teste do processador analógico usando o CAD. Ele gera um sinal semelhante ao obtido na saída do amplificador do Detector. A Tabela II mostra os resultados obtidos nas simulações de sinais de estímulo que mimetizam os sinais gerados pelo detector proporcional. A notação das colunas representa as tensões de sinal gerado e sinal de saída e os erros obtidos no processamento. V1, V2 e V3 são os pontos do gráfico da Fig.8 correspondentes à aquisição mostrada na Fig.7. Foi gerado, juntamente com o sinal de teste, um sinal de ruído simulado por sweep senoidal cuja amplitude é mostrada na coluna VR. Os sinais das colunas referem-se a VS (tensão do sinal) e, portanto, existem V1S, V2S e V3S. O sinal detectado pelo processador analógico é chamado de VD e, portanto, temos V1D, V2D e V3D. O erro obtido refere-se à diferença entre as colunas VS e VD. A coluna Erro referese à diferença entre as duas colunas, dividido pelo valor teórico VS e a coluna Erro é o mesmo valor em porcentagem. A coluna CFiltro, refere-se ao valor utilizado de capacitância no filtro passa-faixa que separa o sinal de teste do sinal de ruído injetado. Este ruído tem por finalidade simular ruídos no sinal causados por interferência eletromagnética no detector e no cabo. Na Tabela II, é mostrado que os valores medidos pelo processador analógico e disponibilizados para conversão pelo conversor A/D apresentam resultados dentro de 1,8%, no pior caso, do valor de sinal injetado no processador analógico. Os resultados obtidos demonstram que a solução encontrada para determinar o nível de sinal desejado do pulso de coleta da carga do nêutron, apresenta os resultados desejados para o medidor. A solução requer baixa potência para operar, disponibiliza o resultado para conversão A/D com tempo adequado para operação por um conversor de baixo custo e baixo consumo e adequado para um medidor que precisa operar durante muitas horas a partir de baterias. O resultado do presente trabalho poderá ser aplicado, de forma semelhante, a outros tipos de partículas e outros tipos de sensores específicos, com o objetivo de obtenção de um instrumento multi-partícula. Os resultados obtidos e apresentados nesse artigo serão detalhados na Dissertação de Mestrado do 1º. autor. VIII. CONCLUSÕES O presente trabalho visou a apresentar o desenvolvimento de um dispositivo medidor dos níveis de fluência de nêutrons térmicos para emprego em aeronaves, ou em outras situações nas quais um equipamento portátil e autossuficiente em energia seja necessário, permitindo o levantamento real dos níveis de fluência de nêutrons térmicos incidentes na aeronave, auxiliando na investigação de possíveis discrepâncias nos resultados obtidos em simulações computacionais e facilitando, no futuro, o desenvolvimento de materiais e de novas topologias de aeronaves mais robustas contra esse tipo de partícula. Os resultados obtidos no presente trabalho demonstraram a viabilidade de desenvolver um instrumento dedicado de medição de fluência de nêutrons térmicos para uso embarcado em ensaios em voo em aeronaves, possuindo pequeno volume, alta viabilidade de uso autônomo, por meio de alimentação independente e com alta precisão, robustez, exatidão, linearidade, sensibilidade e estabilidade, somada a uma baixa latência. Testes adicionais serão realizados para avaliar os parâmetros operacionais e desempenho do equipamento após montagem."
	}
