	{
		"id": 58,
		"titulo": "monitoramento de plumas radioativas utilizando vants",
		"autor": "Gabriel C. C. Silva, Marielcio Lacerda, Joyce C. M. Silvestre1, Luiz Claudio de Faria; Elcio H. Shiguemori, Claudio A. Federico",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2020/st/ST_04_1.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 2,
		"resumo": "O monitoramento de potenciais liberações atmosféricas em ocasiões de acidentes nucleares é uma preocupação que vem crescendo devido ao aumento no número de usinas nucleares utilizadas no mundo. No entanto, não é uma tarefa simples, devido a diversos fatores de risco que existem nesta área, sendo exemplos disto, o risco do desenvolvimento de efeitos biológicos nas equipes envolvidas e a contaminação do ambiente e equipamentos. Com isso tem se optado por novas técnicas para realizar este monitoramento de forma segura, a fim de minimizar a exposição humana, e, propor uma solução, flexível e rápida para o auxílio em ocasiões envolvendo radiação. Uma destas técnicas envolve o uso de Veículo Aéreos Não Tripulados. Estes VANTS proporcionam novos meios de se realizar o acompanhamento destes eventos, minimizando o envio de seres humanos. Neste trabalho, é apresentada uma abordagem preliminar para o mapeamento e monitoramento de plumas em áreas afetadas por radiação.",
		"texto": "I. INTRODUÇÃO A radiação é uma área de estudo que vem ganhando diversos campos de atuação desde sua descoberta no final do século XIX [1], sendo muito utilizada em áreas médicas para a prevenção de doenças [2][3][4] e ou para a produção de energia em grandes quantidades. Como consequência destas atividades, faz-se necessário o monitoramento de fontes radioativas [5] em diferentes situações, dentre as quais, por exemplo, desastres decorrentes de catástrofes que podem ocasionar vazamentos de material radioativo nocivos ao ambiente e ao ser humano, e afetar a operação de diversos tipos de maquinários [6]. Este tipo de desastre também pode ocorrer em casos de usinas termonucleares que precisam ter um controle restrito sob os radioisótopos que são utilizados para a produção de energia, ou seus subprodutos radioativos. Tal fonte de energia vem com diversos riscos, sendo um deles o vazamento material radioativo em casos de acidentes, deterioração da estrutura ou acidentes naturais, como maremotos e tsunamis [7]. Estes vazamentos podem apresentar graves riscos a vida humana e ao meio ambiente, podendo resultar em mutações, câncer e doenças crônicas [1][8]. Nestes casos muitas vezes para que o monitoramento seja feito, é necessário a mão de obra humana em diferentes graus de proximidade das fontes radioativas criando assim a possibilidade de exposição. Com isso diversas abordagens são desenvolvidas para diminuir o risco do contato de material radiológico com o ser humano, uma destas é o uso de aeronaves como helicópteros, e mais recentemente o uso de Veículos Aéreos Não Tripulados (VANT). Estas aeronaves são capazes de realizar voos rápidos com grande flexibilidade de altura e são capazes de carregar sensores de baixo custo capazes de auxiliar no monitoramento e prevenção de acidentes. Estes sensores existem em uma ampla gama de funcionalidades que podem ser operacionalizadas e exploradas para facilitar o monitoramento de zonas de perigo ou para a prevenção de acidentes. Como consequência, tornase necessária a integração de diferentes tecnologias tais como técnicas de visão computacional, o uso de VANTS e os diferentes sensores existentes para auxiliar a prevenção e em caso de acidentes, diminuindo a exposição humana. No presente trabalho são reportados resultados preliminares obtidos em um exercício simulado na usina nuclear de Angra dos Reis (RJ, Brazil), em 2019, utilizando um sistema de medição simplificado, bem como são discutidos aspectos e requisitos do desenvolvimento de um sistema mais completo e complexo, ainda em elaboração. Estão também sendo desenvolvidas técnicas para o mapeamento de regiões afetadas por radiação, para facilitar a caracterização de eventos importantes envolvendo liberações de contaminantes radiológicos ou nucleares e para o auxílio ao monitoramento de fontes radioativas. II. METODOLOGIA O trabalho está sendo desenvolvido em duas etapas distintas: na etapa preliminar foi realizado um ensaio em campo com equipamento mais simples, para se determinar a dinâmica e as características desejáveis ao sistema em sua utilização em um cenário simulado, mais próximo possível da situação real. Na segunda etapa, referente ao desenvolvimento de um sistema dedicado, está sendo montado um sistema mais complexo, com as características e requisitos especificados na etapa preliminar. A. Etapa preliminar. Em uma primeira fase de desenvolvimento, o sistema foi utilizado, como teste, no exercício geral de emergência nuclear da usina nuclear de Angra dos Reis, ocorrido em 2019. Este exercício consiste em um esforço conjunto das forças armadas, com o apoio do governo de Angra e cidades vizinhas, além do apoio das instituições regulamentadoras na área de energia nuclear e proteção radiológica brasileiras e internacionais, como a CNEN (Comissão Nacional de Energia Nuclear) e a IAEA (Agência Internacional de Energia Atómica). O exercício consiste em uma série de eventos envolvendo a usina nuclear de Angra como centro. Onde cada evento simula a evolução de um acidente nuclear real. Em cada uma das fases, diferentes órgãos públicos são acionados e ações são tomadas, desde evacuação de civis, resgate de pessoas feridas e contaminadas e mobilização de tropas, aeronaves e navios. Durante uma determinada fase dos exercícios, o sistema de medição aqui descrito foi utilizado, como teste de conceito, no monitoramento do espaço aéreo afetado por potencial pluma radiológica/nuclear, e assim comprovar a simulação do Sistema ARGOS, que simula diversos cenários de espalhamento de pluma radioativa e de deposição de material contaminante na atmosfera e em solo. Estas ações visam dar suporte à Força Aérea Brasileira (FAB) no atendimento às suas obrigações de controle do espaço aéreo em situações de defesa radiológica/nuclear, conforme especificado na Diretriz do Comando da Aeronáutica, DCA 1-6 [9] Para este ensaio foi selecionado o detector RadEye G/N, apresentado na Fig. 1. Este detector, previamente calibrado, foi carregado pelo VANT matrice 600 em uma rota pré- definida sobrevoando as regiões da praia Brava e da praia de Mambucaba, exemplificada nas Fig. 2 e 3. Cada voo ocorreu em uma altura de 100 metros, à 30 km/h, com o intuito de simular o VANT realizando o monitoramento de uma pluma que seria liberada pela usina, algumas horas após o início da simulação do acidente.  Tal sensor é capaz de detectar ondas eletromagnéticas na faixa dos raios X e raios gama por meio de um cristal cintilador existente em seu interior, sendo muito utilizado em checkups de containers contendo fontes radioativas, em aplicações médicas, de pesquisa, ou em situações de acidentes onde ocorreu alguma exposição a material radiológico. Os detectores de cintilação utilizam a emissão de radiação visível ou luz UV, gerada pela radiação que passa por certos materiais. Como a quantidade de energia depositada no cristal depende da energia da radiação incidente, esses tipos de detectores também podem determinar o espectro de energia da radiação incidente. Devido à conversão indireta da energia de radiação em um sinal elétrico, e a necessidade empregar componentes eletrônicos adicionais para processamento de luz visível, esses detectores geralmente são mais pesados que outros tipos de detectores além de serem extremamente sensíveis a danos por impacto. Já as câmaras de ionização consistem em um tubo cheio de gás com um campo elétrico induzido por uma fonte de tensão. A passagem de radiação através do tubo faz com que o gás ali presente se ionize e as cargas sejam coletadas pelo circuito. A principal vantagem deste tipo de detector é seu baixo custo. No entanto, sensores de tamanho pequeno desse tipo geralmente não tem a sensibilidade necessária para detectar fontes comparativamente fracas, devido à baixa densidade dos átomos nos gases [10]. Esses detectores fazem a leitura dos dados na grandeza de equivalente de dose ambiente, que, após conversão para dose efetiva, é utilizada para avaliar o efeito da radiação ionizante no tecido biológico. A unidade do Sistema Internacional de Unidades para a avaliação destas grandezas é o sievert (Sv) [11]. Também são utilizados sensores de GPS para a obtenção da posição do veículo. Para o projeto estão sendo utilizados GPS’s classificados como RTK (Real Time Kinematic). Estes sensores trabalham analisando o comprimento de onda portadora dos sinais do satélite, sendo corrigidas por uma estação de solo com um ponto de referência geo referenciado. Este modo de detecção em conjunto com a correção é capaz de aumentar a precisão do posicionamento, abaixando a imprecisão do posicionamento para 3cm, em contrapartida a GPS’s comuns que tem faixas de erro de 5m a 12m [12]. Este GPS é embarcado no VANT matrice 600, ambos apresentados na Fig. 4. B. Etapa de desenvolvimento de sistema dedicado. No desenvolvimento da aplicação está sendo utilizada a linguagem de programação Python, em conjunto com as bibliotecas de visão computacional OpenCV e Seaborn.Heatmap com seu diagrama apresentado na Fig.5. Esta aplicação faz uso de dados coletados durante o voo de um VANT que possui sensores sensíveis a radiação e de GPS embarcados. As bibliotecas utilizadas viabilizam a geração de um mapa com os dados coletados. Estes mapas são criados utilizando dados como a posição real do veículo carregando os sensores sensíveis a radiação. A biblioteca OpenCV foi utilizada pois possibilita o manuseio da imagem no código. Já a biblioteca Seaborn.Heatmap foi utilizada pois a mesma é utilizada na geração de mapas. O sistema é apresentado na Fig.6. Nesta etapa estão sendo utilizados diversos sensores para a coleta de dados utilizando VANTS, devido a sua flexibilidade de movimentação aérea e da capacidade de integração com os sensores utilizados. Dentre os sensores, está sendo estudado um arranjo com detector com capacidade de detectar diferentes espectros da radiação, apresentado na Fig. 6. O sistema possui como característica a capacidade de capturar o espectro da radiação incidente, possuindo a capacidade de identificar os radionuclídeos envolvidos por meio da análise da curva espectrométrica, bem como podendo discernir faixas específicas de energia, o que permite a avaliação de um determinado contaminante na presença de outros. A versão final também poderá, mediante calibração adequada, avaliar a taxa de dose de radiação presente, de forma a poder gerar dados de validação para as ações de simulação de plumas radiológicas/nucleares. III. RESULTADOS E DISCUSSÕES Ao final de cada voo realizado em Angra dos Reis, os dados do sensor em conjunto com os dados do GPS foram retirados manualmente para análise e geração de mapas de calor, visando o auxílio ao ensaio. Estes dados foram utilizados para a geração de mapas que seriam utilizados pela equipe de evacuação das vilas próximas a usina nuclear, e pelo comando geral durante os eventos da simulação da usina nuclear de angra. Nas figuras 7, 8 e 9 são apresentados exemplos preliminares de como o algoritmo se comporta em relação ao GPS e as leituras da dose no momento. São apresentados dados obtidos durante voos nas praias de mambucaba e brava. Na Fig. 8, é possível visualizar a diferença entre as doses nos locais sobrevoados. Estas doses são obtidas na escala de microSievert (µSv), pois durante os testes na simulação da usina nuclear de angra não é possível o uso de fontes radioativas, por se tratar de um teste em zona urbana populosa. Na Fig. 9. é apresentada uma média da nuvem de pontos obtidos pelo GPS RTK, que por sua vez apresenta uma taxa elevada de aquisição de dados, sendo obtidas de 15 a 20 leituras por segundo, em contrapartida, o detector utilizado para a medição da dose apresenta leituras na faixa de 1 leitura por segundo. Com os testes realizados em Angra foi possível determinar pontos importantes de melhora dentro da proposta do sistema, sendo um dos mais importantes a telemetria de dados em tempo real em grandes distâncias, e a independência de sistemas de terceiros, como por exemplo o GPS proprietário do vant matrice 600, para evitar-se problemas durante próximos voos. Com isso optou-se pelo desenvolvimento de um payload, contendo o algoritmo de mapeamento embarcado, um GPS e o detector de radiação, dando maior flexibilidade ao sistema, podendo ser carregado por qualquer aeronave. O sistema também será utilizado de forma principal para a validação das simulações de plumas atmosféricas radiológicas e nucleares, que são realizadas utilizando a plataforma ARGOS, existente nos laboratórios do IEAv."
	}
