	{
		"id": 59,
		"titulo": "knn e rede neural convolucional para o reconhecimento de plataformas de petróleo em imagens sar do sentinel-1",
		"autor": "Leonan Entringer Falqueto, Ricardo Suterio, Rafael Lemos Paes e Angelo Passaro",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2019/st/ST_03_3.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 2 ,
		"resumo": " O reconhecimento automático de alvos (plataformas petrolíferas) por meio de imagens de radar de abertura sintética (SAR) de média resolução auxilia a vigilância de áreas extensas como o Atlântico Sul. Esse trabalho aprofundou o estudo do emprego da VGG-16 como extratora de atributos para alimentar algoritmos de Machine Learning, especificamente, o kNN. Variou-se o número de vizinhos para um conjunto de amostras de imagens SAR do Sentinel-1 contendo plataformas marítimas e falsos-alarmes, usando um experimento com 50 blocos de treinamento e teste. Demonstrouse que o ajuste de parâmetros do classificador apresenta melhorias significativas, com um incremento de 6,46% no indicador AUC. ",
		"texto": " I. INTRODUÇÃO O Brasil, assim como os demais países com grandes dimensões territoriais, enfrenta o desafio de manter a vigilância sobre extensas áreas. Essa tarefa é sintetizada no conceito da Dimensão 22, veiculado pela Força Aérea Brasileira [1]. Os satélites imageadores proporcionam, rotineiramente, uma grande massa de dados distribuídas, inclusive, gratuitamente. Tais dados, se bem utilizados, podem contribuir para solucionar a questão da vigilância. Dentre esses sensores, destaca-se os satélites com SAR, que produzem amplas faixas de imageamento, operam diuturnamente e utilizam a banda espectral das micro-ondas, pouco afetada pelas condições meteorológicas da troposfera (atenuação do sinal por absorção de energia eletromagnética). Diversas constelações estão em operação nas principais bandas (X, C e L) e com diversas configurações, em termos de resolução e de polarização. Na verdade, a abundância de dados alçou o SAR à era do Big Data [2], [3]. A média de dados diária do Sentinel-1 (satélites SAR do Projeto Copernicus da ESA – European Space Agency), obtida no mês de novembro de 2017 foi de 3,79 Tb [3], [4]. A tendência é que essa a quantidade de dados aumente consideravelmente com a operação do Projeto NISAR, com a previsão de 85 Tb/dia [5]. Portanto, há uma necessidade premente de automatização no processo de vigilância por imagens orbitais, ou seja, são necessários métodos eficientes para tratar e sintetizar essa quantidade dados em informações de apoio aos processos decisórios. Dentre os alvos artificiais de interesse no oceano, a literatura é vasta para manchas de óleo e navios, porém pouco foi relatado sobre plataformas marítimas [6], [7]. Estudar a interação da onda eletromagnética com as plataformas marítimas tem relevância para as áreas de inteligência militar e econômica, para segurança da navegação naval e aérea de baixa altitude, para antecipação de providências em casos de desastres ambientais provocados por acidentes ou fenômenos naturais como furacões e para vigilância em casos de poluição ambiental. Além disso, uma das principais motivações é que a verdade de campo é obtida facilmente, por ser um alvo metálico parado e, normalmente, de posição conhecida. Isso facilita a extrapolação do conhecimento para outros objetos de interesse como navios, sobre os quais não é tão simples obter a verdade de campo. O desafio para reconhecimento de plataformas petrolíferas é a dinamicidade do ambiente marítimo associada à presença de muitos alvos semelhantes, enquanto elas apresentam características geométricas diversas, não apresentando um comportamento tão homogêneo quanto ao retroespalhamento do sinal radar [6]–[8]. No âmbito das técnicas de reconhecimento automático de alvos por meio de deep learning, as Redes Neurais por Convolução (CNN) apresentam resultados promissores com imagens SAR de média e alta resolução. Uma taxa de acurácia de 79% foi alcançada para o reconhecimento de três tipos de navios (graneleiro, contêiner e petroleiro) usando imagens de média resolução Sentinel-1 (5m x 20m, SLC) [9]. O estado da arte no reconhecimento de alvos foi alcançado por meio de avanços na aprendizagem profunda [10]–[16], incentivando novos estudos em vigilância marítima com imagens coletadas pelos sensores espaciais atuais. Por exemplo, a CNN é usada para classificar quatro tipos de navios em imagens SAR de alta resolução (1,5m x 2,0m) do COSMO-SkyMed em [17]. Em [18], atingiu-se mais de 90% de acurácia na discriminação entre cinco classes de objetos metálicos no mar em imagens de alta resolução do TerraSAR-X (1,0m x 2,0m). Em [7], foram comparadas duas CNN para extrair atributos de imagens SAR para o reconhecimento de plataformas de petróleo. Esses atributos foram submetidos a seis algoritmos de Machine Learning para finalizar o processo de distinção entre as plataformas de petróleo e os falsos-alarmes: kNN, Regressão Logística, SVM, Random Forest, Árvore de Decisão e Naïve Bayes. A melhor performance foi obtida utilizando o algoritmo de Regressão Logística, extraindo-se atributos por meio da VGG-16 de imagens SAR com a polarização VH, alcançando a acurácia de 86,4%, como média de 50 testes. Não houve parametrização dos algoritmos de Machine Learning empregados em [7]. Experimentos adicionais podem sugerir parâmetros que permitam alcançar o desempenho obtido com imagens de alta resolução também com imagens de média resolução. Este trabalho procurou iniciar tal estudo avaliando o algoritmo de configuração mais simples: o kNN (k-Nearest Neighbor, em português, kvizinhos mais próximos). Executou-se um experimento variando o fator k em quatro níveis (k = [3, 7, 15 e 31]), utilizando a seleção do conjunto de treinamento e de teste como bloco [19]. O objetivo principal é verificar se a acurácia do classificador sofre alterações significativas ao recorrer a um ajuste de parâmetros para a tarefa proposta em [7]. O artigo apresenta na próxima seção o método empregado por [7] para o reconhecimento de plataformas marítimas e o algoritmo kNN. A Seção III apresenta a metodologia, bem como os procedimentos de avaliação do experimento, seguida dos resultados e das discussões na Seção IV. II. REDES NEURAIS CONVOLUCIONAIS E O KNN Em [7], duas redes neurais convolucionais, a VGG-16 e a VGG-19, foram utilizadas como extratoras de atributos de 800 amostras de imagens SAR, sendo 400 de cada polarização, 50% plataformas offshore e 50% falsos-alarmes. Esse trabalho utilizou a configuração de melhor desempenho, ou seja, a VGG-16 extraindo atributos das 400 amostras da polarização VH. A VGG-16 é uma rede neural convolucional profunda com arquitetura ilustrada na Fig. 1 [20], [21]. Ela é composta por cinco grupos de camadas de Convolução e de Max Pooling, seguidas por três camadas fully conected. A rede usada foi aquela implementa em [22], que já é treinada no banco de dados ImageNet [23]. A última camada fully conected de 1000 neurônios (fc8) é substituída pelo algoritmo de classificação supervisionada kNN, sendo esse algoritmo alimentado pelo output da camada anterior (fc7), isto é, por 4096 valores que compõe o vetor de atributos. Esse artifício foi utilizado, pois o conjunto de amostras é pequeno para treinar uma rede completa ou, simplesmente, a camada final de classificação. O algoritmo kNN compara a amostra sob teste com k vizinhos mais próximos e classifica de acordo com a classe predominante, podendo ser a comparação ponderada por algum fator (peso). Para determinar os vizinhos mais próximos, a amostra é posicionada no espaço de atributos e a distância para todas as amostras de treinamento é calculada. O espaço de atributos é organizado tendo em cada dimensão (eixo) um dos atributos. Os parâmetros são o tipo de cálculo de distância, o número de vizinhos (k) e peso de cada vizinho para comparação [24]. A Fig. 2 ilustra a classificação de uma amostra por meio de kNN com o uso de distância Euclidiana, número de vizinhos igual a 3 e peso uniforme. III. MATERIAIS E MÉTODOS Conforme explicitado anteriormente, foram utilizadas 400 amostras na polarização VH, obtidas de imagens do satélite SAR Sentinel-1 (produto GRD), com resolução de aproximadamente 20m em range x 22m em azimute, pixel spacing de 10m x 10m, número de looks de 5 em range para 1 em azimute e Número Equivalente de Looks (ENL) de 4,4. Alguns exemplos de amostradas são apresentados na Fig. 3. Essas mesmas amostras, bem como os mesmos atributos extraídos pela VGG-16, são utilizadas para compor o conjunto de treinamento e teste para o algoritmo kNN. Notase na Fig. 3 que as imagens SAR são muito parecidas. Isso torna a tarefa de determinar visualmente se a amostra é de uma plataforma ou não muito complexa para um especialista. O procedimento adotado é executar 50 repetições do experimento, nas quais o conjunto de testes e o de treinamento são escolhidos a partir das 400 imagens da base de dados. Em cada repetição, 80 amostras são selecionadas aleatoriamente para compor o conjunto de teste balanceado entre plataformas e falsos-alarmes, enquanto as outras 320 compõem o conjunto de treinamento também balanceado. Por balanceado, entende-se que os conjuntos são compostos por 50% de plataformas e 50% de falsos-alarmes. Portanto, cada repetição é considerada um bloco de experimentação, de forma que a variância proveniente da seleção de amostras não afete a comparação dos tratamentos. Cada bloco de treino e teste foi submetido ao kNN com quatro níveis para o fator número de vizinhos, ou seja, quatro tratamentos: 3 (parâmetros empregado em [7]), 7, 15 e 31. Para todos os tratamentos, foi utilizada a distância Euclidiana e o peso uniforme. A análise foi feita com os indicadores AUC e Acurácia [25], inicialmente de forma gráfica por meio da visualização em boxplots da distribuição dos resultados. Posteriormente, foi feita a ANOVA, a análise de resíduos e o teste de Tukey. Algumas informações sobre Recall foram extraídas para verificar se o algoritmo tende a ser conservador ou liberal, considerando as plataformas de petróleo como alvo de interesse [19]. IV. RESULTADOS E DISCUSSÃO A Tabela I apresenta para os indicadores AUC, Acurácia e Recall [25] os valores de: média, mediana, variância, desvio-padrão e o p-value do Teste de Shapiro-Wilk [19]: A Fig. 4 e a Fig. 5 apresentam graficamente as distribuições dos resultados para os indicadores AUC e Acurácia para cada um dos tratamentos: A Tabela II apresenta os resultados da ANOVA tanto para o indicador AUC, quanto para o indicador Acurácia, mostrando que há diferença estatística (significância de 5%) para as médias das distribuições das Fig. 4 e Fig. 5. A análise dos resíduos da ANOVA para o indicador AUC apresenta o valor-p para o teste de normalidade de 0,173 (Teste de Shapiro-Wilk - W = 0,9899), e para o teste de homogeneidade das variâncias de 4,8E-05 (Teste de Bartlett). A análise dos resíduos da ANOVA para o indicador Acurácia apresenta o valor-p para o teste de normalidade de 0,9503 (Teste de Shapiro-Wilk - W = 0,99672), e para o teste de homogeneidade das variâncias de 0,0153 (Teste de Bartlett). O Teste de Tukey (significância de 5%) de ambos os indicadores é apresentado na Tabela III. Conforme esperado, os classificadores necessitam de uma parametrização adequada para alcançar o melhor desempenho, pois a ANOVA tanto para Acurácia, quanto para AUC são significativas, demonstrando que há diferença na média dos tratamentos. Houve melhora de 6,46% na AUC, 5% no Recall e 3,14% na Acurácia, considerando o tratamento com pior e com o melhor desempenho. O fato de o Recall apresentar uma melhora percentual de praticamente o dobro da Acurácia representa que a parametrização impactou mais o reconhecimento das plataformas de petróleo do que o dos falsos-alarmes. O Recall é a proporção de plataformas corretamente previstas com o total dessa classe existente no teste. A Acurácia considera os acertos de ambas as classes em seus cálculos. Ressalta-se que o classificador tem um comportamento liberal, ou seja, acerta bastante a classe positiva (plataformas de petróleo), mas também tende a errar mais a classe negativa (falsos-alarmes). Ao comparar a tabela de Recall com a Acurácia, percebe-se que primeiro indicador é maior que o segundo em todos os tratamentos, uma característica para um classificador liberal, quando atuando em classificação binária balanceada. Foram testadas as quantidades de vizinhos que variam de 0,93% da massa de treinamento (k=3) a 9,69% (k=31). A quantidade de vizinhos influencia como o classificador tende a perceber a topologia do espaço de atributos. Quanto maior, mais tende-se a classificar de acordo com um comportamento regional dentro do espaço de atributos, pesando menos os detalhes locais. Assim, quanto maior k, supõe-se que os ruídos afetem menos a classificação, porém tende-se a suavizar as bordas dos limites entre as classes. Com isso, classes não-linearmente separáveis podem ser de difícil distinção ao utilizar um k muito grande em termos proporcionais ao conjunto de treinamento. Para os resultados do experimento, percebe-se que k=3 apresenta o pior resultado, com média igual 0,0767. Portanto, o número muito pequeno de vizinhos provavelmente sofreu influência dos ruídos locais. Ao utilizar o k=31, não se percebe melhora significativa. Na verdade, a média de todos indicadores começa a cair. Pode-se inferir que as classes possuem limites complexos. Para um número de vizinhos muito grande, o classificador deixa de ser sensível aos detalhes das fronteiras entre as classes. Além disso, um número maior de vizinhos exige um poder computacional maior, devido a maior quantidade de comparações necessárias. Para essa base de dados, provavelmente o número de vizinhos ideal estaria próximo a 15, ou seja, em torno de 5% do conjunto de treinamento. Quanto aos resultados da referência [7], notou-se uma melhoria de 5,9% na AUC, passando de 0,825 para 0,874, confirmando que a parametrização do algoritmo oferece mudanças significativas em termos operacionais e estatísticos. V. CONCLUSÃO Nesse trabalho, continuou-se uma pesquisa que utilizou Redes Neurais Convolucionais para extrair os atributos de imagens SAR de média resolução de plataformas de petróleo (alvos de interesse) e falsos-alarmes. O objetivo era verificar se a parametrização do classificador que processava tais atributos tinha influência significativa no desempenho do reconhecimento automático desses alvos artificiais. O classificador empregado foi o kNN e testou-se o parâmetro número de vizinhos em quatro níveis (k= [3, 7, 15 e 31]). Chegou-se à conclusão de que há diferença na performance, sendo que os tratamentos com 7 e 15 vizinhos alcançaram as melhores médias para os três indicadores utilizados. Percebeu-se que o kNN tem um comportamento liberal para o tipo de alvo classificado. Como trabalhos futuros, sugere-se um estudo mais detalhado da parametrização do kNN, bem como dos demais algoritmos empregados na pesquisa de base desse trabalho, para que se possa atingir o estado-da-arte em algoritmos ATR usando imagens de média resolução. A ampliação do banco de amostras também pode contribuir para resultados melhores. Além disso, seria interessante testar o kNN associado à VGG-16 em outras bases de dados de imagens SAR com mais classes para verificar se o comportamento do algoritmo é semelhante. Contribuiu-se para a melhoria de sistemas de vigilância de grandes áreas, de forma que o controle da Amazônia Azul, por exemplo, seja beneficiado pelo emprego de técnicas ATR que usam a abundância de dados gerada pelos sensores espaciais. "
	}
