{
    "id": 60,
    "titulo": "formas de onda em comunicações militares com baixa probabilidade de detecção",
    "autor": "marcos arend",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2019/st/ST_01_2.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Cada ambiente ou necessidade operacional deve definir as Formas de Onda mais adequadas, de acordo com os requerimentos específicos de missão. Em geral os diferenciais das comunicações táticas estão na necessidade da Baixa Probabilidade de Detecção (LPD), interoperabilidade e resiliência à interferência (jamming) do canal de comunicação. O presente trabalho busca analisar os requisitos para a avaliação de formas de onda, apresenta as formas de onda multi-portadoras quanto às características LPD e propõe uma solução de espalhamento espectral multi-portadora com espalhamento em tempo e frequência utilizando mesmo código (código único).",
    "texto": "I. INTRODUÇÃO No Brasil, o tema Forma de Onda em Comunicações Militares tomou vulto a partir do projeto Rádio Definido por Software de Defesa (RDS-Defesa) que foi aprovado pela Portaria nº 2.110, de 2012, do Ministério da Defesa (MD). Conta com a participação das três Forças Armadas. De modo geral, países onde o RDS já faz parte da doutrina operacional, as formas de onda são padronizadas e gerenciadas pelo MD destes países, garantindo interoperabilidade, segurança e valor operacional no uso pelas forças. O documento de Padronização e Gerenciamento de Formas de Onda de Comunicações do Departamento de Defesa Americano (DoD) [1] é um exemplo de doutrina para estabelecimento de formas de onda. Em particular, o espalhamento espectral (SS), como característica de forma de onda, teve seu desenvolvimento focado em comunicações militares [2], apresentando baixa probabilidade de detecção (LPD), resistência a jamming e possibilidade de uso simultâneo do canal de comunicação por multiusuários (divisão por códigos) [2]. A desvantagem do SS é a necessidade de banda larga para altas taxas de dados, levando a maior susceptibilidade ocasionado por canais seletivos e pontos móveis (doppler) [3]. Soluções multiportadoras foram desenvolvidas visando à facilidade de equalização dos canais de transmissão em banda larga [3]. Analisa-se a Multiplexação por Divisão de Frequências Ortogonais – OFDM e Acesso Múltiplo por Divisão de Código em Multiportadora (MC-CDMA). A maioria dos trabalhos anteriores investigou o desempenho Multiportadora em canais de comunicação, sem muita atenção às características LPD, tema deste artigo. Os maiores desafios das comunicações militares estão no uso do espectro eletromagnético, e são resultantes da diversificação dos cenários operacionais e suas plataformas, da taxa de transmissão de dados e do ambiente de Guerra Eletrônica (Fig. 1). A definição da Forma de Onda é ponto central para o atendimento a estes desafios [1]. Quanto à estrutura do artigo. A Seção II analisará a importância e a definição de forma de onda, a Seção III abordará as técnicas usadas para detecção, a Seção IV fará uma introdução sobre espalhamento espectral e sua detecção, a Seção V ilustrará as opções de multiportadora e a Seção VI apresentará a simulação da proposta multiportadora LPD. II. IMPORTÂNCIA E DEFINIÇÃO DE FORMA DE ONDA As Formas de Onda são o centro das capacidades de comunicação de um rádio. Chamamos de Forma de Onda o sinal gerado pelos equipamentos de comunicação (transmissores) com a finalidade de propagar-se em um meio (canal) até os receptores. Este sinal pode apresentar desde uma simples modulação até uma complexa codificação em tempo e frequência. As Formas de onda se tornaram definíveis aos usuários com o advento da tecnologia RDS. A Forma de Onda é definida em função das características desejadas da comunicação (taxa de transmissão de dados, resiliência a jamming, LPD, otimização de uso do espectro, etc), das limitações do hardware e do cenário operacional. A definição de alguns parâmetros, como modulação, sincronização, equalização, taxa de comunicação e banda dependem de mapear as condições do canal para uma otimização. A característica do canal é apenas um dos diversos parâmetros necessários para o projeto de uma forma de onda. Ela deve otimizar várias funções enquanto atende a vários critérios [1]: • Deve atender aos requerimentos de disponibilidade e taxa de erros. • Deve ser de fácil sincronização entre transmissor e receptor. • Deve atender às restrições de potência exigidas pelas agências reguladoras de comunicação. • Deve ser robusta quanto à dinâmica dos canais, na presença de interferência por múltiplos caminhos, nas interferências conhecidas e causadas por equipamentos de Guerra Eletrônica (EW). • Deve ser eficiente na ocupação da banda; é preciso usar toda a capacidade disponível do canal de forma eficiente. Deve apresentar características de segurança, como LPD. • Deve ser implementável no hardware quanto à capacidade exigida para processamento. De maneira a atender as condições de sistemas, as Formas de Onda tipicamente são combinadas com: • Técnicas de múltiplo acesso e protocolos. • Estratégias de equalização de canal. • Criptografia e técnicas de autenticação. • Métodos de correção de erros. • Esquemas de diversidade de antenas (MIMO). Em um mesmo ambiente de combate, podemos encontrar diferentes Formas de Onda, elas devem ser avaliadas, testadas e validadas para uso pelas forças de maneira integrada. O documento [1] apresenta uma metodologia para avaliação de Formas de Onda: • Comparar com as Formas de Onda Disponíveis, avaliando o grau de melhorias. • Grau de Interoperabilidade obtido. • Custos relacionados ao Ciclo de Vida. • Importância Operacional. • Análises de segurança. Baseadas em ameaças de Equipamentos de Inteligência de Comunicações (COMINT). Existem diversas Formas de Onda desenvolvidas para o segmento de defesa, como as formas de onda GPS, de designação e controle de armamentos (NCW), Mobile Ad hoc Network (MANET), Demand Assigned Multiple Access (DAMA), etc. Tais definições de Formas de Onda são consideradas internacionais, que visam à padronização de uso e interoperabilidade entre hardwares. Existem formas de onda cujo desenvolvimento e usos são controlados, de uso específico de uma força ou nação. Obtemos algumas vantagens em desenvolver uma forma de onda nacional: -Desenvolvimento de Contramedidas Eletrônicas (ECCM), como espalhamento espectral, ou salto em frequência sobre controle nacional, adicionando uma nova camada de segurança à Forma de Onda. -A forma de Onda nacional pode ser otimizada para missões e cenários específicos. III. MÉTODOS DE DETECÇÃO Detecção significa confirmar a presença de um sinal com determinada probabilidade, misturado a outros sinais ou ruído [4]. Se não possuímos informações sobre este sinal (como frequência, banda e modulação) chamamos de detecção cega [4]. A detecção do sinal é fundamental na extração de parâmetros para a inteligência de comunicação (COMINT), que são componentes importantes em Guerra Eletrônica. Os sinais podem ser classificados como sinais LPD, baixa probabilidade de Interceptação (LPI) e baixa probabilidade de exploração (LPE) [4][5]. Para que um sinal possa ser explorado (fazer uso das mensagens portadas pelos sinais) ele deve ser interceptado (seu código deve ser capturado para decodificação), e o sinal para poder ser interceptado deve primeiro ser detectado. Em teoria, não existe sinal que não possa ser de-criptografado, a melhor proteção é não ser detectado [5]. No momento que um sinal é detectado, ele se torna passível de ser analisado, localizado ou de sofrer jamming. Para ocorrer a detecção de sinais de interesse de baixa intensidade (baixa razão sinal ruído - SNR) é necessário o monitoramento do espectro eletromagnético, fazendo varredura nas bandas de provável uso. Em termos táticos, a detecção necessita confirmar a presença do sinal de interesse o mais rápido possível. Em geral, sinais LPD necessitam alta capacidade de processamento para realizar a detecção [6]. Sistemas modernos de comunicação fazem uso de controle de potência, limitando o nível de sinal entre os pontos monitorados, dificultando a detecção. Existem diversos métodos e algoritmos para detecção de sinais. Os mais tradicionais são a detecção por nível de energia, análise ciclo-estacionária (por autocorrelação) e análise de componentes principais (por autovalores) [6]. O desempenho dos algoritmos de detecção pode ser expresso em termos da probabilidade de detecção em uma faixa de SNRs. Algoritmos sofisticados que fornecem alta detecção também têm altas demandas computacionais, que limitará sua implementação em sistemas de detecção em tempo real. Os algoritmos fazem uso de técnicas de detecção no domínio do tempo e/ou no domínio da frequência, visando otimizar recursos computacionais. A susceptibilidade dos algoritmos em relação ao ruído depende da técnica usada, porém, mesmo os algoritmos mais robustos não são capazes de extrair informações de um sinal cujo nível seja comparável às incertezas da instrumentação usada [5]. O processo de detecção cega necessita estimar certos parâmetros, um receptor precisa ajustar sua frequência central para determinada banda (ou varredura sobre a banda) onde o sinal de interesse é assumido como presente. Isto, no entanto, pode não ser suficiente, sendo necessários parâmetros primários adicionais, como tipo de modulação, constelação e mapeamento de símbolos, para poder realizar a demodulação. Em geral, estes parâmetros primários são testados por meio de algoritmos, que diversificam os mesmos, obtendo indicativos até convergir. Um sistema COMINT dispõe de múltiplos tipos de detectores e algoritmos para análises, que são diversificados e testados sobre cada fonte de sinal, a fim de promover a detecção e interceptação. Alta probabilidade de detecção apenas é útil se a probabilidade de falsos alarmes for baixa. A probabilidade de detecção e a probabilidade de falsos alarmes são dependentes do método e dos algoritmos de detecção. A. Detector por Nível de Energia A detecção por nível de energia é obtida pela seleção de uma banda de interesse, integrando no tempo o sinal eficaz recebido e depois avaliando o nível total (Fig. 2). O sinal recebido é composto pelo eventual sinal de interesse, ruído do canal e outros sinais de transmissões, por esta razão, em geral, o detector por nível de energia não é eficiente para detectar sinais LPD [6]. B. Detecção Baseada em Autocorrelação No sensoriamento de espectro podemos explorar qualquer propriedade do sinal que não está presente no ruído. Uma destas propriedades é a autocorrelação das amostras dos sinais. A autocorrelação é a correlação do sinal, com ele mesmo, com uma defasagem (Z-d) (Fig. 3). A detecção por autocorrelação pressupõe que o sinal a ser detectado possui alguma informação periódica ou cíclica, cujo espaçamento ou defasagem (Z-d) é testada. Para detecção é usado o nível de autocorrelaçao ou a flutuação deste nível. Mesmo a autocorrelação sendo baixa na presença de ruído, é possível ocorrer a detecção em períodos longos de integração. O método, devido às incertezas dos processos estatísticos, possui limitação quanto ao nível mínimo de SNR necessário para garantir a detecção [6]. C. Detecção Baseada em Análises de Componentes Principais (PCA) Técnicas de detecção baseadas em PCA (Fig. 4) podem apresentar melhor desempenho em comparação com outras técnicas, como análises por correlação e por nível de energia [6][7]. PCA é uma técnica em que os componentes essenciais ou principais (autovetores - Eigen Values) de um dado conjunto correlacionado são isolados para formar um conjunto de dados reduzido e não correlacionado, com o objetivo de reter a maior parte da informação [7]. A Decomposição de Valores Singulares (SVD) é uma ferramenta derivada da PCA que faremos uso no artigo. Sensoriamento de espectro baseado em SVD decompõe uma matriz formada pelas amostras do sinal em seus autovalores [8]. A matriz (A) para decomposição é montada com um número de colunas que tem supostamente correlação com características cíclicas ou periódicas de mesma proporção do sinal de interesse. Os valores dos autovalores da matriz (S) representam o sinal presente. IV. ESPALHAMENTO ESPECTRAL (SS) SS é um meio de transmitir uma informação espalhada em uma banda, muito maior que a mínima necessária para enviar a informação. O SS tem sido usado para comunicações seguras [2] e em sistemas de Múltiplo Acesso por Divisão de Código (CDMA) [2][9]. O SS por Sequência Direta (DS-SS) (modelo na Fig. 5), a informação é modulada (spread) por um sinal periódico sequencial pseudorrandômico [2] antes da transmissão, resultando em um sinal de banda larga e LPD [2]. O sinal DS-SS pode ser transmitido abaixo do nível de ruído, pois o receptor conhece a sequência pseudorrandômica (código) e, portanto, pode correlacionar [2], aumentando o SNR. Este aumento é chamado de ganho de processo, ou de espalhamento (Gs) (1). Nc é o número de bits de código por bit de dado. Normalmente é usado um ciclo completo de código para cada bit de dado. A Fig. 5 apresenta o diagrama em blocos de um link de comunicações DS-SS BPSK. Vantagens dos sinais SS: • Em geral, ganhos de SNR entre 10 e 20dB. • Melhores margens Antijamming (A/J), dependendo do tipo de ataque. • Mitigação das interferências por multicaminhos (reflexões são eliminadas pela correlação com o código). • Permite múltiplos acessos simultâneos a mesma banda usando CDMA. A. Detecção SS Por operarem normalmente em baixo SNR, os sinais SS são de difícil detecção [2]. O código pode ser determinado através de certos algoritmos, possibilitando a interceptação, além da detecção [12][13][14][15]. O conhecimento das estatísticas de ruído de fundo é necessário para determinar o limiar na detecção [12]. Existem diversos algoritmos para detecção de sinais SS, que são customizados conforme o tipo de código de espalhamento esperado [12][13]. Por exemplo, códigos Walsh e sequências-m tem respectivamente grandes e pequenos valores de correlação de lóbulos laterais (quando deslocamento usado para a detecção é diferente do tamanho do código usado na transmissão do sinal) [12]. Portanto, detectores baseados em autocorrelação são aplicáveis a códigos randômicos, como as sequencias-m, mas não servem para detectar códigos Walsh. Aborda-se melhor o tema de detecção SS em aplicação Multiportadora (próxima seção). V. ESPALHAMENTO ESPECTRAL COM MULTIPORTADORAS O objetivo é fazer uso das vantagens SS já apresentadas, com as vantagens da modulação por multiportadoras [9][10][11]. O uso de multiportadoras divide a banda larga SS em bandas menores (canais ou subportadoras), diminuindo os efeitos causados pelos canais seletivos em frequência, facilitando a equalização e maior imunidade ao doppler [9]. A técnica multiportadora por OFDM é atualmente popular por permitir taxas de comunicação muito elevadas, excelente desempenho em canais seletivos e apresentar boa eficiência espectral, causada pela aproximação das subportadoras ortogonais [9]. Porém, a modulação OFDM apresenta desempenho ruim quanto à segurança e resiliência às interferências/ jamming. Obtêm-se várias vantagens ao combinarmos a técnica OFDM com SS, que resulta em um sistema CDMA. Uma das vantagens é a LPD. Para efetuar o SS em multiportadoras em sistemas multiusuários (que dividem a mesma banda) é necessário o uso de códigos ortogonais, que apresentam a característica de que todas as correlações cruzadas entre pares são zero [9]. A utilização de códigos ortogonais permite a transmissão simultânea de vários canais na mesma banda de frequência, se os códigos puderem ser sincronizados. As propriedades de correlação cruzada entre códigos determinam quantos canais simultâneos podem ser acomodados e como o desempenho será degradado à medida que o número de canais de dados é aumentado [9]. Dois tipos comuns de códigos são sequências Gold e Kasami [9]. A Fig. 6 apresenta os dois métodos tradicionais de uso de código em espalhamento espectral (MC-CDMA-FS e MCCDMA-TS), mais uma nova proposta de espalhamento, com foco em LPD, a MC-CDMA-TFS. Na MC-CDMA-FS o espalhamento do código é no domínio da frequência, na MCCDMA-TS o espalhamento é no domínio tempo e na proposta MC-CDMA-TFS o espalhamento é no domínio frequência e tempo (Nc > Nfft). Os métodos tradicionais (MC-CDMA-FS / MC-CDMA-TS) são de fácil detecção. A MC-CDMA-FS não diversifica o código no canal, estando o mesmo explícito, permitindo detecção direta por análises do conteúdo de dados da mensagem (considerando mensagem com conteúdos periódicos ou autocorrelacionados). Com maior dificuldade, a MC-CDMA-TFS permite a detecção do código através dos métodos tradicionais, monitorando apenas um dos canais OFDM (subportadora) observamos cada símbolo sendo espalhado pelo código. Na proposta MC-CDMA-TFS, observamos que um símbolo não é mais espalhado diretamente no comprimento de código. Neste caso obtemos partes de códigos em diferentes símbolos, ou seja, reduzindo o tamanho original do código por bit de dado, dificultando a autocorrelação ou o estabelecimento de autovalores. Os dados tornam-se mais misturados (multiplicados) no código quanto maior o número de subportadoras, observando-se que a maior diversidade e consequentemente maior dificuldade de detecção ocorre quando Nc=Nfft±1. Apenas um monitoramento em mais subportadoras permitiria uma melhor detecção, sendo algo de grande dificuldade de processamento e monitoramento de espectro, pois não há informação de posição e nem de espaçamento das subportadoras. Estudos anteriores sobre MC-CDMA-TFS utilizaram códigos diferentes para frequência e tempo [10], de forma a melhorar a eficiência espectral. Códigos diferentes podem ser detectados como exposto neste artigo, não apresentando assim característica LPD. Abaixo é apresentado de maneira analítica a detecção por autocorrelação e por autovalores. A. Detecção SS por Autocorrelação A autocorrelação do sinal interceptado  (2) é dada por (3) quando o comprimento de dados L é igual ao deslocamento, ou tamanho do código N. Onde  e  são a variância para os dados ( / código (\te para o ruído respectivamente Onde  = +/-1 representa os valores do bit de dados (modulação BPSK). Como também  =  = ±1 podemos simplificar a equação para: A equação (4) demonstra que o nível de correlação depende do tamanho do código, menor o tamanho de código (usado por bit de dado) maior a probabilidade de falsos alarmes, levando a menor autocorrelação, com menor possibilidade de detecção, o que ocorre na proposição MC-CDMA-TFS na interceptação de apenas um canal. B. Detecção SS por Autovalores Para a detecção por autovalores é montada uma matriz do sinal interceptado Y (5), formada por linhas de tamanho D. A matriz de covariância (R(Y)) é montada em (6). A sequência dos autovalores de R(Y) é maximizada quando o tamanho das linhas D tem o mesmo tamanho do código, sendo dadas por (8). VI. SIMULAÇÕES Foi criado um modelo para simulação com o objetivo de validar a hipótese de LPD da proposta MC-CDMA-TFS (Fig. 7). A simulação foi executada em MATLAB/ Simulink 2019A, com o toolbox de comunicação. Trata-se de um modelo simplificado para análises de detecção de transmissão, não apresentando mecanismos de equalização de canal ou de sincronismo. Bloco transmissor em verde, bloco receptor em laranja e bloco COMINT em rosa. Para a simulação foi considerado que o COMINT está verificando o espectro com mesma demodulação do sinal de interesse (OFDM/BPSK). O Bloco COMINT apresenta 2 tipos de detectores (por autocorrelacao e autovalores-SVD) e um receptor com duas saídas. Uma saída com apenas uma subportadora OFDM (saída monocanal) e outra saída com todas as subportadoras OFDM (saída Multicanal). A modulação OFDM usada foi sem prefixo cíclico (que causa maior autocorrelação), considerando que a codificação irá garantir ortogonalidade entre as subportadoras. A Fig. 8 apresenta a probabilidade de erro simulada para modulação BPSK sem espalhamento espectral (N=1) e com espalhamento espectral de Nc=63. Aplicando (1), na simulação foi obtido em média 15dB. Para a análise de LPD da forma de onda proposta foi escolhido um baixo SNR (-10dB) e verificado o desempenho dos dois detectores para número de subportadoras OFDM (FFT) de 8, 16 e 32, comparando os resultados entre portadora presente (TX ligado) e apenas recebendo sinal de ruído gaussiano (AWGN). O código de espalhamento utilizado foi gerado por uma sequência pseudorrandômica, de tamanho 63 (N=63) (5uS/bit) para cada bit de dado. Para 8 subportadoras OFDM temos os 63 bits de código divididos por 8 na saída de cada canal, passamos a não ter mais um comprimento de código inteiro por bit de dado, diminuindo a autocorrelacao do sinal (4). A probabilidade de detecção vai caindo até o número de subportadoras chegar a 64, momento em que cada bit de código é multiplicado pelo dado. As Fig. 9 e Fig. 10 mostram que apenas com alto tempo de integração é possível a detecção para FFT=8. Para FFT=16 e 32 não houve convergência em tempos de integração práticos (Fig. 11 e Fig. 12). A técnica por autovalores (SVD) teve facilidade para detecção para FFT=8 e 16, uma maior dificuldade com FFT=32, mas não apresentou autovalores distintos para FFT=64 (Fig. 9 a Fig. 16). VI. CONCLUSÕES O artigo teve como objetivo ilustrar a complexidade que pode existir para a definição de uma Forma de Onda. Foram apresentados métodos de detecção, que tem seu desempenho dependente dos algoritmos usados para o sensoriamento do espectro. Técnicas de SS, com técnicas OFDM e MC-CDMA foram usadas para obter Baixa Probabilidade de Detecção (LPD) e alta taxa de comunicação. A proposta Multiportadora por Divisão de Código em Tempo e Frequência (MC-CDMA-TFS) foi apresentada com resultados comprobatórios da característica LPD. Mecanismos de sincronismo, aplicações multiusuários, e métodos e desempenho em canais Rayleigh são temas para futuros trabalhos sobre a proposta MC-CDMA-TFS. "
}