{
    "id": 61,
    "titulo": "guerra eletrônica e defesa cibernética na amazônia: desenvolvimento de um protótipo de sistema de interceptação de comunicações para indústria nacional de defesa",
    "autor": "cristiano torres do amaral, edilson vasconcelos dantas júnior, marcus vinícius braga,artur salvador, lorena paula mendonça guedes",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2019/st/ST_01_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 2,
    "resumo": "A Região Amazônica possui uma extensa área de fronteira e biodiversidade, acolhendo povos indígenas, ribeirinhos e comunidades tradicionais. Contudo, a região é vítima constante de grupos criminosos que praticam a biopirataria, tráfico de drogas, armas e pessoas. Essas ações ocorrem por meio de rotas aéreas, terrestres e fluviais ilegais, por isso, este trabalho descreve o desenvolvimento de um protótipo eletrônico para interceptar as comunicações de aeronaves, veículos e embarcações na Amazônia. O dispositivo foi desenvolvido com recursos de baixo custo e que pode ser interligado em antenas de comunicação via satélite do Sistema de Proteção da Amazônia (SIPAM). O desenvolvimento de um protótipo tecnológico envolve investimentos de recursos humanos e financeiros, que podem ser aprimorados pela Indústria Nacional de Defesa para produção em larga escala com uso militar ou de segurança pública. Além disso, a aplicação do protótipo de interceptação de comunicações pode integrar o portfólio de serviços do Sistema Integrado de Monitoramento de Fronteiras (SISFRON) ou do Satélite Geoestacionário de Defesa e Comunicações Estratégicas (SGDC).",
    "texto": "I. INTRODUÇÃO A expansão de grupos ligados às facções criminosas e milícias avança em diferentes regiões do país, de Norte a Sul do território do território nacional. Na Amazônia isso não é diferente e se agrava com as ações ligadas à extração mineral em áreas indígenas e de preservação ambiental, narcotráfico, contrabando, biopirataria e tráfico de armas e de pessoas [1]. As ações dos grupos criminosos na Amazônia desafiam as Forças de Defesa e Segurança Pública na área de fronteira. O roubo das riquezas naturais, tráfico de drogas e de pessoas avançam pelo território brasileiro por meio de aeronaves, embarcações e veículos que transitam em rotas ilegais na floresta. A logística operacional dessas ações envolve o planejamento e comunicação entre grupos especializados e cabe às autoridades realizar ações para coibir essas atividades. Ainda assim, também existe o desafio de cuidar e preservar a floresta evitando a devastação. Essas ações podem parecer intangíveis ao poder público, mas utilizando a tecnologia é possível combater tais crimes [2]. Para tanto, o monitoramento ambiental na floresta conta com apoio tecnológico e estratégico do Centro Gestor e Operacional do Sistema de Proteção da Amazônia – CENSIPAM, que utiliza uma rede de antenas via satélite (VSAT - ​Very Small Aperture Terminal​) para fornecer serviços de telecomunicações em várias localidades isoladas da região Amazônica. Este trabalho é complementado com o monitoramento por imagens de satélites, fornecendo suporte às operações de defesa para preservação biodiversidade [3]. Para expandir esse trabalho e contribuir com o combate de atividades ilegais na Amazônia este estudo descreve o desenvolvimento de um protótipo de interceptação de comunicações para uso na Amazônia. Este produto de aplicação na Indústria Nacional de Defesa, com destaque para guerra eletrônica e defesa cibernética, foi desenvolvido para interceptar as comunicações via rádio de aeronaves, embarcações e veículos que transitam na floresta. Trata-se de um pequeno analisador do espectro eletromagnético utilizando uma plataforma de Rádio Definido por ​Software (SDR) de baixo custo. ​II. REFERENCIAL TEÓRICO Na Amazônia está concentrada a biodiversidade mais importante do planeta e a maior disponibilidade de água potável e riquezas minerais de todo o mundo. Além disso, a região possui fronteira com sete países da América do Sul. É mais de treze mil quilômetros de fronteira de difícil acesso e, por tudo isso, a região está sendo vítima de ações do crime organizado. Nesse território existem vários pontos de vazios demográficos, totalmente ocupados por uma densa floresta tropical, facilitando a entrada e saída de aeronaves, embarcações e veículos ilícitos no país [6]. Em 2018, por exemplo, houve diversos casos de apreensão de aeronaves e embarcações ilegais. Destaca-se o incidente envolvendo um avião carregado com cerca de 330 kg de cocaína que entrou no espaço aéreo brasileiro e foi acompanhado até uma pista clandestina a sudeste do município de Jacareacanga, no Pará. A droga estava no avião monomotor PP-HAR que foi classificado como tráfego aéreo desconhecido por não ter apresentado plano de voo. Outro incidente de interceptação de aeronave foi registrado próximo ao município de Tangará da Serra, no Mato Grosso. A aeronave era proveniente da Bolívia e foi interceptada pela Força Aérea Brasileira (FAB). Neste incidente houve a apreensão de 300 kg de pasta base de cocaína [6]-[7]. ​Ainda em 2018, foram apreendidas embarcações no Maranhão com 4 toneladas de pesca ilegal. De acordo com a Marinha do Brasil, as embarcações realizavam pesca ilegal, comprometendo a biodiversidade amazônica e, por isso, foram apreendidas pelo Instituto Brasileiro de Meio Ambiente e dos Recursos Renováveis (IBAMA) [8]. A atuação desses grupos é facilitada pela dificuldade de acesso na área de floresta tropical. Não existem estradas e os rios têm bancos de areia que se alternam de acordo com a época do ano, desafiando os navegantes. As condições meteorológicas mudam repentinamente, e colocam em risco o tráfego aéreo. Além disso, o Estado não consegue se fazer presente em mais de 5,5 milhões quilômetros quadrados deste território. A imensidão da floresta também exige dos grupos criminosos o estabelecimento de pontos de apoio e comunicação no interior da floresta. Por isso, as ações de inteligência devem ser intensificadas para detectar esses pontos de apoio e, a partir da eliminação desses alvos, provocar baixas relevantes nas atividades ilegais na Amazônia [9]. Uma Rede de Monitoramento de Comunicação da Amazônia pode contribuir para o rastreamento de pontos de apoio dos grupos criminosos na floresta. Entretanto, isso não é uma tarefa simples, porque devem ser instaladas antenas de recepção de sinais de rádio em diferentes pontos da floresta. Isso exige um investimento muito alto para criação da infraestrutura e interconexão. A alternativa para redução do custo de implantação é a utilização de redes preexistentes [10]. Para tanto, o CENSIPAM possui uma rede de telecomunicação governamental com terminais VSAT que disponibilizam ​internet e telefonia para 400 (quatrocentas) localidades na Amazônia Legal. Esta rede governamental é monitorada por Centros Regionais em Manaus, Belém e Porto Velho. Nesta topologia, os terminais VSAT são gerenciados remotamente por uma unidade de coordenação instalada em Brasília. Estas antenas são instaladas em áreas que não possuem cobertura dos serviços de telefonia fixa, móvel ou ​internet​. Os usuários, em geral, são comunidades indígenas, postos de fiscalização e de fronteira e entidades vinculadas à segurança nacional (Fig. 2). As antenas do CENSIPAM estão localizadas em diferentes pontos da Amazônia e possibilitam o acesso digital para transferência de dados e implantação de uma rede de monitoramento de comunicação em plena floresta. Porém, para interceptação de mensagens de rádio e defesa cibernética é necessário um equipamento que seja capaz de realizar o monitoramento do espectro eletromagnético. Este equipamento é o analisador de espectro e, em geral, possui um valor muito elevado. Trata-se de um dispositivo que realiza a varredura (​scanner​) de diferentes frequências, analisando a distribuição de energia dos sinais de rádio em uma determinada área de cobertura de sua antena [10]. Estudos recentes e o desenvolvimento tecnológico possibilitaram a criação de Rádios Definidos por ​Software (SDR – sigla em inglês) que fazem um trabalho semelhante ao realizado pelos analisadores de espectro, com custo reduzido de operação. Os SDR têm a sua origem em meados de 1970, na indústria de defesa da Europa e Estados Unidos da América (EUA). Um projeto pioneiro criado pelos militares dos EUA foi denominado ​SpeakEasy​. Os principais objetivos deste projeto era incorporar os novos padrões de codificação e modulação das comunicações militares [11]. A arquitetura de um SDR é composta por bloco denominado ​front end, ​responsável ​pela detecção das frequências de rádio, e outro, ​back end que realiza o processamento do sinal de rádio. Na tecnologia SDR existe um ​hardware que faz parte do ​front end ​e um ​software que conduz o processamento no ​back end​. O SDR pode interceptar diferentes sinais de rádio simultaneamente, realizando a conversão analógico/digital e o processamento [12]. A plataforma SDR com ​chip RTL2832U (Fig. 3 - a) possui baixo custo e capacidade de recepção de sinais de rádio nas bandas de Alta Frequência (HF – sigla em inglês), Muito Alta Frequência (VHF – sigla em inglês), e Ultra Alta Frequência (UHF – sigla em inglês). O RTL-SDR 2832 possui valor médio de US$ 30,00, tem plataforma aberta com inúmeros fabricantes. Ele pode ser ligado em computadores embarcados, de tamanho e custo reduzido, tal como os equipamentos das plataformas ​Orange Pi e ​Raspberry Pi​. Estes pequenos computadores possuem custo médio de US$ 30,00. III. METODOLOGIA Para desenvolvimento do protótipo de monitoramento de comunicação na Amazônia foi realizado levantamento dos dispositivos de varredura SDR disponíveis no mercado. Neste levantamento foi avaliada a capacidade de interceptação das mensagens transmitidas via rádio em modo analógico e digital por diferentes tipos de aeronaves, embarcações e veículos. As faixas de VHF e UHF foram contempladas nessa análise e o ​dongle com ​chip RTL2832U foi selecionado por ter o menor custo. Esta placa eletrônica (​dongle​) será interligada a um microcomputador embarcado para processamento das mensagens e envio ao enlace por satélite (​StarOne ​C2 – Banda C). O acesso remoto é possível a partir de uma interface ​web ​(Fig. 4). O levantamento para identificação do equipamento responsável pelo processamento das informações e envio das comunicações pelos terminais VSAT resultou na seleção de duas plataformas de baixo custo e amplamente comercializadas. Foram avaliados os microcomputadores Raspberry Pi ​(Protótipo A) e ​Orange Pi ​(Protótipo B). O investimento no desenvolvimento dos protótipos é avaliado na Tabela I: Os testes de interceptação das comunicações foram realizados utilizando uma plataforma interligando dois terminais de comunicação via satélite. Neste teste foram avaliados o atraso (​delay​) das mensagens e fluxo dos dados na rede de comunicação. Eram avaliados os critérios relacionados com tamanho reduzido; baixo custo para o desenvolvimento e implantação do sistema; nível de processamento satisfatório do microcomputador. Concomitantemente ao trabalho de análise e definição dos equipamentos foram realizadas atividades de testes de ​performance. Nesses ensaios eram avaliadas a largura de banda consumida pela transmissão do áudio; capacidade de áudio (​audio buffer​) armazenado; e tamanho do pacote de áudio fornecido. As mensagens interceptadas pela plataforma eram geradas por um rádio HT ​Baofeng UV-5R (VHF/UHF) e/ou de aeronaves comerciais (VHF) que estavam no espaço aéreo de Porto Velho/RO. As mensagens eram interceptadas pelos protótipos e transmitidas pelas antenas via satélite, simulando a interceptação remota, sendo recebidas em um portal ​web​. O pulso azul com maior intensidade no portal (Fig. 6) indica um sinal de rádio sendo interceptado na frequência 118.20 MHz (Aeroporto de Porto Velho/RO). Para varredura do espectro eletromagnético foram realizados ensaios com ​softwares ​de varredura de sinais de rádio: ​OpenWebRX​, GQRX e ​WebSDR​. O software OpenWebRX ​é resultado da pesquisa e publicação da tese do engenheiro András Retzler na Universidade de Tecnologia de Budapeste [13]. Este trabalho iniciou em 2014, foi publicado em 2017 e descreve detalhadamente a plataforma de acesso remoto para recepção de sinais de rádio. O ​software GQRX foi desenvolvido pelo engenheiro e físico dinamarquês Alexandru Csete [14]. Esta plataforma possibilita acesso a diferentes tipos de comunicação via rádio e foi publicada em 2013 com código fonte aberto. O ​software ​WebSDR foi desenvolvido pelo engenheiro alemão Pieter-Tjerk de Boer e também foi disponibilizado gratuitamente para acesso remoto aos receptores de rádio via internet [15]. IV. RESULTADOS E DISCUSSÕES O primeiro ensaio de operação foi realizado com o objetivo de identificar a capacidade de processamento das plataformas computacionais disponíveis nos Protótipos A e B. Para tanto, um computador ​desktop foi utilizado como parâmetro de comparação com as plataformas embarcadas Raspberry Pi (Protótipo A) e Orange Pi ​(Protótipo B). A Tabela II apresenta os resultados obtidos nos ensaios iniciais e, de acordo com os dados, as plataformas embarcadas são capazes de processar as mensagens interceptadas via rádio e encaminhar via rede de comunicação por satélite. O tráfego das mensagens possui atraso médio de 1,2 segundos. Isso ocorre por causa do tempo de propagação dos dados subindo (600 ms) e descendo (600 ms) até o satélite StarOne ​C2 – Banda C. A plataforma baseada no processador ​Raspberry Pi processa as mensagens digitais sem comprometer sua capacidade de armazenamento. Por sua vez, o dispositivo Orange Pi​, de menor custo, comprometeu 99% da capacidade de armazenamento de memória e processamento. Os dados obtidos apresentam os níveis de ocupação dos processadores quando as unidades lógicas dos Protótipos A e B executavam o ​software ​OpenWebRX para varredura do espectro eletromagnético. A unidade PC Dell ​OptiPlex ​7050 foi utilizada como unidade de controle, para referência e comparação. Este computador não cumpre os requisitos de mobilidade e baixo custo. Trata-se de um dispositivo de mesa, com dimensões que inviabilizam o uso em áreas isoladas. Quanto aos equipamentos embarcados, ambos apresentam especificações bastante semelhantes, com processador de quatro núcleos de 64 ​bits e memória RAM de 1 GB. Apesar disso, é possível observar resultados distintos na ocupação da CPU para processamento de áudio e varredura do espectro eletromagnético. Enquanto protótipo B utilizando a plataforma ​Orange Pi consome 99% da capacidade de processamento da Unidade Central de Processamento (CPU), a plataforma ​Raspberry Pi do Protótipo A ocupa 83% da capacidade. Tal disparidade é justificada pelas diferenças na arquitetura de ​hardware. ​Essas diferenças são observadas ​na Tabela III. O ​Raspberry Pi 3 ​B+ ​(Protótipo A) possui processador cortex A53 - arquitetura armv8 e suporta instruções em 64 bits. Ele também utiliza o recurso NEON com vetores de 128 bits, o qual fornece aceleração para processamento de mídia e sinais. O Protótipo B possui arquitetura inferior de processamento. Os Protótipos A e B também estavam operando com sistemas operacionais livres e distintos. O Protótipo A utilizava a versão ​Raspbian 4.14, que é uma customização da distribuição Linux Debian, especificamente para a arquitetura ARM (​Advanced RISC Machine​). Este sistema operacional é voltado para aplicações móveis com o microprocessador Raspberry Pi​. Por sua vez, o Protótipo B utilizava ​Ubuntu Desktop 16.04, uma versão não otimizada da distribuição Linux ​Ubuntu​. Desse modo, o sistema operacional do Protótipo B possui instruções não otimizadas ao ​hardware do dispositivo, ocasionando uma maior alocação da memória RAM. A diferença de sistema operacional pode justificar os resultados distintos observados na Tabela III. O Protótipo A utilizava uma versão de sistema operacional desenvolvida sob medida para o dispositivo em teste, enquanto o Protótipo B utilizava um sistema operacional de uso geral, tal como um sistema genérico. Uma diferença técnica considerável que explica a diferença de 16% entre a capacidade de processamento dos dois protótipos. Além disso, de acordo com [16], a empresa ​Broadcom Limited destaca-se no mercado de tecnologia por apresentar microchips de alta ​performance. ​Essa empresa surgiu no início dos anos 90 no Vale do Silício nos Estados Unidos. Ela é a fabricante do processador do Protótipo A - Raspberry Pi. Por sua vez, a empresa ​Allwinner Tecnologia​, é uma pequena empresa chinesa de semicondutores, que está começando a se consolidar no mercado de tecnologia. Apesar dos protótipos das duas plataformas possuírem tamanho e custo semelhantes, a diferença de desempenho pode ser considerada em função das características e qualidade de fabricação dos respectivos processadores (CPU). O desempenho computacional entre os protótipos de interceptação e varredura das comunicações é descrito na Tabela IV. Nesta análise os resultados apresentam a performance ​de processamento de áudio das mensagens rastreadas no espectro eletromagnético. Foram avaliados, o uso da rede, armazenamento de áudio e a pacote de áudio. A unidade de controle apresenta os resultados de referência e são utilizados para comparação dos protótipos. Uso de Rede na Tabela IV descreve a quantidade de dados transmitida no momento do processamento. O Protótipo A apresentou a maior capacidade de transmitir dados e, dessa forma, garantir a qualidade da transmissão. A variável Armazenamento de Áudio na Tabela IV descreve o tamanho da capacidade de armazenamento de dados na memória ​cache. ​O Protótipo A também apresentou melhor resultado, sendo capaz de armazenar 0,1s de dados a mais de informação que o Protótipo B. Além da capacidade de armazenamento também foi avaliado o tamanho do pacote de dados de áudio. De acordo com os resultados, o Protótipo A apresentou maior eficiência quando comparado ao Protótipo B, sendo capaz de processar pacotes com mais símbolos por segundo (sps – sigla em inglês). A Tabela V apresenta uma breve análise dos vantagens e desvantagens dos ​softwares ​para varredura dos espectro. Foram analisados três ​softwares de recepção de sinais de rádio e o ​OpenWebRX ​destacou-se porque é de fácil instalação, configuração e operação. v​. CONCLUSÕES Neste trabalho foi possível descrever o desenvolvimento de um protótipo de baixo custo para Indústria Nacional de Defesa e contribuir no combate dessas organizações criminosas na Amazônia. A guerra eletrônica e defesa cibernética apoiam os departamentos de inteligência e autoridades na tomada de decisão, proporcionando vantagem relevante nas ações operacionais. O acesso às mensagens dos grupos criminosos pode oferecer um diferencial estratégico nas salas de comando e controle, assessorando o planejamento das ações contra os adversários. Logo, o desenvolvimento de um protótipo de interceptação das comunicações via rádio para uso na Amazônia apresenta-se como ferramenta apropriada para defesa cibernética. Assim, foi possível demonstrar que é possível desenvolver um protótipo de baixo custo, com acesso remoto, que possibilita a interceptação das comunicações de aeronaves, embarcações e veículos que estejam em trânsito na Amazônia. O desenvolvimento de um protótipo envolve múltiplas variáveis que podem ser aprimoradas pela Indústria Nacional de Defesa, possibilitando o desenvolvimento tecnológico nacional e avanço nas atividades de combate às organizações criminosas na Amazônia. Em estudos futuros será possível desenvolver dispositivos integrados e que podem utilizar, inclusive, o Satélite Geoestacionário de Defesa e Comunicações Estratégicas (SGDC). "
}