	{
		"id": 62,
		"titulo": "proposta de um receptor de guerra eletrônica microcanalizado totalmente fotônico",
		"autor": "André Paim Gonçalves, Renan Miranda Richter, Felipe Streitenberger Ivo, Romildo Henrique de Souza, Thiago de Souza Mansur Pereira, Olympio Lucchini Coutinho",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2019/st/ST_07_1.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 1,
		"resumo": "Este artigo apresenta a proposta de um receptor de guerra eletrônica microcanalizado fotônico baseado em demonstração teórica e de simulação. O receptor é desenvolvido a partir de uma estrutura com canais sintonizados por filtro óptico e com detecção de envoltória de banda ultra larga baseada no batimento de componentes espectrais de uma das bandas laterais do sinal óptico modulado em fase pelo sinal de RF de interesse. O receptor pode operar em frequências da portadora de RF acima de 100 GHz. A implementação deste receptor é simples, pois emprega poucos componentes, e utiliza componentes baratos encontrados no comércio. Este receptor pode ser miniaturizado por intermédio de fotônica de silício. A probabilidade de interceptação de sinais é de 100%.",
		"texto": " I. INTRODUÇÃO Com o advento do emprego de satélites e aeronaves remotamente pilotadas em guerra eletrônica, percebe-se a crescente necessidade de redução de consumo de energia, baixo volume e peso, bem como banda de rádio frequência larga [1]. A Microwave Photonics (MP) surgiu para complementar à eletrônica no cumprimento de tão difícil missão. Diante de tal desafio, foram estudadas as potencialidades do emprego da MP para redução de peso, volume, consumo e aumento de banda [2]. Algumas arquiteturas surgiram propondo a detecção de sinais com estas características, tais como [3] e [4]. Contudo, ambas as arquiteturas empregam moduladores que dependem de sistemas de controle de polarização rigorosos para evitarem deriva no ponto de polarização. Ressalta-se que estes dispositivos empregam diversos componentes fotônicos e eletrônicos, o que dificulta a sua miniaturização pela fotônica de silício. A proposta desse estudo é uma arquitetura que emprega um laser DFB, um isolador, um modulador de fase, um divisor de potência óptica com uma grade de Bragg em cada saída acoplada a um fotodetector de baixa velocidade. Este receptor depende de amplificação eletrônica de banda de vídeo, apresenta poucos componentes, o que permite uma futura miniaturização. Pelo fato de empregar um modulador de fase, não depende de um circuito de controle de polarização. Como a saída do receptor é em banda base, o fotodetector pode ser de baixa velocidade o que barateia e simplifica o circuito óptico. Para o caso de pulsos com banda instantânea abaixo de 1,5 GHz ainda é possível empregar tal fotodetector sugerido na arquitetura proposta. O receptor consome pouca energia por conta de seus poucos componentes serem, na maioria, passivos e de baixa perda de energia por acoplamento e absorção. A faixa de operação pode chegar até 500 GHz com o uso de moduladores de fase baseados na tecnologia plasmônica [5]. II. CONFIGURAÇÃO DO SISTEMA E PRINCÍPIO DE OPERAÇÃO O princípio de operação do receptor micro canalizado de guerra eletrônica totalmente fotônico é apresentado na Fig. 1. O sinal de luz proveniente do laser DFB é acoplado no modulador de fase e sofre modulação de fase óptica por intermédio do sinal de RF de interesse. O sinal óptico modulado incide na grade de Bragg após passar pelo divisor de potência óptica. Uma parte do sinal é refletida de volta para o laser DFB, onde o isolador evita que esta luz interfira no funcionamento desta fonte óptica. A parcela de luz que é transmitida pela grade incide no fotodetector para ser convertida em sinal elétrico de banda base. Caso ocorra coincidência de recepção de mais de um sinal de RF no modulador de fase, a sintonia que ocorre na grade de Bragg seleciona somente a parcela do sinal de interesse, fazendo a sua conversão de fase em intensidade. Os outros sinais não sofrem essa conversão e, assim, não são fotodetectados. Há dois fenômenos importantes a serem considerados no funcionamento correto deste receptor. O primeiro é a sintonia do filtro óptico de RF composto pela grade de Bragg. Essa sintonia é baseada na frequência de ressonância da grade de Bragg, onde a frequência do sinal de RF somado a frequência do sinal óptico tem que ser igual à frequência de ressonância de Bragg. Esse sistema de sintonia é bastante diferente do usual observado na literatura, ele se vale da característica do laser DFB apresentar o chirpping, onde a corrente do laser ou a temperatura da cavidade do laser são modificadas para se atingir uma frequência de laser de interesse [6]. A sintonia comumente encontrada seria a mudança da temperatura ou a tração na grade de Bragg para que esta mude sua frequência de ressonância. O segundo fenômeno de interesse é o emprego da lei quadrática do fotodetector para realizar o batimento das componentes espectrais. O normal seria transmitir para o fotodetector a frequência da portadora óptica para realizar o batimento com a frequência de RF, bem como, as componentes espectrais do pulso de uma de suas bandas laterais. Este batimento resulta em um espectro na saída do fotodetector composto da portadora de RF e as componentes do pulso. Contudo, este trabalho propõe algo diferente, deixa-se a grade transmitir somente uma das bandas laterais do sinal óptico modulado pelo pulso de RF de interesse. Estes componentes espectrais sofrem batimento entre si resultando somente as componentes do pulso na frequência base do sinal, isto é, a portadora de RF desaparece quando ela faz batimento com ela mesma e as componentes do pulso de RF. Este fato pode ser observado na seção seguinte. A Fig. 2 ilustra como é feita essa sintonia. A. Modelagem Matemática do Comportamento do Receptor Microcanalizado Totalmente Fotônico Um sinal óptico gerado por um diodo laser com o campo elétrico igual a: sendo que a amplitude de campo elétrico do sinal proveniente do diodo laser é 𝐸𝑂, sua frequência angular 𝜔𝑂, o tempo é 𝑡 e a fase é 𝜑𝑖, incide em um modulador de fase. Visando facilitar à análise do campo 𝐸⃗ (𝑡)𝑂, considera-se a fase 𝜑𝑖 = 0 e sua orientação coincidente com a do cristal de LiNO3 do modulador de fase, bem como do eixo cartesiano 𝑥̂. Considerando um sinal elétrico de RF, 𝐸⃗ (𝑡)𝑅𝐹, incidindo na entrada de RF de um modulador de fase, é definido como: onde a amplitude do campo elétrico do sinal de RF incidente é representado por 𝐸𝑅𝐹, sua frequência angular é dada por 𝜔𝑅𝐹, o tempo sendo apresentado por 𝑡 e a fase sendo 𝜑𝑅𝐹. O campo elétrico é considerado orientado no eixo x, coincidente com a orientação do cristal de LiNO3 do modulador de fase. As bandas laterais em torno da portadora de RF são 𝐴 = [𝜔𝑅𝐹 + ∆𝜔𝑅𝐹] e 𝐵 = [𝜔𝑅𝐹 − ∆𝜔𝑅𝐹]. A largura de banda do pulso de RF instantânea dividida por dois é definida por ∆𝜔𝑅𝐹. No modulador de fase, o sinal óptico sofre uma alteração de fase na forma: Sabendo-se que: onde V é o potencial elétrico, E é campo elétrico e d é a distância entre os eletrodos do cristal de LiNO3 do modulador de fase. O índice de modulação m é definido como: sendo 𝑉 𝜋 é a tensão de meia onda do modulador de fase. Reescrevendo (3) de forma simplificada em função das séries de Bessel a partir de (4) e (5) e considerando a condição especial de operação do modulador conhecida como regime de operação de pequenos sinais, em que m<<1, pode ser expressa por (6). Desta forma o sinal de saída do modulador no regime de operação de pequenos sinais pode ser expresso por: sendo que as funções de Bessel de primeira espécie e ordem 0 e 1 são respectivamente 𝐽0(𝑚) e 𝐽1(𝑚). O sinal óptico na saída do modulador de fase apresenta as bandas laterais iguais em amplitude e simétricas em fase, o que ocasiona um sinal DC na saída do fotodetector se as componentes espectrais não sofrerem mudanças na fase ou na amplitude. Este sinal de saída do modulador de fase é então acoplado a uma grade de Bragg em fibra óptica conforme Fig. 1 e sintonizada no ponto operação da grade indicado na Fig. 2 após passar pelo divisor de potência óptica. A grade de Bragg empregada no ponto de operação da Fig. 2 se comporta como um filtro óptico de RF com uma rampa de refletividade que parte da transmissão total e termina no início da região de reflexão máxima de sinal óptico. Esta rampa não é desejável para essa aplicação, o ideal é que a resposta da grade seja uma função degrau ideal. Contudo, a operação nessa região ainda permite um desbalanceamento em amplitude e fase das bandas laterais do sinal proveniente do modulador de fase, originando a conversão da modulação em fase em intensidade. O sinal óptico quando se propagando na FBG tem a portadora e uma de suas parcelas refletidas, quando posicionadas no ponto de inflexão da curva de refletividade da grade de Bragg conforme a Fig. 2, e a outra parcela é transmitida. Esta última parcela será acoplada no fotodetector. É importante observar que a FBG é projetada para possuir um alto coeficiente de refletividade óptica, sendo praticamente constante para frequência de RF na região da stop band. A sintonia do filtro óptico formado pela grade de Bragg foi feita com base no ajuste da temperatura da cavidade ressonante do diodo laser DFB de modo que 𝜔𝑂 assuma o valor suficiente que subtraído do sinal de RF, 𝜔𝑅𝐹, fique na faixa espectral de transmissão da grade conforme a Fig. 2. Esta sintonia fará que somente a banda lateral superior do sinal incida no fotodetector e seu campo elétrico é expresso por (7) conforme: onde este depende diretamente da resposta em frequência dos parâmetros de transmissividade, 𝑇(𝜔), e fase, 𝜑(𝜔), da FBG. O parâmetro α representa o fator de proporcionalidade ocasionado pela divisão de potência óptica. Relembra-se que a parcela da portadora óptica e a da banda lateral inferior foram filtradas. Como o fotodetector é sensível a intensidade do sinal óptico incidente, será necessário calcular o valor do vetor de Poynting, sabendo-se que o campo magnético é: onde 𝜂 é a impedância intrínseca do material. O vetor de Pointing é dado produto vetorial representado por (9): Empregando (7) e (8) em (9) tem-se: Após a execução das operações matemáticas na parcela de (10) que apresenta exponenciais, observa-se o resultado em (11): Sabendo-se que (11) corresponde à relação trigonométrica 2cos(𝐹) = 𝑒𝑥𝑝[−𝑗(𝐹)] + 𝑒𝑥𝑝[+𝑗(𝐹)]: Cabe ressaltar que ∆𝜔𝑅𝐹 = 𝑏𝑎𝑛𝑑𝑎 𝑑𝑜 𝑠𝑖𝑛𝑎𝑙 /2. O resultado do vetor de Poynting (13) é obtido substituindo (12) em (10) e retirando a parcela dc na forma: A corrente elétrica, i(t), na saída do fotodetector na frequência de banda base, sem a parcela do sinal dc, é calculada pela multiplicação de (13) pela área do fotodetector, Ae, e pela responsividade do fotodetector, ℜ ficando: III. SIMULAÇÃO DO CONCEITO DE RECEPTOR MICROCANALIZADO TOTALMENTE FOTÔNICO Para a verificação do conceito do receptor foi montada uma arquitetura com componentes disponíveis no software Optsystem da empresa Optwave conforme a Fig. 3. O laser DFB empregado foi o configurado para apresentar um comprimento de onda fixo sintonizado em uma faixa de operação de interesse conforme desenvolvido na seção anterior. O modulador de fase é a entrada dos sinais de RF de interesse, a grade de Bragg empregada foi uma grade uniforme apodizada com operação em torno de 1550 nm variando em função do comprimento de onda do sinal de RF. O fotodetector de baixa velocidade simulando no trabalho foi o modelo 818-BB-31 da Newport que opera na faixa de RF até 1,5 GHz. O gerador de RF empregado para a realização do teste foi baseado em dois tons que entram em combinador de sinal de RF, as faixas de RF simuladas foram duas, a primeira em torno de 32 GHz e a segunda em torno de 23 GHz. Os sinais foram gerados simultaneamente. Os resultados podem ser observados nas Fig. 4 e 5. As grades de Bragg disponíveis empregadas no ponto de operação da Fig. 2 se comportam como um filtro óptico de RF de uma forma diferente, isto é, como uma rampa de refletividade que parte da transmissão total e termina no início da região de reflexão máxima de sinal óptico conforme a Fig. 6. Esta rampa não é desejável para essa aplicação, o ideal é que a resposta da grade seja uma função degrau ideal. Contudo, a operação nessa região ainda permite um desbalanceamento em amplitude e fase das bandas laterais do sinal proveniente do modulador de fase, originando a conversão da modulação em fase em intensidade. Cabe ressaltar que os valores de frequência da portadora de RF podem ser muito mais altos, dependendo somente do modulador de fase a ser empregado. A frequência de RF de operação do fotodetector e a stop band da grade de Bragg determinam a frequência instantânea do sinal de saída do receptor. Os sinais observados nas Fig. 4 e 5 apresentam os batimentos das componentes espectrais da faixa de 32 GHz e 23 GHz respectivamente. Na primeira faixa foi o batimento dos tons de 32 e 30 GHz e na segunda faixa foi o batimento dos tons de 23 e 22 GHz. Essas frequências representam os limites das bandas de cada faixa. As quantidades de faixas abrangidas podem ser maior, contudo, quanto mais faixas empregadas, maior é demanda de potência do laser ou o uso de amplificação óptica ou de RF. Os resultados observados nas Fig. 4 e Fig. 5 demonstram que o receptor tem a capacidade de operar em bandas de recepção instantâneas muito amplas e apresenta uma probabilidade de interceptação de sinais de100%. IV CONCLUSÕES Conclui-se nesse trabalho que o receptor proposto com base em componentes de baixo custo encontrados no comércio e sua pequena quantidade de componentes permite funcionar como um receptor instantâneo de banda larga, de faixa de operação ampla e com probabilidade de interceptação de sinais de 100%. Pela pouca quantidade de componentes é possível inferir que ele tem possibilidade de miniaturização por conta da óptica de silício e de seu emprego em veículos remotamente operados e satélites graças a seu pequeno volume, peso e consumo de energia. Esse receptor tem a vantagem de não empregar sistemas de controle de para os pontos de polarização dos moduladores de intensidade. Cabe ressaltar que quanto mais faixas de sinais (canais) empregadas, maior é a necessidade de uso de amplificador ou aumento de potência óptica. A faixa de operação em frequência e sua banda de operação ficam a critério da necessidade do projeto que este receptor será empregado. Seus limites de sua banda e de faixa de operação de RF ficam condicionados aos limites de operação do modulador de fase e do fotodetector. Para o caso de Guerra Eletrônica esse receptor permite que o projeto se ajuste as necessidades advindas das evoluções nos sensores alvos.  "
	}
