{
    "id": 63,
    "titulo": "investigação do efeito da espessura e da concentração de compósitos baseados em ferrocarbonila aplicados como absorvedores de micro-ondas na banda x.",
    "autor": "simone de souza pinto, newton adriano dos santos gomes, valdirene aparecida da silva e mirabel cerqueira rezende",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2019/st/ST_10_3.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "O design de Materiais Absorvedores de Radiação Eletromagnética (MARE) para atuar com eficiência na banda X (8,2 GHz a 12,4 GHz) é ainda um desafio. Nesse sentido, o objetivo deste trabalho é a obtenção de MARE na banda X baseado em compósitos de ferrocarbonila (FC) inserida em matriz de resina epóxi, fixando a espessura em 5 mm e variando a concentração de 1%, 5%, 10%, 20%, 30%, 40% e 50% (m/m). A concentração de máxima eficiência foi fixada e variou-se a espessura da amostra em 2 mm, 3 mm, 4 mm, 5 mm, 6 mm, 7 mm e 8 mm. Sendo assim, foi realizado um estudo sistemático a fim de se obter o MARE com maior eficiência para atuar na banda X. A caracterização eletromagnética foi realizada em guia de ondas, extraindo informações de permissividade elétrica (ε), permeabilidade magnética (µ) e refletividade na banda X.",
    "texto": "I. INTRODUÇÃO Nos dias atuais, devido à proliferação de dispositivos eletrônicos e ao rápido crescimento de sistemas de telecomunicações operando em frequências elevadas (GHz), a vulnerabilidade à interferência eletromagnética teve um aumento considerável [1]. Muitos esforços vêm sendo realizados no estudo de Materiais Absorvedores de Radiação Eletromagnética (MARE), em função da diversidade de aplicações dessa classe de materiais, devido ao seu uso potencial na indústria, na área civil, comercial e nas tecnologias militares [2]. Em se tratando de aplicações militares, o processamento de MARE busca materiais com os menores valores de densidade e espessura possíveis, principalmente na área aeronáutica, onde o perfil aerodinâmico de uma aeronave não pode ser alterado, o volume de carga útil deve ser maximizado e os custos operacionais reduzidos [3]. Os materiais utilizados como absorvedores de micro-ondas devem apresentar perdas elétricas e/ou magnéticas [1]. A forma como essas propriedades variam com a frequência refletem a performance do absorvedor [4]. O princípio de obtenção de MARE envolve, usualmente, a utilização de uma matriz dielétrica transparente às micro-ondas e um material que apresenta perdas, podendo ser do tipo dielétrico, como polímeros condutores, negro-de-fumo e nanocargas de carbono, entre outras, ou do tipo magnético, pelo uso de ferritas e ferrocarbonila, por exemplo, ou híbridos pelo uso simultâneo desses dois tipos de aditivos [5]-[6]. A proposta deste trabalho é a investigação do efeito da concentração e da espessura de amostras para atuar como absorvedores de micro-ondas na banda X [7], obtidas pelo uso do aditivo ferrocarbonila inserido em uma matriz de resina epóxi. II. EXPERIMENTAL A. Materiais Os materiais utilizados neste estudo são partículas magnéticas de ferrocarbonila, obtidas comercialmente da empresa BASF Ltda., e resina epóxi bicomponente, código Epocast 50-A1 e endurecedor 9816/Q3, ambos da Huntsman. B. Preparação do MARE em Resina Epóxi Inicialmente, variou-se a concentração de ferrocarbonila na matriz de resina epóxi em 1%, 5%, 10%, 20%, 30%, 40% e 50%, em massa (m/m), mantendo a espessura da amostra fixa em 5 mm. A ferrocarbonila foi adicionada à resina epóxi e a homogeneização foi realizada por meio de mistura mecânica dos componentes. Em seguida, as misturas foram transferidas para moldes de silicone com as dimensões exatas do porta-amostra (23 mm × 10 mm × 5 mm) utilizado no trecho do guia de ondas durante a caracterização eletromagnética. A cura da resina epóxi ocorreu no período de 24 horas, em temperatura ambiente. Posteriormente, a concentração de 40% (m/m) foi fixada e novos corpos-de-prova foram preparados, variando-se a espessura de 2 mm a 8 mm, em intervalos de 1 mm. C. Caracterização Caracterização Eletromagnética: As caracterizações eletromagnéticas foram realizadas em um guia de onda retangular (kit de calibração WR-90 P11644A - Agilent) acoplado a um analisador de rede vetorial PNA-L, 20 GHz, modelo N5230C. As propriedades eletromagnéticas, permissividade elétrica (ε) e permeabilidade magnética (μ), foram extraídas na banda X, na faixa de frequência de 8,2-12,4 GHz. Através da obtenção dos parâmetros de espalhamento (parâmetros S), foi possível estudar a interação da onda eletromagnética com a amostra, por meio da obtenção da permissividade elétrica e da permeabilidade magnética. O método utilizado para obter tais parâmetros é o Nicolson-Ross-Weir (NRW), que também é chamado de Método de Transmissão e Reflexão [8]. Considerando um dispositivo com 2 portas, além da reflexão, relacionada com os parâmetros de reflexão (S11 e S22), há a possibilidade da transmissão, relacionada com os parâmetros de transmissão (S21 e S12). As medidas de refletividade foram obtidas aplicando-se um material metálico como anteparo que possui uma elevada condutividade elétrica (PEC - Perfect Electric Conductor). A refletividade (RL), medida em dB, refere-se à potência refletida pelo material tendo uma placa metálica (PEC) posicionada junto à amostra, sendo Pr a potência refletida e Pi a potência incidente (Equação 1) [9]. A condição de casamento de impedâncias, representado pelo perfeito acoplamento da onda eletromagnética ao meio, é dada por Zr → 1, sendo que Zr corresponde à impedância relativa de entrada do material, t é a espessura da amostra, µr é a permeabilidade magnética relativa, εr é a permissividade elétrica relativa do material e λ é o comprimento da onda eletromagnética incidente no espaço livre (Equação 2). Os dados da Equação 2 são obtidos pela combinação de 6 parâmetros: µ0r, µ00r, ε0r, ε00r, λ e t (Equações 3 e 4). III. RESULTADOS E DISCUSSÕES A. Caracterização Eletromagnética Permissividade Elétrica e Permeabilidade Magnética: Valores complexos da permissividade elétrica (ε) e da permeabilidade magnética (µ) representam as propriedades dielétricas e magnéticas dos materiais. As partes reais da permissividade e permeabilidade complexas (ε0r, µ0r) simbolizam a capacidade de armazenamento de energia elétrica e magnética, respectivamente. As partes imaginárias (ε00r, µ00r) representam as perdas de energia elétrica e magnética. No estudo de MARE, são esperados valores elevados dos componentes imaginários da permissividade elétrica e da permeabilidade magnética [10]. A fim de investigar as propriedades de absorção de micro-ondas das amostras em estudo, os parâmetros eletromagnéticos, permissividade elétrica e permeabilidade magnética, foram medidos em amostras com espessuras de 5 mm, apresentando seus valores na Tabela I, extraídos na frequência de 10 GHz. As Figuras 1 e 2 mostram as curvas da parte real da permissividade elétrica e da permeabilidade magnética em função da frequência obtidas nessas medidas. As tangentes de perdas dielétricas, tan δε = ε00r / ε0r, e magnéticas, tan δµ = µ00r / µ0r, fornecem uma relação da energia dissipada nos absorvedores versus a energia armazenada, cujas perdas estão associadas às forças de amortecimento atuando entre átomos e moléculas, bem como pela condutividade elétrica total do material empregado [1]. As tangentes de perdas elétricas e magnéticas estão apresentadas na Tabela I. A resina epóxi é um material isolante e não magnético, sendo assim, transparente às micro-ondas. Analisando a Tabela I, a resina epóxi apresenta os menores valores dos componentes de armazenamento e de perdas dielétricas e magnéticas em relação às outras amostras. Portanto, no presente estudo, a resina epóxi atua apenas como matriz de ancoragem para a FC, como citado em trabalhos anteriores [11]. A análise da Tabela I mostra ainda que a inserção do aditivo magnético (FC) na resina epóxi aumenta os parâmetros da permissividade elétrica e da permeabilidade magnética. O componente real da permissividade elétrica (ε0r) aumenta de 2,8333, valor obtido para o MARE 1%-FC/epóxi, para 3,1764, referente à amostra 30% -FC/epóxi. Uma tendência similar é observada para a parte imaginária da permissividade (ε00r), com o valor máximo de 0,3460 para a amostra 40% -FC/epóxi. A parte real da permeabilidade magnética (µ0r) apresenta um valor mínimo de 1,0509 para a amostra 1%-FC/epóxi e um valor máximo de 1,4907 para a composição 50% -FC/epóxi. De maneira similar, a parte imaginária da permeabilidade (µ00r) aumenta em função da adição de partículas magnéticas, tendo um valor máximo de 0,1256 para a amostra 20% -FC/epóxi. A análise das tangentes de perdas dielétricas (tan δε) e magnéticas (tan δµ) mostra que as tangentes de perdas magnéticas apresentam, em geral, valores maiores, com um valor máximo de 0,1570 para a composição 50% -FC/epóxi. Essa condição evidencia que os mecanismos de perdas ocorrem preferencialmente por perdas magnéticas, relacionadas envolvendo momentos de spin, forças harmônicas de vibração e forças de amortecimento atuando entre os átomos e moléculas, além de possíveis perdas elétricas [1]. Medidas de Refletividade: Materiais absorvedores devem apresentar duas características relevantes, quais sejam, baixa perda por reflexão (RL) e ser efetivo em uma larga banda de frequências (banda larga). Uma definição aceita para banda larga considera o intervalo de frequências onde o absorvedor atenua pelo menos -10 dB [12], mas outros valores de atenuação são também aceitos. A Figura 3 mostra a variação da refletividade em função da frequência na faixa de 8,2-12,4 GHz (banda X) para as amostras com 5 mm de espessura, variando a concentração de FC em 1%, 5%, 10%, 20%, 30%, 40% e 50% (m/m). A análise da Figura 3 mostra que a eficiência do absorvedor melhora em função da inserção das partículas magnéticas, apresentando um valor máximo de atenuação para a amostra 40%-FC/epóxi, no valor de -14 dB, na frequência de 12 GHz, na faixa final da banda X. No entanto, o aumento da concentração do aditivo para 50% (m/m) prejudicou o desempenho do MARE. A análise da Figura 4, referente ao MARE com concentração de 40% de FC, com a espessura variando entre 2 mm e 8 mm, mostra um máximo de atenuação na espessura de 7 mm, -10 dB, ou ~90% de atenuação, de acordo com [13], na frequência de 12 GHz. Enquanto isso, a amostra com 8 mm apresenta um máximo de atenuação de -6 dB no fim da escala da banda X. Os resultados de refletividade obtidos podem ser explicados com base em (1) e (2), com o valor de refletividade variando em função da espessura da amostra. A correlação entre os parâmetros complexos apresentados nas Figuras 1 e 2, bem como as curvas de refletividade apresentadas nas Figuras 3 e 4, evidenciam que o processamento de um absorvedor é uma tarefa complexa, onde diferentes parâmetros como concentração e espessura das amostras devem ser considerados, além do comprimento de onda da radiação incidente [1]. IV. CONCLUSÕES Em conformidade com os resultados apresentados, é possível concluir que o desempenho de um absorvedor está relacionado com a concentração do aditivo utilizado como centro absorvedor, bem como com a espessura da amostra. Os resultados mostram que o melhor material foi obtido para a amostra com 40% de FC na resina epóxi. Verificou-se ainda que os melhores resultados foram obtidos na espessura de 7 mm. Os resultados de tangente de perdas mostram o predomínio do mecanismo de perdas magnéticas, devido à característica intrínseca do aditivo utilizado."
}