	{
		"id":65,
		"titulo": "recuperação de falhas em um sistema de navegação inercial por meio de sensor auxiliar",
		"autor": "Tibor Thiesen Dumont Pitrez, Fernando Teixeira Mendes Abrahão",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2019/st/ST_04_1.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 1,
		"resumo": "A utilização de sensores inerciais para a navegação de veículos possui vantagens significativas, pois os mesmos independem de influência ou auxílio externo para realizarem a navegação. Em teoria, para realizá-la por meio de sensores inerciais, basta utilizar 3 sensores de cada tipo (acelerômetros e girômetros). Todavia, por questões de qualidade operacional e redundância, é comum o uso de uma configuração com 4 sensores, que são suscetíveis a falhas. No caso de 4 sensores, em caso de falha, é desejável isolar o sensor defeituoso e continuar a navegação com 3 sensores. Mas só é possível garantir a exclusão do sensor defeituoso em um sistema com 5 sensores. Neste trabalho, é estudada a possibilidade de isolar o sensor defeituoso usando 4 sensores principais e 1 sensor de qualidade inferior, evitando os custos de adquirir mais um sensor principal e ganhando a vantagem de recuperação que o quinto sensor traz.",
		"texto": " I. INTRODUÇÃO A utilização de sensores inerciais para aplicações espaciais e em veículos aéreos não tripulados é muito comum [1]-[7]. Uma grande vantagem dos sensores inerciais para a navegação é que os mesmos independem de qualquer influência externa para operarem, o que evita que o sistema sofra problemas como jamming ou boicote de um serviço. A navegação inercial pode trabalhar em conjunto com outro modo de navegação (por exemplo, com um sistema de navegação por satélite, como o GPS – Global Positioning System), e com sensores não inerciais (como altímetros) em um processo de integração dos sistemas, proporcionando uma navegação de melhor qualidade [5], [8]-[9]. Os dois principais tipos de sensores inerciais são: acelerômetros e girômetros [5]-[6]. Acelerômetros são sensores que medem a força específica do corpo ao qual estão solidários. Já os girômetros medem a velocidade angular do corpo ao qual estão solidários em relação a um referencial inercial. Os dados fornecidos por estes sensores são utilizados em cálculos para estimar a atitude, velocidade e posição de um dado corpo [5]-[6]. O maior problema dos sensores inerciais é o fato de que seus erros crescem com o tempo de operação, pois o cálculo da posição e da atitude do corpo consiste em, essencialmente, integrar equações diferenciais. Por isso, um pequeno viés no sensor, quando integrado por muito tempo, pode causar grandes erros nos resultados [7]. Assim, a duração da missão está intimamente ligada com a qualidade dos sensores. Sensores inerciais são suscetíveis a falhas, seja por dano físico, seja por motivos aleatórios. Logo, é comum a utilização de sensores redundantes em sistemas de navegação, principalmente se o mesmo for de importância crítica [2]-[3]. Em teoria, para operar, uma unidade de medidas inerciais precisa-se de três girômetros e três acelerômetros, pois como o sistema realiza medida de vetores no espaço tridimensional, é necessário, pelo menos, o conhecimento de três componentes não coplanares do vetor a ser medido para determinar o mesmo [6]. Todavia, nada impede a utilização de mais sensores para realizar as medidas. Tal fato proporciona uma melhor qualidade nas medições realizadas, uma vez que a presença de mais sensores tende a balancear o erro dos demais [10]. Mas esta não é a única vantagem ao utilizar mais sensores. A redundância proporciona ao sistema maior robustez a falhas. Para um sistema de navegação (de girômetros ou acelerômetros), um conjunto de 4 sensores garante ao sistema a capacidade de detecção de falhas, isto é, descobrir se há um sensor defeituoso. Um conjunto com 5 sensores já possui a capacidade de isolação do sensor defeituoso, isto é, a capacidade de identificar qual é o sensor defeituoso [3], [10]. Conhecendo o sensor defeituoso, o sistema pode passar a ignorar seus dados e reconfigurar seu algoritmo de navegação de forma a operar com os sensores restantes. Esta é a etapa de recuperação da falha. Essas três etapas compõem o cerne de um sistema FDIR, acrônimo em inglês para Detecção, Isolação e Recuperação de Falhas. A adição de um sensor inercial de boa qualidade não é simples, pois o mesmo pode ser consideravelmente caro. A faixa de valores de um sensor inercial varia muito de acordo com sua qualidade e pode variar de dezenas de milhares de dólares a dezenas de dólares [11]-[12]. O objetivo deste trabalho é identificar, embasar com evidências e desenvolver um método a ser usado como solução para realizar a isolação do sensor defeituoso, em um sistema com apenas 4 sensores principais, sem o acréscimo de custo de adicionar um quinto sensor de mesma qualidade dos demais. A linha de ação utilizada foi: ao invés de inserir um quinto sensor de mesma qualidade, usa-se um quinto sensor de qualidade inferior (e mais barato) a fim de proporcionar ao sistema a capacidade de isolação. Ou seja, a ideia é que adição de um quinto sensor de qualidade inferior possibilite a capacidade de isolação de falhas do sistema sem o custo de um quinto sensor principal adicional. Tal capacidade aumenta a robustez a falhas e a confiabilidade do sistema de navegação sem acarretar em grande aumento de custo monetário. Este sensor de menor qualidade (que será denominado ao longo do texto como o sensor 5 ou quinto sensor), a priori, não deve ser utilizado na navegação propriamente dita. Um ponto a ser ressaltado é que o foco do artigo não é a navegação inercial propriamente dita. Mais detalhes sobre este tópico podem ser encontrados em [8]-[9]. O foco do artigo é a elaboração de um sistema FDIR para um conjunto de sensores de navegação inercial com 4 sensores principais e um quinto sensor de qualidade inferior. Outro ponto de relevância a ser esclarecido é que, neste artigo, os sensores inerciais não possuem, a princípio, uma medida de referência. Essa consideração permite que o método aqui desenvolvido possa ser utilizado como multimissão com pouquíssimas alterações. Isso faz com que o sistema FDIR seja capaz de realizar a detecção e a isolação da falha sem um auxílio de uma trajetória de referência. Por fim, um outro ponto que deve ser ressaltado é que um sistema FDIR, na grande maioria das vezes (e é o caso deste trabalho) possui algum atraso em relação aos dados adquiridos pelos sensores, principalmente pelo fato do sistema FDIR utilizar alguns filtros que tenham esta característica [3]. Por isso, o sistema FDIR não deve ser implementado em série com o sistema de navegação, mas sim em paralelo. A saída do sistema FDIR é apenas informar ao sistema de navegação se há algum sensor em falha e qual é o sensor em falha, possibilitando ao sistema de navegação conhecer a situação dos sensores e se reconfigurar para continuar operando com os sensores sobressalentes. Caso o sistema FDIR ficasse em série com o sistema de navegação, este sofreria um atraso que, dependendo das aplicações, poderia prejudicar um sistema de controle que utiliza dados de saída do sistema de navegação. A Fig. 1 mostra a estrutura do sistema. No caso deste artigo, os estados lidos pelos sensores são a força específica e a velocidade angular. O escopo deste trabalho é o Sistema FDIR, incluindo suas entradas, que são os dados dos sensores e suas saídas, que são os alertas de detecção de falha e a informação do sensor isolado. Este artigo está dividido em 5 seções. A primeira apresenta o contexto, o objetivo e o conteúdo deste artigo. A segunda traz a revisão bibliográfica, apresentando brevemente o estado da arte na área de FDIR, em especial para navegação. A terceira seção apresenta a fundamentação teórica do conteúdo do artigo. A quarta seção traz a metodologia, sua implementação e resultados. A quinta seção é a conclusão do artigo. Ao fim, são citadas as referências. II. REVISÃO DA LITERATURA A área de guiamento, navegação e controle de sistemas aeroespaciais é uma área considerada sensível e estratégica no contexto da engenharia atualmente [3]. Ainda assim, há materiais científicos da área, que podem ser utilizados para ter uma noção do atual estado da arte neste setor. Já a área de FDIR possui uma quantidade apreciável de materiais. Todavia, quando se trata de FDIR em sistemas de navegação, a quantidade de conteúdo científico é relativamente pequena. Em [1] discute-se como abordar um problema FDIR para um sistema de girômetros de um pequeno satélite. No trabalho, um caso de estudo é analisado com um sistema de controle de atitude com 4 girômetros em configuração tetraédrica. Em [2] se usa uma abordagem baseada em agente para realizar procedimentos de FDIR em um satélite com trajetória definida e com um sistema de 4 girômetros. A falha estudada foi essencialmente o caso de deriva do viés do girômetro. Em [3] tem-se um estudo FDIR para um sistema de girômetros, com vistas a aplicação espacial. O caso em questão conta com um sistema de 4 girômetros. Nesse trabalho, o autor utiliza de Análise de Wavelets para processar os dados e realizar a isolação da falha. Outro ponto do trabalho é que a solução não é generalizada para todas as aplicações e falhas, apesar de não se ater ao modelo físico do sistema. Em [13] é apresentado um trabalho de FDIR para clusters de sensores tipo MEMS (Sistemas Microeletromecânicos). Estes sensores são, muitas vezes, mais baratos e de menor qualidade que sensores inerciais mecânicos ou de fibra óptica. Por isso, o caso em questão estuda um sistema FDIR para grandes quantidades destes sensores (15 ou mais). No trabalho, o autor utiliza o método k-th nearest neighbor. Em [14] é apresentada uma pesquisa sobre a abordagem do desenvolvimento de um sistema FDIR para os softwares de bordo de um satélite, levando em conta os requisitos que um sistema FDIR precisa seguir, incluindo como o sistema deve implementar um modo de segurança ao satélite. Em [15] é apresentada uma nova abordagem para a recuperação de sistemas espaciais por meio de retry, isto é, desligar e ligar (ou reset) um sistema que apresenta comportamento anômalo. É uma abordagem consideravelmente diferente do usual na área de FDIR. Em [16] é feito um estudo de FDIR para um sistema de testes de um motor foguete líquido. O algoritmo desenvolvido utiliza um Filtro de Kalman e um Teste de Hipóteses. É um problema de FDIR da área de propulsão espacial. Por fim, é mostrada na Tabela 1 uma relação entre os assuntos dos diferentes trabalhos observados na literatura. Esta tabela permite identificar os pontos em comum e diferentes entre os trabalhos e este presente artigo. Como pode-se observar, este artigo contempla um sistema FDIR no contexto de navegação, aplicável a sistemas espaciais, visando aplicação em sensores inerciais, sem trajetória ou medida de referência, com capacidade plena de isolação para 4 sensores principais, isto é, a capacidade de isolar o sensor defeituoso para qualquer tipo de falha. Desta forma, este artigo aborda um problema diferente dos demais encontrados e desenvolvidos na literatura. III. FUNDAMENTAÇÃO TEÓRICA A. Modelo dos Sensores As grandezas a serem medidas pelos sensores inerciais são vetoriais. Para desenvolvimento do método neste artigo, utiliza-se como base os girômetros, mas todo o processo pode ser repetido igualmente para os acelerômetros. É importante modelar estes sensores matematicamente. Um girômetro mede a componente da velocidade angular paralela ao seu eixo de medida. Evidentemente, a medida não é perfeita e há erros. Um modelo utilizado para representar as medidas de um girômetro é dado por [2], [17]: Onde 𝜔̂ é a medida do girômetro, 𝜔 é a velocidade angular verdadeira, 𝐵 é o viés do sensor, 𝜂 e 𝜈 são um ruídos brancos gaussianos de média nula. O subscrito 𝑖 indica o instante da medida realizada. Desta forma, tendo as características dos sensores a serem utilizados, pode-se realizar uma simulação, em ambiente computacional, dos girômetros. B. Modelo do Bloco de Sensores Os sensores, evidentemente, estão dispostos de forma a serem capazes de medir um vetor no espaço tridimensional. Há diversas configurações possíveis para alocar os 4 sensores principais, assim, é importante compreender como a geometria do conjunto de sensores se relaciona com as medidas. Seja uma matriz 𝑯 a matriz dos cossenos diretores dos eixos de medidas dos sensores. A dimensão dessa matriz é 𝑛 × 3, sendo 𝑛 o número de sensores. No caso, 𝑛 = 4. Estes ângulos são tomados em relação a um sistema de referência fixo ao veículo. Se as medidas dos sensores fossem perfeitas, ter-se-ia a seguinte relação entre o vetor de medidas 𝝎̂ e o vetor de velocidade angular verdadeira 𝝎 [3]: Utilizando a matriz pseudoinversa de 𝑯, denotada por 𝑯+, multiplicando (3) pela esquerda por 𝑯+, pode-se encontrar a velocidade angular verdadeira [21]: Observa-se que (4) mostra uma capacidade de encontrar a velocidade angular independente da configuração geométrica dos sensores. Mas, devido aos erros dos sensores, explicitados por (1), tem-se que o descrito em (4) não ocorre em termos práticos na realidade. Isto faz com que certas configurações geométricas sejam melhores do que outras [3], [5], [10], [20]. O critério utilizado, em geral, para buscar otimizar uma configuração é o GDOP (Diluição Geométrica de Precisão), que quanto menor, melhor é a qualidade do arranjo. Os poliedros platônicos sempre possuem o valor mínimo de GDOP para o seu respectivo número de sensores. Para quatro sensores, o tetraedro regular é uma configuração ótima, ou seja, os sensores teriam seus eixos de medidas perpendiculares às faces do tetraedro, por isso seu uso é muito comum. Desta forma, a configuração tetraédrica possui uma matriz de cossenos diretores que pode ser dada, para determinado sistema de coordenadas cartesianas, por: C. Filtragem dos Dados Como visto em (1), os dados dos sensores são ruidosos. Isso pode levar ao sistema FDIR a acusar falsos alarmes de falhas. Por isso, é desejável a utilização de um filtro capaz de filtrar os dados e atenuar o ruído. Este processo é chamado de smoothing (suavização). Um filtro que possui tal característica e é de implementação simples é o Filtro de Média Móvel Ponderada (FMMP). Neste filtro, dada uma janela de tamanho 2𝑚 + 1, o cálculo de sua saída é dada em função dos dados de entradas por: O 𝑘-ésimo peso é 𝑝𝑘 = 𝑚 + 1 − 𝑘. 𝑥𝑖 é o sinal advindo do sensor no instante 𝑖. (𝑚 + 1)2 é a soma dos pesos. O FMMP é tal que prevalece a passagem de baixas frequências. Quanto maior a sua janela, mais restrito a baixas frequências é o comportamento do filtro. Em [21] pode-se encontrar explicações sobre o domínio da frequência e mais informações sobre filtros. D. Tipos de Falhas Na literatura, há diversos tipos de falhas que são considerados possíveis de ocorrer em sensores. Para sensores inerciais, as falhas consideradas são: falha degrau, falha rampa, falha de valor constante, falha cíclica, falha errática e falha pico (ou impulso), com detalhes em [1], [3]. Estes tipos de falhas podem ser modelados matematicamente e inseridos na simulação dos sensores. Desta forma, pode-se testar diferentes falhas para avaliar a capacidade do sistema FDIR. As falhas ocorrem nos sensores, e, para o desenvolvimento deste artigo, considerou-se que apenas um dos sensores principais falha. E. Filtro de Mediana A falha impulso pode ser solucionada de maneira relativamente simples, mediante a implementação de um Filtro de Mediana (FM). Seu funcionamento consiste em selecionar uma janela de 𝑙 elementos, sendo 𝑙 ímpar, caso o elemento central da janela esteja consideravelmente destoante dos demais, o filtro o substitui pela mediana dos elementos desta janela [3]. O FM não é um filtro linear, enquanto o FMMP é. Por isso, a ordem de aplicação dos filtros influencia no resultado. Assim, o primeiro filtro a ser aplicado deve ser o FM e em seguida o FMMP. Pois se FMMP for aplicado primeiro, o mesmo pode atenuar uma falha impulso, fazendo com que o FM não detecte aquele valor como destoante o suficiente. Desta forma, com o FM, a falha impulso deixa de ser um problema. Além disso, o FM também evita o problema de ruídos espúrios. Todavia, tanto o FM como o FMMP inserem certo atraso nos dados. Assim, as janelas do FM e do FMMP devem ser dimensionadas de forma que o sistema consiga cumprir suas funções e o atraso seja o mínimo possível. IV. IMPLEMENTAÇÃO E RESULTADOS O problema a ser resolvido é que um sistema com 4 sensores não é capaz de realizar a isolação de uma falha, apesar de conseguir realizar a etapa de detecção. Evidentemente, a isolação só faz sentido após a detecção. Para a detecção, o método consiste em separar os 4 sensores em 4 grupos de 3 sensores, onde cada um destes grupos consegue realizar uma medida da velocidade angular. Se estas medidas estiverem discordando entre si, ou seja, se a diferença entre duas destas medidas for maior que uma dada tolerância, então há um forte indício de que há uma falha no sistema. Esta tolerância deve ser ajustada de forma que o sistema não acuse muitos falsos alarmes. Sistemas com menor tolerância tendem a acusar mais falsos alarmes. Mas sistemas com maior tolerância tendem a não perceberem falhas de pequena magnitude. Possivelmente, uma falha de pequena magnitude pode não ser prejudicial para a navegação do veículo, uma vez que o sistema de navegação do veículo pode ser robusto o suficiente para suprimir esta pequena falha com os dados dos 3 sensores sem falhas. Todavia, para garantir a isolação, seriam necessários 5 sensores [3], [10], o que pode não ser viável, dependendo da qualidade dos sensores. Um girômetro do modelo EG- 120 FOG com saída digital é comercializado a preço da ordem de US$ 3.800 a unidade. Já um sensor do modelo EG-1300 FOG pode custar US$ 39.000 a unidade [11]. A linha de ação utilizada neste artigo é a utilização de um quinto sensor com qualidade inferior para auxiliar na etapa de isolação da falha. Dos valores citados no parágrafo anterior, observa-se que um sensor de qualidade inferior possui um custo de apenas 10% do sensor de maior qualidade. A. Sistema de Isolação O sistema de isolação é ativado assim que o sistema de detecção acusa a presença de uma falha. A partir deste instante, o algoritmo de isolação atua da seguinte forma: A primeira etapa é dividir os sensores em grupos de 3. Calcula-se a diferença entre estes grupos de sensores. Todos os grupos que não possuem o sensor defeituoso estarão concordando entre si, enquanto que os grupos que possuem o sensor defeituoso estarão discordando dos grupos que não possuem o sensor defeituoso. Por exemplo, denotando os sensores principais com números de 1 a 4 e o sensor de qualidade inferior pelo número 5, se o sensor defeituoso for o sensor de número 1, então todos os grupos que não possuem o sensor 1 estarão concordando entre si. Enquanto isso, os grupos que possuem o sensor 1 estarão discordando daqueles que não o possuem (ou seja, o grupo 1-2-3, discordará dos grupos 2-3-4, 2-3-5 e 3-4-5, que concordarão entre si). A concordância significa que a diferença entre duas medidas é menor do que uma dada tolerância, dada por 𝜀, enquanto que a discordância significa que a diferença entre as medidas é maior que uma outra tolerância, dada por 𝛿. Um ponto importante a ser observado é que o quinto sensor deve ser posicionado de forma que não haja um grupo de 3 sensores coplanares. A configuração tetraédrica dos sensores principais é mantida e o quinto sensor é colocado em um eixo estranho ao tetraedro. Este eixo pode ser paralelo à altura do triângulo da base do tetraedro. B. Implementação O sistema é simulado em ambiente computacional. Os sensores são simulados por meio de (1) e (2). Estes dados são filtrados no FM e no FMMP, e posteriormente são utilizados para calcular as velocidades angulares dos grupos de sensores, por meio de (4). Para calcular a velocidade angular de um dado grupo, retira-se da matriz de cossenos diretores a linha correspondente aos sensores removidos. Os 4 sensores principais estão em configuração tetraédrica com a matriz de cossenos diretores dada por (5). Como o quinto sensor possui seu eixo alinhado com a altura do triângulo da base do tetraedro, a sua linha correspondente na matriz dos cossenos diretores é: Com estas informações é feita a simulação do sistema. A velocidade angular verdadeira é configurada no próprio simulador. A falha é inserida dentro do ambiente computacional. O tipo de falha e sua magnitude podem ser escolhidos de acordo com a análise a ser feita. A falha é inserida por meio da alteração dos dados crus obtidos pelos girômetros. Os dados crus são os dados antes do processo de filtragem pelo Filtro de Mediana e pelo FMMP. Por fim, são calculadas as diferenças entre as medidas dos diferentes grupos. Compara-se as diferenças com as tolerâncias 𝜀 e 𝛿. Por meio de um conjunto de operações lógicas que analisam os resultados das comparações, consegue-se inferir qual dos sensores sofreu a falha. Este sensor deve, então, ser descartado da navegação, que passa a atuar com os outros 3 sensores restantes. C. Parâmetros de Simulação Os parâmetros de simulações foram os seguintes:  Janela do Filtro de Mediana 𝑙 = 3  Janela do FMMP 2𝑚 + 1 = 5  Desvio padrão do ruído dos sensores principais 𝜎𝜂 = 10°/ℎ  Desvio padrão do Random Walk do viés dos sensores principais 𝜎𝜈 = 1°/ℎ  Desvio padrão do viés inicial dos sensores principais 𝜎𝐵0 = 30°/ℎ  Desvio padrão do ruído do quinto sensor 𝜎𝜂 = 100°/ℎ  Desvio padrão do Random Walk do viés do quinto sensor 𝜎 𝜈 = 10°/ℎ  Desvio padrão do viés inicial do quinto sensor 𝜎𝐵0 = 300°/ℎ  Frequência de amostragem: 100 𝐻𝑧  Instante de ocorrência da falha: 100 segundos  Velocidade Angular: 𝝎 = [253⋅⋅⋅cos sin cos000,,01 01 ,1 ⋅⋅⋅𝑡𝑡𝑡] 𝑟𝑎𝑑/𝑠 O viés inicial é inicializado como resultado de uma variável aleatória gaussiana com média nula. Pode-se perceber, pelos parâmetros, que a qualidade do quinto sensor é cerca de 10 vezes pior que os sensores principais. As falhas inseridas para serem testadas foram as falhas degrau e rampa, uma falha brusca e uma suave. D. Resultados Os resultados obtidos foram positivos. O sistema conseguiu realizar com sucesso a isolação do sensor defeituoso utilizando o quinto sensor de menor qualidade. Nas Fig. 2 e Fig. 3 pode-se observar as leituras dos sensores e a comparação entre a velocidade medida e a verdadeira, respectivamente. Na Fig. 2 pode-se observar o surgimento da falha no sensor 2. Na Fig. 3 pode-se observar o momento em que a falha é isolada e o sistema se reconfigura para calcular a velocidade sem o sensor defeituoso. Em ambas as figuras, a falha está em destaque. Neste caso, a falha inserida foi uma falha degrau de magnitude de 1,5°/𝑠. Da mesma forma, nas Fig. 4 e Fig. 5 pode-se observar os resultados para uma falha do tipo rampa. A falha rampa foi inserida no sensor 3 com magnitude de crescimento de 0,05°/𝑠². Na figura 5 é possível ver como a falha degrau aumenta gradativamente o erro na medida da velocidade. De maneira geral o sistema consegue isolar o sensor defeituoso. As tolerâncias utilizadas para os resultados encontrados foram 𝛿 = 0,55°/𝑠 e 𝜀 = 0,2 °/𝑠. Estes parâmetros devem ser sintonizados conforme a qualidade dos sensores, tanto dos principais como do quinto sensor. V. CONCLUSÃO De maneira geral, os resultados do sistema FDIR para 4 sensores principais e um quinto sensor secundário se mostraram positivos. O objetivo do trabalho, que era desenvolver um sistema capaz de realizar a isolação do sensor defeituoso utilizando apenas 4 sensores principais foi atingido. Com a solução proposta neste trabalho, pode-se diminuir o custo financeiro de um sistema FDIR capaz de realizar a isolação de um sensor defeituoso. Para estudos futuros, é interessante fazer uma análise estatística do desempenho do sistema, analisando a taxa de acertos das isolações, isto é, qual a probabilidade do sistema isolar o sensor correto dada uma magnitude e tipo de falha. Outro estudo possível é verificar a possibilidade de desenvolver um sistema de isolação para sistemas de navegação inercial em um veículo autônomo com trajetória de referência."
	}
