	{
		"id": 66,
		"titulo": "planejador de missões do rádio definido por software do ministério da defesa",
		"autor": "Victor Feitosa de Carvalho Souza, Fillipe Machado Pinto Napolitano, Maurício Henrique Costa Dias",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2019/st/ST_01_3.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 3,
		"resumo": "No contexto das comunicações táticas baseadas no uso de rádios definidos por software, uma das dificuldades que se apresentam é a configuração e a programação de múltiplos rádios de forma eficiente para uma operação. A estratégia usual para mitigar esse problema potencial é o uso de software específico, usualmente referido como planejador de missões. O objetivo deste artigo é descrever o planejador de missões desenvolvido para o Rádio Definido por Software do Ministério da Defesa brasileiro, destacando suas principais funções e características técnicas e operacionais. Para tal, alguns casos de uso são exemplificados e discutidos quanto ao ganho de eficiência que a ferramenta proporciona.",
		"texto": " I. INTRODUÇÃO O conceito de rádio definido por software (RDS) [1] está cada vez mais presente nos sistemas e redes de telecomunicações atuais, inclusive nas aplicações táticas militares [2]. Tomando como exemplo o contexto norteamericano, destaca-se a iniciativa de busca pelo padrão JTRS (Joint Tactical Radio System) de RDS tático, entre 1997 e 2012, que foi reformulado para melhor incorporar aspectos de redes, e hoje é gerenciado pelo JTNC (Joint Tactical Networking Center) [3], [4]. Além dos EUA, apenas outros 14 países detém tecnologia de RDS militar, entre eles o Brasil [5], [6]. Desde 2012, o Centro Tecnológico do Exército (CTEx) conduz o programa de desenvolvimento do Rádio Definido por Software de Defesa (RDS-Defesa), uma iniciativa do Ministério da Defesa brasileiro, que conta com a participação de integrantes das três Forças Armadas e de empresas parceiras contratadas [5], [6]. Com base nos requisitos operacionais conjuntos que foram definidos em 2013 [7], o projeto foi dividido em dois ciclos, sendo o primeiro voltado para o desenvolvimento de um RDS veicular, com potência de até 50 W e banda de operação de 2 a 512 MHz. Este ciclo tem previsão de término até 2020, com resultados preliminares compatíveis com as expectativas, conforme comprovado na última edição da LAAD (Latin America Aerospace and Defence), com demonstrações de capacidade de interoperabilidade e portabilidade de diversas formas de onda [8], [9]. No desenvolvimento do RDS-Defesa veicular, para fins de gestão, o projeto foi dividido em 14 módulos, sendo um voltado para gestão propriamente dita, um para integração e os demais destinados ao desenvolvimento de partes específicas dos equipamentos, tais como formas de onda, soluções de segurança, hardware de radiofrequência e plataforma operacional [5], [6]. Em especial, um desses módulos previstos foi uma ferramenta em software para configurar, de forma automática e multiplexada, os RDS a serem levados para uma operação. Esse software foi denominado Planejador de Missões do RDS-Defesa, e desde 2018 está disponível para uso [10]. A demanda para esse tipo de ferramenta se justifica por vários motivos. Em primeiro lugar, pela complexidade e pelo volume das informações das formas de onda, que são de difícil configuração em uma interface de rádio usualmente restrita. Outro aspecto relevante é a escalabilidade. O oficial de Comunicações responsável por preparar os equipamentos para uma operação precisa de uma ferramenta que automatize e permita a configuração distribuída e simultânea desses múltiplos rádios. Há ainda a preocupação com a segurança, como por exemplo, o controle das chaves de criptografia. Cumpre destacar que várias empresas que comercializam RDS táticos oferecem também ferramentas próprias com essas funções, como por exemplo, a Harris [11]. Do exposto, o objetivo deste artigo é apresentar o Planejador de Missões do RDS-Defesa, descrevendo suas principais funções e características técnicas e operacionais. Para tal, o texto foi dividido da seguinte forma. A seção II apresenta os requisitos e a descrição funcional da ferramenta. Para ajudar a entender melhor o potencial do planejador para o oficial de Comunicações, a seção III discute casos de uso principais. As funcionalidades previstas para a versão 2.0 do software são brevemente apontadas na seção IV. Por fim, a seção V conclui o artigo. II. REQUISITOS E DESCRIÇÃO FUNCIONAL O Planejador de Missões é uma ferramenta computacional cuja finalidade é fornecer funcionalidades de configuração e planejamento de redes rádio de modo gráfico e intuitivo. Seu projeto foi desenvolvido com base em requisitos pré- estabelecidos, reproduzidos na Tabela I, juntamente com as respectivas justificativas. Dentre as funcionalidades principais do sistema estão: criação, validação lógica e exportação de planos (também chamados de missões) de comunicações; configuração dos parâmetros de topologias, redes e rádios; gerenciamento de chaves de segurança criptográficas; auditorias das ações dos usuários da ferramenta. A Fig. 1 apresenta um mapeamento geral dos recursos do Planejador de Missões [10]. Há dois perfis de usuários do sistema: o administrador e o operador. O administrador – geralmente um oficial de Comunicações do Exército Brasileiro ou equivalente das outras Forças Armadas – é o responsável pela instalação do software e pela configuração dos valores-padrão de atributos da ferramenta (endereço IP inicial, prefixo dos nomes das redes, etc.). Por outro lado, o operador, um usuário padrão do rádio, detém um conhecimento limitado no planejamento das redes rádio e possui a função de elaborar as missões de comunicações. Neste sentido, a exibição do software de modo gráfico e intuitivo simplifica a experiência que o operador tem ao utilizar a ferramenta. Em termos de arquitetura de software, o sistema desenvolvido é uma aplicação Java SE8, de forma que a instalação da ferramenta é realizada através da execução de um arquivo no formato JAR (Java Archive). Espera-se que a máquina hospedeira da instalação possua no mínimo 4 GB de RAM, apresente arquitetura do Sistema Operacional Windows ou Linux, e possua instalada a ferramenta de desenvolvimento Java SE8. Uma das tecnologias implementadas no sistema é o OSGI (Open Service Gateway Initiative), que possibilita a integração de módulos (plugins) a serem carregados dinamicamente na ferramenta. A Fig. 2 apresenta a visão macro da arquitetura do sistema, ressaltando os componentes: plugins, planejamento da missão, e pacotes de configuração. Os plugins possuem descritores de novos elementos (que podem ser formas de onda, rádios, entre outros) a serem adicionados para manipulação na ferramenta. No planejamento da missão, a configuração da topologia da rede rádio é realizada de forma gráfica. Após validação deste planejamento, obtêm-se como resultado os diversos pacotes que serão exportados para a configuração dos diversos rádios através do padrão militar Fill Gun. III. CASOS DE USO PRINCIPAIS A. Planejamento das comunicações e programação de múltiplos rádios Realizar o planejamento das comunicações é a principal funcionalidade do Planejador de Missões. Um plano de comunicações é composto pelo conjunto de topologias dos presets (páginas de configuração) e seus elementos de rede. Para gerar um plano de comunicações, o usuário deve criar, dentro de cada preset, a topologia desejada, escolhendo para isso os RDS e as formas de onda que serão utilizadas na composição das redes. Além disso, o usuário poderá inserir destaques como construções, veículos e geografia, deixando o planejamento mais detalhado e informativo. Neste contexto, a interface gráfica da ferramenta pode ser aproveitada inclusive para fins didáticos, em instruções para oficiais de Comunicações de modo geral. Após realizar a conexão entre os RDS e as formas de onda, torna-se necessário preencher as propriedades de cada componente. Por exemplo, caso o usuário utilize uma forma de onda digital, devem ser inseridos os valores de frequência, potência, endereço IP, máscara de sub-rede, entre outros parâmetros. A Fig. 3 ilustra a interface de planejamento dos planos de comunicações. Conforme mencionado anteriormente, o Planejador de Missões foi projetado para ser uma ferramenta gráfica, simples e intuitiva para o planejamento da rede e configuração dos rádios. Atualmente, toda programação dos RDS é realizada através da referida ferramenta, como pôde-se verificar recentemente por ocasião da LAAD edição 2019, na qual o CTEx expôs protótipos do RDS-Defesa. B. Validação lógica de rede Uma das vantagens em se utilizar o Planejador de Missões para construir a rede de comunicações é a possibilidade de realizar validações lógicas. Por meio desse recurso, torna-se possível buscar, verificar e corrigir inconsistências, erros de preenchimento, elementos não conectados, entre outros problemas do planejamento. Na parte inferior da Fig. 4 é possível observar um campo de mensagens. Ao se pressionar o botão de Validar, são exibidas as mensagens de erros nesse campo, de forma a proporcionar ao usuário correções no plano. Ao término das correções, é exibida a mensagem Validação realizada com sucesso. C. Gerenciamento de chaves de segurança A ferramenta Planejador de Missões possibilita realizar o gerenciamento de todas as chaves criptográficas que serão utilizadas nas redes rádio (tanto no modo COMSEC quanto no TRANSEC). Atualmente estão presentes algoritmos universais, como por exemplo o AES (Advanced Encryption Standard), bem como algoritmos de criptografia proprietários, desenvolvidos pela Marinha do Brasil. A Fig. 5 apresenta a tela de gerenciamento de chaves do Planejador de Missões. Além de gerar chaves criptográficas, é possível realizar a importação de chaves através de arquivo ou dispositivo (hardware) de segurança. Também é possível determinar o tempo de expiração para as chaves utilizadas nas topologias de rede. D. Gerenciador de plugins A arquitetura do Planejador de Missões é baseada em plugins. Isso possibilita a inserção de novos elementos na ferramenta (novos rádios, formas de onda, equipamentos de rede, entre outros) sem a necessidade de compilar novamente o programa. O plugin é um pacote de software, desenvolvido à parte do Planejador de Missões, que após instalado na ferramenta, disponibiliza um elemento para utilização do usuário no planejamento de comunicações. O pacote contém todas as informações necessárias para apresentação do elemento no Planejador de Missões, tais como tipo do elemento (rádio, rede, etc), nome, ícone representativo, operações possíveis de serem executadas, propriedades exibidas e configuráveis pelo usuário, versões dos demais plugins compatíveis, dentre outras informações. O usuário fornece ao gerador de plugin todas as informações necessárias para a elaboração do pacote compactado que especifica o elemento. Uma vez desenvolvido, a instalação do plugin será realizada manualmente, através da cópia e cola do arquivo no respectivo diretório de instalação do Planejador de Missões. A ação instalar disponibiliza a última versão do plugin ao usuário no Planejador, como representado na Fig. 6. E. Programação dos Rádios A programação dos rádios é caso de uso final nas ações de planejamento das redes rádio. Consiste na cópia dos arquivos gerados na fase de elaboração do plano de comunicações para o sistema operacional dos rádios. O pacote gerado pelo Planejador de Missões é composto por n arquivos compactados, cada qual se referindo a um dos n rádios envolvidos na missão. Cada um desses arquivos é composto por um arquivo CSP (contendo as chaves criptográficas utilizadas no plano) e um arquivo XML (descrevendo os diversos parâmetros de configuração do rádio em questão). O pacote gerado é armazenado em um dispositivo Fill Gun, que será conectado ao rádio para a transferência do arquivo. Após os processos de transferência, descompactação de arquivos e descriptografia, o rádio estará configurado como planejado na ferramenta. Cabe ressaltar que os processos supramencionados são de responsabilidade da ferramenta Loader, um utilitário adicional do Planejador de Missões e também proprietário do CTEx. IV. PLANEJADOR 2.0 Em que pese a versão atual da ferramenta atender às demandas originais a que se propunha, novas funcionalidades importantes foram identificadas para reforçar sua utilidade. Uma nova versão (2.0) foi especificada e o seu desenvolvimento está em fase inicial. Nesta seção destacamse as principais mudanças previstas. Uma das novidades será a incorporação de mapas à ferramamenta, o que permitirá a ampliação de sua utilidade como apoio ao planejamento das operações de comando e controle, e mesmo poderá ser utilizada durante a operação nesse sentido. Outra opção prevista, ainda como aproveitamento da integração de mapas digitais à ferramenta, é o planejamento de cobertura de radiotransmissão das operações. Com a inserção de dados adicionais referentes às antenas e a utilização de informações de configuração dos rádios (potência de transmissão, forma de onda, etc.), o Planejador disponibilizará um modo de cálculo de perda de propagação, dando ao operador a opção de escolha de modelos adequados, a exemplo do que se encontra em suítes comerciais de grande porte [12] ou testes de conceito mais restritos [13]. Por fim, destaca-se a previsão de uma barra de ferramentas para apoio ao planejamento e monitoramento de comunicações em HF. O modo de propagação ionosférico, pertinente a essa banda, impõe aspectos adicionais não necessários ao planejamento e operação das comunicações em VHF e UHF. O ruído predominante é o atmosférico, o canal ionosférico varia de maneira muito peculiar com o tempo e a posição dos equipamentos da rede, as antenas são pouco eficientes, dentre outros aspectos [14]. Como a faixa de HF é importante para as comunicações táticas militares, esta barra incorporará as especificidades pertinentes para permitir ao oficial de Comunicações melhor planejar as operações em HF V. CONCLUSÃO Este artigo apresentou uma breve descrição do Planejador de Missões do RDS-Defesa. Inicialmente, os requisitos e a descrição funcional da ferramenta foram discutidos. Desataca-se que, baseada em Java SE8, ela roda em plataformas usuais Linux e Windows, demandando pouca memória RAM. Na sequência, os cinco principais casos de uso do Planejador foram abordados. Disponibilizada em 2018, ainda antes da conclusão do ciclo 1 da versão veicular do RDS, espera-se que a ferramenta atual dê grande flexibilidade e agilidade ao oficial de Comunicações responsável pelo planejamento da operação e pela configuração dos equipamentos. Com a incorporação das funcionalidades adicionais previstas para a próxima versão do software, a utilidade da ferramenta será ainda maior."
	}
