	{
		"id": 67,
		"titulo": "fusão de dados em unidade de medição inercial virtual de baixo custo",
		"autor": "Victor Wilvert Antunes, Gian Ricardo Berkenbrok e Carla Diacui Medeiros Berkenbrock",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2019/st/ST_03_1.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 2,
		"resumo": "A aplicação de sensores de medição inercial é utilizada em sistemas de navegação de diversos tipos de aparelhos e veículos terrestres, aéreos e náuticos. Esses sensores fazem uso de sistemas micro eletromecânicos (MEMS), que são sujeitos a diversos erros e imprecisões. Para módulos de baixo custo, a precisão tende a ser menor, justificando o uso de técnicas de aperfeiçoamento da medição como, por exemplo, a fusão de dados. A fusão de dados é realizada utilizando dados de vários sensores combinados, fazendo com que o erro possa ser reduzido. Neste trabalho foi desenvolvida uma placa com algumas unidades de medição inercial (IMU) e uma aplicação para exemplificar a fusão de dados nela, conseguindo obter dados de orientação, velocidade e posição da placa a partir dos dados obtidos das IMUs disponíveis.",
		"texto": " I. INTRODUÇÃO Fusão de dados consiste em métodos para aglutinação de diversos dados de diferentes fontes que referenciam a um mesmo objeto. No âmbito de sensores é uma técnica utilizada para aglutinar um conjunto de medições de forma a tornar a informação final mais precisa e utilizável do que as medições individuais que a compõem, ou para adicionar proteção contra falhas devida à redundância [1]. Usualmente, empregam-se sensores de alto custo em aplicações que demandam precisão. Porém, como objetivo desse trabalho, demonstra-se a utilização de um conjunto de sensores de baixo custo, com precisão menor, fazendo uso de técnicas de fusão de dados, tornando possível o alcance de diferentes níveis de precisão, corrigindo erros de leitura por compensação usando as medições de outros sensores, o que os tornam capazes de substituir sensores de maior custo. Para sistemas de navegação inercial, onde são utilizadas unidades de medida inercial (IMU), um problema recorrente é o dead reckoning para determinação da posição. Esta técnica consiste em deduzir a posição atual de algum objeto através de suas características de posição, velocidade e aceleração em um instante passado [2]. O uso dessa técnica leva a dificuldades advindas da utilização de integração sobre as medidas de aceleração, pois todos os erros de medidas são integrados em conjunto com os dados desejados. A partir desta inclusão de erros indesejada, são originados diversos problemas, sendo o mais comum os erros no alinhamento estático. Neste ponto, são aplicadas as técnicas de fusão de dados, como filtros que analisam dados de diversos sensores para correções de erros. A aglomeração dos dados das medições de diversos sensores de mesmo tipo é realizada através da integração de dados redundantes qualitativos [3]. Para a determinação da posição a integração dos dados é feita seguindo as equações de estimação de máxima probabilidade [4]. Outro problema a ser contornado é o ruído e erros presentes nas medições devido às unidades de medição, o qual se lida através de da aplicação de filtros à por software em conjunto com às configurações de filtragem possíveis na própria IMU. Com todos dados finais obtidos após a fusão dos dados e pela técnica dead reckoning, pode-se utilizar essas informações para controles de veículos tripulados ou não tripulados, como é realizado controle mísseis [5] e drones. Reduzindo o custo e possivelmente atingido níveis de precisão similares ao uso de uma unidade de medida de maior custo. Além disso, possibilitando a proteção contra falhas advinda da redundância derivada da utilização de diversos sensores. Este trabalho está dividido em cinco partes: na parte 2 são analisados métodos de fusão de dados entre os sensores presente em um IMU, além de correção de distorções presentes nos sensores. Na parte 3 apresenta-se a análise de métodos de fusão entre múltiplas IMUs. Na sequência, a quarta parte apresenta os experimentos e resultados obtidos, finalizando com as considerações finais, na última parte, presentando observações sobre os resultados e trabalhos futuros. II. FUSÃO DOS DADOS INDIVIDUAIS Essa seção apresenta os algoritmos de filtragem e fusão de dados utilizados em cada unidade de medida inercial individualmente. Para que seja possível manipular os dados presentes, primeiro é necessário realizar a correção de erros e filtragens nas leituras dos sensores presentes. A partir disso, se aplicam técnicas de fusão de dados para se obter todas informações necessárias com o mínimo de erro possível. Inicialmente corrigindo distorções sobre as leituras do magnetômetro, devido ao seu efeito nos cálculos de orientação. A. Correção de distorções nas medidas do magnetômetro. Magnetômetros são sensores de campo magnético que são submetidos a distorções por ferros duros e doces advindas dos componentes presentes na placa de circuito impresso em conjunto com o sensor [6]. As distorções de ferro duro são criadas por objetos que produzem um campo magnético, como a presença de motores e imãs nas vizinhanças do sensor, causando uma modificação permanente na saída do sensor, e as distorções de ferro doce são consideradas deflexões ou alterações no campo magnético existente, causadas pela presença de materiais como ferro e níquel [6]. Uma maneira comum de visualizar e corrigir distorções de ferro duro e doce é analisar as saídas do magnetômetro em um gráfico 2D, contendo as medições por pares de eixos do magnetômetro. Analisando a Fig. 1 se identificam a relação das leituras de um magnetômetro em pares, onde a distorção por ferro duro ocasiona um deslocamento em relação ao eixo central de cada um dos círculos. Para correção da distorção por ferro duro é apenas necessário a subtração por uma constante, já que esse é um tipo de erro permanente. Para encontrar o valor de correção se aplica (1), em que se busca um valor de correção a para as leituras n de cada eixo denotado por i [6].Portanto aplicando (1), se realiza a correção das leituras mostrada na Fig. 2, onde também é realizada a normalização dos valores de leitura, que serão utilizadas para a determinação de orientação do sistema. As distorções por ferro doce não estão presentes na Fig. 2, normalmente só ocorrem em sistemas com quantidade alta de metais próximos aos sensores. B. Isolamento do vetor gravidade e aceleração linear Todas as medições de acelerômetros contêm a aceleração linear sobre o sensor em conjunto com a ação da gravidade sobre ele. Para a utilização dos dados deste sensor, inicialmente é necessário realizar o isolamento de cada um destes vetores de aceleração. O vetor correspondente à gravidade é utilizado para o cálculo dos ângulos de orientação que serão utilizados na correção dos dados do giroscópio e a aceleração linear é utilizada para obter a velocidade e posição através de integrações. Para isolar as diferentes acelerações, um filtro passabaixa de acordo com (2) é utilizado, pois os sinais relativos à gravidade são de baixa frequência, enquanto os relativos à aceleração linear são de alta frequência. Onde em (2) g representa o vetor gravidade e a é o vetor de aceleração medido pelo acelerômetro, em (3) τ é a constante de tempo do filtro e dt é o período de amostragem e em (4) al representa o vetor de aceleração linear. C. Filtro complementar. Um problema apresentado ao se utilizar giroscópios para a determinação da orientação de um sistema é a presença de drift sobre os dados de ângulos de orientação, devida à integração de ruídos de desvios em relação à referência e outros erros advindos das medições do sensor. Decorrente deste erro sobre a orientação, o alinhamento estático do sistema apresenta imprecisão. Para corrigir este problema, um filtro complementar é utilizado, onde através de medições de aceleração e campo magnético são determinados os ângulos de pitch, roll e yaw de referência, para correção do alinhamento estático. Estes valores, mesmo possuindo elevada quantidade de ruído, em estados estáticos são precisos e não são afetados por limites de máxima taxa de amostragem como o giroscópio. Para se obter os ângulos de roll (φ) e pitch (θ) são utilizadas as medições da gravidade isoladas do acelerômetro e aplicando (5) e (6) de acordo com Pedley [7], onde g é o vetor gravidade, em seu respectivo eixo de acordo com o índice. Tendo os ângulos de roll e pitch é possível determinar o ângulo de yaw (𝜓) utilizando medições de um magnetômetro aplicando (7) seguindo os métodos expostos por Ozyagcilar [8], em que B representa o campo magnético de seu respectivo eixo de acordo com o índice. Através dos ângulos de referência, obtidos por outros sensores, é possível aplicar um filtro complementar para obtenção de valores precisos para orientação. Aplicando um filtro passa-alta nos dados do giroscópio e passa-baixa nos ângulos de referência, somando-os e formando assim um filtro passa-tudo, com sinais vindo de duas fontes diferentes, para impedir o drift apresentado pelo giroscópio nesta faixa [9]. O valor do ângulo é denotado por γ em (8), podendo ser qualquer um dos ângulos de orientação, ω é a taxa angular medida, θ é o ângulo de referência, dt é o período de amostragem e α é dado de acordo com (3). D. Detecção de condição estacionária. Para obter valores de velocidade e posição é necessário realizar a integração da aceleração linear, o que acarreta no problema de que qualquer ruído ou desvio é integrado, levando a erros na informação final, especialmente no caso da posição, em que se realiza dupla integração. Para contornar esse problema, o princípio de zero velocity update (ZVU) é utilizado, que consiste em utilizar outras medições com o objetivo de determinar se o sistema no qual a IMU está inserida se encontra em um estado estático [10]. Uma condição viável para determinação da condição de ZVU é a utilização do ruído das medições do acelerômetro para determinar movimentação. Durante qualquer tipo de movimento, em velocidade é constante, as medições de aceleração no eixo do movimento apresentam uma elevada quantidade de ruído em relação à quando o sistema está completamente estacionário. Desta forma, é possível empregar o cálculo do desvio padrão das leituras de aceleração, e utilizar um limite de controle para definir quando a velocidade é igual a zero, como por exemplo a utilização de um limite de 0,05 m/𝑠ଶ [10]. Ao empregar o método ZVU, se removem erros na integração da velocidade para cálculo de posição, já que é removido qualquer desvio em relação à referência. Similar ao que foi realizado com o filtro complementar, utilizando diferentes informações para buscar corrigir erros originados por integrações de sinais com presença de erros. III. FUSÃO DOS DADOS EM GRUPO Para casos que se deseja leituras mais precisas, ou segurança em relação a falhas, são utilizados múltiplos sensores, compensando por erros de medição entre si. A técnica escolhida de fusão de dados quantitativos redundantes é a de estimação da máxima probabilidade, seguindo os princípios de Maybeck e avaliando o apresentado por Villanueva [11]. Esta técnica consiste em analisar a função de probabilidade de um conjunto de amostras e os parâmetros que a maximizam. Onde em (9) f representa a variável a ser medida e as medições individuais são representadas por z, em (10) u representa os desvios padrões de cada sensor. O objetivo desse método é desenvolver uma lógica de medida similar à criação de um sensor virtual, o qual representa todos os outros em conjunto. No caso de IMUs, se usam os termos redundant IMU (RIMU) ou virtual IMU (VIMU), normalmente aplicadas na indústria aviônica como método de correção de falhas, caso algum sensor seja danificado ou deixe de funcionar [12]. IV. EXPERIMENTOS E DISCUSSÃO Para a realização dos experimentos foi desenvolvida uma placa contendo duas unidades de medida inercial BNO055, sendo amostrados por um microcontrolador TM4C123GXL e repassando os dados para um computador, o qual realiza todo o processamento dos dados. A placa contendo as IMUs e o microcontrolador podem ser vistos na Fig. 3, sendo que cada uma das unidades de medida se encontra com seus eixos em posições diferentes, para melhor detecção de erros. Como objetivo futuro para o desenvolvimento desta placa, deseja-se adicionar outras IMUs, para melhores resultados em relação a fusão de dados entre múltiplas IMUs. Para demonstrar a funcionalidade da fusão de dados individual de cada IMU para a orientação, temos na Fig. 5 a orientação da placa com relação ao eixo z durante a execução de um movimento oscilatório no mesmo eixo, onde é observado o funcionamento do filtro complementar, que é ilustrado no diagrama de blocos na Fig. 4, no qual os dados de referência são obtidos através dos dados do acelerômetro e magnetômetro e da aplicação de (5), (6) e (7). Na Fig. 5, quando o sistema se encontra em regime dinâmico, a saída do filtro complementar segue as medições feitas pelo giroscópio, e quando o regime passa a ser estacionário, o filtro tem sua saída tendendo aos valores de referência. Com isso, mesmo que os dados de referência possuam considerável ruído, seu alinhamento estático é preciso, assim corrigindo o problema de drift apresentado pelo giroscópio, que possui leituras dinâmicas precisas, porém erros oriundos da integração dos dados, para o alinhamento estático, principalmente no caso de mudanças bruscas. Com a fusão desses dados é possível melhorar a precisão com as medidas de orientação. No caso da utilização de vários sensores, são empregados as 2 IMUs BNO055 presentes na placa para medições da orientação no eixo z na execução de um movimento oscilatório, utilizamos (9) e (10), obtendo os resultados apresentados na Fig. 6. De acordo com o algoritmo utilizado, a fusão dos dados é dada com o uso do desvio padrão que cada medição apresenta, fazendo que leituras com menor variação tenha maior relevância no valor final da informação. Na Fig. 6, observa-se que as medições da IMU 2 variam muito mais do que a IMU 1, ocasionando que o valor final seja muito próximo do valor das medições da IMU 1. Esse método auxiliar na prevenção de erros devido a falhas de sensores, já que suas leituras seriam invalidadas, além de ser capaz de aumentar a precisão do valor final. Para realizar a correção do problema de drift devido a integração com as medições de aceleração, foi utilizado o método ZVU, demonstrado na Fig. 7, onde são realizados dois movimentos oscilatórios rápidos no eixo x. O princípio seguido é zerar o valor de velocidade quando o desvio padrão da aceleração for abaixo de determinado valor, depois de certo tempo, pois sempre que o sistema em que a IMU estiver presente se movimentar, ocorre a presença de uma quantidade leve de ruído sobre a aceleração. Na Fig. 7 observam-se os valores de velocidade sendo corrigidos após determinado tempo em duas instâncias, identificadas pelo item A na figura. Sem essa correção, a obtenção da posição ficaria cada vez mais complexa, pois ocorreria integração desse desvio. Por fim, a análise das medições de posição é realizada, para isso foi realizado o ensaio de um movimento circular, de um diâmetro de aproximadamente 5 cm, sobre uma bancada, no qual a placa só era movida em relação aos eixos x e y, sem nenhuma movimentação relativa ao eixo z. Na Fig. 8 os resultados são apresentados. Observa-se na Fig. 8 que os valores obtidos não foram muito similares ao movimento que foi realizado. Esse resultado obtido sofreu a influência devido a inércia inicial e a desaceleração final, que não são analisados corretamente devido a limitações do sistema, por causa da taxa de amostragem. Porém, na parte intermediária do movimento possui um resultado aproximado ao que seria esperado, o que é oriundo das variações de aceleração neste trecho não serem muito elevadas. Experimentos em ambientes com maior controle podem obter resultados melhores, algo não disponível no laboratório onde o experimento foi realizado. Além disso, pode-se observar na curva vermelha a fusão dos dados dos dois sensores. Demostrando que com poucos sensores e dados não muito precisos, já se atingem resultados aceitáveis. V. CONSIDERAÇÕES FINAIS Neste Trabalho foram aplicados métodos de fusão de dados em unidades de medição inercial, sendo utilizados algoritmos para fusão dentre os sensores de uma IMU individual e entre as medidas de múltiplas IMUs, além de correções de distorções presentes nas leituras do magnetômetro. Considerando os dados obtidos nos experimentos, podese observa que as informações de orientação atingiram resultados aceitáveis. No entanto, devido ao uso de ângulos de Euler existe a possibilidade de gimbal lock, que seria a perda de um eixo de rotação por certa combinação de ângulos [13]. Esse problema pode ser resolvido através da utilização de quartenions que não são suscetíveis a esse problema, além de simplificar o isolamento da gravidade. Na obtenção dos dados de velocidade e posição por integração, os resultados finais não foram muito satisfatórios devido à presença elevada de erro ocasionada pela simplicidade do método de correção utilizado para velocidade, o ZVU, e pela amostragem do acelerômetro. Além disso, para aumentar a qualidade das informações obtidas também seria útil a utilização de mais sensores na fusão, o que já está planejado no desenvolvimento da placa utilizada. Planeja-se também um firmware com suporte à manipulação dos dados usando abordagem de quartenions. No estado atual, essa solução já poderia ser aplicada para determinação de orientação em diversos sistemas, como nos veículos terrestres e náuticos autônomos e não autônomos. "
	}
