{
    "id": 68,
    "titulo": "robustecimento/endurecimento a radiação ionizante por técnicas de design de circuito em célula unitária de circuitos condicionadores de sinais (roics)",
    "autor": "brunno brendon cortes de oliveira, lester de abreu faria",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2019/st/ST_12_2.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "O trabalho proposto analisa e propõe técnicas de mitigação para os efeitos a radiação ionizante em uma célula unitária (pré-amplificador) de um circuito condicionador de sinais (Readout Integrated Circuit – ROIC) empregado em sensores de imagem multi-pixel (Focal Plane Array – FPA). A topologia de ROIC escolhida foi a Source-Follower Direct Injection (SFDI) por possuir uma simples implementação, boa linearidade, baixo consumo de potência e menor área ocupada. Uma vez conhecido os efeitos da radiação ionizante em componentes eletrônicos, foram utilizados métodos para a análise de pontos sensíveis do circuito e robustecimento dos mesmos através de modificações na arquitetura do circuito em nível de projeto.",
    "texto": " I. INTRODUÇÃO Sensores de imagem multi-pixel (focal plane arrays), com valor agregado bastante elevado, sofrem embargo tecnológico de países detentores de tecnologia de ponta que, geralmente não compartilham o conhecimento necessário, existindo uma dupla dificuldade de implementação em vetores reais: o projeto dos circuitos propriamente ditos e o seu robustecimento/endurecimento às situações agressivas existentes no espaço, em termos de radiações ionizantes. Uma das dificuldades na produção de circuitos para aplicação espacial é o ambiente com inúmeras fontes de radiação como: anéis de Van Allen, fendas solares e raios cósmicos, portanto, inóspito para eletrônicos [1]. Dessa forma, é importante que os circuitos desenvolvidos para esse fim sejam mais robustos, ou até mesmo resistentes, ao acúmulo de cargas geradas pelas partículas de radiação presentes no espaço. Os circuitos integrados que experimentam a integração de partículas ionizantes, sofrem de dois efeitos de radiação cósmica, os efeitos acumulativos (Total Ionizing Dose – TID, Desplacement Demage – DD) e os efeitos transientes ou isolados (Single Event Effect – SEE) [2]. Dois elementos são essenciais a fim de se compor um dispositivo de imageamento infravermelho: o detector e o circuito de leitura e condicionamento de sinais, também conhecido como Readout Interated Circuit (ROIC), é elemento fundamental para a formação da imagem, uma vez que o sinal gerado pelo detector deve ser lido, filtrado, amplificado, multiplexado e transmitido de forma sequencial para um circuito externo, responsável pela reconstrução da imagem [3]. No caso específico de sensores de imagem multipixel o acúmulo de cargas nos sensores leva a distorção ou perda da imagem formada. Dentre várias arquiteturas disponíveis para circuitos condicionadores de sinais, Self-integrator (SI) [4], Direct Injection (DI) [5]; Gate Modulated Injection (GMI) [6]; Buffered Direct Injection (BDI) [7]; Source Follower per Detector (SFD) [5]; Buffered Gate Modulation Input (BGMI) [7]; Switched Current Integration (SCI) [7]; Share-buffered direct injection (SBDI) [8]; Current-mirror direct Injection [7]; Capacitive Trans-Impedance Amplifier (CTIA) [5], foi escolhida a Source-Follower Direct Injection (SFDI) [5]. A topologia é de simples implementação, possui as funcionalidades básicas de condicionamento de sinal, ocupando pouca área, apresentando boa linearidade e com bons parâmetros de desempenho, aspectos importantes para aplicações de imageamento espacial [3]. No trabalho, são considerados os efeitos acumulativos (Dose Total Acumulada – TID). Estes efeitos se devem ao acumulo de cargas positivas em transistores MOS ao longo do tempo e que podem acarretar em: alteração da tensão de limiar (threshold voltage), acréscimo na corrente de fuga (leakege currente), degradação da mobilidade de portadores, armadilhas de fronteiras (border traps) e armadilhas de interface (interface traps) [2]. Além da utilização da arquitetura SFDI, o circuito a ser analisado e robustecido engloba um módulo complementar e um módulo polarizador que proporciona uma melhoria importante no desempenho do circuito como: eliminação de correntes parasitas e aumento da faixa dinâmica de operação. As técnicas de proteção utilizadas para robustecimento de circuitos contra a radiação ionizante são divididas em três níveis distintos: em nível de arquitetura de sistema, processos de fabricação e a nível de projeto de dispositivos (layout) [2]. Uma solução simples a nível de projeto utilizando transistores tradicionais (two-edged) e promovendo uma tolerância adequada a radiação ionizante, é a utilização de técnicas de inversão de fonte (Source) para transistores NMOS e inversão de substrato (Bulk) para transistores PMOS [9]. Esta solução será implementada para os transistores que demostrarem mais sensíveis a radiação ionizante através de testes, alterando a tensão de limiar conforme características apresentadas para cada tipo de transistor. Esta implementação será demonstrada e após esta análise, propor técnicas de mitigação para o robustecimento do circuito, através da arquitetura do circuito em nível de projeto. II. EFEITO DA RADIAÇÃO EM TRANSISTORES MOS Historicamente, o efeito dominante em consequência da radiação ionizante em transistores MOS tem sido relacionado ao desvio da tensão de threshold (tensão de limiar) [2]. Este efeito pode causar o funcionamento incorreto do circuito, ou até mesmo a queima de componentes. A parte com maior sensibilidade de um transistor MOS à radiação ionizante é o óxido de silício (SiO2), que gera pares 𝑒̅/ℎ podendo haver a migração de carga antes que ocorra a recombinação [10]. Este efeito, caso haja uma polarização positiva num NMOS, as lacunas tendem a se deslocarem para a área do Si/SiO2 experimentando um fenômeno estocástico de migração através de pequenos saltos entre centros de aprisionamento de cargas localizados na estrutura do óxido [10]. Os elétrons, por sua vez, sendo removidos do óxido, tendem a migrar para o gate do transistor [11]. Estes acúmulos de cargas, que são defeitos relacionados ao TID, dependendo da quantidade, pode promover que haja uma inversão de população sob o substrato alterando as características elétricas do dispositivo [2]. Os desvios da tensão de limiar possuem uma grande relação com as cargas aprisionadas no óxido e na área de Si/SiO2. O efeito eletrostático destas cargas cria um campo elétrico na superfície do substrato, com isso, em transistores NMOS, os elétrons atraídos para a região do canal resultam em uma diminuição da tensão de limiar, notando-se o efeito contrário em dispositivos PMOS [12]. A fig. 1 ilustra com clareza a consequência do TID na tensão de limiar de um transistor MOS. Nota-se na fig.1 que, quanto maior for a dose acumulada de radiação ionizante, maior será o deslocamento de Vt e consequentemente a alteração da resposta do circuito em que se encontra o dispositivo. III. CARACTERIZAÇÃO DO CIRCUITO COMPLETO A célula unitária analisada é composta pelo circuito SFDI, um módulo complementar (para melhorar o desempenho global do circuito), que serve de módulo de hibridização entre o fotodetector e o SFDI, e um módulo polarizador, economizando a área do circuito. O circuito completo para a análise é descrito na fig. 2. Os transistores M1a e M1b (NMOS) fazem parte do módulo polarizador e funcionam como um divisor de tensão. O transistor M2 (PMOS) serve como um fixador de tensão no nó de entrada do circuito. O transistor M3 (NMOS) é dimensionado de forma a proporcionar a subtração de uma faixa de correntes típicas das amplitudes de corrente de escuro. O espelho de corrente M4 e M6 (PMOS) serve para aumentar a faixa de atuação do ROIC amostrando-se somente parte do sinal de entrada e, neste caso, multiplicando-se por dois a faixa de detecção. O transistor M5 (NMOS) atua como amplificador e em conjunto com M2 e M3 gera uma realimentação negativa para o circuito. Já os transistores que compõem o circuito SFDI, M7 (PMOS) atua como transistor de entrada e tem a função de controlar o chaveamento de amostragem e integração do sinal no dispositivo. O transistor M8 (NMOS) é responsável pelo descarregamento do capacitor quando um sinal de reset é enviado para o circuito. O transistor M10 (PMOS) implementa um source-follower, que é responsável por servir de buffer para o sinal, transformando-o de carga para tensão e possibilitando a sua amostragem pelo multiplexador. O transistor M9 (PMOS) atua no circuito como um transistor dummy, tendo como única função a de minimizar os efeitos de injeção de cargas decorrentes do chaveamento de M7. Por último, o transistor M11 é responsável por drenar a fotocorrente para o terra quando M7 estiver aberto, impedindo que a tensão suba no nó de entrada VPAD [3]. Os sinais de entrada do circuito são descritos na tabela I, onde será mantido os valores para a análise do sinal de saída para diferentes testes sob influência da radiação ionizante. A resposta para o circuito apresentado é ilustrada na fig. 3, onde em circunstancias normais de operação, se apresenta uma boa linearidade em uma faixa dinâmica de 0.2nA a 10.2nA de corrente de entrada no fotodetector. IV. VERIFICAÇÃO COMPORTAMENTAL DO CIRCUITO ATRAVÉS DA VARIAÇÃO DE Vt Diferentes pontos do circuito foram analisados isoladamente para avaliar o efeito da alteração na tensão de substrato do transistor. Em condições normais de operação com a fonte de corrente em 7nA, o sinal de entrada é estabilizado em 1,57V que seria a tensão de polarização dos fotodetectores, e para o sinal de saída a tensão é linear durante todo o período de integração e se estabiliza em torno de 2V para então ser amostrado, repetindo o mesmo ciclo a cada 260u segundos. Para realização dos testes para identificar os transistores que mais afetam a operação do circuito, foi empregado uma tensão positiva e significativamente maior em cada substrato, reduzindo a tensão de limiar de cada transistor. Assim, no caso de transistores NMOS facilitando e transistores PMOS dificultando a condução, conforme mostrado na fig.1. Com esta técnica empregada em todos os pontos do circuito, pode-se perceber que alguns transistores apresentaram maior sensibilidade a variação da tensão de limiar, atingindo diretamente os sinais de entrada e saída do circuito pré-amplificador. Foram observados três pontos afetados devido aos transistores M3 e M8 (NMOS) e pelo transistor M7 (PMOS). Os transistores que compõem o espelho de corrente M4 e M6 quando analisados separadamente, apresentaram uma alta taxa de sensibilidade, porém, como estes transistores estão bem próximos e sofrem um acumulo de radiação ionizante praticamente idêntico, se tornou mais viável analisá-los em conjunto, tornando-os menos sensíveis ao acumulo de cargas. O transistor M3, destacado na fig. 4, é parte do módulo complementar do circuito, sendo este responsável por drenar as correntes parasitas e, em conjunto com M2 e M5 gerar uma realimentação negativa no circuito. A variação na tensão de saída é perceptível após a redução da tensão de Vt em torno de 32%, reduzindo de 721mV em condições normais para 495mV. O sinal de saída sofre uma queda drástica conforme ilustra a fig. 5. O transistor M8, que tem a função de descarregar o capacitor através de um sinal de reset empregado em sua porta (Gate) destacado na fig. 6, também afeta a operação. A variação na tensão de saída é perceptível após a redução da tensão de Vt em torno de 41%, reduzindo de 874mV em condições normais para 514mV. Nota-se na fig. 7 que o sinal de saída do circuito começa a perder a linearidade no período de integração e se torna instável no período de amostragem, reduzindo a tensão neste período. Por fim, mais um nó sensível do circuito é a entrada do SFDI, onde se encontra o transistor M7. Foi variado a tensão de limiar deste transistor destacado na fig. 8. O transistor M7 é o único transistor PMOS que afeta a operação do circuito. Sua tensão de substrato está ligada ao VDD do circuito em 3.3V, gerando uma tensão Vt de -1.5V. Ao se aumentar esta tensão de substrato, a tensão Vt tende a ser mais negativo, apresentando uma alteração nos sinais de entrada e saída quando Vt é aproximadamente -1.85V, ou seja, apresenta variação na resposta com Vt 24% mais negativo. A fig.9 ilustra o comportamento destes sinais. Através dos testes realizados no circuito, com a utilização do ambiente de simulações de esquemático do software Cadence Virtuoso, pode-se perceber os três pontos mais sensíveis do circuito com a variação da tensão de limiar. Os métodos para o robustecimento destes pontos foram implementados no próximo tópico. V. PROPOSTA DE ROBUSTECIMENTO Após a análise dos pontos críticos do circuito e encontrando os transistores mais sensíveis a alteração da tensão de limiar, pode-se aplicar técnicas de inversão da tensão de fonte para os transistores NMOS M3 e M8 e inversão na tensão de substrato para o transistor PMOS M7. Para a aplicação da solução, foram alteradas as tensões de substrato (PMOS) e fonte (NMOS) até que a operação correta do circuito não seja afetada. Com isto, para os testes iniciais, foram empregadas fontes de tensões nos ramos ilustrados pela fig. 10. O método para a correção do transistor NMOS M3 foi através do aumento da tensão na fonte do transistor, tornando Vs que antes tinha uma tensão de 0V, passando a ter uma tensão positiva e, assim, aumentando a tensão de limiar do transistor. A fig.11 ilustra o comportamento adotado pela tensão de limiar do transistor M3. Nota-se na fig.11 que ao adicionar uma tensão positiva na fonte do transistor M3, a tensão de limiar tende a se deslocar para a direita do gráfico IdsxVgs, indo no sentido inverso do que o acumulo de cargas produzido pela radiação ionizante provoca em transistores MOS. Deste modo, cria-se uma dificuldade maior da tensão de limiar atingir o ponto crítico que é 495mV. Uma vez que a tensão mais positiva aplicada no substrato que simula o efeito da radiação ionizante passa de ±300𝑚𝑉 para ±550𝑚𝑉 , aumentando assim o robustecimento em 83% do transistor M3. O mesmo método foi utilizado para o transistor NMOS M8 do circuito que, por sua vez, teve o mesmo comportamento do transistor M3. A fig. 12 ilustra o comportamento de sua tensão de limiar. No transistor M8, a tensão de limiar é alterada para que o ponto crítico de 514mV seja mais difícil de ser atingido. Deste modo a tensão aplicada no substrato passa de ±550𝑚𝑉 para ±900𝑚𝑉, aumentando assim o robustecimento em 63% do transistor M8. Para a correção do transistor PMOS M7, o método adotado deve ser diferente, pois não é possível alterar a tensão na fonte do transistor. Deste modo, o método foi a redução da tensão de substrato no transistor, fazendo com que a tensão de limiar seja mais positiva. A fig.13 ilustra o comportamento do transistor M7 que passou a ter o substrato alimentado por uma tensão diferente (Vt1) da tensão de VDD (Vt0). Observa-se que ao reduzir a tensão de substrato para 2V (tensão máxima sem alterar o funcionamento do circuito) a tensão de limiar vai de -1.5V para -1.03V, tornando o transistor M7 mais resistente para atingir a tensão crítica de -1.85V com a simulação da tensão de substrato em 4.5V. Desta forma o robustecimento do transistor a radiação ionizante fica em torno de 40%. As alterações necessárias para cada um dos três transistores são descritas com detalhes na tabela II. Com as análises e os resultados com a utilização de fontes de tensão para a simulação do circuito operando em níveis aleatórios de dose total acumulada (TID), pôde ser substituído estas tensões destacadas na fig.10 por divisores de tensão utilizando resistores em série, que não sofrem com o TID como transistores MOS. Deste modo, para os transistores M3 e M8, os divisores de tensão atuam abaixo de 200mV, podendo ser ligados na tensão de polarização (Vpol) do circuito. E no caso do transistor M7, o divisor de tensão foi ligado ao VDD, fornecendo os 2V necessários para o substrato do transistor. Através das modificações no circuito substituindo as fontes por divisores de tensões e simulando novamente o circuito, obteve-se o gráfico de Monte Carlo com 100 pontos, ilustrado na fig.14. Observa-se que o circuito manteve sua linearidade e bom desempenho assim como o circuito original. VI. CONCLUSÃO Com a necessidade do desenvolvimento de circuitos condicionadores de sinais (ROIC) nacionais e que seja robustecido a radiação ionizante para atividades espaciais, proporcionou o desenvolvimento deste trabalho, que faz uma contribuição importante para a área de circuitos analógicos de pré-amplificadores. O circuito além de possuir várias vantagens em termos de linearidade, consumo e área ocupada, demonstrou ser resistente a alterações na tensão de limiar na maior parte dos transistores, sendo que apenas três destes tiveram uma sensibilidade maior com esta variação. Por não ser possível irradiar o circuito na prática ao longo do projeto, para obtenção de resultados mais precisos e com a taxa de dose (TID) bem determinada, foi sugerido alterações na tensão de substrato dos transistores para simular o que acontece na prática com a radiação ionizante em transistores MOS. Com isso, não é possível determinar a taxa de dose suportável pelo circuito, sendo o foco do trabalho voltado ao robustecimento do circuito em determinados pontos críticos. A utilização de técnicas mais simples como de inversão de fonte e substrato para aumentar a tensão de limiar a níveis aceitáveis, se demonstrou eficaz a nível de projeto de circuito. Os transistores continuaram operando em condições normais, porém, com uma resistência maior à alteração da tensão de limiar."
}