{
    "id": 69,
    "titulo": "estudo de absorvedores de micro-ondas com dupla camada aplicados na banda x",
    "autor": "bruno donati, nicholas eras, erick melo, cecília corsato, gustavo souza, luiz mario junior, newton adriano dos santos gomes e valdirene aparecida silva",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2019/st/ST_10_2.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "O estudo de Materiais Absorvedores de Radiação Eletromagnética (MARE) continua sendo uma área de pesquisa relevante em vários países. Esse trabalho contribui no estudo de absorvedores de dupla camada, composto de um material magnético, ferrocarbonila (FC), e outro dielétrico, nanotubos de carbono (NTC), aditados em resina epóxi e avaliados ele- tromagneticamente na Banda-X (8,2 GHz à 124 GHz). O compósito de FC foi preparado nas concentrações de 15%, 20% e 25%, sendo realizado medidas de suas características de reflexão (parâmetro S,;) e transmissão (parâmetro S;,) bem como perda por refletividade (RL). Uma camada de compósito NTC foi adicionada à uma de FC sendo caracterizado com os mesmos parâmetros medidos. Os resultados obtidos mostram que os MARE com camada dupla apresentam comportamento banda larga e sua eficiência pode ser melhorada com ajustes de concentração e espessura da camada.",
    "texto": "I. INTRODUÇÃO A tecnologia furtiva (stealth) pode ser categorizada em dois métodos: o primeiro é o formato da estrutura da aeronave, e o segundo é a partir de materiais absorvedores de radiação eletromagnética (MARE). Estes são amplamente estudados pela comunidade científica, sua história inicia no período entre guerras com o uso em tanques de guerra por militares russos. Mas foram popularizados com os caças Lockheed F-117 na guerra do Golfo, em 1990 [1]. Devido ao desenvolvimento da tecnologia de radares, dispositivos eletrônicos e comunicação sem fio, os MARE tornaram-se de grande importância, pois a interferência das ondas eletromagnéticas não só comprometem a saúde humana, mas também pode interferir nos dispositivos eletromagnéticos de equipamentos civis, bem como dos sistemas militares [2]. Os MARE são classificados em dois tipos: os dielétricos e os magnéticos. As ferritas e a ferrocarbonila (FC) são exemplos de MARE magnéticos, e os polímeros condutores e materiais carbonosos, como grafeno e nanotubos de carbono (NTC), são exemplos de materiais dielétricos [1]-[2]. O NTC possui um excelente desempenho como absorvedores de radiação eletromagnética em bandas de alta frequência, podendo ter eficiência em frequências mais baixas de acordo com a sua espessura [3]-[4]. Já a FC é um ótimo absorvedor de radiação na banda X [1]. Ao avaliar as características eletromagnéticas da FC e do NTC distintamente, é possível obter uma maior absorção ao juntá-los em um processo de multicamadas. A absorção da onda eletromagnética por materiais magnéticos ocorre por relaxamento induzido pelo movimento da parede dos domínios magnéticos ou por um mecanismo de ressonância de rotação natural do spin. Quanto aos materiais dielétricos, quando a onda eletromagnética se propaga através do material, movimentos translacionais das cargas livres dos elétrons ou íons são induzidas pelo campo interno gerado, promovendo orientação dos dipolos. Em ambos os casos, a energia da onda é dissipada na forma de calor [4]. No intuito de obter um melhor desempenho, o material absorvedor depende da frequência, da onda incidente e da espessura do material processado e, para que seja considerado ideal, deve satisfazer dois pré-requisitos: (i) a impedância (Zin) correspondente entre o espaço livre e a superfície do material para evitar a reflexão da onda; (ii) para os materiais absorvedores apresentarem absorção da onda eletromagnética incidente, é necessário apresentarem mecanismos de perdas dielétricas e/ou magnéticas dentro dos absorvedores [4]-[5]. Estudos com MARE de duas camadas ou mais são realizados para se obter um absorvedor que atenue a onda eletromagnética numa ampla faixa de frequência (banda larga) [5]. Uma estrutura dupla ou multicamadas apresenta melhor eficiência na atenuação das micro-ondas do que uma camada simples, reduzindo a perda da reflexão e resultando em uma absorção em banda larga. Geralmente, obedece a um design com uma camada de correspondência, que permite a entrada da onda eletromagnética, e uma camada absorvedora, que permite o espalhamento da onda [5]-[6]. II. METODOLOGIA EXPERIMENTAL A. Materiais Neste estudo, foram utilizados ferrocarbonila comercial da empresa Basf Ltda, nanotubos de carbono de paredes múltiplas NANOCYL® NC7000TM da empresa Nanocyl S.A. e a matriz polimérica utilizada foi uma resina epóxi Hexion tipo EpikoteTM MGS® L135. B. Preparação dos MARE A adição dos absorvedores na matriz polimérica foi realizada por dispersão (m/m). Primeiramente, foi construído o MARE com FC em três concentrações: 15%, 20% e 25%, com espessura de 4 mm. Em seguida, o MARE preparado com NTC foi feito com 1% e adicionado sobre a camada do absorvedor de FC com 1 mm de espessura, resultando em um absorvedor com espessura total de 5 mm, conforme mostrado na Fig. 1. C. Medidas Eletromagnéticas As medidas dos parâmetros S e refletividade com placa RL foram realizadas na faixa de frequência de 8,2 GHz a 12,4 GHz, em um guia de ondas retangular (kit de calibração WR-90 P11644A - Agilent) acoplado a um analisador de rede vetorial PNA-L, 20 GHz, modelo N5230C. Os parâmetros de espalhamento S (S11, S21, S12 e S22) permitem estudar as interações das ondas eletromagnéticas com a amostra. A capacidade de atenuação da onda eletromagnética por um material absorvedor pode ser expressa em termos da proporção de incidência e saída da energia da onda eletromagnética. A atenuação depende dos mecanismos de reflexão na superfície do material (S11, S22), absorção da onda que passa através do material (S21, S12) e das múltiplas reflexões da onda nas várias interfaces do material absorvedor [4]. As medidas de refletividade com placa, ou perda por reflexão, foram obtidas utilizando uma placa metálica de alumínio, totalmente refletora, como anteparo, conforme Fig. 2. A capacidade de absorção da onda eletromagnética é indicada pela perda de reflexão (RL) (equação 1) [1]. Considerando que Zin corresponde à impedância de entrada na interface da primeira camada em estudo e o ar, uma condição para minimizar a reflexão da onda eletromagnética incidente é considerar que Zin seja igual a 1. Nessa condição, o material está eletricamente casado com o meio ar, tendo uma espessura de λ/4 da onda incidente [7]. III. RESULTADOS E DISCUSSÕES A. Caracterização Eletromagnética Parâmetros S: A reflexão está relacionada ao desajuste de impedância entre o ar e o material absorvedor quando a frequência da onda incidente varia no tempo. A absorção pode ser considerada como a energia dissipada na interação entre micro-ondas eletromagnéticas e o absorvedor. As múltiplas reflexões são consideradas como o efeito de espalhamento devido à falta de homogeneidade nos materiais. Geralmente, o aumento da eficiência de blindagem, em decibéis, representa o aumento do consumo de energia no absorvedor. Por outro lado, o coeficiente de absorção resulta do efeito dielétrico e das propriedades magnéticas dos materiais [5]. Quando a energia da onda eletromagnética incide sobre um material, a radiação na faixa de micro-ondas pode ser parcial ou totalmente refletida, absorvida ou transmitida. Na caracterização eletromagnética de materiais, os parâmetros S representam a relação entre a energia da onda eletromagnética refletida e transmitida pelo material. Esses parâmetros fornecem informações sobre as propriedades de espalhamento da onda no material [8]. Para que uma onda eletromagnética circule pela superfície do material absorvedor e se propague em seu interior, é necessário haver casamento de impedâncias entre o espaço livre e a primeira superfície do material, onde a onda incide. A impedância representa a resistência encontrada pela onda ao penetrar no material. Portanto, o valor da impedância da superfície do material absorvedor deve ser igual à impedância do espaço livre (Z0 = 377 Ω) [9]. Quando a energia da onda penetra no material, ocorre o fenômeno de interação onda-matéria, ao nível das estruturas molecular e eletrônica do material, resultando na transformação da energia da onda eletromagnética em calor [10]. Na prática, os parâmetros de espalhamento mais citados são os relativos a S11 e S21. O parâmetro S11 representa a quantidade de energia refletida pelo material. Quanto mais próximo o valor medido estiver da referência (placa metálica), ou seja, 0 dB, maior é o seu caráter refletor. Quanto maior a diferença do valor medido em relação à referência, menor é a energia que retorna à origem (fonte da onda incidente). O parâmetro S21 representa a energia transmitida pelo material. Quanto mais próximo da referência, no caso o ar (material 100% transmissor), estiver o valor medido de S21, maior é a energia transmitida, ou seja, a energia que penetrou no material, irradiada pela porta 1, que se propagou pelo material e foi detectada na porta 2 [9]. Os gráficos da Figura 3, 4 e 5 apresentam as curvas das medidas dos parâmetros S. Foram realizadas medidas do absorvedor com a camada simples de FC (com 15%, 20% e 25% m/m de FC) e com a dupla camada FC/NTC (com 1% NTC m/m), sendo seus resultados comparados. Na Figura 3, as curvas de reflexão e transmissão da onda (S11 e S21) mostram que a adição de uma camada de um absorvedor dielétrico, neste caso o NTC, resultou em um aumento no parâmetro de transmissão, que variou de -5 dB a -8 dB, mantendo-se com o aumento da concentração de FC no MARE, Figura 4 e Figura 5. O parâmetro de reflexão (S11) mostra que o MARE com dupla camada FC/NTC apresentou um aumento, em torno de -22 dB, sendo a curva deslocada para dentro da faixa de frequência estudada, como pode ser observado nas Figuras 4 e 5. A curva mostra um comportamento ressonante do compósito em camada dupla. Esse comportamento pode estar relacionado à espessura da camada de NTC no compósito. Nanotubos de carbono apresentam comportamento absorvedor mais eficiente em faixas de frequências altas, sendo necessário aumentar a espessura para obter maior eficiência na faixa de frequência da banda X [11]-[12]. As medidas de refletividade com placa foram realizadas para todas as amostras de MARE, com concentração de 15%, 20% e 25% de FC de camada única e com dupla camada com 1% de NTC, Figura 6, 7 e 8. As curvas dos MARE com camada dupla apresentam um comportamento de banda larga, com uma atenuação de -4 dB, enquanto que o MARE de camada única de FC apresenta comportamento ressonante, com um pico de ressonância em torno de -8 dB no compósito de dupla camada com 25% de FC. Mesmo com o aumento de FC no MARE, os resultados no absorvedor de dupla camada não foram maiores que o absorvedor de camada única, o que não significa que não tem comportamento de material absorvedor. Todos os compósitos apresentam comportamento absorvedor. Relacionando os resultados com os parâmetros de transmissão (S21), a adição da camada de NTC no MARE elevou a absorção, mostrando que um ajuste de concentração e uma maior dimensão da camada do dielétrico podem melhorar o comportamento do absorvedor na atenuação da onda eletromagnética [11]-[12]. Fazendo-se a correlação entre os parâmetros S (S11 e S21) e as curvas de refletividade, Figura 6, 7 e 8, nota-se que o processamento de MARE é muito complexo, pois deve-se levar em consideração não somente o aditivo utilizado, mas também a concentração e espessura do absorvedor, bem como a faixa de frequência estudada, pois o comprimento da onda incidente está diretamente relacionado ao tipo do aditivo [1]. IV. CONCLUSÕES Os resultados apresentados mostram que os compósitos estudados apresentam bom comportamento como MARE. A adição da segunda camada dielétrica na camada de ferro-carbonila contribuiu para que o absorvedor apresentasse um comportamento de banda larga. Os valores do parâmetro de transmissão, S21, apresentaram uma melhora, o que indica que a onda eletromagnética teve uma melhor distribuição no absorvedor. O desempenho de um MARE é dependente da concentração e da espessura do absorvedor, neste caso, para melhorar a eficiência de absorção da onda eletromagnética pelos absorvedores, é necessário um ajuste da razão de massa FC/NTC e espessura da camada das amostras, pois os resultados apresentados indicam perspectivas promissoras para um excelente desempenho como absorvedor de radiação eletromagnética na faixa de frequência estudada. "
}