	{
		"id": 7,
		"titulo": "exército recebe nova geração de radares saber m60 da embraer",
		"autor": "Noticiário do Exército",
		"url": "https://www.eb.mil.br/web/noticias/noticiario-do-exercito/-/asset_publisher/znUQcGfQ6N3x/content/id/16221427 ",
		"tipo_documento": "Notícia",
		"rotulo": 3,
		"resumo": 0,
		"texto": "Brasília (DF) – O Exército Brasileiro recebeu da Embraer, neste dia 28 de setembro, as duas primeiras unidades dos radares SABER M60 em sua versão 2.0, que serão utilizados nas unidades de Artilharias Antiaérea. Está prevista ainda a entrega de quatro radares adicionais do mesmo modelo, conforme contrato com a Embraer assinado em abril deste ano. A obtenção dos radares SABER M60 está prevista no Planejamento Estratégico do Exército Brasileiro 2020-2023 e amplia a capacidade operacional da Força Terrestre. Fruto da parceria entre a Embraer e o Exército Brasileiro para desenvolver um radar de artilharia antiaérea de baixa altura, o SABER M60, que já conta com exportações, tem desenvolvimento 100% nacional e já se encontra em operação no Exército. Em 2019, foi concluída a fase de atualização tecnológica do radar, resultando na versão 2.0. O SABER M60 é um radar de busca que integra um sistema de defesa antiaérea de baixa altura, visando à proteção de pontos e áreas sensíveis, como instalações governamentais e infraestruturas estratégicas. Com tecnologia 3D, possui alcance de 60 quilômetros e até 16.400 pés de altura, permitindo rastrear até 60 alvos simultaneamente, incluindo a detecção e classificação automática de alvos. Trata-se de um radar tático de grande flexibilidade operacional, fácil montagem e transporte, podendo ser desdobrado em até 15 minutos, possuindo tecnologia LPI (Low Probability Interception), o que permite alta capacidade para atuar na identificação de alvos sem ser facilmente identificado. O SABER M60 pode ser integrado aos sistemas de armas baseados em mísseis ou canhões antiaéreos, além de contar com provisão para integração com outros sistemas de defesa aérea, tal como o Sistema de Defesa Aeroespacial Brasileiro (SISDABRA)."
	}
