	{
		"id": 72,
		"titulo": "desenvolvimento de biossensor para detecção de bioagentes de interesse em dqbrn",
		"autor": "nadja fernanda gonzaga serrano, ivan perazzoli, eduardo migon, julio zukerman-schpector, ignez caracelli, bruno thomazini, fernando manoel araújo-moreira",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2018/st/ST_08_2.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 2,
		"resumo": "A rápida e segura identificação e classificação de microrganismos (bactérias, fungos, etc) não é uma tarefa simples. O uso de métodos ópticos, a exemplo da técnica de fluorescência, tem como vantagem ser de custo financeiro bem acessível quando comparado com outras técnicas – como PCR (Polimerase Chain Reaction) -, obtenção dos resultados em poucos segundos, nenhuma ou pequena preparação da amostra, e não há geração de resíduos químicos. Neste projeto aplicamos o fenômeno da fluorescência na construção de um dispositivo que permita avaliar a presença de microrganismos de interesse em diversas áreas, entre elas a de defesa química, biológica, radiológica e nuclear (DQBRN). Especificamente buscou-se a detecção de patógenos que podem ser usados como bioarmas. Foram detectados com sucesso diversos microrganismos de letalidade baixa (classe C/CDC) e média (classe B/CDC). Ainda, no procedimento do uso deste dispositivo é incluída a ação de um peptídeo antimicrobiano (PAM) com o intuito de usá-lo como bioreceptor.",
		"texto": " I. INTRODUÇÃO Guias de onda retangulares têm sido amplamente usados como uma estrutura básica de guiagem tanto em tecnologias de microondas, radares como em antenas. Em várias aplicações, o tamanho físico de um guia de onda é um importante parâmetro a ser considerado. A miniaturização de guias de onda usando metamaterial de permeabilidade negativa uniaxial foi primeiramente demonstrada por Marques et al. [1]. Eles propuseram que carregando-se um guia de onda com anéis ressonantes de permeabilidade negativa, denominados SRR (split-ring resonator) e desenvolvidos por Pendry et al. [2], era possível obter transmissão de sub-comprimento de onda (abaixo da frequência de corte do guia de onda). Ao seu trabalho seguiram-se diversos outros, como o de Hrabar et al. [3], que mostraram a propagação de ondas regressivas (backward) abaixo da frequência de corte do guia de onda. Entretanto, em todos esses trabalhos os níveis de transmissão apresentavam perdas por inserção de no mínimo 15 dB e larguras de banda muito estreitas. Já Carbonell et al. [4] introduziram um novo método de excitação das ondas em guias de onda evanescentes que reduziram significativamete as perdas por reflexão. Tapers (transições) também têm sido amplamente usados para mitigar efeitos de reflexão [5]. Neste artigo foram analisadas e comparadas as diversas técnicas para excitar e transmitir uma onda eletromagnética num guia de onda retangular operando na banda–X em um intervalo de frequências abaixo de sua frequência de corte (fc ~ 6,56 GHz). Também foram introduzidas metodologias para aprimoramento destas técnicas visando maximizar os níveis de transmissão e largura de banda de sub-comprimento de onda. II. MÉTODOS DE EXCITAÇÃO E DISCUSSÃO O guia de onda é carregado com uma placa metamaterial constituída de cinco aneis ressonantes, que é mostrada na Fig.1 Na Fig. 2 é exibido o guia de onda de banda–X carregado com a placa metamaterial. A placa é posicionada simetricamente no guia de onda relativamente à sua dimensão transversa. Esta localização permite a excitação máxima dos SRRs, desde que o campo magnético (modo TE10) atinge valores máximos no centro do guia de onda. O guia carregado é então colocado entre duas seções de guia de onda retangular que operam na banda–S (fc ~ 2,1 GHz). Nas simulações, portas de guia de onda são colocadas nas extremidades exteriores dos guias de banda-S. Uma porta (porta esquerda) está associada à onda eletromagnética a ser transmitida (modo TE10) e recebida na segunda porta na extremidade direita do guia. Isto equivale experimentalmente a um guia de onda WR–90 conectado às portas de entrada e saída com um analisador de rede por duas sondas coaxiais horizontais (no eixo do guia evanescente). A estrutura completa exibida na Fig.2 é simulada com o módulo Time Domain do CST Microwave Studio e os resultados dos parâmetros de espalhamento S são dados na Fig. 3. Uma banda de transmissão surge de 3,41 a 3,52 GHz (110 MHz) abaixo da frequência de corte do modo fundamental do guia de onda vazio (~ 6,56 GHz). A transmissão é caracterizada por apresentar dois picos, um menor, em f ~ 3,42 GHz indica S21 ~ 0,36 e o outro, o de máxima transmissão em f ~ 3,50 GHz indica S21 ~ 0,51. Constatou-se que no ponto de maior transmissão, as correntes nos cinco SRRs giram todas em fase ao passo que no outro pico, as correntes oscilam numa configuração antissimétrica (correntes em dois SRRs circulando em fase e fortemente excitados, separados por um SRR fracamente excitado de outros dois SRRs girando em contra-fase, também fortemente excitados). Parte da potência não transmitida é perdida por reflexão devido ao descasamento de impedâncias entre o guia injetor e o guia evanescente e outra parte é perdida devido ao efeito de dissipação no metal e no dielétrico. Para superar esta dificuldade Marques et al. [1] propuseram introduzir as metades do primeiro e último ressoador da placa metamaterial nos guias de onda de injeção e recepção da onda com o intuito de aumentar o acoplamento magnético. É observado na Fig. 4 que há um aumento considerável no pico de maior transmissão (em f ~ 3,53 GHz, S21 = 0,65), cerca de 30% maior do que no pico de maior transmissão da estrutura da Fig. 2. A largura de banda é praticamente a mesma (~100 MHz), mas existe neste caso uma pequena estrutura de transmissão em frequências mais baixas (f ~ 3,3 – 3,4 GHz) que é devida à interação guia injetor (banda-S) com o arranjo de SRRs da placa metamaterial. Para tentar casar melhor os guias incidente e o evanescente e assim reduzir as perdas por inserção devido às reflexões na junção dos guias de diferentes dimensões, um taper foi usado (Fig. 5). O taper ajuda a concentrar o campo elétrico na entrada do guia evanescente e permite uma mudança mais suave entre as duas seçoes dos guias de onda, reduzindo o descamento da impedância de onda na estrutura. No entanto, os resultados mostrados na Fig. 6 não mostram melhoramentos, apenas o desaparecimento do pico menor na região de transmissão de sub-comprimento de onda como visto na Fig. 4. Em seu trabalho, Burokur et al. [5] conseguiram obter ótimos níveis de transmissão com um taper otimizado, através do ajuste de parâmetros geométricos como a espessura do metal e a espessura do gap dos elementos ressonantes, além do comprimento do taper. Para reduzir as perdas por descasamento produzidas pela forte reflexão causada na interface entre os guias de onda injetor e o guia de onda evanescente, Carbonell et al. [4] propuseram o uso de excitação coaxial direta da estrutura periódica LH como exibido na Fig. 7. No caso, o acoplamento da energia é feito através da sonda coaxial inserida verticalmente no guia de onda evanescente. A sonda tangenciando ao primeiro ressoador, juntamente com o curtocircuito gerado pela sonda coaxial contatando a parede superior do guia de onda evanescente, produz um campo magnético muito forte, o que por sua vez induz um fluxo magnético muito forte através da área do SRR. Assim, o acoplamento total sonda–SRRs é aumentado e a reflexão é reduzida. Na Fig. 8 observa-se um melhoramento acentuado na transmissão. Novamente, como no caso dos guias de onda excitadores (Fig. 2), obtém-se uma estrutura de transmissão de dois picos, mas no primeiro pico (f ~ 3,47 GHz) a transmissão atinge S21 ~ 0,71 (cerca de 100% maior que o pico correspondente ao caso do guia excitador) e no ponto de mais alta transmissão (f ~ 3,60 GHz) o coeficinte de transmissão é S21 ~ 0,76 versus S21 ~ 0,51 no caso da estrutura da Fig. 2. A largura da banda é mais do que o dobro da obtida no caso do guia excitador (Δf ~ 270 MHZ versus Δf ~ 110 MHz). Um aspecto muito importante, que, ao que se saiba não descrito até hoje na literatura, é o posicionamento das fendas (slits) dos SRRs no que concerne ao acoplamento com a sonda excitadora. Tem-se exibido na Fig. 8 uma transmissão de quase 80% da energia incidente. Neste caso, a fenda do anel externo do SRR está próxima à parede superior do guia de onda. Surpreendentemente, observou-se que, fazendo-se uma rotação de 180 graus dos anéis do SRR, tal que a fenda do anel externo fique próxima à sonda excitadora, a transmissão sofre uma queda muito acentuada, atingindo um máximo de S21 ~ 0.32, conforme pode ser verificado na Fig. 9. A largura da banda de transmissão é dramaticamente reduzida para cerca de 50 MHz. Examinando-se o campo elétrico no plano dos anéis para o caso da fenda do anel próxima à parede superior do guia de onda (Fig.10), nota-se que o campo é bastante intenso especialmente nas vizinhanças da fenda ao longo do arranjo de SRRs e isso é transmitido à sonda receptora cuja ponta está curto-circuitada à parede superior. O resultado desse processo pode ser mensurado notando que a intensidade dos campos na saída (sonda coaxial receptora) é quase igual à dos campos na entrada da sonda coaxial injetora. Na situação em que a fenda do anel externo está próxima à sonda coaxial injetora (Fig. 11), o campo elétrico é mais intenso perto da parede inferior do guia. Este campo excita a base da sonda receptora apenas (antena ineficiente), e por isso a transmissão é muito fraca. Pode-se também examinar essa interação sonda coaxial – SRR do ponto de vista do fluxo de potência. Na Fig.12 o fluxo de potência na estrutura com SRRs com anel externo próximo à parede inferior do guia de banda-X mostra existir um acoplamento muito forte entre a sonda injetora e o primeiro ressoador. Veja que antes de atingir as proximidades da fenda do anel externo do primeiro SRR, o fluxo de potência era forte (setas bem vermelhas), aí a potência se acoplou aos SRRs e ficou aprisionada neles. Claramente, após esse acoplamento, a potência fluindo próxima à parede inferior do guia de onda fica bem menor (setas violetas). Para o caso do SRR com a fenda do anel externo próxima à parede superior do guia, o fluxo de potência é intenso perto da parede inferior (Fig. 13). A estrutura de dois picos nos perfis de transmissão não é algo desejável, pois é ineficiente para propósitos de se produzir uma banda larga. Introduz-se então uma mudança na estrutura do Carbonell et al. Ao invés de curto-circuitar a sonda coaxial com a parede superior do guia de onda, permite-se uma pequena separação (gap), objetivando aumentar a capacitância do sistema. Na Fig.14 são exibidos os resultados para os coeficientes de transmissão tomando um gap d=0,5 mm. A transmissão tem um incremento de cerca de 10% relativamente ao caso curto-circuitado, atingindo um máximo em f ~ 3,55 GHz (S21 ~0,83), a estrutura de dois picos tem desaparecido e obtém-se uma largura de banda de ~560 MHz, mais do que o dobro da obtida para o caso curtocircuitado. Uma investigação da distribuição de correntes nos anéis dos SRRs no intervalo de frequências acerca do ponto de maior transmissão (f ~ 3,45 a 3,65 GHz), onde o perfil de transmissão é suavizado relativamente ao caso curtocircuitado (compare Fig. 8 e Fig.14), indica que todas as correntes nos cinco anéis giram em fase, ao passo que no caso da sonda-parede curto-circuitadas somente no ponto de mais alta transmissão as correntes giram todas em fase. Na Fig. 15 mostra-se o campo elétrico no plano transverso (XZ) à propagação, numa posição próxima (y = 45 mm) à sonda detectora nos casos do guia de onda vazio (f ~ 9,0 GHz), na estrutura sonda – guia curto-circuitada na frequência de máxima transmissão (f ~ 3,6 GHz) e na estrutura sonda-guia com gap na máxima transmissão (f ~ 3,54 GHz). Nota-se um dramático aumento da intensidade de campo elétrico causado pela presença dos elementos ressonantes SRRs (até 20 vezes maior) do que no caso de um guia vazio. No caso da estrutura sonda-parede curtocircuitadas, o campo é mais intenso na região central dos anéis e, se um gap está presente, o campo, além da região central, também é muito forte na extremidade superior dos anéis e por isso temos o grande aumento na transmissão e na largura de banda exibidos na Fig. 14. Tem-se demonstrado que os níveis de transmissão e a largura de banda são fortemente incrementados com o gap sonda-parede. Na Fig. 16 constata-se que altos níveis de transmissão e de largura de banda são obtidos para gaps tais que 0 < d ≤ 0,5 mm. Para d = 0,3 mm, obtém-se a maior transmissão, S21 ~ 0,86 em f ~ 3,58 GHz. Já com d = 0,4 mm obtém-se S21 ~ 0,855 (f ~ 3,57 GHz). Então os três casos de menores gaps (d = 0,3 mm, d = 0,4 mm e d = 0,5 mm) dão resultados praticamente idênticos. Um aumento além desse valor do gap leva à redução acentuada dos níveis de transmissão. Além da influência do gap sonda-parede, o acoplamento sonda–SRR é claramente dependente da distância das sondas coaxiais ao primeiro e ao último ressoador da placa metamaterial, como pode ser observado na Fig.17. Para os três valores da distância do primeiro e último SRR à sonda coaxial (L = 0,0, L = 1,0 e L = 1,5 mm) as curvas mostram que o melhor acoplamento é atingido quando a sonda está encostada no ressoador. Com o afastamento da sonda do SRR o campo magnético que atravessa o SRR é enfraquecido e, portanto, a transmissão é reduzida. Para L=1,5 mm a transmissão tem sido reduzida a S21 ~ 0,6. É importante esclarecer que o acoplamento sonda–sonda, que poderia afetar a transmissão através do guia de onda evanescente, apenas é significativo para uma distância sonda excitadora–sonda detectora menor que 10 mm, correspondendo a apenas um SRR. Para o caso da placa de cinco SRRs, que corresponde a 50 mm de espaço entre as sondas, o sinal transmitido está abaixo de -50 dB, como pode-se notar na Fig. 18. Objetivando demonstrar que a transmissão de subcomprimento de onda obtida no guia de onda carregado com a placa metamaterial é de natureza regressiva (onda backward) tem-se determinado o diagrama de dispersão do guia de onda carregado [6]. Até f ~ 8,0 GHz notam-se três modos que são admitidos pela estrutura do guia de onda carregado como exibido na Fig.19. O primeiro modo, dentro do intervalo de frequências 3,313,56 GHz é caracterizado pela inclinação negativa de sua curva de dispersão,indicando o caráter left-handed (onda regressiva) da transmissão. Já o segundo modo propaga-se no intervalo entre 3,97,25 GHz e a inclinação positiva da curva dispersiva indica que ele é do tipo progressivo. III. CONCLUSÃO Uma nova metodologia de excitação de ondas eletromagnéticas num guia de ondas carregado com uma placa metamaterial proporcionou uma grande transmissão de sub-comprimento de onda( mais que 80% da potência incidente) e um aumento considerável (mais que 100%) da largura da banda de transmissão quando comparada com o método de injeção coaxial direta, até então o mais eficiente procedimento anteriormente desenvolvido. Foi também demonstrado que o posicionamento dos slits do anel externo do SRR desempenha um papel fundamental na transmissão no caso de injeção coaxial direta. "
	}
