{
    "id": 73,
    "titulo": "a abordagem de rádio definido por software aplicada a receptores de vor",
    "autor": "rafael gonçalves licursi de mello",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2018/st/ST_06_3.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 2,
    "resumo": "Um receptor de VOR (Very High Frequency Omnidirectional Range) baseado em Rádio Definido por Software (RDS) com processamento em laptop é apresentado. Experimentos apontaram que o sistema é capaz de indicar a radial da estação de VOR de São José dos Campos com uma taxa de erro médio menor que 1% e desvio padrão menor que 2,14% com relação à radial calculada cartograficamente, em todos os casos medidos. Os resultados sugerem que receptores de VOR baseados em RDS apresentando baixo volume e peso podem ser desenvolvidos com processamento em microcontroladores ou FPGAs (Field Programmable Gate Arrays) para comporem sistemas de navegação de drones que necessitem operar nos entornos de aeródromos. Este estudo é recomendado para as áreas de Sistemas de Navegação e Processamento Digital de Sinais.",
    "texto": "I. INTRODUÇÃO O conceito de Rádio Definido por Software (RDS) permite que um circuito flexível de RF (radiofrequência) seja configurado através de algoritmos computacionais [1]. Tal abordagem possibilita que um único equipamento apresente respostas automatizadas, rápidas e versáteis diante do cenário operacional no qual se encontra. Em paralelo, as evoluções tecnológicas do Século XXI inserem o drone como uma realidade do presente e um equipamento indispensável para o futuro. Esses artefatos, hoje, além de invocarem reflexões sobre ética [2], têm causado complicações nos arredores de aeródromos, ao apresentarem conflitos com aeronaves, à medida que são de difícil detecção [3] e que não cumprem perfis de navegação em coordenação com as mesmas. A Fig. 1 ilustra esse cenário. Para evitá-lo, atualmente, legislações restringem as áreas de operações dos drones ao redor dos aeródromos. Em um futuro próximo, entretanto, a demanda por esta tecnologia obrigará a coexistência dos mesmos com aeronaves convencionais, e sistemas de navegação deverão proporcionar a informação imprescindível para a separação segura entre ambos. Este trabalho apresenta proposições iniciais para o desenvolvimento de um receptor de VOR (Very High Frequency Omnidirectional Range) com a abordagem RDS. Nele, são empregados um RDS modelo NooElec RTL-SDR™ [4], e um laptop convencional. O processamento dos sinais foi implementado em Matlab® [5]. Após filtrar digitalmente ambos os sinais variável e de referência da estação de VOR, o algoritmo efetua demodulações não-coerentes, nomeadamente uma detecção de envoltória e uma discriminação complexa com linha de atraso. O objetivo deste empenho é validar conceitos para que, em trabalhos futuros, o processamento possa ser realizado por microcontroladores ou FPGAs (Field Programmable Gate Arrays), de forma que sistemas de navegação de baixo volume e peso para drones possam ser concebidos. Dessa forma, a operação segura nos entornos de aeródromos pode ser conquistada. Foram realizados experimentos com o auxílio da estação de VOR de São José dos Campos. Seus resultados demostraram que o receptor proposto é capaz de indicar a radial do equipamento com relação à estação com uma taxa de erro médio menor que 1% e desvio padrão menor ou igual a 2,14% com relação à radial calculada cartograficamente em todas as localidades nos quais o sinal foi medido. O restante deste artigo é organizado da seguinte maneira: a Seção 2 revisa os princípios básicos de funcionamento de um sistema de VOR; a Seção 3 descreve o receptor proposto; a Seção 4 apresenta os experimentos, além de expor e discutir seus resultados; e a Seção 5 apresenta as considerações finais. II. PRINCÍPIOS BÁSICOS DE FUNCIONAMENTO DO VOR A Fig. 2 ilustra o sinal emitido pela estação de VOR de São José dos Campos, no domínio complexo das frequências, considerando uma sintonia em 115,40 MHz. Na Fig. 2, os picos de energia situados próximos a ±10 kHz consistem em uma subportadora de 9.960 Hz que foi modulada em FM (frequency modulation) por um sinal de referência de 30 Hz. Tal subportadora, após a modulação FM, foi transladada em 115,40 MHz, com supressão da portadora. Esse sinal de referência de 30 Hz é visto por receptores de VOR de forma independente a suas posições geográficas [6]. Em contrapartida, o pico central de energia da Fig. 2 consiste em um outro sinal de 30 Hz que modula em AM (amplitude modulation) uma portadora não-suprimida também de 115,40 MHz. A fase desse segundo sinal de 30 Hz é percebida pelos receptores de VOR como uma função da posição geográfica dos mesmos, e por isso ele é denominado na literatura como sinal variável [6]. Para que um receptor de VOR determine a posição angular em que se situa com relação à estação, basta que os dois sinais de 30 Hz (referência e variável) que respectivamente modulam os picos de energia laterais e central tenham suas fases comparadas [6]. Em adição, um terceiro sinal, de 1.020 Hz modula em AM uma portadora suprimida de 115,40 MHz. Este contém a informação de identificação da estação, em código Morse [6]. III. SISTEMA PROPOSTO O diagrama de blocos referente ao processamento de sinais do receptor proposto, a ser apresentado nesta seção, está ilustrado na Fig. 3. O RTL-SDR é configurado para amostrar o sinal recebido com uma taxa de 240 kS/s. Ele é sintonizado na frequência da estação de VOR menos 9.960 Hz, de forma que a banda lateral inferior (LSB – lower side band), que contém a subportadora modulada em FM pelo sinal de 30 Hz de referência, fique centrada em 0 Hz no domínio complexo das frequências. A portadora modulada em AM pelo sinal de 30 Hz variável, dessa forma, fica centrada em +9.960 Hz nesse mesmo domínio. Essa disposição, diferente daquela apresentada na Fig. 2, possibilita o emprego de dois demoduladores em paralelo: um discriminador complexo com linha de atraso para o sinal de referência e um detector de envoltória para o sinal variável. Antes da demodulação, todavia, os dois sinais devem ser filtrados por filtros do tipo FIR (finite impulse response). Esse tipo de filtro é empregado em virtude de sua resposta de fase precisamente linear, em contraposição aos IIR (infinite impulse response), que promovem distorção de fase [7] e afetam o último estágio do receptor, em que ocorre a comparação de fases entre os sinais de referência e variável. Após a demodulação, os dois sinais são decimados para uma taxa de amostragem de 2,4 kS/s. Nesse procedimento, um novo filtro FIR embutido previne fenômenos de aliasing [8]. Em seguida, os sinais são ajustados por um controle automático de ganho (AGC – automatic gain control), antes que uma comparação de fase indique a radial na qual o receptor se encontra com relação à estação. O áudio identificador da estação, em código Morse, pode ser ouvido decimando-se o sinal oriundo da demodulação AM para 48 kS/s, com reprodução no próprio dispositivo de som do laptop. A Fig. 4 demonstra a composição física do receptor de VOR desenvolvido. IV. EXPERIMENTOS O receptor de VOR proposto foi testado frente a sinais reais de VOR emitidos pela estação SCP – 115,40 MHz, localizada na lateral da pista do aeródromo de São José dos Campos (SBSJ). O equipamento foi posicionado nas localidades ilustradas em amarelo na Fig. 5, e uma centena de medições foi realizada para cada uma delas. Cada uma das radiais ilustradas nessa figura foi medida na carta com precisão de 1°. Os valores indicados computam 22° de declinação magnética. A Tabela 1 sumariza os resultados das 100 medições efetuadas em cada uma dessas localidades ilustradas. Observe que, em todos os casos, houve um erro médio percentual menor que 1%. Este valor é considerado, em detrimento do valor de 0,32 %, que seria encontrado subtraindo-se os valores de radial na carta e média das radiais medidas no VOR, em virtude de a resolução da radial na carta ser de 1%. O maior desvio padrão encontrado é aquele referente ao sinal medido no Estacionamento do Departamento de Eletrônica do Instituto Tecnológico de Aeronáutica (ITA), no valor de 2,14°. As medições efetuadas podem ser visualizadas em tempo real através da função nativa do Matlab denominada compass. A Fig. 6 exemplifica tal visualização com uma medição da radial do portão localizado próximo ao IPEV (Instituto de Pesquisas e Ensaios em Voo). V. CONSIDERAÇÕES FINAIS O conceito de RDS pode ser aplicado para a concepção de equipamentos que apresentem respostas automatizadas, rápidas e versáteis a cenários operacionais diversos. Este artigo apresentou proposições iniciais para o desenvolvimento de um receptor de VOR com esse conceito. Nele, foram empregados um RDS modelo NooElec RTL-SDR e um laptop convencional. O processamento dos sinais foi programado em Matlab. Além de implementar filtros digitais do tipo FIR, o algoritmo efetua uma demodulação AM com um detector de envoltória e uma demodulação FM com um discriminador complexo com linha de atraso, nos sinais variável e de referência, respectivamente, recebidos da estação de VOR. O objetivo deste empenho foi validar conceitos para que, em trabalhos futuros, o processamento possa ser realizado por microcontroladores ou FPGAs, de forma que sistemas de navegação de baixo volume e peso para drones possam ser concebidos para possibilitar a operação dos mesmos nos entornos de aeródromos. Experimentos mostraram que o receptor proposto pôde indicar a radial da estação de VOR de São José dos Campos com uma taxa de erro médio de 1% e desvio padrão menor ou igual a 2,14% com relação à radial calculada cartograficamente em todas as localidades nas quais os sinais foram medidos. Esses resultados indicam que o receptor desenvolvido é capaz de receber os sinais de uma estação de VOR e, adequadamente, indicá-los. Eles sugerem que o sistema apresentado pode ser mapeado para um equipamento que tenha processamento em microcontroladores ou FPGAs, tendo em vista que a presença do laptop ocorreu apenas devido a conveniências de programação. "
}