	{
		"id": 75,
		"titulo": "caracterização e avaliação do desempenho em distância de uma câmera termal por processamento de imagens",
		"autor": "raphael efísio da silva, augusto cezar gomes dos santos, ruy morgado de castro, alvaro josé damião,",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2018/st/ST_07_1.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 1,
		"resumo": "A caracterização de um imageador térmico embarcado em aeronaves é de fundamental relevância para a garantia da qualidade e fidelidade das imagens. O levantamento dos dados técnicos da câmera termal permite a avaliação de seu desempenho como função da distância, de forma a contribuir para o planejamento das operações e promover o sucesso na missão. No presente estudo estimou-se, com auxílio de softwares específicos para o processamento de imagens, um diferencial mínimo de temperatura resolvível (MRTD - Minimum Resolvable Temperature Difference) de um sistema eletro-óptico termal, equipado em helicópteros, denominado FLIR (Forward Looking Infrared). Mediante o MRTD obtido, foi possível propor uma distância máxima de identificação de um alvo de interesse, em função da temperatura e dimensão espacial do mesmo.",
		"texto": " I. INTRODUÇÃO A aquisição de novos vetores aéreos pela Força Aérea Brasileira (FAB) no início dos anos 2000 permitiu um vigoroso incremento em sua capacidade de combate, frente aos desafios inerentes à constante evolução tecnológica no mundo [1]. Dentre os diversos equipamentos que auxiliam a consecução das missões atribuídas à FAB [2], os sistemas eletro-ópticos (EO) termais são fundamentais para atividades militares em ambientes noturnos ou sob condições atmosféricas restritivas para o alcance visual. Dispositivos denominados FLIR (Forward Looking Infrared), são modernos sistemas de câmeras indispensáveis para aplicações operacionais. O referido imageador contribui para a detecção, reconhecimento e identificação de alvos em que fatores como distância e ambiente de fundo prejudicam a percepção ocular [3]. Diante dessa vantagem operacional permitida pela utilização do FLIR, para justificar os altos custos financeiros em investimento para compra e manutenção que tais equipamentos exigem, o correto e aprimorado emprego por parte do operador não é apenas o único fator relevante para o sucesso da missão. É fundamental que, durante todo o ciclo de vida útil do sistema, esses imageadores termais sejam peridicamente caracterizados e avaliados quanto ao seu desempenho [4]. Ao se considerar dispositivos eletro-ópticos termais, os elementos fundamentais de caracterização que expressam a resolução e sensibilidade são: MRTD (Minimum Resolvable Temperature Difference), MTF (Modulation Transfer Function), NETD (Noise Equivalent Temperature Difference) e SiTF (Signal Transfer Function). Por meio desses dados, avalia-se o desempenho do equipamento, sendo possível identificar parâmetros de alcance de identificação de alvos na superfície. No presente estudo teve-se por objetivo apresentar um método de caracterização e avaliação de desempenho em distância de sistemas termais utilizados em aeronaves. Foram identificados e analisados dados técnicos em campo de um equipamento FLIR, por meio de softwares específicos para o processamento de imagens, o que é o estado da arte, neste momento [5]. Na seção II apresenta-se as principais informações referentes aos dados de caracterização da câmera termal bem como o critério de resolução utilizado para o desempenho em distância. Na seção III aborda-se como foram realizadas as medições de um FLIR, aeroembarcado em um helicóptero militar, na Base de Aviação de Exército. Nesta parte do trabalho foi considerado o efeito do AGC na aquisição de imagens. A seção IV discute-se os dados dos parâmetros obtidos, bem como o resultado da distância de identificação para um alvo de dimensões de 2,3 m por 2,3 m. Por fim, na seção V conclui-se a apresentação da pesquisa com os resultados obtidos. II. FUNDAMENTAÇÃO TEÓRICA Ao se considerar os dispositivos eletro-ópticos termais, no que diz respeito à qualidade da imagem, a resolução espacial e a sensibilidade são elementos determinantes para o desempenho do sistema [3]. Enquanto a primeira característica implica no menor detalhe identificável, a segunda representa a menor diferença de sinal detectável pela câmera termal, ambos para uma dada distância . A função de responsividade representa a resposta do sistema detector à variação de um sinal entrada. Ela permite identificar informações de ganho, linearidade e saturação [4]. A Função de Transferência de Sinal, do inglês Signal Transfer Function (SiTF), consiste na parte linear de uma função de responsividade da câmera termal. Essa característica é calculada como a tangente do ângulo entre a parte linear da função de responsividade como função da variação da temperatura [4][6]. Uma das figuras de mérito referente ao ruído, para as câmeras termais é a a diferença de temperatura equivalente ao ruído, do inglês Noise Equivalent Temperature Difference (NETD), que representa a sensibilidade de um sistema imageador. Essa característica é definida como a diferença de temperatura, entre um alvo e o cenário de fundo, necessária para gerar um sinal para uma dada taxa unitária de ruído (relação sinal-ruído superior a 1) [4]. Ao se considerar a utilização de recursos de software para processamento da imagem, o NETD pode ser obtido pelo cálculo do desvio padrão da variação temporal do nível digital (ND) dos pixels, pela análise estatística de vários quadros do imageamento de um alvo estático [7]. Quando a análise para obtenção do NETD é realizada por processamento de imagens, é necessário que sejam avaliadas um mínimo de 100 quadros ou frames para desconsiderar o efeito de ruído temporal (presente em baixas frequências) provocado pela gravação do imageador [4][7]. Tal parâmetro pode ser identificado conforme a equação: onde: σTVH – representa o ruído aleatório tridimensional (eixos verticais e horizontais da matriz de imagem mais a variação temporal – TVH). A função de transferência de modulação, MTF, representa a característica de resolução de imagem, por meio da qual um sistema eletro-óptico consegue perceber pequenos detalhes, com suficiente contraste, em elementos de uma cena de imageamento[8]: onde: NDmáx – nível digital máximo em determinada frequência espacial (fx); e NDmín – nível digital mínimo em determinada frequência espacial (fx). A frequência espacial é uma grandeza física utilizada para caracterizar espacialmente as dimensões do objetivo. Pela conceituação de modulação, fx representa a taxa com que a imagem varia entre os níveis digitais máximos e mínimos [4]. O MRTD é considerado um parâmetro fundamental de caracterização de câmeras termais, pois essa única figura de mérito representa o desempenho em resolução espacial e sensibilidade [4][6]. Ele pode ser obtido pela expressão: onde: K – constante de proporcionalidade (representa características específicas da câmera, como: óptica, resposta espectral e radiométrica, dentre outros). Seu valor mínimo é um (K=1) [4][6]; MTF – Função de Transferência de Modulação do sistema; e NETD – Diferença de Temperatura Equivalente ao Ruído. O limite de resolução espacial de uma câmera é determinado pela frequência de Nyquist (fN). Essa é identificada no dispositivo como a razão do total de pixels da matriz do detector por duas vezes o valor do campo de visão (FOV – Field of View), referente à óptica do equipamento [9]. Como os dados específicos de K – (3) – são de difícil parametrização [8], foi atribuído o valor 1 (um). Desta forma, o MRTD estimado apresentou valores em distância adequados para planejamento de missões em que se utilize imageadores como o FLIR. Como fator de desempenho em distância, considerou-se o Critério de Johnson. Esse critério considera que o alcance de identificação como aquele em que o alvo pode ser visualmente descrito pelo observador, por meio de um sensor eletro-óptico [10][11]. Pela equação (4) é possível converter fx em distância de identificação (Rident), de modo a obter um MRTD em termos de alcance [7][11]: onde: Dalvo – dimensão de um alvo em um formato quadrado (em metros); e PPxident – pares de pixel por dimensão do alvo, conforme o Critério de Johnson para identificação [10][11]: PPxident = 6. Para se calcular o decréscimo do diferencial de temperatura ΔT entre o alvo de interesse e seu cenário de fundo, ou seja, de a atenuação atmosférica do sinal do alvo, de acordo com determinada condição atmosférica (favorável ou limitada) [7]: onde: ∆T0 –diferencial de temperatura entre alvo e cenário de fundo em que a câmera estaria praticamente na mesma posição do alvo; e σ – coeficiente de transmitância, sendo σ = 0,2 km-1 para condições favoráveis de transmitância e σ = 1 km-1 para condições limitadas de transmitância. III. MATERIAIS E MÉTODOS Na pesquisa foi utilizado uma câmera termal FLIR STAR SAFIRE III que equipa helicópteros do Comando de Aviação de Exército (CAvEx), em Taubaté-SP. A Tabela I apresenta as especificações fornecidas pelo fabricante [12]: No estudo foram analisadas as características da câmera operando no FOV mais amplo (WFOV: 25° por 19°) [12]. A coleta dos parâmetros da câmera foi realizada no hangar de helicópteros do CAvEx (Fig. 1). As caracterizações consistiram na aquisição e análise dos níveis digitais (ND) dos pixels das imagens. Para tanto, foi utilizado um Corpo Negro (CN, modelo SR800, de 11 pol., emissividade de 0,97, da CI Systems). Para uma temperatura ambiente média de 21°C, a faixa de temperatura absoluta (Tabs) avaliada foi de 14°C a 36°C, em intervalos de 2°C. Para cada Tabs, foram obtidas 150 imagens. O processamento das imagens foi realizado por meio dos softwares, de código aberto, ImageJ para identificação de valores de SiTF e NETD, e SFRMAT3 para a obtenção da MTF [13]-[16]. No estudo foram utilizados dois alvos de alumínio, que foram acoplados na frente do Corpo Negro de área extensa (Fig. 2): um quadrado vazado e outro padrão Quatro Barras com quatro frequências espaciais. Um termopar foi acoplado à parte inferior de cada alvo para obter a temperatura e comparar com o CN. A MTF, representativa das componentes vertical e horizontal, foi obtida por meio do imageamento do alvo quadrado. As dimensões desse último são de 30 cm por 30 cm, com uma área vazada de 15 cm por 15 cm, inclinado 6° em relação ao plano vertical da placa. Essa angulação considerou os cálculos realizados pelo programa SFRMAT3, que utiliza o método do degrau inclinado (Slanted-Edge Method) para a caracterização da MTF [14]-[16]. A Fig. 3 apresenta as áreas selecionadas na imagem obtida da composição corpo negro e alvo quadrado para análise da MTF vertical e horizontal. A dimensão da área de análise foi um retângulo de 130 pixels por 105 pixels, sendo esse os valores máximos possíveis para identificação da MTF pelo método Slanted-Edge [16]. O alvo padrão Quatro Barras possuiu dimensões de 30 cm por 30 cm, com quatro padrões de furação representando diferentes frequências espaciais. As medidas totais da aresta da composição das barras são: 98 mm, 40 mm, 25 mm e 21 mm. Esse alvo foi utilizado para confirmar se nas distâncias a serem calculadas seria possível identificar os padrões de Quatro Barras, para assim confirmar a efetividade das medições [4][6]. Ou seja, a determinada distância de identificação, o operador do sistema deve possuir a capacidade de distinguir as quatro barras em uma frequência espacial específica. Para a avaliação dos dados de SiTF e NETD, considerou-se o efeito do controle automático de ganho (AGC – Automatic Gain Control) do FLIR. Como o sistema imageador em estudo não possibilita, por meio de seu menu de configurações, desabilitar o efeito do AGC, um segundo Corpo Negro foi utilizado, configurado a uma temperatura de 60° C. Dessa forma, manteve-se uma região da imagem com um nível digital fixo, sem que o ganho fosse alterado durante a medição. Tal temperatura de 60° C para o segundo CN foi selecionada em função de identificar, por meio de um termopar conectado ao FLIR, uma temperatura média de 34° C. Com isso, ao se emitir um sinal maior que a temperatura interna da câmera termal, além de diminuir o efeito do AGC, também foi possível melhorar a qualidade da imagem influenciada pelo ruído causado pelo aquecimento da eletrônica do imageador. A Fig. 4 apresenta a visualização da imagem obtida nas medições, com o funcionamento de um segundo Corpo Negro. Pela Fig. 4 observa-se uma imagem obtida pelo FLIR. O CN com cavidade redonda a esquerda da imagem (Tabs = 60° C) foi utilizado para diminuir o efeito do AGC da câmera; o valor médio de nível digital foi de 254 (ND60° C = 254), com desvio padrão de 0,85. O quadrado inclinado a direita representa a composição Corpo Negro (Tabs = 29° C) e alvo em alumínio. O ND29° C = 171 para o alvo, com desvio padrão de 2. A Fig. 5 apresenta a visualização da imagem obtida nas medições, sem a adição de um segundo CN. Com isso é possível notar o efeito de contraste promovido pelo AGC, observando-se um maior contraste na imagem em comparação a Fig. 4. Esta alteração incorre em uma imprecisão na aquisição de níveis digitais das medições. O nível digital médio para a composição do alvo foi de ND29° C = 249, com desvio padrão de 0,7.  IV. RESULTADOS E DISCUSSÕES Foi identificado a curva de resposta termal da câmera FLIR (Fig. 6). O valor representativo para SiTF, ou seja, o coeficiente angular da reta em azul correspondente a parte linear da curva foi de 19 ND/°C, com um valor de R2 de 0,9997. Fig. 6. SiTF caracterizada da câmera. Foram obtidos dados de NETD para a faixa de temperaturas analisadas (Fig. 7). Fig. 7. NETD caracterizada na câmera. Os resultados da Fig. 7 permitem determinar uma NETD característica para a câmera de 0,069 °C (para Tabs = 31°C). Esse valor representa o máximo de sensibilidade obtido na faixa de temperatura estudada (ou seja, representa a pior condição), dentro da região linear da curva de resposta termal do equipamento (SiTF – Fig. 6). A Fig. 8 apresenta os resultados da MTF vertical e horizontal, representativas da câmera. Observa-se que o desempenho de modulação espacial do FLIR é melhor verticalmente (valores de modulação superiores à MTF horizontal na região de 0,4 mrad-1 a 0,75 mrad-1). Fig. 8. MTF caracterizada câmera. A Fig. 8 apresentou a frequência de Nyquist, fN = 0,74 mrad- 1 , o que indica o seu limite de resolução. Com isso, para o cálculo do MRTD estimado para o FLIR, não foram apresentados dados de frequência espacial (fx) superiores a fN. A Fig. 9 apresenta os dados de desempenho em distância de identificação da câmera. Como exemplo, foi considerado um alvo de dimensões de 2,3 m por 2,3 m (alvo padrão, conforme STANAG 4347 [10]), com um diferencial de temperatura de 10 °C em relação ao cenário de fundo (ΔT = 10° C). Foi considerada uma atmosfera com condições de máxima transmitância (ou transmitância favorável). A curva tracejada em verde representa a atenuação atmosférica do sinal em função da distância entre alvo e câmera, como demonstrado em (5). Como a atenuação apresentou-se em uma pequena distância, parece estar linear. Em função dessa atenuação do sinal do alvo não interceptar a curva de MRTD estimada (Fig. 9), o valor da distância de identificação de 277 m foi a máxima obtida. Esse alcance foi limitada pela óptica da câmera, dada pela frequência de Nyquist. Para avaliar a conformidade nas medições, foi utilizado o alvo padrão 4 Barras, na dimensão de 40 mm por 40 mm. O diferencial de temperatura ajustado foi de ΔT = 1° C. A Fig. 10 apresenta o desempenho em distância de identificação para o alvo considerado. A interceptação da atenuação atmosférica do sinal do alvo com a MRTD estimada apresentou a limitação da sensibilidade de diferenciação termal da câmera, que foi de 4,8 m (Fig. 10). Foi obtida uma imagem termal de um alvo de 40 mm por 40 mm, posicionado a 5 m da câmera FLIR (Fig. 11). Apesar da distância estar a 0,2 m além do limite de sensibilidade termal e resolução espacial da câmera, foi possível distinguir as 4 barras como uma distância de identificação. Esse fato pode estar associado ao fator K, conforme apresentado em (3), que permitiu uma melhoria de 5% no desempenho em alcance do equipamento imageador. V. CONCLUSÃO No presente estudo foram determinados, à partir de medições em campo, os parâmetros SiTF, NETD e MTF de uma câmera FLIR termal utilizando softwares específicos para processamento de imagens de um Corpo nNegro. Para diminuir o efeito do AGC na aquisição dos níveis digitais das imagens, foi necessário utilizar um segundo Corpo Negro. Por meio desses parâmetros caracterizados de SiTF, NETD e MTF, foi possível traçar uma curva de MRTD estimada em função da distância, de acordo com as dimensões e diferencial de temperatura de um alvo de interesse. Para um alvo com dimensões de 2,3 m por 2,3 m, com um ΔT = 10° C em relação ao cenário de fundo, obteve-se uma distância de identificação de 277 m. A distância foi a máxima obitida em função do limite de resolução da câmera (fN = 0,74 mrad-1). Como forma de avaliação do método empregado nesta pesquisa, foi utilizado um alvo padrão Quatro Barras, com dimensões de 40 mm por 40 mm e difencial de temperatura de 1 °C (ΔT = 1 °C). Pelo método, foi possível obter uma distância de 4,8 m, sendo que a câmera conseguiu identificar o padrão Quatro Barras a 5 m. Essa diferença de 0,2 m (5% superior) pode estar relacionado ao fator K, conforme (3), e deve ser melhor pesquisado posteriormente. Pelos resultados identificados, o método utilizado no estudo demonstrou-se eficiente para a avaliação das características e do desempenho de uma câmera termal, o que contribui com o planejamento de operações aéreas."
	}
