{
    "id": 76,
    "titulo": "a interoperabilidade nas comunicações de dados por meio de radiofrequência em hf",
    "autor": "márcio gonçalves ramos, pablo pontes arraes",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2018/st/ST_10_3.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 3,
    "resumo": "Os modernos sistemas militares de transmissão de dados no espectro de radiofrequência em HF (high frequency) possuem protocolos específicos para atender aos requisitos exigidos nos diferentes cenários dentro do teatro de operações militares conjunto e a interoperabilidade entre os equipamentos de diferentes fabricantes é um requisito relevante na estrutura de Comando, Controle, Comunicações, Computação, Inteligência, Vigilância e Reconhecimento (C4ISR). Com o objetivo de gerar a interoperabilidade entre os rádios de comunicações utilizados pelas Forças Armadas Brasileiras, a aplicação em software de computador HF Data Link Engine foi desenvolvida e este artigo descreve o padrão do protocolo de comunicações desenvolvido, aponta as características da camada física que permitem sua funcionalidade, bem como, apresenta o resultado dos testes de interoperabilidade entre os equipamentos de comunicações em HF utilizados no âmbito do Ministério da Defesa.",
    "texto": "I. INTRODUÇÃO O Brasil é um país de dimensões continentais, o que exige avançados equipamentos tecnológicos para manter a vigilância constante em terra, céu e mar. Desta forma, um bom sistema de comunicações é primordial para o cumprimento das missões de defesa aérea, busca, resgate, patrulha marítima e vigilância de nossas fronteiras. Essas características de independência e longo alcance creditam à faixa de radiofrequência em HF uma meritória importância estratégica e, logicamente, grande interesse no âmbito civil e militar. O Ministério da Defesa está desenvolvendo o Sistema Estratégico de Comunicação em Alta Frequência – SECAF, cujo objetivo é prover uma rede de comunicações de dados em HF (RECAF) que integrará as três forças em todo o território brasileiro. A RECAF empregará os enlaces de alta capacidade da Rede Operacional de Defesa (ROD) e os enlaces em HF para conectar estações e promover o fluxo dos dados entre usuários do sistema. [1] A principal proposta para estabelecimento da RECAF é manter a capilaridade da rede HF existente nas forças singulares, para tanto, é fundamental que seja estabelecido um padrão mínimo de interoperabilidade entre os sistemas de comunicações atuais. Os requisitos técnicos e operacionais da RECAF, aliado às necessidades de comunicações em HF da Força Aérea Brasileira (FAB), motivaram o desenvolvimento da aplicação HF Data Link Engine. II. PADRÃO DE PROTOCOLO DE COMUNICAÇÕES EM HF A Organização do Tratado do Atlântico Norte (OTAN), através do Acordo de normatizações (STANAG), utiliza o STANAG 5066 (Padrão para Rádio Comunicações de Dados em HF) para permitir que aplicações de fabricantes distintos se comuniquem de forma eficiente através de rádio enlace em HF. O STANAG 5066 fornece um conjunto de protocolos que trabalham entre a camada física e a camada de aplicação do modelo OSI, o qual inclui o SIS (Subnet Interface Service) que permite uma aplicação conectar-se a um modem HF através de um servidor STANAG 5066 utilizando o protocolo TCP/IP [2]. Desta forma, permite-se uma independência entre o software aplicativo e o hardware de MODEM de um determinado fabricante. A Fig. 1 mostra a configuração de três sítios que se comunicam por rádios HF utilizando o STANAG 5066 para prover o link ponto a ponto entre um conjunto de aplicações. O protocolo SIS está separado do STANAG 5066 sendo responsável pelo controle de fluxo de dados no enlace HF e integração entre a aplicação, o sistema de controle do rádio e o MODEM que compõem uma rede de dados em HF. Tendo em vista a sua sofisticação e complexidade, aliada ao difícil acesso aos documentos que descrevem a pilha de protocolos ou estrutura de dados do protocolo SIS, aceitou-se o desafio de desenvolver um software para a arquitetura computacional IBM-PC, que fosse capaz de encapsular dados de aplicações externas de usuário em um protocolo simples de Enlace de Dados em HF, com o objetivo de estabelecer a interoperabilidade desejada entre todos os rádios HF utilizados pelas Forças Armadas do Brasil. III. CARACTERÍSTICAS DO PROTOCOLO DESENVOLVIDO Com base no protocolo LINK BR1 (propriedade da FAB) e de posse da documentação que descreve a sua estrutura [3], foi possível estabelecer um protocolo reduzido de controle de fluxo de dados trafegados em um enlace em HF. A finalidade de se reduzir o número de campos de controle de enlace, se comparado ao LINK BR1, foi otimizar a utilização da banda estreita disponível nas diversas modulações presentes no MODEM HF. A aplicação desenvolvida chamada de HF DataLink Engine é um software servidor capaz de prover, por meio de uma rede TCP/IP, às aplicações clientes de chat, e-mail e posicionamento GPS (unidade móvel) um meio de comunicações com as suas partes remotas por meio de enlace HF. O HF DataLink Engine possui como principais características: 1) Uso de interface de rede ethernet para comunicação com aplicações clientes por meio do protocolo de transporte UDP pertencente a pilha TCP/IP; 2) Uso de interface serial assíncrona RS-232 para comunicação com MODEM HF de diversos fabricantes; 3) Características da interface serial: Taxa de dados de 1200bps a 115200bps, 8 bits de dados, 1 bit de parada, sem paridade; 4) Controle das sinalizações elétricas TXD, RXD, RTS, CTS, DCD padronizadas da interface serial, a fim de permitir o controle de fluxo de um enlace half-duplex; 5) Fragmentação de dados em pequenos blocos chamados de frames com comprimento de até 154 bytes; 6) Verificação de integridade de cada frame trafegado com a repetição apenas daqueles que forem corrompidos; 7) Ajuste de tempo de atraso entre a ativação de transmissão através do RTS e o envio de dados através do TXD, a fim de garantir a estabilidade de funcionamento do amplificador de potência do rádio antes de se enviar os dados; 8) Ajuste de tempo de atraso entre o término do envio de dados e a desativação da transmissão, a fim de garantir que todos os bits dos frames estejam presentes na estrutura de bits da modulação utilizada; 9) Tabela de endereços de estações controladas pelo HF Data Link Engine e aplicações de usuários; 10) Interface visual (texto e indicadores luminosos) para indicação de estado de conexão TCP/IP com as aplicações clientes e de acompanhamento do tráfego de frames por meio das interfaces ethernet e serial; Após o software enviar o conteúdo do protocolo de enlace ao modem por meio da interface serial, este irá se encarregar de encapsular os dados na forma de onda selecionada para operação no espectro de rádio HF. Para isso foi estabelecido um padrão adequado para a camada física (rádio e modem) e a adequação do protocolo LINK BR1 a um canal de comunicação em HF. A Fig. 2 apresenta a estrutura de enlaces de dados utilizada no funcionamento do software HF Data Link Engine. IV. HF DATALINK ENGINE A aplicação foi desenvolvida para funcionar com os seguintes padrões para a camada física: Rádio HF- Modulação AM-SSB (USB e LSB) com largura de banda de 3 kHz, padrão MIL-STD 188-141A (ALE 2ª geração) MODEM HF – Porta serial nativa para a transferência dos dados no padrão RS-232 em modo assíncrono e síncrono (necessita de conversor externo), forma de onda com padrão MIL-STD-188-110A com taxa de transmissão entre 75 e 2400 bauds com Interleaving Short para a correção de erros no enlace de dados. Essas características foram definidas após a verificação dos padrões de camada física comum aos equipamentos existentes nas três Forças Armadas e posteriormente, foram analisados os resultados obtidos nos ensaios realizados em laboratório, seguindo a recomendação ITU-R F.339-8, onde foi verificada a melhor relação do sinal sobre o ruído para uma determinada taxa de bits transmitida, largura de banda do canal e modulações utilizadas pelo MODEM. Durante o desenvolvimento, priorizaram-se as características da configuração do MODEM que apresentaram a melhor eficiência e robustez durante os enlaces realizados. A Fig. 3 mostra a estrutura do frame do protocolo de enlace. Segue abaixo o significado de cada campo contido em um frame do protocolo desenvolvido: STX (Start of Text): Marcação de início composto por 4 bytes 82 representado em notação hexadecimal; Frame Number: Número do frame corrente que poderá ser de 1 a 8; Frame Last: Número do último frame que poderá ser de 1 a 8. Se um bloco de dados possuir um tamanho de até 1024 bytes ele será acondicionado em até 8 frames; Frame Type: Identificação de tipo para o frame corrente. Ele poderá ser de controle, dados ou reconhecimento (ACK); Control Type: Identificação de tipo de comandos de controle que são executados apenas entre as aplicações HF DataLink Engine; Data Type: Identificação de tipo de dados trafegados entre as aplicações externas de usuário; Ack Flags: Trata-se de uma sinalização mapeada em bit capaz de indicar o reconhecimento positivo (bit 1) ou negativo (bit 0) de integridade do(s) frame(s) recebido(s); Data Number: Número da mensagem (controle/dados) corrente. Esse número será incrementado sempre que houver uma confirmação positiva de recebimento (ACK) referente a esta mensagem; Data Block Length: Tamanho do bloco de dados do frame corrente, cujo valor deverá ser de no máximo 135 bytes; Source Address: Endereço numérico da estação de origem que fará o envio de dados para a estação de destino; Destination Address: Endereço numérico da estação de destino que receberá os dados da estação de origem; Data Block: Diz respeito ao transporte de dados do protocolo de aplicação externa de usuário; CRC: Verificação de Redundância Cíclica. Trata-se de um valor numérico calculado pelo transmissor para garantir ao receptor a confiabilidade do frame. Ao recebê-lo, o receptor fará o cálculo de CRC para verificar a sua integridade. Caso esteja corrompido, ele fará a sinalização em bit no campo Ack Flags, a fim de informar ao transmissor uma confirmação negativa de recebimento e este deverá reenviar o frame; ETX (End of Text): Marcação de fim composto de 4 bytes 83 representado em notação hexadecimal. O HF Data Link Engine é o software responsável pelo estabelecimento do enlace entre as estações de comunicações sendo capaz de efetuar o controle de fluxo dos dados trafegados entre estações (protocolo de enlace), gerenciar as aplicações externas de usuário (protocolo de aplicação) e realizar a detecção de erro. V. DETECÇÃO DE ERRO O CRC (Cyclic Redundancy Check) é um método de detecção de erro usado em transmissões digitais que detecta alterações acidentais nos dados. Blocos de dados que entram nesses sistemas recebem um valor de verificação baseado no resto de uma divisão de polinômios de seu conteúdo. Na recuperação, o cálculo é repetido e no caso de os valores de verificação não coincidirem, uma ação corretiva deverá ser tomada contra a corrupção de dados. Neste desenvolvimento foi utilizado o CRC de 16 bits da CCITT (Conselho Consultivo Internacional de Telefonia e Telegrafia). VI. PREPARAÇÃO PARA OS TESTES Para verificar o funcionamento do software desenvolvido, foram testados os seguintes equipamentos de diferentes fabricantes: RF-5800H-MP – HARRIS; RT7000 – DATRON; XK2100 – ROHDE & SCHWARZ; e HF9500 – ROCKWELL COLLINS. Dos quatro equipamentos testados, somente o rádio da empresa DATRON não possui MODEM interno, entretanto, foram utilizados MODEM externos, modelo RF-5710a do fabricante Harris e RM6 do fabricante RapidM. Foi utilizado o software PComm Lite para transmitir as mensagens de teste e monitorar os erros ocorridos durante o enlace entre os MODEM e rádios HF, assim pode-se determinar o tamanho ideal do frame para transmissão e recepção dos dados em um canal de 3 kHz de banda. Foi utilizado o analisador de espectro Fieldfox, modelo N9912A do fabricante Agilent para medir a razão do sinal pelo ruído (SNR) definida para o link, bem como o ajuste da potência transmitida, seguindo os parâmetros contidos na recomendação ITU-R F.339-8 (Larguras de banda, relações sinal / ruído e tolerâncias ao desvanecimento em sistemas fixos e terrestres de radiocomunicações móveis HF) O rádio RF-5800H-MP foi conectado ao notebook pela interface serial de comunicação RS-232, ao qual, permite acesso direto à interface de controle do fluxo de dados do modem. Para testar o software em operação com o rádio HF9500 foi utilizada uma aeronave P3M em solo na ALA12 e o enlace de dados foi estabelecido com o rádio manpack RF5800 instalado ao lado da pista do aeródromo. Todos os MODEM utilizados no desenvolvimento possuem a forma de onda padrão MIL-STD 188-110A (adotada como o padrão mínimo de interoperabilidade) e interface de comunicação com controle de fluxo efetuado pelas sinalizações elétricas do padrão serial RS-232. As mensagens dos testes realizados continham 1.000, 5.000 e 10.000 caracteres. Foram efetuadas, no mínimo, 500 transmissões de cada mensagem para ajustar e certificar o correto controle de fluxo efetuado pelo software HF Data Link Engine. A Fig. 4 mostra o Setup disponibilizado para os testes executados nas instalações do Primeiro Esquadrão do Primeiro Grupo de Comunicações e Controle. Foram utilizadas as instalações prediais e os equipamentos de comunicações em HF do 1º/1º GCC, o que permitiu verificar a eficiência do software em todas as fases do seu desenvolvimento. Durante os testes práticos, utilizouse os equipamentos de HF instalados na Tática Profeta com até 10 kW de potência. VII. RESULTADO DOS TESTES REALIZADOS O HF Data Link Engine mostrou-se eficiente na interoperabilidade dos equipamentos de comunicações de dados em HF de diferentes fabricantes. Os requisitos mínimos da forma de onda do MODEM HF, interface de comunicação serial, taxa de transmissão e correção de erros exigidos foram atendidos. Os primeiros testes a longa distância foram executados no enlace ionosférico de 932 km de distância entre Brasília e Rio de Janeiro. A estação de Brasília está instalada no prédio do Ministério da Defesa e a do Rio de Janeiro está instalada no 1º/1º GCC na ALA12. Foram utilizados os transceptores XK2100L (Rohde Schwarz) e RF-5800H-MP (HARRIS), respectivamente em Brasília e Rio de janeiro, ambos com seus respectivos MODEM configurados com a forma de onda MIL-STD 188-110A e taxa de 600 a 3200 bps. A potência de transmissão dos equipamentos foi ajustada para 100 W e as frequências utilizadas nos testes foram calculadas pelo software REC-533 ITSHF. Foram trafegados mensagens de texto livre e envio de arquivos em diversos formatos (TXT, PDF e JPG) e o enlace permaneceu estável durante todo o teste e nos períodos de desvanecimento do sinal, o aplicativo mostrou-se bastante eficiente na detecção de erros. O HF Data Link Engine foi testado na aeronave P3-M do 1o /7o Grupo de Aviação e mostrou-se bastante eficiente na interação com o rádio HF9500 empregado na plataforma de missão da aeronave. Cabe ressaltar que não foi preciso alterar nenhum parâmetro de configuração da aeronave para utilização do software. Os testes foram feitos com a aeronave em solo, efetuando o enlace de dados com um rádio portátil operado em uma viatura em deslocamento no entorno do aeródromo. O software gerou interoperabilidade nas comunicações de dados entre o rádio HF9500 do fabricante Rockwell Collins e o rádio RF5800-MP do fabricante Harris, onde foi possível trafegar mensagens de texto e arquivos anexados. Nos testes de desempenho em ambiente simulado, a máxima taxa de transmissão atingida foi de 9600 bps, utilizando a forma de onda MIL-STD-188-110B, porém não são todos os rádios que possuem essa configuração de hardware, o que restringe sua aplicação em uma rede com diversidade de equipamentos. O estado do enlace, o comportamento das interfaces de comunicações e a interpretação de cada bloco de dados transmitido ou recebido, puderam ser acompanhados em tempo real pela interface gráfica do software desenvolvido. A Fig. 5 e Fig. 6 mostram, respectivamente, as telas dos softwares HF Chat Terminal e HF Data link Engine em funcionamento. VIII. CONCLUSÃO Por meio da aplicação HF Chat Terminal é possível transmitir mensagens de texto e arquivos digitais em qualquer formato, desta forma ela atende algumas necessidades operacionais das forças em um emprego tático, tais como: missões de patrulha marítima, resgate e reconhecimento. O próximo passo do projeto será o desenvolvimento de aplicações para transmitir mensagens de posicionamento GPS e mensagens de e-mail, onde será possível acompanhar em tempo real, o deslocamento de uma aeronave em voo e trafegar mensagens de correio eletrônico com usuários da rede INTRAER ou ROD. "
}