	{
		"id": 77,
		"titulo": "circulador construído com loops acoplados de ressoadores parametricamente modulados operando a 915 mhz",
		"autor": "eduardo gonçalves sousa",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2018/st/ST_06_1.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 1,
		"resumo": "O circulador é um dispositivo não recíproco muito utilizado em sistemas de comunicação full-duplex. O seu funcionamento baseia-se na precessão dos momentos de dipolo magnético associados ao spin de elétrons não emparelhados que giram em torno do eixo de um campo magnético externamente aplicado. Por consequência, torna-se necessário o uso de ferrita de grande dimensão, tornando o seu footprint muito grande comparado aos padrões atuais de componentes SMT, i. e., Surface-Mount Technology. Uma alternativa é construir um circulador ativo utilizando transistores, que também possui limitações, e. g., largura de banda estreita, alto nível de ruído e alta complexidade da topologia. Como alternativa a esses dois modelos de circulador, este artigo apresenta o projeto de um circulador com topologia Π com o uso de indutores, capacitores e diodos de capacitância variável, para a banda UHF de 33 cm e frequência central de 915 MHz.",
		"texto": " I. INTRODUÇÃO Um circulador é um dispositivo de três terminais, nãoreciproco, que permite que um sinal RF flua entre duas portas em uma só direção. Esse dispositivo deve prover baixas perdas de inserção e alta isolação reversa e entre portas. Para fins práticos, o circulador deve ser capaz de operar em full-duplex, típicos de transmissores e receptores de comunicações. Alcançar esses objetivos de projeto é extremamente complicado em um dispositivo real, uma vez que, este é uma função de iterações complexas que incluem, dentre outras, os seguintes parâmetros: a qualidade de transmissão RF depende da temperatura do material ferrimagnético [1], a linha de transmissão deve ter uma geometria adequada [2], causando severas limitações de aplicação ou dificuldade de construção, intensidade do campo magnético, função de uma magnetização inicial e da temperatura do material ferrimagnético [3]. Alcançar estabilidade na operação do circulador requer inteligencia na escolha dos materiais, na desenho de sua geometria, na iteração mecânica de construção e no ajustes de parâmetros, a fim de obter a melhor relação entre tamanho, custo, eficiência para a faixa de operação do projeto. Por essas dificuldades, poucos são os fabricantes de circuladores e seus processos de fabricação tendem a se manter os mesmos, apesar do dispositivo ter sido desenvolvido há décadas. A fim de evitar essas dificuldades de projeto e suas limita- ções práticas, vários estudos [4] [5] estão sendo realizados para que se mude o processo de fabricação para uma tecnologia barata e extremamente desenvolvida. Para isso, é necessário conhecer os fundamentos que regem o funcionamento do circulador de ferrita para então propor uma solução equivalente. Neste artigo, apresentam-se formas de construir um circulador com circuitos eletrônicos, com topologia Π. Como consequência dessa construção, tem-se um dispositivo que não necessita da aplicação de um campo magnético uniforme externo, ou seja, o efeito de giro que em circuladores tradicionais é consequência de um fenômeno físico - principalmente da precessão de Larmor - é então realizado por modulações paramétricas [6] em loops de ressoadores acoplados. Os resultados são obtidos por meio de simulações no software ADS. II. EMULANDO A PRECESSÃO DE LARMOR EM UM ANEL RESSONANTE O primeiro passo para o projeto do circulador sem ferrita é entender o fenômeno que que rege o seu funcionamento. Dessa forma, podemos propor uma topologia baseada em uma solução com circuitos elétricos. A Fig. 1(a) apresenta a solução baseada na polarização do momento angular no anel ressonante. Neste caso, a modulação espaço-temporal de uma permissividade ∆(’; t) produz um spin eletrônico efetivo no anel, que remove a degenerescência dos estados ressonantes contrapropagantes e induz não reciprocidade. Este anel tem uma variável dielétrica que é função do tempo e do espaço e gira com velocidade angular Ωm. Outra forma de obter o momento angular é girando mecanicamente o anel, a um custo de severas limitações de frequência que não são discutidos neste artigo. Com relação ao sinal de modulação, é possível realizar a discretização de ∆(’; t) em três regiões como apresentado na Fig. 1(b). Semelhantemente, em Fig. 1(c) temos a discretização do anel em três ressoadores acoplados por κ, igualmente espaçados, com uma fase deslocada de 2π=3 rad entre cada ressoador, como apresentado em (1), (2) e (3). III. ANÁLISE DA TOPOLOGIA PI BASEADA NO ANEL RESSONANTE O circuito da Fig. 3 mostra um circulador eletrônico construído com ressoadores acoplados. Este circuito possui todas as proteções contra vazamento de sinal entre as fontes, além de possuir um acoplador mais robusto, que tende a estabilizar o sistema com um baixo fator de qualidade, ou seja, tornando as mudanças de comportamento menos abruptas com maior largura de banda (BW). Analisando a Fig. 3 percebe-se três loops de ressoadores acoplados, o primeiro com as portas 1 e 4, o segundo com as portas 2 e 5 e o terceiro com as portas 3 e 6. Em seguida tem-se dois ressoadores LC em série. Um sintoniza a frequência RF, com os componentes L2 e C2. O outro sintoniza a frequência de modulação, com os componentes L1 e C1. As portas 4, 5 e 6 são entradas de sinal DC, que polarizam os diodos de capacitância variável, chamados de diodo varicap. Esse sinal não pode ir para os ressoadores, por isso o capacitor Cdcb é colocado antes de L1. Para bloquear o sinal DC no ressoador sintonizado da frequência RF, o circuito alterna na colocação dos ressoadores RF e modulação, afim de que o próprio C1 bloqueie o sinal DC no ressoador RF. Há também, na entrada das portas 4, 5 e 6, o indutor Lrfc, que serve para bloquear o sinal RF, protegendo a fonte DC. Como ponto de partida do projeto, deve-se escolher valores de capacitor e indutor para o ressoador série de modula- ção, levando em consideração a impedância dos componentes para os sinais de modulação e RF. Dada a disposição dos componentes, percebe-se que o capacitor C1 deve permitir a passagem dos dois sinais. Como a frequência de modulação é menor que a frequência RF, a impedância RF será menor, idealmente 0 Ω. O indutor L1 deve ter impedância pequena, para o sinal de modulação, e alta para o sinal RF. Em termos práticos, entre 1 kΩ e 2 kΩ, é o que se considera como alta impedância em circuitos RF[7]. Para realizar a sintonia do ressoador, usa-se a seguinte fórmula: O capacitor Cdcb e o indutor Lrfc devem ter alta impedância para os sinais DC e RF, respectivamente. Esses dois componentes podem ter seus valores alterados, levando em consideração a premissa da alta impedância, afim de ajustar a impedância de S11 em 50 Ω no final do projeto. Por fim é feito a sintonia na faixa de operação RF desejada. Essa parte do projeto exige a análise da capacitância C2 a cada modificação do sistema, pois ela vai variar de acordo com a tensão que chega no diodo varicap. Então inicialmente, devese verificar qual a capacitância para uma determinada tensão aplicada. Em seguida faz-se a sintonia para uma frequência desejada, calculando o valor do indutor L2. Neste caso, devese escolher um valor de capacitor para que tenha impedância baixa (menor que 1 kΩ) tanto para RF, quanto para modulação, pois é justamente o sinal modulado variando a capacitância que irá emular a precessão de Larmor. Caso seja inserido um capacitor de valor fixo ou um diodo varicap com alta impedância para o sinal de modulação, o circuito se comportará como um divisor de potência. Passos para sintonia da frequência de operação: Escolhido o modelo de varicap, verifique a capacitância no datasheet [8] para um certo valor VDC de polarização e utilizando a fórmula fres = 1 2πpLC , escolha um valor adequando para L. Execute a simulação e verifique em qual frequência o circulador está sintonizado, levando em consideração o ponto ótimo dos parâmetros S11, S21 e S31. Utilize a mesma fórmula para verificar o valor de C, dado que L é fixo. Com o novo valor de C, calcule L para fres sendo a frequência desejada para o projeto. Passos para melhorar S21 21 e S11 11: Após a simulação, se o circulador já estiver na frequência desejada, modifique os valores dos componentes, tal que a frequência de ressonância não seja alterada, ou seja, deseja-se que apenas a impedância mude. O valor desejada deve ser observado na carta de Smith, onde a parte real da impedância de entrada Z11 deve ser idealmente 50 Ω. Inicie modificando Cdcb e Lrfc, pois eles não modificam a sintonia do circulador. Em seguida, o ressoador do sinal de modulação C1 e L1. Passos para melhorar S31 31: Após a simulação, se o circulador já estiver na frequência desejada, modifique os valores dos componentes, tal que a frequência de ressonância não seja alterada, ou seja, deseja-se que apenas a impedância mude. O valor desejada deve ser observado na carta de Smith, onde a parte imaginária da impedância de entrada Z11 deve ser idealmente uma reatância capacitiva entre −j1 à −j10, de acordo com os resultados experimentais obtidos. O casamento em j0 resulta na anulação do efeito de modulação, ou seja, o dispositivo passa a se comportar como um divisor de potência. Inicie verificando se a isolação em função de vmod está no seu ponto ótimo. Em seguida modificando Cdcb e Lrfc, pois eles não modificam a sintonia do circulador. E por fim, o ressoador do sinal de modulação C1 e L1. IV. ESTUDO DE CASO: CIRCULADOR 915 MHZ Seguindo as regras de projeto de circuitaria RF [9] [10], a Tab. I apresenta os componentes e seus respectivos parâmetros, utilizados no projeto. Além dos valores dos componentes estarem devidamente ajustados para impor a ressonância na faixa correta de operação, a frequência de modulação deve ser aproximadamente dez vezes menor que a frequência RF [6] e neste caso foi utilizado fm = 90 MHz. Por fim, as tensões utilizadas para polarização dos varicaps e na fonte de modulação foram respectivamente VDC = 3:0 V e Vmod = 1:4 V . V. RESULTADOS DE SIMULAÇÃO Seguindo os parâmetros da Tab. I, o circuito foi simulado utilizando a simulação LSSP (Large Signal S-Parameters) no software ADS [11]. Todos os componentes foram considerados ideais e sem perdas. Por se tratar de uma simulação ideal, as fontes foram conectadas diretamente nas portas do circulador. Diferente da maioria dos circuitos RF, no qual é comum utilizar circuitos de casamento de impedância, no caso do circulador, quando o circuito de casamento foi utilizado o circulador perdeu o efeito da modulação e passou a operar como um divisor de potência. O mesmo resultado foi encontrado no caso de desligar a fonte de polarização, como apresentado na Fig. 5. Comparando com o circulador de ferrita, este processo é equivalente ao caso da remoção da ferrita. Para o circulador em condições normais de uso, os resultados de perda de inserção S21, perda de retorno S31 e isolação S11 são apresentados na Fig. 4. Outra importante característica deste circuito é a sua sintonização em faixas de frequência distintas. Embora a largura de banda apresentada no circuito em pleno uso, na Fig. 4, seja de aproximadamente 20 MHz, se necessário operar em outra faixa, basta ajustar a tensão de polarização VDC que o circulador passa a trabalhar em outra faixa, como apresentado na Fig. 6. Isso se deve ao fato de estarmos alterando a capacitância e consequentemente alterando a zona de ressonância do dispositivo. VI. CONCLUSÃO Os resultados apresentados mostram que o circuito desenvolvido atua como um circulador. Ele tem a habilidade de ser pequeno e pode ser desenvolvido com tecnologia SMT. Em condições de pleno uso, o circulador funcionou bem, tendo como ponto forte a sintonização de faixa de operação modificando a tensão de polarização dos diodos varicaps. Para uso industrial ainda é necessário um refinamento na topologia, nas questões de casamento de impedância e filtragem dos sinal para os harmônicos de operação. O circuito tem um grande potencial de uso e aplicabilidade em equipamentos de comunicação diversos, inclusive militares, tendo a vantagem no tamanho em relação ao circulador de ferrita e em questões de custo de projeto e fabricação em relação aos circuladores em transistores.  "
	}
