{
    "id": 78,
    "titulo": "medidas eletromagnéticas do nanocompósito de nanoferrita [ba(niti)0,2fe11,6o19]96,0[la2o3]4,0 / resina epóxi para uso como absorvedores de micro-ondas na banda-x",
    "autor": "valdirene aparecida da silva, bruno ferraz donati, mirabel cerqueira rezende,",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2018/st/ST_06_2.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Medidas eletromagnéticas de permeabilidade magnética e permissividade elétrica, parâmetros de espalhamento (parâmetros S22 e S21) e de refletividade foram realizadas em amostras de compósitos nanoestruturados com a nanoferrita de [Ba(NiTi)0,2Fe11,6O19]96,0[La2O3]4,0 em resina epóxi, pela técnica de guia de ondas na faixa de frequências da banda-X (8,2 - 12,4 GHz). Com os valores experimentais de permeabilidade e permissividade obtidos foi realizada a predição do comportamento da atenuação da radiação da amostra processada via simulação computacional. A correlação dos resultados obtidos via simulação com curvas de refletividade experimentais mostra um bom ajuste. Este dado mostra o potencial de simulações na otimização do processamento de absorvedores, tornando esse processo menos oneroso e mais rápido.",
    "texto": " I. INTRODUÇÃO O desenvolvimento de materiais absorvedores de radiação eletromagnética (MARE) tem sido de grande importância tecnológica e tem atraído a atenção de pesquisadores em todo o mundo. O aumento da poluição eletromagnética, devido à presença de micro-ondas (não-ionizantes) e o uso da tecnologia furtiva em sistemas de defesa e plataformas militares têm sido os grandes atrativos para estudos nesta área, com investimentos em trabalhos de pesquisa que já cobrem a faixa de frequências de 1-100 GHz [1,2,3,4]. Os absorvedores de radiação eletromagnética são materiais constituídos por compostos que proporcionam significativas perdas de energia em frequências sintonizadas. Esses materiais absorvem a radiação da onda eletromagnética incidente e dissipam a energia absorvida sob a forma de calor, por meio de mecanismos internos próprios dos materiais absorvedores, sejam esses magnéticos ou dielétricos; mecanismos esses que podem ser de natureza física ou química [5,6]. Considerandose aplicações no setor militar, pode-se dizer que a energia que seria utilizada para a detecção do sinal por meio de um radar é inibida total ou quase que totalmente e o objeto revestido com o material absorvedor de radiação eletromagnética torna-se invisível ao radar [7,9]. Uma das características mais importantes desses materiais é a possibilidade de se ajustar as suas propriedades elétricas e magnéticas, de tal forma a maximizar a atenuação das micro-ondas incidentes, em frequências específicas ou em um amplo espectro de frequências. Também são características importantes de MARE, durabilidade, a menor densidade possível, custo reduzido, desempenho em uma ampla faixa de frequências e, também, ser de fácil aplicação [9,11]. Considerando os centros absorvedores de micro-ondas mais estudados, as ferritas constituem uma classe muito importante de materiais magnéticos, por apresentarem átomos com características magnéticas arranjados de modo a produzir magnetização espontânea, enquanto mantêm boas propriedades dielétricas [9,10]. As características intrínsecas e extrínsecas das ferritas afetam à sua utilização no processamento de MARE, podendose citar a sua permeabilidade, permissividade e a temperatura Curie, somadas às suas características microestruturais, como porosidade e tamanho de grãos [9,10]. Neste trabalho, foram feitas medidas eletromagnéticas de parâmetros de espalhamento (parâmetros S), permeabilidade, permissividade e refletividade em compósitos de matriz de resina epóxi nanoestruturados com a nanoferrita de [Ba(NiTi)0,2Fe11,6O19]96,0[La2O3]4,0, denominada neste estudo, de maneira simplificada, de ferrita (BaNiTi). Foram também realizadas simulações do comportamento de atenuação da onda eletromagnética na banda-X de amostras com diferentes espessuras, pelo uso de um algoritmo desenvolvido e validado pelo grupo de pesquisa [11,12]. II. FUNDAMENTAÇÃO TEÓRICA A. Medidas eletromagnéticas 1) Parâmetros S e medidas de permeabilidade e permissividade: Os parâmetros de espalhamento (parâmetros S) são definidos em uma matriz matemática, que contém informações sobre as propriedades de espalhamento das ondas eletromagnéticas, onde S11 e S22 representam a energia refletida na primeira superfície da amostra e S12 e S21 a energia transmitida através da amostra [13,14]. Normalmente, uma baixa transmissão (S12 e S21) está associada à elevada reflexão (S11 e S22). Isso significa que o material apresenta elevada condutividade elétrica, contribuindo para uma maior reflexão da onda na primeira superfície do material. Já uma baixa transmissão da onda associada à uma reduzida reflexão indica que o material apresenta um bom potencial como absorvedor intrínseco de micro-ondas, ou seja, pode absorver parte ou quase que totalmente a energia da onda eletromagnética incidente sobre ele. Nessa condição, o material pode comportar-se como absorvedor com baixas e médias reflexões internas, com a dissipação da energia em seu interior [13,14,15]. A Fig. 1 ilustra esquematicamente o método de linha de transmissão em guia de ondas retangular. Os valores de permeabilidade e permissividade complexas são gerados pelos parâmetros S, e esses valores apresentam uma correlação direta com as características de absorção do material absorvedor de ondas eletromagnéticas. Onde, os componentes reais e imaginários da permissividade e da permeabilidade permitem avaliar a dissipação da energia na forma de calor em um absorvedor de micro-ondas [14,15]. O conhecimento desses parâmetros torna possível adequar as propriedades de absorção dos MARE, possibilitando a obtenção de materiais com melhores desempenhos. 2) Medidas de Refletividade: Baseado no princípio da conservação da energia, a energia incidente, Ei, é igual ao somatório de todas as energias envolvidas no processo de interação onda-matéria, quais sejam: Er – energia refletida, Et – energia transmitida, Ea – energia absorvida e Ed – energia dissipada (1). Quando uma onda eletromagnética incide no material, a energia incidente, Ei, pode ser total ou parcialmente refletida, absorvida ou transmitida. A energia transmitida representa a energia que passa através da estrutura do material e não é absorvida ou refletida [10,15] A Fig. 2 apresenta a configuração do sistema de medição utilizado nas medidas de refletividade (R). Uma placa metálica é posicionada atrás da amostra, num sistema fechado, onde o porta-amostra fica entre o adaptador e a placa metálica, como ilustra a Figura 2. De acordo com a metodologia utilizada neste caso, o corpo-de-prova deve ter espessura igual ou inferior à espessura do porta-amostra, ou seja, em torno de 9,77 mm [10,15]. A refletividade (R) pode ser avaliada como a redução da intensidade dos campos elétricos ou magnéticos pela interação da onda com o material absorvedor. A refletividade (com placa) pode ser definida (2) [10]: onde: R é a refletividade em decibéis (dB), Er é a energia refletida e Ei é a energia incidente. III. MATERIAIS E MÉTODOS As nanohexaferritas de bário (BaNiTi) foram obtidas pelo método de citratos precursores, com substituições de íons NiTi e dopadas com lantânio e tratadas termicamente a 1100 °C. As nanohexaferritas foram preparadas pela Universidade Federal do Rio Grande do Norte, no Instituto de Química, Grupo de Pesquisa em Materiais Cerâmicos e cedidas especialmente para este trabalho. Os nanocompósitos foram preparados com 30% e 50% (m/m) da ferrita (BaNiTi) em resina epóxi comercial, bicomponente. A espessura final das amostras foi de 9,0 mm para o nanocompósito com 30% da nanohexaferrita e 6,5 mm para o nanocompósito com 50% da nanohexaferrita. A caracterização eletromagnética utilizada neste estudo foi realizada na banda-X e baseada em metodologias da literatura [9,11]. As medidas de refletividade e dos parâmetros S foram realizadas pelo uso de um analisador de redes vetorial da marca Agilent Tecnologies, modelo PNA-L-N5230C, adaptado com um guia de ondas na banda-X. Os valores de permissividade e permeabilidade foram obtidos de acordo com o modelo de Nicolson-Ross [10,15]. Para a simulações foi utilizada uma ferramenta chamada RFE (um acrônimo para refletividade, frequência e espessura. Essa ferramenta permite investigar o comportamento do material absorvedor com diferentes espessuras na banda X. O RFE recebe como parâmetros de entrada os componentes real e imaginário de permissividade, ε’ e ε e permeabilidade, μ’ e μ (em função da frequência), e dá como saída o RL, em dB, em função da faixa de frequência de interesse e espessura do material em mm. Esse recurso fornece análise dinâmica do comportamento de atenuação dos absorvedores, onde os dados de saída de uma análise experimental mais rápida e com baixo custo [12,13]. Neste trabalho, utilizaremos RL para as medidas simuladas e Refletividade (dB) para as medidas experimentais. IV. RESULTADOS E DISCUSSÕES As medidas dos parâmetros S, S22 (energia refletida) e S21 (energia transmitida) para os nanocompósitos BaNiTi/resina epóxi são apresentados nas Fig. 3 e Fig. 4. Para que a onda eletromagnética se propague através da superfície do material absorvedor e atinja o seu interior, deve existir o casamento de impedâncias entre o espaço livre e a primeira superfície do material, onde a onda incide. A impedância representa a resistência que a onda encontra para penetrar no material [10,15]. Ao incidir no material absorvedor, a onda eletromagnética tem sua energia parcial ou totalmente refletida, transmitida ou absorvida. Como já mencionado, os parâmetros S representam a energia da onda eletromagnética refletida e transmitida no material. Assim, esses parâmetros contêm informações sobre as propriedades de espalhamento da onda no material [15,16,17]. No caso do parâmetro S22, que representa o quanto a energia é refletida na primeira superfície do material. Quanto mais próximo o valor medido estiver da referência, ou seja, 0 dB, maior é o seu caráter refletor. Quanto mais distante o valor medido estiver da referência, menor é a energia que retorna (refletido) à origem (antena receptora). O parâmetro S21 representa a energia transmitida no material. Quanto mais próximo da referência (ar) (material 100% transmissor) estiver o valor de S21 medido, maior é a energia transmitida através do material, ou seja, a energia irradiada que penetrou no material absorvedor, se propagou por toda sua extensão, sendo, posteriormente, detectada [17,18]. Os gráficos da Fig. 3 e Fig. 4 apresentam as medidas dos parâmetros S22 e S21, na faixa de frequências da banda-X. A Fig. 3 mostra os gráficos do parâmetro S22 (energia refletida). A análise desta figura indica que os nanocompósitos processados mostram comportamento promissor com relação a se comportarem como MARE. Para a amostra do nanocompósito processada com 30% em massa de nanoferrita têm-se valores entre -10 dB em 8,2 GHz e -6 dB no final da faixa de frequências estudada. Na amostra processada com 50% m/m da nanoferrita, os valores no início da faixa de frequência 8,2 GHz, apresenta valores de -4,5 dB, e um máximo de -10 dB, na faixa de frequências de 9,8 GHz a 10,9 GHz e termina com -8 dB em 12,4 GHz. As duas concentrações estudadas apresentam comportamento similar para o parâmetro S21 (Fig. 4). Já as curvas de S22 mostram comportamentos diferentes, onde a amostra mais concentrada mostra valores de S22 mais negativos acima de 9,5 GHz. Valores como esses podem ser geralmente considerados como um bom desempenho na maioria das aplicações comerciais, sendo baixa a quantidade de energia transmitida. A Fig. 5 e Fig. 6 apresentam as medidas de permissividade, εr’ e εr e permeabilidade, μr’ e μr dos nanocompósitos BaNiTi/resina epóxi. A Fig. 5 apresenta as curvas de permeabilidade e de permissividade das amostras preparadas com 30% (m/m) da nanohexaferrita. A análise da Fig. 5 mostra que os valores medidos de μr’ mantêm-se praticamente constantes em torno de 1,02 e μr em torno de 0,01. Os valores de εr’ obtidos apresentam-se em torno de 4,5– 4,9 em toda a faixa de frequências e os de εr, entre 0,46-0,52. A Fig. 6 apresenta as curvas de medidas de permissividade, εr’ e εr e permeabilidade, μr’ e μr para as amostras com 50% (m/m) da nanohexaferrita. Observa-se que o aumento da concentração promoveu um aumento nos valores do componente real de ε’, os quais variaram entre 5,3 e 6,4. Já os valores do componente imaginário de ε encontra-se entre 0,4 e 1,1 em toda a faixa de frequências avaliada. Os valores de μr’ e μr mantiveram-se muito próximos aos valores obtidos para as amostras preparadas com 30% em massa da nanohexaferrita. Considerando-se que os valores de permeabilidade e permissividade são calculados a partir dos valores dos parâmetros S, observa-se a mesma tendência entre as curvas dos parâmetros S e dos parâmetros complexos. Não são também observadas variações significativas nos comportamentos dos parâmetros complexos com o aumento da concentração da nanoferrita no nanocompósito. A Fig. 7 apresenta as medidas de refletividade (com placa metálica) dos nanocompósitos de BaNiTi/resina epóxi, nas concentrações de 30 e 50%, em massa. A linha reta preta representa a referência de um material totalmente refletor, ou seja, de atenuação zero da onda eletromagnética. O gráfico da Fig. 7 mostra que o valor de refletividade da onda eletromagnética para a amostra com 30% em massa da nanohexaferrita é de ~ -2 dB em torno de 8,2 GHz e aumenta ao longo da faixa de frequências, atingindo valores de -20 dB em 11,7 GHz. A curva de refletividade da amostra com 50% da nanohexaferrita apresenta comportamento semelhante. O valor medido no início da faixa de frequências, 8,2 GHz, encontra-se em torno de -2 dB e em 12 GHz apresenta um pico de ressonância com um máximo de -14 dB. Nas espessuras medidas, o nanocompósito comporta-se como absorvedor ressonante. Vale lembrar que, a espessura do absorvedor influencia em seu comportamento de atenuação da onda eletromagnética [10,15]. A simulação computacional é um recurso que possibilita a predição de valores de atenuação da onda eletromagnética pelo material absorvedor estudado, com concentração conhecida e espessuras ainda não estudadas [17,18,19,20]. A atenuação da onda eletromagnética promovida por um material absorvedor é determinada pela permissividade elétrica e permeabilidade magnética complexas do material. Assim, o acesso aos parâmetros complexos de ε e μ permite realizar simulações e prever o comportamento do absorvedor em diferentes espessuras e em faixa de frequências mais ampla. Assim, a partir dos valores de ε e μ obtidos foram feitas simulações, com o uso do algoritmo RFE [12,13]. As simulações foram feitas com os absorvedores para cada concentração estudada, em diferentes espessuras de interesse. As Fig. 8 e Fig. 9 mostram os resultados das simulações realizadas. Na Figura 8 são apresentadas as medidas de perda por reflexão (RL) simulada para o nanocompósito com 30% (m/m) da nanohexaferrita. As curvas representam as simulações nas espessuras de 2 a 9 mm. Observa-se, nessas espessuras, um comportamento de absorvedor banda larga, com atenuação em torno de -11 dB, que representa ~93% de atenuação da onda eletromagnética, com um máximo de -18 dB para a simulação com 4 mm de espessura. Na Figura 9, são apresentadas as curvas de RL simuladas para os nanocompósitos com 50% (m/m) de nanohexaferrita. Para a validação das simulações realizadas, a curva simulada para 3 mm foi comparada com medidas experimentais de refletividade para uma amostra com 3 mm de espessura (Fig. 10). Comparando as curvas experimental para a espessura, verifica-se um bom ajuste entre as curvas, quando se analisa a frequência de máximo de atenuação, validando as respostas geradas pelo uso do algoritmo RFE. Observa-se, no entanto, a presença de deslocamento com relação à amplitude da atenuação, com variações na atenuação de -22 dB a -35 dB. Deslocamentos entre as curvas simulada e experimental podem ocorrer por variações na espessura e homogeneidade da amostra, por exemplo [12,13]. Assim, melhores ajustes entre as curvas experimentais e simuladas são obtidos com a melhoria da qualidade do processamento do absorvedor, da técnica de preparação do corpo de prova e da qualidade da calibração do analisador de rede vetorial e medidas dos parâmetros S. V. CONCLUSÕES Medidas eletromagnéticas de parâmetros de espalhamento (parâmetros S), permeabilidade, permissividade e refletividade foram realizadas em compósitos de matriz de resina epóxi nanoestruturados com a nanoferrita de [Ba(NiTi)0,2Fe11,6O19]96,0[La2O3]4,0. Os resultados obtidos indicam que os nanocompósitos apresentam comportamento promissor para uso como material absorvedor de radiação eletromagnética. Os compósitos obtidos apresentam bons resultados nos parâmetros S, indicando que há uma boa interação da onda eletromagnética com material. Nas medidas de refletividade, o nanocompósito com 30% da nanoferrita apresentou uma refletividade máxima de -20 dB, em 11,7 GHz. O nanocompósito com 50% da nanoferrita, apresentou um pico de ressonância de -14 dB em 12 GHz, ambos com comportamento de absorvedor ressonante. O aumento da concentração de nanoferrita nos nacompósitos, não apresentou variações significativas nos comportamentos dos parâmetros complexos de permeabilidade e permissividade. Nesse estudo, a simulação realizada pelo uso do algoritmo RFE, mostra que é possível prever o desempenho do material absorvedor variando as espessuras. Os resultados mostram que os melhores valores de perda por refletividade são apresentados pelo nanocompósito com 50% da nanoferrita. Na comparação das curvas simulada e experimental, há um bom ajuste. Esses resultados mostram o grande potencial das simulações na otimização do processamento de matérias absorvedores de radiação eletromagnética, permitindo que o processo seja mais rápido e com menor custo."
}