	{
		"id": 79,
		"titulo": "transmissão e distribuição remota de sinais radar banda larga multicanal em redes de fibra óptica por dwdm",
		"autor": "andré paim gonçalves, olympio lucchini coutinho",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2018/st/ST_02_3.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 2,
		"resumo": "Este artigo aborda a transmissão e distribuição de sinais de radar com banda larga em fibras ópticas com o emprego de Multiplexação por Divisão Densa de Comprimento de Onda (DWDM) para emissores radar remotamente localizado, 1 km, em relação a seu parque de antenas. Esse enlace analógico a fibra foi concebido para a transmissão de sinais radar na faixa de frequência de 0,3 a 3 GHz. Tal enlace é apresentado, por meio de uma breve abordagem teórica e experimental. Para isto este estudo fez considerações em relação à influência de não linearidade e dispersão cromática. Essa modelagem permite verificar com precisão o efeito da dispersão da fibra óptica no sinal de RF, bem como verificar o comportamento do ganho de potência do sinal de RF. A implementação de tal enlace em bancada permitiu confirmar tal comportamento espectral do sinal radar, a estabilidade do ganho e seu futuro emprego para radares de banda larga.",
		"texto": " I. INTRODUÇÃO Nos últimos anos se observa uma busca por sistemas de RF, onde estes tenham uma grande largura de banda para transmissão de sinais, dimensões reduzidas e baixa dissipação de energia. Por conta dessas características, a Fotônica vem contribuindo no desenvolvimento dessas novas tecnologias. Circuitos fotônicos são significativamente mais leves do que os de RF, eles não sofrem interferência eletromagnética (IME) e são imunes a pulso eletromagnético (EMP). O fato de a fibra óptica não ser condutora e, portanto, não gerar arco voltaico ou faíscas se torna uma opção interessante para barramentos que passam próximos ou através de tanques de combustível, sem o risco de incêndio ou explosão [1]. Nesse contexto surgiu há alguns anos o termo Microwave Photonics, assim, este artigo fará referência a esse assunto com o nome de RF em fotônica. Este último é uma área, do conhecimento humano com rápido crescimento, usada para alicerçar o processamento, a transmissão e a geração de sinais de RF usando sistemas ópticos [1]. Valendo-se da RF em fotônica, foi proposto um enlace para transmissão de sinais de um radar com diversos canais para as suas respectivas antenas, conforme a Fig.1. Tal enlace deveria ter pelo menos 1 km de comprimento, baixa atenuação do sinal de RF e ter seu ganho de potência de RF estável, isto é, seu ganho ser uniforme para toda a banda de transmissão. Diante de tais requisitos empregou-se um enlace analógico à fibra óptica com o uso de DWDM sem amplificação óptica. Este artigo pretende fazer uma análise teórica e experimental da transmissão e distribuição remota de sinais radar multicanal em redes de fibra óptica por DWDM. Cabe ressaltar que DWDM é um acrônimo de Dense Wavelength Division Multiplexing, que significa em uma tradução livre: multiplexação por divisão densa de comprimentos de onda. Esta multiplexação é uma técnica de transmissão por fibra óptica que utiliza comprimentos de onda distintos da luz para a comunicação de dados [2]. O artigo foi organizado em quatro seções. Na seção II abordou-se uma breve análise do enlace, que faz uso da tecnologia DWDM, sobre as condições limitantes para o seu emprego e do comportamento de ganho de potência de sinal de RF do sistema com base em um modelo sem aproximações (emprega o Teorema de Adição de Graf). Na seção III os resultados experimentais obtidos foram apresentados e comentados. Na seção IV foram feitas as considerações finais do artigo. Conforme se observa na Fig. 2, esse enlace é composto por diodos laser, circuitos casadores de impedância, moduladores eletro-ópticos de Mach-Zehnder, cabos de fibras ópticas mono modo padrão (SMF-28), multiplexadores/demultiplexadores do tipo AWG (Arrayed Waveguide Grating), fotodetectores do tipo p-i-n e unidades amplificadoras de RF (UA). II. ANÁLISE DO ENLACE ANALÓGICO À FIBRA ÓPTICA DWDM Pelo fato de serem utilizados moduladores de MachZehnder (MMZ) nesse enlace, deve-se levar em conta sua resposta óptica senoidal quadrática, conforme observado na Fig.3. A análise de sua modulação é feita no ponto de quadratura e é escolhida uma abordagem para pequenos sinais ou uma abordagem para grandes sinais. A de pequenos sinais constitui em escolher índice de modulação, m, bem menor que um. Um valor postulado para m, neste trabalho, é em torno de 0,1, dependendo do nível de ruído. Quando o estudo é conduzido para valores muito pequenos de m implica em aproximações da série de funções de Bessel e quando é levada em conta uma modelagem para m maiores surge a necessidade de uma abordagem com série de funções de Bessel [2] e [3]. Neste artigo será empregada, para a análise do enlace, a figura de mérito relacionada com o ganho de potência do sinal de RF baseado no teorema de adição de Graf. Tal teorema permite fazer uma abordagem que engloba as duas abordagens anteriores, isto é, a de pequenos sinais e de grandes sinais. A não linearidade do MMZ não advém do material, mas sim por intermédio da sua função característica senoidal quadrática, observada a esquerda na Fig. 3, o que ocasiona distorções por harmônicas das frequências dos sinais modulantes (sinais em RF) e produto de intermodulação, a direita na Fig. 3 [4]. Os sinais com frequências harmônicas pares podem ser desconsiderados desde que o MMZ-SD (modulador MachZehnder Single Drive), esteja polarizado no ponto de quadratura [4] e [5]. Quanto às distorções oriundas do produto de intermodulação, deve-se observar o limite de potência na entrada do modulador. Este limite é obtido por meio do teste de dois tons. Quando o modulador está polarizado no ponto de quadratura, o produto de intermodulação de terceira ordem se torna o mais importante. Outro fenômeno importante é a dispersão. No enlace analisado, empregou-se a fibra óptica mono modo padrão (SMF-28), cuja dispersão cromática está presente. Contudo, devido ao seu comprimento ser de apenas 1 km e a faixa de RF a ser observada está definida entre 0,3 a 3 GHz, tal fenômeno não exercerá influência significativa, sendo confirmado pelo cálculo do ganho de potência de RF Neste estudo não será abordada a influência do ruído no sinal de RF na saída do enlace. A análise desse enlace deve levar em conta o problema da diafonia (crosstalk) pelo fato de empregar o DWDM. Essa diafonia pode ocorrer tanto no AWG demultiplexador (AWGDEMUX) quanto na fibra óptica por conta dos seus efeitos não lineares. Na fibra óptica, devido à multiplexação dos sinais do enlace, destacam-se os seguintes fenômenos: Automodulação de Fase (SPM), Modulação de Fase Cruzada (XPM), Mistura de Quatro Ondas (FWM), Espalhamento Brillouin (SBS) e Espalhamento Raman (SRS). Para mitigar o efeito de tais fenômenos na fibra óptica, foi considerado o limite de potência do sinal das portadoras ópticas, a diferença mínima de comprimento de onda dessas portadoras e um valor mínimo de dispersão da fibra óptica [5] e [6]. O multiplexador/demultiplexador do tipo Arrayed Waveguide Grating (AWG), empregado neste estudo, segue a norma STM-4 da União Internacional de Telecomunicação (ITU), a qual preconiza espaçamentos entre canais de 12,5 a 200 GHz. O AWG em questão apresenta um espaçamento entre canais de 100 GHz. Com isto a eficiência de mistura para o efeito de XPM e FWM é próxima de zero e a interferência entre os canais fica desprezível quanto ao acoplamento entre canais ópticos adjacentes na fibra óptica [2]. Considerando o isolamento entre canais ópticos adjacentes em um multiplexador/demultiplexador do tipo AWG em torno de 30 dB, então esses são considerados como lineares [2] e como não havendo crosstalk entre canais ópticos adjacentes. Diante de tais considerações e dentre as diversas figuras de mérito disponíveis para a verificação da qualidade do enlace, fez-se uso da análise do ganho de potência elétrica em [dB] que leva em conta todos esses fenômenos. Para se determinar o comportamento do ganho de potência de RF no enlace DWDM deve-se partir da expressão do Ganho de Potência de RF [2] calculado com o auxílio do teorema de Graf dado por: A responsividade do fotodetector é representada por ηD; αg é a representação de todas as perdas ópticas, tais como a perdas de inserção; P୭ୣ୬୲୰ୟୢୟ é a representação da potência óptica de entrada; PRF é a potência do sinal de RF na entrada do sistema; J1 é a representação da função de Bessel de primeira espécie de ordem um; mi é o índice de modulação de RF no modulador de Mach-Zehnder; θୢé o coeficiente de dispersão de primeira ordem determinado na frequência angular da portadora óptica, ω ୭; ω୰୤ é a frequência angular do sinal de RF e ZL é a impedância da carga. Note que em (1) a dispersão cromática é levada em conta de uma forma mais precisa do que a observada com a aproximação para pequenos sinais [2]. Aplicando os dados contidos na Tabela I em (1) é possível observar na Fig.4 o comportamento previsto do sinal variando de 300 MHz a 3 GHz. Observando o resultado na Fig. 4, percebe-se que o ganho de potência do sinal de RF se comporta de forma estável ao longo do intervalo de frequência de RF (0,3 a 3 GHz). Este comportamento permite inferir, por exemplo, que um sinal radar com banda de 2 GHz centrado em 1,5GHz não teria problema para ser transmitido nesse enlace. III. O EXPERIMENTO O enlace foi implementado por componentes comerciais. Utilizaram-se dois lasers DFB que operam no canal 30@ 1553,33 nm e Canal 31 @ 1552,52 nm, dois moduladores MZ com tensão de meia onda, Vπ = 4,1 V @ 1GHz, dois AWG DWDM que operam nos Canais 29 a 32 (espaçamento entre canais ópticos 100 GHz), 1 km de fibra óptica Corning Glass SMF-28 dispersão de 17 ps/nm•km, dois fotodetectores para comprimento de ondas de 900 a 1650 nm (banda de saída em RF >5 GHz) e amplificadores de RF (banda até 3 GHz, ganho mín. 33 dB). Esses componentes foram montados conforme as Fig. 5, 6 e 7. Primeiramente, modelaram-se e caracterizaram-se experimentalmente todos os componentes deste sistema visando ter conhecimento dos valores envolvidos em cada parâmetro do enlace. Após esta caracterização, visando medir o ganho de RF do enlace, conectou-se um dos cabos de RF de entrada do sistema a ser caracterizado à porta 1 do analisador de rede. Os fotodetectores foram conectados aos seus respectivos amplificadores. Os cabos de saída dos amplificadores foram conectados a um combinador de RF. A saída deste combinador foi conectada a um cabo de RF. A outra extremidade deste cabo foi conectada à porta 2. Quando foram medidos os parâmetros S do sistema, colocou-se o conector da entrada de RF do canal 30 na porta 1 e casou-se a entrada de RF do canal 31 com uma carga de 50 Ω. O que podem ser observados nas Fig. 5 e 7. O enlace foi organizado de acordo com a Fig. 5 para medir o ganho de potência do sinal de RF. Tal ganho para cada canal pode ser calculado descontando o resultado medido do parâmetro S21 para os cabos de RF e o amplificador de RF no valor medido do parâmetro S21 de cada canal. A Fig. 8 apresenta o resultado medido para o canal 30 comparado com o calculado pelo método de pequenos sinais e pelo método exato aplicando teorema de Graf. Observando a Fig. 8, percebe-se que a sobreposição dos valores obtidos visando à comparação do resultado calculado com o valor medido mostra uma diferença muito pequena. Os valores calculados (-32 dB) estão oscilando aproximadamente em 0,5 dB com relação aos resultados medidos. Para verificar o impacto do crosstalk óptico, observado na Fig. 9, no sinal de RF a partir do enlace configurado conforme a Fig. 10, optou-se por desconectar a saída do canal óptico 31 (que não está sendo medido) de seu fotodetector. Diante deste fato, foi possível observar somente o sinal que vinha do fotodetector do canal 30. O resultado desta ação foi observado no analisador de espectro Agilent E4407B que explora uma faixa de 9 kHz a 26,5 GHz, o qual foi obtido no canal 30 e apresentado na Fig.11. O resultado observado na Fig. 11 mostra o sinal de RF na frequência da portadora centrada em 1 GHz proveniente do canal 30 sem a interferência do sinal de RF proveniente do canal 31. Não são observados os sinais harmônicos da frequência de RF centrada em 1 GHz. Foi observado um sinal espúrio constante em torno de 2,154 GHz. Este último, mesmo com os geradores de RF desligados, foi observado. O que indica ser um sinal interferente externo. Para a faixa de frequência de operação do enlace estudado, verifica-se que este sinal não influenciou no experimento. Analisando (1) percebe-se que o ganho de RF depende da potência da portadora óptica. Contudo, quando se trata de transmissão de mais de uma portadora óptica em uma fibra óptica deve-se limitar o aumento da potência óptica que é utilizada para melhorar o ganho de potência do sinal de RF. Este fato ocorre por conta dos efeitos não lineares descritos na Seção II. Observando a Fig.4, como estudado na seção anterior, era esperado um comportamento aproximadamente retilíneo nesta faixa de frequência e isto foi verificado na Fig. 8. Analisando a Fig. 11 percebe-se que o segundo sinal de RF na frequência de 1,3 GHz (frequência fundamental de RF do canal 31) não foi observado. O sinal de RF do canal 31 continuou sendo gerado com potência igual a do canal 30 (- 4,68 dBm). Com isto, constata-se que não ocorre a diafonia na faixa de frequência de RF mesmo ocorrendo o crosstalk óptico, conforme a Fig. 9. Repetindo o procedimento aplicado para verificar o crosstalk na faixa de frequência de RF no canal 31 foi obtido o mesmo resultado para este nível de ruído. Cabe ressaltar que a diafonia óptica verificada na Fig. 9 tinha uma diferença entre os sinais de aproximadamente de 50 dB, o que possivelmente evitou a interferência mútua entre canais óticos e de RF. As frequências harmônicas da frequência fundamental gerada no canal 30 não aparecem. Isto era esperado tendo em vista que o nível do sinal de RF do canal 30 quando entra no MMZ não é grande o suficientemente em relação à tensão de polarização de meia onda deste modulador, o que confere um índice de modulação menor que 0,1. Na Fig. 11 aparece um sinal espúrio que não estava previsto e que permanecia mesmo com os equipamentos desligados, o mesmo foi interpretado como interferência e não influenciou na análise do resultado. IV. CONCLUSÃO A linearidade e a dispersão cromática podem limitar o ganho do enlace a fibra óptica por DWDM do sinal de RF. Observando os resultados percebe-se, por conta do comprimento do enlace de 1 km, que a dispersão e os fenômenos não lineares da fibra não influenciaram na transmissão dos sinais de RF. O ganho de potência de RF para este enlace a fibra óptica por DWDM foi aproximadamente -32 dB para a faixa de frequência de 0,3 a 3 GHz. Os resultados para o método de cálculo aplicando o Teorema de Adição de Graf e os resultados pela aproximação para pequenos sinais foram aproximadamente coincidentes, tendo em vista que, com o índice de modulação (mi) próximo de 0,10, não ocorre a transferência de energia da componente fundamental para as harmônicas. Cabe ressaltar, que se fosse necessário observar o comportamento dos sinais de RF para o caso de índice de modulações maiores, poderia ser avaliado com essa expressão desenvolvida com base no teorema de adição de Graf. Tornouse possível verificar que o enlace se apresenta aproximadamente linear graças ao respeito aos limites de potência óptica, dispersão e espaçamento entre canais ópticos sendo respeitados. Essa linearidade permite a fidelidade do sinal para esta aplicação. E com estes resultados, nesse estudo inicial, a possibilidade de emprego de enlace à fibra óptica por DWDM de sinais de RF em transmissão de sinais radar que dependam de banda larga (acima de 1GHz) sem distorções é factível. "
	}
