{
    "id": 80,
    "titulo": "fusão de decisões de sensoriamento espectral com pre-compensação sob erros de estimação de canal",
    "autor": "fernanda m. v. boas, dayan a. guimarães e guilherme p. aquino",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2018/st/ST_05_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "O conceito de rádio cognitivo (cognitive radio, CR) pode ser aplicado em sistemas táticos de uso militar e em redes de telecomunicação para uso em segurança pública. A reconfigurabilidade e a capacidade de uso oportunista de espectro por meio de sensoriamento espectral permitem aos CRs estabelecerem comunicação sem fio sem a necessidade de uma complexa infraestrutura de rede. Recentemente foi proposto um esquema de sensoriamento espectral cooperativo no qual as decisões locais tomadas pelos CRs em relação ao estado de ocupação do canal sensoriado são enviadas ao centro de fusão de forma simultânea, na mesma frequência e usando o conceito de pré-compensação dos ganhos dos canais entre CRs e o centro de fusão. Nesse artigo analisa-se o desempenho deste esquema sob a influência de erros na estimacão dos ganhos de canal. Demonstra-se que a regra de decisão por voto majoritário é pouco sensível a tais erros, sendo a mais atrativa para aplicação prática.",
    "texto": "I. INTRODUÇÃO O atual estágio de evolução das redes e sistemas de comunicação sem fio, aliado à elevada demanda por novos serviços e altas taxas de dados, seja para aplicação comercial ou militar, culminaram na escassez do espectro de radiofrequências. No entanto, muitas das faixas de frequência hoje alocadas aos sistemas de comunicação são subutilizadas, fato que cria a possibilidade de algum tipo de compartilhamento de banda. O conceito de rádio cognitivo (cognitive radio, CR) surgiu neste contexto, tendo sido considerado como uma possibilidade de aliviar a subutilização espectral [1]. Um dos objetivos de um CR é utilizar, de maneira oportunista, faixas de frequências licenciadas que estejam sendo subutilizadas, sem causar interferência prejudicial aos usuários que detêm a licença de uso destas bandas, denominados usuários primários (primary user, PU). Para atingir tal objetivo, o CR, neste caso considerado usuário secundário (secondary user, SU) faz uso de duas de suas principais habilidades: i) habilidade cognitiva, que lhe confere a possibilidade de coletar informações sobre o ambiente em que está inserido e ii) reconfigurabilidade, que lhe confere a possibilidade de se adequar dinamicamente a tal ambiente. Assim, os sistemas táticos de uso militar e os sistemas para uso em segurança pública podem se beneficiar do uso do CR para estabelecimento de redes de telecomunicações em qualquer lugar e a qualquer momento, sem a necessidade de uma complexa infraestrutura de rede para tal fim. O sensoriamento espectral [2] integra a habilidade cognitiva de um CR, permitindo-lhe encontrar bandas de frequência que não estão sendo ocupadas pelo PU em determinado momento e localização. Quando o CR encontra uma lacuna espectral, o mesmo pode utilizá-la para transmissão de dados na rede secundária. No entanto, quando o PU voltar a utilizar o canal sensoriado, o CR deve cessar sua transmissão a fim de não interferir na comunicação licenciada. Fatores inerentes aos sistemas de comunicações sem fio, como ruído térmico, desvanecimento multipercurso e sombreamento, podem elevar a incerteza na tomada de decisão dos CRs em relação ao estado de ocupação do canal sensoriado. Um erro de sensoriamento pode ser descrito pela situação na qual o canal sensoriado se encontra livre e o CR decide a favor da presença do sinal primário, ou pela situação na qual o canal sensoriado se encontra ocupado e o CR decide a favor da ausência do sinal do usuário licenciado na banda de interesse. Estas duas situações são denominadas de falso alarme e falha de detecção, respectivamente. Uma alta taxa de falso alarme diminui as chances de transmissões oportunistas dos CRs, enquanto uma alta taxa de falha de detecção pode causar interferência prejudicial nos PUs.  O sensoriamento espectral cooperativo (cooperative spectrum sensing, CSS) [3] se aproveita da diversidade espacial promovida por CRs geograficamente espaçados para reduzir a incerteza na tomada de decisão supracitada, diminuindo assim as taxas de falso alarme e de falha de detecção. Especificamente no caso das redes de rádios cognitivos com CSS centralizado e fusão de decisões, cada um dos CRs faz o sensoriamento individual de forma independente dos demais e depois transmite sua decisão para a unidade central da rede, denominada centro de fusão (fusion center, FC). O FC tem a função de combinar as decisões individuais (também chamadas de decisões locais) dos CRs e, por meio desta combinação, tomar uma decisão global sobre a presença ou ausência do sinal primário. Em seguida, o FC compartilha a decisão global com todos os CRs da rede secundária e dá-se o acesso à banda considerada desocupada. Nos esquemas CSS tradicionais há um canal dedicado entre cada CR e o FC para a transmissão das decisões locais, denominado canal de controle. Normalmente, alguma técnica de transmissão ortogonal é usada para fazer a separação entre as transmissões no canal de controle, por exemplo, por meio de multiplexação em frequência (frequency division multiplexing, FDM) ou multiplexação temporal (time division multiplexing, TDM). Nestas técnicas, o aumento no número de CRs em cooperação irá exigir um correspondente aumento nos recursos de comunicação: largura de banda dos canais de controle e consumo de energia. No entanto, este aumento vai na contramão de uma das principais premissas de um CR, que é o uso eficiente dos recursos de comunicação das redes. Várias abordagens de CSS que utilizam de maneira eficiente os recursos da rede já foram propostas na literatura científica. Uma revisão sobre algumas delas é apresentada em [4]. No presente contexto, destaque especial é dado ao esquema CSS introduzido em [5]. Nele, os CRs em cooperação transmitem suas decisões locais ao FC utilizando a mesma frequência e ao mesmo tempo. Como consequência, produz-se interferência intencional entre os sinais recebidos pelo FC, mas ainda é possível se tomar a decisão global sobre o estado de ocupação do canal sensoriado. Por outro lado, as transmissões simultâneas e na mesma banda trazem maior eficiência espectral ao uso do canal de controle. Visando melhorar o desempenho do sistema originalmente proposto em [5], em [6] é proposta uma alteração na regra de decisão original, sem significativa alteração de complexidade. Já em [7] é proposta uma técnica CSS com transmissão das decisões locais ao FC de forma simultânea e na mesma frequência, mas antes realizando-se pré-distorção do sinal com o objetivo de pré-compensar os ganhos do canal de controle. Tal técnica mantém a eficiência espectral do esquema proposto em [5], ainda permitindo que se obtenha melhor desempenho no sensoriamento espectral. É importante salientar que as três propostas supramencionadas necessitam que em alguma parte do sistema haja conhecimento do ganho de cada canal de controle, da variância de ruído térmico ou de ambos. Em [5] e [6], o FC deve conhecer os ganhos do canal de controle e a variância de ruído, enquanto em [7] os ganhos devem ser conhecidos pelos CRs, sem a necessidade da variância de ruído nos CRs ou no FC. Além disso, nessas propostas considera-se que, quando utilizados, os ganhos do canal de controle e a variância de ruído são perfeitamente conhecidos, ou seja, não são considerados os inerentes erros de estimacão destes parâmetros, os quais, por menores que sejam, sempre existem na prática. O impacto dos erros de estimacão dos ganhos do canal de controle e da variância do ruído na regra de decisão proposta em [6] foi investigado em [8]. Demonstrou-se que o desempenho desta regra pode ser severamente degradado devido a tais erros, principalmente no que se refere à incerteza sobre o canal de controle. Nesse artigo analisa-se o desempenho do esquema CSS com pré-compensação dos ganhos do canal de controle proposto em [7], sob influência de erros na estimacão destes ganhos, os quais degradam a pré-distorcão. Objetivando dotar a análise de um apelo prático, os erros de estimacão são modelados em consonância com o método de estimacão linear sob o critério do mínimo erro quadrático médio (linear minimum mean square error, LMMSE). A aderência com o LMMSE permite adequada amarração entre o grau de imprecisão da estimativa e a relação sinal-ruído na entrada do receptor onde a estimacão é realizada. O restante do artigo está assim organizado: A Seção II apresenta os conceitos fundamentais sobre os esquemas de referência propostos em [5] e [6]. Na Seção III é feita uma análise quanto ao modelo usado para simular os erros de estimacão dos ganhos do canal de controle. A Seção IV traz as curvas de desempenho do sensoriamento para o sistema com pré-compensação, sob influência de tais erros. Por fim, a Seção V traz as principais conclusões do trabalho e algumas oportunidades para futuras pesquisas. II. MODELOS DE SISTEMA Nesta seção abordam-se os dois sistemas adotados como referência para este artigo. O primeiro, denominado de original, é aquele proposto em [5]. O segundo, referenciado como sistema com pré-compensação, é aquele proposto em [7]. A. Modelo do sistema original No esquema CSS proposto em [5], cada um dos M CRs em cooperação verifica se o sinal primário está ou não presente, aplicando alguma técnica de sensoriamento espectral apropriada, por exemplo dentre aquelas tratadas em [2]. O k-ésimo CR, k = 1;: : : ; M, toma uma decisão local sobre o canal sensoriado, resultando em mk = 0 se o canal é considerado desocupado (hipótese H0), e mk = 1 se o canal é considerado ocupado (hipótese H1). Em seguida, a decisão local mk é mapeada em um símbolo BPSK (binary phase-shift keying) sk = (2mk − 1)√pEb, o qual é transmitido para o FC, sendo Eb a energia média por bit transmitido. Seja s = [s1; s2;· · · ; sM]T o vetor formado pelos símbolos BPSK transmitidos pelos M CRs e h = [h1; h2;· · · ; hM]T o vetor formado pelos ganhos complexos do canal de controle entre o k-ésimo CR e o FC. Como todos os M CRs transmitem suas decisões locais ao mesmo tempo e na mesma frequência, no FC os símbolos recebidos se somam de forma não-coerente. Assim, a amostra do sinal recebido pelo FC na saída do detector tem a forma em que (·)T denota a operação de transposição e w é uma amostra do ruído térmico presente no receptor do FC, modelado como um ruído aditivo Gaussiano branco (additive white Gaussian noise, AWGN) de média nula e variância N0 = σw^2 , em que N0 é sua densidade espectral de potência. As médias das amostras do sinal recebido, E[s_k], com E[·] denotando a operação de esperança matemática, correspondem a soma de variáveis aleatórias de Bernoulli, s_k, ponderadas pelo ganho complexo h_k do k-ésimo canal de controle, formando um conjunto de 2M símbolos complexos que correspondem às 2^M possíveis combinações das decisões locais dos CRs. Empregando a conhecida regra de fusão K-em-M, que define que a decisão global a favor de H1 deve ser tomada se pelo menos K dentre os M CRs decidirem localmente a favor de H1, estes 2M valores esperados para o sinal recebido podem ser classificados em dois grupos distintos, D1 e D0, que correspondem às hipóteses H1 e H0, respectivamente. De acordo com a regra de decisão proposta em [5], o FC irá decidir por H1 se e decidirá por H0 caso contrário. Note que a aplicação de (2) exige que o FC conheça a variância de ruído e os ganhos do canal de controle que constituem h. Na prática, a estimativa de h pode ser feita por meio do envio de sinais piloto no sentido dos CRs para o FC. Contudo, este processo exige grande quantidade de recursos de tempo ou frequência, uma vez que os sinais piloto de todos os CRs devem ser ortogonais entre si. A estimativa de σ_w^2 é mais simples, mas nem por isso trivial. B. Modelo do sistema com pré-compensação Como em [5], em [7] admite-se que os ganhos do canal de controle entre os CRs e o FC são conhecidos. No entanto, ao contrário de [5], estes ganhos são conhecidos apenas pelos CRs, e não pelo FC. Na prática, a estimativa destes ganhos pode ser feita por meio de um sinal piloto transmitido periodicamente do FC para os CRs. Neste sentido de transmissão exige menor quantidade de recursos de comunicação, uma vez que os sinais piloto podem ser enviados uma única vez em modo difusão (broadcast), ao invés do envio de vários sinais pilotos por canais ortogonais como feito no sentido de transmissão oposto. Os CRs utilizam os ganhos do canal de controle para pré-compensar totalmente as rotações de fase e pré-compensar parcialmente os módulos destes ganhos. Esta pré-compensação parcial é adotada, pois quando o canal apresenta valores baixos do módulo do ganho, a pré-compensação total pode levar o sinal transmitido a ter picos de amplitude proibitivamente elevados, o que é fator limitante para o projeto de amplificadores de potência no transmissor. Assim, considere que o ganho complexo do canal de controle entre o k-ésimo CR e o FC seja h_k = α_k * e^(jβ_k), em que α_k e β_k correspondem, respectivamente, aos valores do módulo e da fase do k-ésimo ganho do canal. Quando o canal apresentar baixos valores para α_k, a amplitude do sinal transmitido será limitada por influência de um limiar de ceifamento C. Na prática, este limiar é essencial para controlar a razão entre a potência máxima e a potência média (peak-to-average power ratio, PAPR) do sinal transmitido e, consequentemente, gerar símbolos com picos de amplitude baixos, aliviando as restrições de projeto dos amplificadores de potência [7]. O símbolo transmitido ao FC que representa a decisão local do k-ésimo CR, considerando o efeito da pré-compensação e ceifamento, é dado por: Onde E_b é a energia média por bit transmitido e ξ é um fator de normalização que garante a energia média por bit E_b para qualquer valor de C. Para um canal de controle com desvanecimentos Rayleigh (distribuição Rayleigh para α_k e distribuição uniforme para β_k), o valor de ξ é dado por: sendo E_1 a função integral exponencial de ordem unitária e Ω = E[|α_k|^2] para todos os k. Em [7] determina-se o valor ótimo do limiar de ceifamento C a partir de uma solução de compromisso entre a PAPR do sinal transmitido e o desempenho global do sensoriamento, em função dos demais parâmetros sistêmicos. Devido à pré-compensação e à transmissão simultânea das decisões locais, uma amostra do sinal recebido pelo FC é dada por: Diferentemente de (1), a partir de (5) nota-se que os sinais recebidos no FC se somam de forma coerente devido à pré-compensação total das rotações de fase produzidas pelo canal, e portanto r é real. Como importante consequência, a regra de decisão global se torna mais simples que (2), uma vez que pode ser efetuada por simples comparação de r com o limiar de decisão no FC, λ_FC, dado por: A decisão global será a favor de H1 se r ≥ λ_FC; caso contrário, a decisão global será a favor de H0. Note que a aplicação dessa regra de decisão não exige o conhecimento dos ganhos do canal de controle, nem tampouco da variância de ruído no FC. Entretanto, o conhecimento dos ganhos de canal se faz necessário nos CRs, onde a pré-compensação de acordo com (3) é realizada. Ressalta-se que a aplicação de (3) tal como definida necessita dos ganhos de canal reais <fh_k>, Contudo, na prática, em vez de <fh_k> utilizam-se suas estimativas <fĥ_k>. A próxima seção discorre sobre a modelagem de <ĥ_k>. III. MODELO DO ERRO DE ESTIMAÇÃO DE CANAL Comumente, a estimação de ganhos de canal é feita por meio da transmissão de sinais piloto [10], os quais são conhecidos pelo receptor. No entanto, a imperfeição inerente ao processo de estimação e a ação do rúıdo AWGN sobre os sinais piloto geram incerteza na a estimativa dos ganhos. Nesse artigo, o modelo matemático sugerido por [11], e também adotado em [8], é utilizado para simular os erros de estimativa dos ganhos do canal de controle, no esquema CSS com pré-compensação do canal. De acordo com este modelo matemático, a estimativa do ganho do canal entre o k-ésimo CR e o FC é dada por: onde hk é o ganho real do canal, k é uma amostra de uma variável aleatória Gaussiana complexa de média nula, variância σ^2_ε = E[|α_k|^2] e independente de hk, e ρ é o módulo do coeficiente de correlação complexo entre hk e ĥ_k [12]. O parâmetro ρ está associado à qualidade da estimação: para ρ = 0, o primeiro termo em (7) se anula, resultando em ĥ_k = β_k, que é a pior estimativa do ganho do canal; para ρ = 1, o segundo termo em (7) se anula, resultando na perfeita estimativa, ou seja, ĥ_k = hk. Um dos possíveis problemas que podem surgir na aplicação de (7) consiste na dificuldade de configuração de ρ de forma consistente com a prática. Por exemplo, é intuitivo esperar que a acurácia do processo de estimação de canal, aqui governada por ρ, dependa da razão sinal-ruído (signal-to-noise ratio, SNR) na entrada do receptor em que tal estimação é realizada. E, portanto, premente que se estabeleça a correta relação entre tais grandezas. Caso contrário, corre-se o risco de atribuir valores não realistas a ρ, mascarando os resultados de análises da influência dos erros de estimação na operação do sistema. Objetivando evitar este risco, nesse artigo os valores de ρ são determinados em função do desempenho do estimador LMMSE em função da SNR média por bit na entrada dos receptores dos CRs. Sem perda de generalidade e por simplicidade, admite-se que esta SNR seja igual àquela experimentada na entrada do receptor do FC, ou seja, Eb/N0. Considere que o FC periodicamente transmita para os CRs um sinal piloto com N símbolos representados por p[1]; p[2];...; p[N]. Admitindo que a duração da transmissão dos símbolos piloto é menor que o tempo de coerência [9, p. 222] do canal, os ganhos do canal de controle podem ser considerados aproximadamente constantes durante esse intervalo. Adicionalmente, admitindo que o tempo decorrido entre a estimação de canal e o início da transmissão dos CRs ao FC é também menor que o tempo de coerência do canal, o ganho que afeta os símbolos piloto é aproximadamente igual àquele que afeta os símbolos que transportam as decisões dos CRs.  Então, a én-ésima amostra do sinal piloto recebido pelo k-ésimo CR, para n = 1; 2;...; N, é dada por Em que ε_k [n] denota a n-ésima amostra de ruído térmico na entrada do receptor do k-ésimo CR.  A partir de símbolos piloto p[n] = pEb transmitidos pelo FC, para n = 1; 2;...; N, pode-se demonstrar [10, pag. 534] que o estimador LMMSE do k-ésimo ganho de canal computado pelo k-ésimo CR adquire a forma: em que σ_ε^2 é a variância de ε_k [n]; para k, n, σ_ε^2 e σ_h^2 = 1, representa ganho médio de potência unitário no canal de controle, de (10) obtém-se: E por meio de (11) que se estabelece a adequada relação entre a qualidade da estimativa dos ganhos do canal de controle, qualidade esta representada por ρ, e a SNR média por bit do sinal piloto recebido pelos CRs, Eb/N0.  IV. RESULTADOS NUMÉRICOS  Objetivando validar a expressão (11), a Fig. 1 apresenta os valores teóricos de ρ calculados por meio desta expressão e os valores de ρ computados por simulação de Monte Carlo, para N = 1, N = 5 e N = 25 amostras colhidas por um CR de referência, arbitrariamente escolhido como o CR de índice k = 1. Na simulação em questão, primeiramente o FC transmite N símbolos piloto p[n] = pEb, n = 1;...; N. Para o canal entre o FC e o CR de referência é gerado h_1 como sendo a realização de uma variável aleatória Gaussiana complexa de média nula e variância σ_h^2 = 1, correspondendo a um canal do tipo Rayleigh. No receptor do CR de referência são geradas as amostras de ruído ε_1[n], respeitando o valor da SNR média por bit desejada e o valor configurado de Eb, ou seja, σ_ε^2 = N0 = Eb (Eb/N0)^(-1). Assim, as amostras do sinal recebido pelo CR têm a forma definida em (8). De posse dessas amostras, o CR simula a estimativa LMMSE a partir da expressão (7), gerando ĥ_1. Para cada par de N e SNR este processo foi realizado 50.000 vezes, por fim computando-se o coeficiente de correlação ρ, entre os 50.000 valores de h_1 e ĥ_1. Em seguida, variou-se o valor da SNR, repetindo-se o processo supradescrito para gerar as curvas da Fig. 1. Observa-se na Fig. 1 a excelente aderência entre os resultados teóricos e simulados, validando-se assim a expressão (11). Observa-se também que à medida que a SNR do sinal piloto aumenta, eleva-se a correlação entre os ganhos real e estimado. Além disso, quanto mais amostras do sinal piloto forem coletadas por cada CR, maior será também esta correlação.  Para as análises seguintes sobre o desempenho do sensoriamento espectral, considerou-se um CSS com M = 5 CRs em cooperação, cada um equipado com um detector de energia [13] operando a partir de 1000 amostras e com relação sinal-ruído no canal de sensoriamento igual a -10 dB, valor este escolhido de forma a representar uma situação desafiadora, porém prevista na prática [14]. Vale relembrar que qualquer outra técnica de sensoriamento local poderia ter sido utilizada em vez da detecção de energia, sem produzir qualquer alteração nas conclusões obtidas. A detecção de energia foi escolhida por simplicidade.  As decisões locais são tomadas por cada CR comparando a estatística de teste do detector de energia com um limiar de decisão escolhido para que se atinja, no FC, o desempenho global desejado para o sensoriamento cooperativo. Tal desempenho é comumente avaliado por meio da curva característica de operação do receptor (receiver operating characteristic curve, ROC), a qual relaciona as probabilidades de falso alarme e de detecção à medida que é variado o limiar de decisão referente ao sensoriamento local. A probabilidade de falso alarme, Pfa, é a probabilidade de a decisão ocorrer a favor da presença do sinal primário na banda sensoriada, dado que, de fato, tal banda está desocupada. A probabilidade de detecção, Pd, é a probabilidade de uma decisão ser tomada a favor da presença do sinal primário, sendo que a banda sensoriada está de fato ocupada. Vale ressaltar que há um par Pd e Pfa referente ao sensoriamento local, e outro par associado ao sensoriamento global realizado a partir da combinação das decisões locais por meio da regra K-em-M. Obviamente, espera-se que haja melhoria de desempenho do sensoriamento devido à cooperação.  As decisões locais são mapeadas em símbolos pré-distorcidos de acordo com (3). Nessa expressão, o limiar de ceifamento ótimo é C = 3,7 quando M = 5 [7].  No FC, as amostras recebidas de acordo com (5) são comparadas com o limiar de decisão (6), determinado em função da regra K-em-M adotada, gerando a decisão global sobre o estado de ocupação da banda sensoriada. Aqui consideram-se os valores de K = 1, K = 3 e K = 5, correspondentes às regras de combinação lógica conhecidas respectivamente por OR, MAJ (voto majoritário) e AND.  Para o canal de controle adotou-se Eb/N0 = 4 = 6 dB, valor este que, a partir da Fig. 1 ou da equação (11), resulta nos seguintes valores de correlação entre ĥ_k e h_k : ρ ≈ 0,899 para N = 1, ρ ≈ 0,976 para N = 5, e ρ ≈ 0,995 para N = 25.  A Fig. 2 apresenta os desempenhos do sensoriamento espectral com e sem erros de estimacão do canal, para K = 1 (a), K = 3 (b) e K = 5 (c) na regra K-em-M, com M = 5 CRs em cooperação. O desempenho do sensoriamento local também é apresentado, permitindo notar os ganhos produzidos pela cooperação em algumas situações. Por exemplo, para K = 1 (OR) e K = 5 (AND) a cooperação trouxe ganhos apenas para alguns pares de Pd e Pfa, em quantidade significativamente menor que no caso de K = 3 (MAJ).  Em todos os casos considerados na Fig. 2, o ganho de cooperação é reduzido à medida que se degrada a qualidade da estimativa dos ganhos do canal de controle, o que acontece à medida que ρ diminui. Pode-se notar que a regra de fusão MAJ é significativamente menos sensível aos erros de estimativa dos ganhos de canal que as regras OR e AND. Para que estas últimas produzam ganho de cooperação, é necessário que o processo de estimativa de canal seja extremamente preciso.  A quantidade de amostras coletadas dos sinais piloto recebidos nos CRs também afeta diretamente o desempenho do sensoriamento espectral. De forma geral, quanto maior essa quantidade, melhor o desempenho do sistema.  Na Fig. 2, a SNR do sinal piloto recebido nos CRs e a SNR dos sinais que transportam as decisões locais recebidos no FC foram fixadas em 6 dB. Obviamente, aumentando-se uma, a outra, ou ambas, espera-se que os desempenhos de todas as regras de fusão melhorem, no primeiro caso devido à melhoria na precisão das estimativas de canal e no segundo devido à redução na probabilidade de erro de decisão global.  A SNR do sinal primário recebido nos CRs foi configurada em -10 dB, fixando-se assim a posição da ROC do sensoriamento local. O aumento desta SNR também produz melhoria de desempenho do sensoriamento global, pois beneficia a acurácia do sensoriamento local.  Como complemento da análise via curvas ROC, a seguir apresentam-se resultados de análise por meio da mínima probabilidade de erro de decisão global. Como cada ponto de uma curva ROC representa um par Pd e Pfa, cada ponto refere-se a uma probabilidade de erro de decisão dada por: em que PH1 e PH0 denotam as probabilidades do sinal primário estar ativo ou inativo na banda sensoriada, respectivamente. Portanto, a mínima probabilidade de erro é encontrada para o par Pd e Pfa que minimiza Perro.  A Fig. 3 apresenta o desempenho global do sensoriamento espectral em termos da mínima probabilidade de erro de decisão para o esquema com pré-compensação sob erros na estimativa dos ganhos do canal de controle, novamente para K = 1 (a), K = 3 (b) e K = 5 (c), considerando M = 5, C = 3,7 e Eb/N0 variável. Os valores PH0 = PH1 = 0,5 foram adotados por representarem a máxima incerteza sobre a atividade do transmissor primário. Para cada valor de Eb/N0, o correspondente valor de ρ foi computado por meio de (11), para que os erros de estimativa de canal pudessem ser corretamente produzidos de acordo com (7).  Os resultados mostrados na Fig. 3 confirmam as conclusões obtidas por meio da Fig. 2, adicionalmente demonstrando que o aumento da SNR no canal de controle propicia melhor qualidade na estimativa dos ganhos do canal de controle e, portanto, melhora o desempenho global do sensoriamento espectral. Nota-se por meio da Fig. 3(b) que a regra de fusão MAJ atinge mínima Perro aproximadamente igual a 0,04, que é dado pelo par Pfa = 0,04 e Pd = 0,96, para valores de SNR acima de 5 dB, aproximadamente, e N = 25 amostras. As regras de fusão OR e AND atingem valores de mínima Perro iguais a 0,1 e 0,08 para valores de N = 25 e de SNR acima de 13 e 11 dB, respectivamente. V. CONCLUSÕES E OPORTUNIDADES  O presente artigo analisou o desempenho do sensoriamento espectral cooperativo para a fusão de decisões com pré-compensação dos ganhos do canal de controle quando há erros nas estimativas destes ganhos. A análise realizada revelou que as regras de fusão OR e AND são significativamente mais sensíveis à imprecisão das estimativas que a regra MAJ, a qual se mostrou mais robusta frente a esta imprecisão.  Foi também possível concluir que, mesmo com erros de estimativa, o esquema de sensoriamento cooperativo com pré-compensação usando a regra de fusão MAJ consegue atingir uma probabilidade de erro de decisão baixa, inferior a 0,05, mesmo em uma condição de baixa SNR do sinal sensoriado e em uma condição de SNR do canal de controle dentro de valores práticos. Por fim, verificou-se a importância de se acoplar o modelo de erros de estimativa definido em (7) a valores realistas do coeficiente de correlação entre os ganhos estimados e os ganhos reais, em função da SNR e do número de amostras do sinal piloto utilizado para estimacão, de acordo com (11).  Como oportunidades de pesquisas relacionadas ao tema desse artigo, citam-se: i) a adoção de um cenário no qual o ruído térmico e potências de sinal recebido podem não ser uniformes devido a diferentes temperaturas de operação e circuitos, e a diferentes distâncias entre os CRs e o FC, considerando variações temporais destas grandezas devido à mobilidade dos nós da rede primária e da rede cognitiva; ii) a análise de sensibilidade a erros de estimativa de canal aplicando-se critérios de estimacão diferentes do LMMSE. "
}