{
    "id": 82,
    "titulo": "parametrização dos filtros passa-baixas de sistemas de sondagem de canal por correlator deslizante",
    "autor": "luís antônio ribeiro scudeler e dayan adionel guimarães",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2017/st/ST_08_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Correlatores deslizantes são comumente utilizados para sondagem de canais de comunicação sem fio, resultando em grande capacidade de rejeição de interferências e redução nas exigências de hardware para medidas em banda larga quando comparados com outras técnicas. Este artigo apresenta resultados de uma análise experimental sobre a influência da frequência de corte e do fator de forma dos filtros passa-baixas que compõem o correlator deslizante, e também da relação sinal-ruído, no desempenho do sistema de sondagem. Os resultados apresentados servem como diretrizes de projeto de tais filtros, com base na faixa dinâmica e no erro quadrático médio alcançados pelo sistema. Tais resultados ratificam algumas regras de projeto recomendadas na literatura e retificam ou complementam outras.",
    "texto": "I. INTRODUÇÃO A pesquisa e o desenvolvimento de sistemas de comunicação sem fio, sejam para uso civil ou militar, são sempre precedidos pela caracterização do canal através do qual o sinal será transmitido. Em outros termos, pode-se dizer que as mais fortes restrições ou imposições com relação ao projeto de um sistema de comunicação são postas pelo canal de comunicação. A adequada modelagem do canal é a etapa de projeto que permitirá que o sistema seja dimensionado em busca da adequação do sinal transmitido a esse canal, de forma a viabilizar a comunicação frente às suas adversidades. A caracterização do canal de comunicação é uma das mais importantes fases em busca de sua modelagem. Ela permite que sejam extraídos parâmetros que serão utilizados para a construção de modelos estocásticos, empíricos, determinísticos ou uma combinação destes, nos domínios do tempo, frequência e espaço [1]–[3]. Modelos empíricos são construídos a partir de medidas dos parâmetros do canal por meio de técnicas de sondagem (channel sounding). Já os modelos determinísticos fazem uso da caracterização física dos fenômenos de propagação de forma que se determine matematicamente a função de transferência do canal. Os modelos estocásticos ou estatísticos consideram o canal como sendo representado por uma série de fenômenos modelados por variáveis aleatórias e, como consequência, a função de transferência do canal é determinada em termos estocásticos. O correlator deslizante (sliding correlator) [4]–[6] vem sendo utilizado há décadas na composição de sistemas para sondagem de canais de comunicação em geral, principalmente de canais de comunicação sem fio, permitindo que se obtenha a resposta ao impulso desses canais e, a partir dela, as informações estocásticas que os caracterizarão nos domínios temporal, da frequência e espacial. Suas principais vantagens são a grande capacidade de rejeição de interferências e a redução nas exigências de hardware para medidas em banda larga quando comparado com outras técnicas de sondagem. A principal desvantagem reside em restrições de tempo real no tocante às admissíveis taxas de variação de parâmetros do canal de forma que esses possam ser devidamente capturados e rastreados pelo sistema de sondagem. O receptor da técnica de sondagem por correlator deslizante tem como principais componentes um gerador de sequência pseudo-aleatória e dois multiplicadores (mixers) seguidos de filtros passa-baixas. As entradas dos multiplicadores são as componentes em quadratura do sinal recebido e a sequência pseudo-aleatória gerada com taxa diferente daquela utilizada na transmissão do sinal de sondagem. Os filtros tem o papel de atenuar as parcelas indesejadas contidas nos sinais de saída dos multiplicadores. As características dos filtros passa-baixas têm grande influência no desempenho final do sistema de sondagem, embora isto seja pouco investigado na literatura especializada [7]. Buscando contribuir com o preenchimento dessa lacuna de informações, este artigo apresenta resultados de uma análise experimental sobre o impacto da frequência de corte e do fator de forma dos filtros, bem como da relação sinal-ruído (RSR), no desempenho global do sistema de sondagem. Os resultados apresentados servem como diretrizes de projeto desses filtros, com base na faixa dinâmica e em medidas de erro quadrático médio alcançadas pelo sistema de sondagem. As demais seções deste artigo estão assim organizadas: na Seção II são brevemente revisados os principais fundamentos sobre o correlator deslizante. A Seção III discorre sobre as regras gerais de projeto dos filtros passa-baixas do dispositivo. Resultados numéricos e discussões sobre a influência da RSR e dos parâmetros dos filtros no desempenho do sistema de sondagem são apresentados na Seção IV. A Seção V conclui o artigo. II. FUNDAMENTOS SOBRE O CORRELATOR DESLIZANTE Esta seção tem por objetivo apenas tornar o artigo autocontido. Detalhes sobre o funcionamento do correlator deslizante e de toda a cadeia de processamento do sinal de sondagem e de sua recepção podem ser obtidos em [6], referência em que esta seção está baseada. A Fig. 1 mostra o diagrama de blocos simplificado de um sistema de sondagem com correlator deslizante. Em resumo, no transmissor (Tx) o sinal de sondagem é formado pela modulação BPSK (binary phase-shift keying) de uma portadora de radiofrequência (RF) por uma sequência pseudo-aleatória do tipo PN (pseudo-noise), periódica, de comprimento N chips por período e taxa Rc chip/s. No receptor (Rx), o sinal recebido é transladado, resultando nas suas componentes em fase (in-phase, I) e em quadratura (quadrature, Q), em banda-base, após o par intermediário de mixers e filtros passabaixas. Os elementos principais do sistema de sondagem que compõem o correlator deslizante são justamente o gerador de sequência PN de taxa Rc0 < Rc e comprimento N, o par de mixers mais à direita e os subsequentes filtros passa-baixas. Sejam x(t) e x0(t) as formas de onda das sequências PN com taxas Rc e Rc0 < Rc, respectivamente, e y(t) a forma de onda em banda-base do sinal recebido pelo sistema de sondagem. Admita inicialmente que o canal entre transmissor e receptor seja perfeito (sem ruído, sem desvanecimento e nãodistorcivo). Neste caso, y(t) = x(t) e x0(t) são aplicados às entradas do mixer do ramo superior do correlator deslizante, o qual servirá como referência para esta análise inicial. À entrada do correspondente filtro é aplicado o sinal p(t) = x(t)x0(t) que, após algum algebrismo [6], pode ser representado por em que f1 = 1=(NTc) e f2 = 1=(NTc0), com Tc = 1=Rc e T 0 c = 1=Rc0 ; X1(f) e X10 (f) são as transformadas de Fourier de x1(t) e x0 1(t), respectivamente, com x1(t) e x0 1(t) representando apenas um período das sequências PN x(t) e x0(t), respectivamente. A transformada de Fourier de p(t), a qual tem seu módulo ilustrado na Fig. 2 para sequências de comprimento N = 31 e relação de taxas Rc0 = 0;99Rc, é dada por em que δ(z) é a função delta de Dirac.  Para que se facilite a interpretação da Fig. 2, note que (1) pode ser reescrita como a soma de duas parcelas, o que é feito separando os termos em u = −k dos termos em u 6= −k no somatório à direita dessa equação, resultando em em que qd(t) é a representação temporal da parte central do espectro de P (f), aqui denotada como parcela desejada, e qi(t) é a correspondente representação das partes à direita e à esquerda da parte central, denotadas como indesejadas. Demonstra-se em [6] que a parcela central do espectro ilustrado na Fig. 2 é a densidade espectral de potência de x(t) comprimida na frequência de um fator de compressão (ou dilatação, conforme a referência) γ = Rc=(Rc −Rc0 ); esse fator é usualmente denominado de sliding factor na literatura em Inglês. A transformada de Fourier inversa dessa parcela corresponde à função de autocorrelação Rx(τ) da sequência x(t), porém dilatada no tempo, ou seja, qd(t) = Rx (t=γ). As partes marcadas como indesejadas no espectro ilustrado na Fig. 2 geram auto-interferência na parte desejada, pois não representam informação útil no processo de sondagem de canal. Portanto, o papel do filtros passa-baixa do correlator deslizante, com resposta ao impulso h(t), é atenuar a autointerferência correspondente a qi(t), fazendo com que em sua saída se tenha p(t)∗h(t) ≈ qd(t) = Rx (t=γ), em que ∗ denota a operação de convolução. Agora admita que o sinal transmitido passou por um canal multipercurso com resposta ao impulso c(t) = PL l=1 αlδ (t − τl), desconsiderando-se a rotação de fase por facilidade de análise, sendo αl a atenuação e τl o atraso do l-ésimo percurso de propagação, e L o número de percursos. Nesse caso, na ausência de ruído térmico, o sinal recebido em banda-base é y(t) = PL l=1 αlx(t − τl), e o correspondente sinal na saída do correlator deslizante é Como a função de autocorrelação de uma sequência PN dentro de um período se assemelha a um impulso (quanto maior N e menor Tc, maior a semelhança [8]), nota-se que a parte da direita de (4) é uma versão aproximada da resposta ao impulso c(t) do canal, dilatada de γ no tempo. Em suma, na presença de rotação de fase no canal multipercurso e também de ruído térmico e de outras interferências no receptor do sistema de sondagem, pelo exposto concluise que a saídas dos dois ramos do correlator deslizante no diagrama da Fig. 1 serão estimativas das partes real e imaginária da resposta ao impulso complexa do canal, dilatada de γ segundos. III. REGRAS GERAIS DE PROJETO DOS FILTROS Observando novamente a Fig. 2, nota-se que não é possível remover completamente as partes indesejadas da parte desejada por meio de filtragem passa-baixas, pois todas têm banda infinita, se sobrepondo. O filtro não bloqueará a parte interferente situada na sua banda de passagem e atenuará não somente as partes interferentes situadas em sua banda de rejeição. Assim, tanto a frequência de corte quanto o fator de decaimento (fator de forma, ou fator de roll-off) na transição da banda de passagem para a banda de rejeição terão influência no desempenho final do sistema de sondagem. Embora haja vários tipos de filtro passa-baixas, diferentes filtros com características similares em termos de frequência de corte de fator de forma proporcionarão desempenhos similares. Então, no que tange ao tipo de filtro utilizado no correlator deslizante, vale a regra de buscar, se possível, magnitude da resposta em frequência plana e fase linear dentro de sua faixa de passagem. A Fig. 3 mostra a magnitude da resposta em frequência de filtros passa-baixas com diferentes fatores de forma. A resposta do gráfico ilustrado na parte superior da figura ilustra a definição de fator de forma em termos da taxa de decaimento do ganho do filtro em função da frequência, o que se mede tipicamente em dB/oitava (o aumento de 1 oitava na frequência corresponde ao dobro do valor de referência). Já na resposta do gráfico inferior da Fig. 3, o fator de forma β é definido como o excesso fracionário de banda a partir da frequência de corte de um filtro ideal para o qual β = 0. Neste artigo adota-se a definição de fator de forma em termos de β. Já a frequência de corte fc de um filtro passa-baixas pode seguir qualquer das várias definições para o termo largura de faixa [8, p. 162]. Aqui adota-se a frequência a partir da qual o ganho de tensão do filtro é a metade do ganho máximo; como exemplo, no gráfico inferior da Fig. 3 tem-se fc = 10 Hz para os três valores de β em questão. A escolha dos parâmetros N e γ do correlator deslizante tem influência no dimensionamento do parâmetros dos filtros. Note que o primeiro nulo da envoltória espectral central na Fig. 2 ocorre em f = Rc=γ [6]. Portanto, quanto menor γ para um dado N, maior a sobreposição em frequência entre as partes desejada e indesejada, o que afeta o desempenho dos filtros. Por outro lado, como o primeiro pico da envoltória espectral associado à parte indesejada ocorre aproximadamente em 1=(NTc) [6], quanto maior o valor de N menor é o espaçamento entre as parcelas interferentes e a parcela central desejada, o que também influencia o projeto do filtro que, pra esse caso, terá que ter baixo fator de forma β. IV. RESULTADOS NUMÉRICOS E DISCUSSÕES Nesta seção são apresentados resultados numéricos sobre a influência da frequência de corte e do fator de forma dos filtros, bem como da RSR, no desempenho do sistema de sondagem de canal, permitindo a elaboração de regras específicas de projetos desses filtros. As métricas de desempenho escolhidas são: i) o erro quadrático médio (EQM), medido em volt2, entre o sinal de saída do correlator deslizante para um canal AWGN (additive white Gaussian noise) e a função de autocorrelação dilatada da sequência PN dentro de um período (denominada função ideal), e ii) a faixa dinâmica (FD) do correlator deslizante, a qual mede a capacidade do dispositivo discriminar componentes de multipercurso com intensidades diferentes, ou, equivalentemente, mede a capacidade do dispositivo detectar componentes de multipercurso de baixa intensidade. A faixa dinâmica é definida como a razão entre a magnitude de pico do sinal qd(t) obtido por filtragem e a magnitude de pico da auto-interferência qi(t) remanescente [6]. O EQM e a FD estão relacionados com a precisão na estimativa da resposta ao impulso do canal. A opção de análise experimental com ambas neste artigo tem por objetivo identificar se uma é mais relevante que a outra para o projeto dos filtros passa-baixas do correlator deslizante. O sistema de sondagem completo, em banda-base, foi implementado na plataforma de simulação computacional de sistemas dinâmicos VisSim/Comm [9], versão 8.0, com sequências PN de comprimento N = 31 e taxas Rc = 1000 chip/s e Rc0 = 0;99Rc = 990 chip/s, implicando em γ = 100. Os dados obtidos a partir da simulação foram exportados para o Matlab, onde foram computados os valores de FD e EQM. Sem perda de generalidade, os filtros passa-baixas adotados como referência na presente análise experimental são do tipo cosseno elevado (raised cosine) com janelamento (windowing) retangular, implementados como filtros FIR (finite impulse response) com n derivações (taps). A escolhe de tal tipo de filtro se deu pela facilidade de controle da sua frequência de corte e do seu fator de forma, além, é claro, de se tratar de um filtro simples e amplamente utilizado na prática. Os valores de FD reportados nesta seção foram obtidos pela média das FDs de 320 respostas ao impulso. Os valores de EQM foram computados como a média de 320 valores de EQM calculados a partir de 6200 pontos em cada resposta ao impulso estimada pelo correlator deslizante. Na Fig. 4 é ilustrado o sinal qd(t) ideal (teórico), e sua versão aproximada, esta obtida por filtragem passa-baixas do sinal p(t), admitindo que y(t) = x(t) foi aplicado à entrada do correlator deslizante. Para esse exemplo, o filtro cosseno elevado tem fc = Rc=γ = 10 hertz e β = 0;05, de forma a simular, aproximadamente, a parametrização considerada ideal na literatura [6]. Nota-se que o sinal qd(t) obtido por filtragem assemelha-se bastante ao sinal qd(t) ideal. A diferença entre eles é medida pelo EQM; a relação de picos que define a FD é medida a partir do sinal qd(t) obtido por filtragem. Nas Tabelas I e II são listados os números de derivações n do filtro cosseno elevado em função do fator de forma β e da frequência de corte fc, respectivamente. Esses números foram escolhidos de tal forma que os menores lóbulos das correspondentes respostas ao impulso do filtro tenham amplitudes de pico (em módulo) 100 vezes menor (−40 dB) que o valor do pico máximo, o qual corresponde ao pico do lóbulo principal. Esse critério de escolha garante que n abarque a parte mais significativa da resposta ao impulso do filtro sintetizado, sem que se utilize um valor excessivo ou insuficiente para n. Vale lembrar que na prática o número de derivações tem relação direta com a complexidade de implementação do filtro e, portanto, o critério aqui adotado tem significância de ordem prática. Na Fig. 5 são mostrados os valores de EQM e FD em função da RSR. Na parte superior desta figura a frequência de corte dos filtros foi configurada com o valor recomendado fc = Rc=γ = 10 Hz, e com valores abaixo e acima deste, respectivamente 8 e 20 Hz. Na parte inferior da Fig. 5 analisase EQM e FD em função da RSR com β = 0;05, 0;5 e 1. Como esperado, à medida que a RSR aumenta o EQM diminui e a FD aumenta. Isso se deve ao fato de que quanto menor a intensidade de ruído, mais o sinal na saída do filtro se assemelha ao sinal qd(t) ideal ilustrado na Fig. 4. Por outro lado, maiores valores de RSR dão ao correlator deslizante maior capacidade de detectar componentes de multipercurso com amplitudes pequenas, o que é característico de uma FD elevada. De acordo com a Fig. 5, independentemente da frequência de corte e do fator de forma, tanto o EQM quanto a FD tendem a se estabilizar para valores de RSR maiores que 20 dB, indicando que a partir desse valor a auto-interferência residual na saída dos filtros passa a dominar ambas as métricas, em vez do ruído. O valor de RSR a partir da qual essa dominância passa a ocorrer depende não somente do desempenho dos filtros, mas também dos parâmetros sistêmicos, principalmente N, Rc e γ [6]. Vale também observar que tanto o EQM quanto a FD possuem variações monotônicas, permitindo afirmar que estas são métricas igualmente adequadas quando se considera o quesito RSR. Na parte superior da Fig. 5 nota-se que a maior FD e o menor EQM foi obtido com fc = 8 Hz, valor ligeiramente inferior que o tipicamente recomendado na literatura, que é fc = Rc=γ, cujo valor é 10 Hz na presente análise. Para fc < 8 Hz a FD se torna menor e o EQM maior; essa situação não está mostrada na parte superior da Fig. 5. Por meio do gráfico ilustrado na parte inferior da Fig. 5 observa-se que maiores fatores de forma β são preferidos quando se deseja maior influência do aumento da RSR no aumento da FD e na diminuição do EQM, mais notoriamente acima de 20 dB. Essa é uma constatação até certo ponto surpreendente, pois um fator de forma elevado produz mais distorção do sinal filtrado na banda de passagem do filtro, ao mesmo tempo atenuando menos a parcela de auto-interferência na banda de rejeição. Do ponto de vista de projeto, vale ressaltar que um filtro FIR do tipo cosseno elevado com alto fator de forma é mais simples de ser implementado que um filtro com baixo fator de forma, pois o número necessário de derivações do primeiro será menor, conforme se conclui por meio da Tabela I. Como se sabe, essa afirmação também vale para outros tipos de filtro: transições menos abruptas da banda de passagem para a banda de rejeição estão normalmente associadas a filtros de menor ordem, os quais são menos complexos que aqueles com ordens mais elevadas. Na Fig. 6 os valores de EQM e FD são apresentados em função da frequência de corte fc do filtro passa-baixas. Na parte superior da Fig. 6 analisa-se esse cenário para três valores de RSR, 5, 10 e 20 dB. Na parte inferior da Fig. 6 consideramse três valores para o fator de forma β, 0;05, 0;5 e 1. De forma geral, à medida que a frequência de corte aumenta, maior é a influência da parcela interferente qi(t) no sinal na saída do correlator deslizante (rever Fig. 2), fazendo com que seja aumentado o EQM entre esse sinal e o sinal qd(t) ideal, ambos ilustrados na Fig. 4. Por outro lado, o aumento da frequência de corte eleva os valores interferentes fora dos picos desejados em qd(t), reduzindo a FD do sistema de sondagem, com isso reduzindo a capacidade de detecção de componentes de multipercurso com amplitudes pequenas. Conforme também constatado por meio do gráfico ilustrado na parte superior da Fig. 5, observa-se no gráfico ilustrado na parte superior da Fig. 6 que o mínimo EQM e a máxima FD são obtidos para fc ≈ 8 Hz, o que representa uma ligeira redução em relação ao valor tipicamente recomendado na literatura, que para o caso seria fc = Rc=γ = 1000=100 = 10 Hz [4]. Esta observação também pode ser realizada por meio do gráfico ilustrado na parte inferior da Fig. 6, mas de forma menos evidente. Embora tanto a FD quanto o EQM tenham revelado os mesmos fenômenos, nota-se que o mínimo EQM é ligeiramente mais notável que a máxima FD e, portanto, recomenda-se o primeiro como métrica mais adequada para se analisar a influência da frequência de corte dos filtros passabaixas no desempenho do sistema de sondagem por correlator deslizante. Ainda com relação à Fig. 6, note no gráfico ilustrado na parte superior que a influência da frequência de corte dos filtros passa-baixas no desempenho do correlator deslizante, na região de maior interesse (maiores FDs e menores EQMs), é mais facilmente medida em altos valores de RSR. Recomendase, portanto, que se procure elevar a RSR do sistema quando o quesito frequência de corte dos filtros for analisado. Por meio do gráfico ilustrado na parte inferior da Fig. 6 nota-se que a escolha do fator de forma não tem grande influência na análise do impacto da frequência de corte no desempenho do correlator deslizante, concluindo-se que qualquer valor de β pode ser utilizado em tal análise. Por fim, a Fig. 7 apresenta os valores de EQM e FD em função do fator de forma β dos filtros passa-baixas. Na parte superior da Fig. 7 analisa-se este cenário para três valores de fc , 8, 10 e 20 Hz. Na parte inferior da Fig. 7 atribui-se à RSR os valores 5, 10 e 20 dB. De forma geral, nota-se que as variações absolutas nos valores de EQM e FD não são tão proeminentes quanto aquelas reveladas sob a influência de diferentes RSRs (Fig. 5) e diferentes frequências de corte (Fig. 6). Assim, do ponto de vista de otimização do funcionamento do sistema, tem-se a importante conclusão de que o fator de forma não precisa ser pequeno ou, equivalentemente, a transição entre a banda de passagem e a banda de rejeição não precisa ser abrupta. Isto facilita o projeto dos filtros, os quais poderão ter baixa complexidade de implementação devido à possibilidade de redução de suas ordens ou de seus números de derivações. Além disso, nota-se que o quesito fator de forma pode ser analisado sob uma elevada gama de diferentes valores de frequência de corte e de relação sinal-ruído, o que proporciona liberdade de projeto nesse aspecto. V. OBSERVAÇÕES FINAIS Neste artigo foram apresentados resultados de análise da influência dos parâmetros dos filtros passa-baixas que compõem o correlator deslizante, e também da RSR, no desempenho do sistema de sondagem, este medido em termos do EQM e da FD do dispositivo. Algumas importantes diretrizes de projeto puderam ser retificadas, confirmadas ou complementadas em relação àquelas já disponíveis na literatura. Como mais importantes conclusões, primeiramente destaca-se que tanto o EQM quando a FD são métricas adequadas para dar suporte ao projetos dos filtros, com ligeira vantagem do EQM, principalmente quando se analisa o impacto da frequência de corte no desempenho do correlator deslizante. Verificou-se ainda que o valor ótimo para a frequência de corte está ligeiramente abaixo daquele normalmente adotado na literatura, que é fc = Rc=γ. Verificou-se também que a transição entre a banda de passagem e a banda de rejeição dos filtros não precisa ser abrupta, permitindo reduzir suas complexidades de implementação devido à possibilidade de redução de suas ordens ou de seus números de derivações. Como extensão do presente trabalho, medidas de FD e EQM em um correlator deslizante real poderiam enriquecer ainda mais as conclusões aqui reportadas. A análise de diferentes tipos de filtro é também algo interessante de se realizar, principalmente como forma de ratificar que as conclusões apresentadas neste artigo são também aplicáveis a filtros diferentes do filtro cosseno elevado. Filtragem não linear e o uso de otimização também representam interessantes oportunidades de investigação no que tange o projeto dos filtros do sistema de sondagem por correlator deslizante.  "
}