{
    "id": 83,
    "titulo": "modelo matemático de um circuito ativo capaz de cancelar capacitâncias parasitas em circuitos semicondutores híbridos",
    "autor": "luiz eduardo schiller e dr. lester de abreu faria",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2017/st/ST_02_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Fotodetectores Infravermelhos a Poços Quânticos (QWIPs, em inglês) têm como saída correntes muito baixas, da ordem de nA. Como geralmente são feitos por materiais das famílias III-V, que não são utilizados em aplicações CMOS regulares (Si, família IV), é necessário hibridização. Os pads de conexão introduzem altas capacitâncias, que podem drenar grande parte da corrente gerada pelo sensor. No presente trabalho, um circuito ativo anteriormente proposto pelos autores e capaz de compensar esse efeito foi modelado matematicamente a fim de referenciar futuras implementações e permitir otimizações de desempenho, área e potência. Tal abordagem faz parte de um projeto complexo e multidisciplinar que visa a integração de sensores e que se mostra de alta relevância para a FAB, na medida em que permeia áreas bélicas e de imageamento, permitindo ser aplicada em mísseis, câmeras infravermelhas e detectores de diferentes aplicações.",
    "texto": "  I. INTRODUÇÃO Na maioria dos dispositivos nos quais a saída é uma corrente, o sinal deve ser processado por um outro circuito, que realiza sua leitura e condicionamento de acordo com os requisitos do sistema. Isto é especialmente verdadeiro para os Fotodetectores Infravermelhos a Poços Quânticos (QWIPs, em inglês). Nestes, o sinal de saída é de corrente muito baixa (da ordem de nA), o que demanda altas performances do circuito integrado de leitura e condicionamento de sinal (ROIC), a fim de tornar o dispositivo útil [1]. Geralmente, a interface entre QWIPs e ROICs é crítica porque os elementos sensíveis (pixels - famílias de semicondutores III-V) são geralmente feitos por materiais não usados em aplicações CMOS regulares (Si, família IV), requerendo hibridização. Para ter uma corrente confiável e obter uma resposta linear, os efeitos dos pads de ligação entre esses dois materiais semicondutores devem ser levados em consideração ao projetar o ROIC. Pads introduzem Capacitâncias parasitas (da ordem de 1.3pF, para pads analógicos) que podem ser muitas ordens de magnitude maiores do que as capacitâncias do circuito de condicionamento (ordem de décimos de pF), resultando em distorção do sinal imediatamente antes de sua leitura. Muitos esforços têm sido feitos para minimizar esta capacitância parasita e para criar uma capacitância nula para o pad em diferentes aplicações, dentre as quais podem-se citar lasers e dispositivos ópticos [2], cartões de transceptor de alta frequência [3], placa de circuito impresso multicamada de alta frequência [4], e testes de chip [5]. Na maioria dos casos é necessário implementar modificações de processo para a estrutura PAD, causando alterações na configuração de camadas e seus contatos. Apesar de as técnicas serem sofisticadas e, em alguns casos, muito complexas, ainda há uma capacitância residual baixa parasita que poderia ser intolerável no caso de implementações como o QWIP-ROIC. Uma opção de circuito [6] capaz de reduzir drasticamente os efeitos da capacitância parasita introduzida pela ligação de hibridização de pads foi anteriormente proposta, podendo este circuito ser implementado não somente em integração de semicondutores por meio de pads, mas ainda em qualquer circuito onde as correntes sejam baixas e as capacitâncias sejam capazes de deteriorar a qualidade da resposta do circuito. Apesar de seu potencial, o circuito foi apresentado de maneira qualitativa a partir de um exemplo funcional. Dessa forma, o presente trabalho visa a desenvolver um modelamento matemático do circuito em pauta, o qual permita a sua otimização em termos de desempenho, área, e potência; e com isso uma implementação prática mais eficiente, fazendo parte de um projeto complexo e multidisciplinar que visa a integrac¸ão de sensores e que se mostra de alta relevância para a FAB, na medida em que permeia áreas bélicas e de imageamento, permitindo ser aplicada em mísseis, câmeras infravermelhas e detectores de diferentes aplicações.  A. Circuito de interesse A entrada do circuito de interesse consiste em uma fonte de corrente que pode ser dividida entre a corrente de escuro Id, constante e gerada independentemente de estímulo do sensor, que deve ser cancelada; e a corrente útil Inet, produto dos estímulos, que deve ser aproveitada ao máximo. Na transmissão da corrente para o ROIC, a capacitância do pad, Cpad, liga o nó de entrada ao terra, conforme a Fig. 1. O ROIC pode ser abstraído como um integrador, desde que a tensão de integração não ultrapasse o limite de operação linear. Este modelamento visa a uma integração do sinal, convertendo a fotocorrente em uma tensão de saída. No presente trabalho, o ROIC será tratado como uma caixa preta, sendo desnecessário, nesse entendimento, avaliar a dinâmica de funcionamento do mesmo. O pad é uma fonte de perturbação no sistema, drenando parte da corrente de carregamento e diminuindo a excursão da tensão de saída, como se pode observar comparando as Figuras 2 e 3; fato este que distorce o sinal de saída, fazendo com que o mesmo perca a linearidade com os estímulos de entrada.  B. Circuito de cancelamento de capacitância O circuito da Figura 4 dispõe os elementos do cancelador de capacitância. Sua principal função é manter a tensão v1 constante para uma dada excursão da corrente útil Inet. Uma vez identificada sua aplicação, é necessário compreendê-lo a fundo para identificar suas limitações e poder implementá-lo da maneira mais eficiente possível. Por isso, será detalhado o equacionamento desse sistema na Seção II. O circuito foi modelado utilizando a ferramenta gratuita LTSPICE [7] com vista a geração de e figuras e verificação dos cálculos. II. EQUACIONAMENTO Considera-se que os tempos de propagação dos transistores sejam insignificantes no presente contexto. Definem-se as correntes i1 = Inet+Id, entrada do circuito no ponto v1; ix, iy, in, e i3 as correntes que passam pelos transistores Mx, My, Mn, e M0, respectivamente; i4 = ix + iy, i2 = i3 + i4 e, finalmente, a corrente i5, que carrega o capacitor Cpad, resultante de i1−i2. O transistor Md atua em saturação como fonte de corrente, com tensão de gate Vd selecionada para drenar Id, a corrente de escuro do sensor utilizado. M0, sujeito a tensão V0 no gate, pode se encontrar em modo de transcondutância ou saturação. A. M0 em transcondutância Neste modo de operação, ocorre uma dinâmica temporal em que a tensão v1 determina a tensão v2, que por sua vez determina a tensão v3, e finalmente é possível calcular v_1, fechando o ciclo de uma equação diferencial conforme resumido em (1). No primeiro caso, como i3 = Id, tem-se (2). Presumindo-se V0, VT P , Id, e β0 pre-fixados, infere-se v2 como função de v1 (6), e sua derivada (7). Os transistores Mn, Mx, e My são responsáveis por drenar a corrente i4, que pode ser dividida em ix e iy. O transistor Mn recebe a tensão v2 no gate como entrada, o que define a tensão v3 de modo que ix = in. Mx necessariamente está saturado, Mn pode estar em corte, transcondutância ou em saturação.  M0 em transcondutância e Mn em corte: Se v2 alcançar um ponto suficientemente baixo, o transistor Mn pode ser cortado, anulando a corrente i4. Para esta condição se manter, é necessário que Inet seja nula. M0 e Mn em transcondutância: No primeiro caso, tem-se (10), de onde se obtém v3 em função de v1 (16). E também a sua derivada em relação à v1 (19) e o valor de i4 (20). M0 em transcondutância e Mn em saturação: Caso Mn esteja em saturação, em vez de (16), (19), e (20), tem-se (23), (24), e (26). Dinâmica de v1: Presumindo-se que ambos os transistores do espelho de corrente formado por Mx e My estejam em saturação, tem-se (27). Disso, segue um valor determinado para i4 conforme (29), e (20) ou (26). Como i3 = Id, tem-se i2. Finalmente, subtraindo-se i2 de i1, resta i5, a corrente que carrega o capacitor Cpad. Em outras palavras, tem-se a derivada de v1 no tempo, conforme (31). Modelo linear do circuito de cancelamento de capacitância: Para linearizar o sistema, é necessário definir o ponto de operação. Partindo de uma corrente Inet constante, e de (31), tem-se (34), definindo um ponto de derivada nula, uma vez que v3 é função de v1. Definam-se x0 = v1, x0' = v_1 = 0; e x = v1 − x0. De acordo com (29), i4 é função de v1. Assim, pode-se definir y0 = Inet e y = i4 − y0. A relação entre v1 e i4 pode ser reescrita em (35) e (36): onde (37) é a solução da equação diferencial ordinária de primeira ordem descrita em (36). Ela indica que quanto maior o valor da constante k, mais rápida é a regulação do circuito, e em maior frequência ele pode operar. Uma análise de otimização do circuito se dá na Seção III.  B. M0 em saturação Neste modo de operação, como será demonstrado, v1 depende apenas de Id, v3 se ajustará para que i4 seja igual a Inet, v2 também se ajusta para que in = ix e o circuito se encontre em equilíbrio. Ou seja, todas as variáveis são constantes no tempo para um conjunto de entradas que recaia neste modo de operação. Isso se resume em (38). Se M0 se encontrar em saturação, tem-se (39), levando a v1 constante em (40). Note que, nesta situação, v2 possui um intervalo no qual pode variar livremente sem interferir com o escoamento da corrente de escuro.  M0 em saturação e Mn em corte: Conforme (8):  M0 em saturação e Mn em transcondutância: Presume-se que v2 está ajustado para que i4 = Inet e tem-se (45). De (40), pode-se inferir (46). Dá-se, assim, calcular o valor de v2 necessário para regular Mn em (47).  M0 e Mn em saturação: Caso Mn também esteja em saturação, em vez de (47), tem-se (49).  C. Limites da operação do circuito Tendo estabelecido as condições de operação, cabe levantar os pontos de transição entre os modos, bem como a sequência de inicialização do circuito. A começar de uma condição inicial em que o mesmo encontra-se desligado, com v1(0) = 0.  Inicialização do circuito: Nesse caso, v2 iria a zero para cortar Md, a fonte de corrente responsável por drenar a corrente de escuro Id, cortando também Mn, resultando em toda a corrente i1 escoando para o capacitor, que se carrega de acordo com (51) até que v1 se tornar alto o bastante para permitir a passagem de uma corrente i3 não-nula. Após essa fase, v1 ainda está muito baixo, o que permite, mesmo em saturação, a passagem de uma corrente menor que Id, de modo que Md não está em saturação, e para isso nos encontramos com um v2 baixo. Na medida em que v1 aumenta, v2 também aumenta para permitir mais corrente por Md conforme (53) até que (52) não seja mais válida.  É necessário garantir que i4, a corrente que passa pelo outro ramo do circuito, não seja alta o suficiente para o circuito entrar em equilíbrio neste ponto, o que implicaria a corrente de escuro ser repassada ao ROIC. A única maneira de garantir isso para Inet = 0 é se Mn ainda estiver em corte no ponto mínimo de operação. Conforme (54), isso ocorre desde que se satisfaça (55). Se isso for garantido, então independente do modo de operação, v2 alcançará um valor acima do ponto mínimo para que i3 = Id; desde que v1 não necessite estar acima da máxima tensão possível para o correto funcionamento das fontes de corrente de entrada. Fronteiras entre os modos de operação: O ponto de fronteira entre os modos de operação de M0 em corte, transcondutância e saturação podem ser determinados por (8) e (56). Partindo de M0 em saturação, se Inet for suficientemente alta, a tensão v3 necessária para Mx conduzir a corrente desejada diminui. Em contrapartida, v2 precisará subir para aumentar a condutância de Mn, podendo então atingir o ponto limite para Mn passar de saturação para transcondutância, o que ocorre quando se satisfaz (57). Nesse processo, v2 pode alcançar o nível máximo para que M0 esteja em saturação. O valor limite de Inet para que isso ocorra pode ser conferido por meio de (47) ou (48), assumindo (56). Assim, se i4 < Inet, entra-se na região em que M0 está em transcondutância, e a dinâmica muda de uma adaptação instantânea de v2 ao valor necessário para escoar Inet para a equação diferencial descrita em (31).  Entrada e saída do circuito: Considera-se que a fonte de correntes Inet e Id na entrada do circuito apenas funcionem corretamente se a tensão de entrada se mantiver abaixo de um v1MAX, o qual será tratado como uma saturação simples no cálculo das dinâmicas, se for o caso.  Para que o espelho de corrente formado por Mx e My opere corretamente, é necessário que ambos estejam em saturação, o que se cumpre desde que seja garantido (59), limitando a tensão de entrada do ROIC. Após a fase de integração, o ROIC fecha a entrada, implicando i4 = ix, uma vez que iy = 0. O circuito deve ser projetado para que o capacitor não seja carregado, mesmo nessa circunstância, ou que o tempo de reset do ROIC seja suficiente para restabelecer a condição operacional.  III. OTIMIZAÇÃO De posse das condições necessárias para o correto funcionamento do circuito, resta apenas avançar para a otimização do mesmo.  São recursos consumidos pelo circuito: a área do mesmo e a potência elétrica. A área S pode ser determinada, de forma simplificada, pela soma das dimensões dos transistores utilizados (60), se possível considerando terminais compartilhados. A potência elétrica pode ser determinada por (61). Cabe ressaltar que a mesma equação se aplica ao sensor utilizado como entrada. Assim sendo, a potência consumida pelo circuito total depende apenas da tensão de referência VDD utilizada pelo sensor e das correntes Id e Inet geradas, independentemente do circuito anulador de capacitância (63). O produto do circuito é a corrente iy, que vai para o ROIC. Quanto maior essa corrente, maior é a frequência com que ele opera. Dito isso, um dos objetivos é maximizar a relação βy=βx do espelho de corrente. No entanto, se isso for levado ao extremo, o ramo de Mx não será capaz de conduzir a corrente Inet na sua totalidade, carregando o capacitor do pad durante a fase em que o ROIC não está recebendo corrente. Isso pode ser compensado pelo aumento do tempo de reset do ROIC, o que, por sua vez, reduziria o tempo disponível para leitura, que é o seu propósito final.  Outro fator relevante, o limite máximo de v4, foi especificado em (59). Isso indica que a tensão máxima de integração, a qual se deseja a maior possível, está limitada por v3. v3, por sua vez, depende de v1 (45), pois seu valor deve ser tal que i4 = Inet, em equilíbrio. Finalmente, o valor de v1 depende de V0 e β0, além das características de Mn, que podem requerer um v2 proibitivamente alto e estão sujeitas a limitações operacionais do sensor de entrada. Outro fator que pode elevar o valor de v3 é o aumento das transcondutâncias de Mx e My.  Quanto a Mn, é desejável, portanto, que seja altamente condutivo, de modo a exigir mínima excursão por parte de v2. Md necessita apenas satisfazer (55) e permitir uma corrente útil nula, estabelecendo assim o valor mínimo para v2.  Também é necessário que o valor máximo possível para Inet seja maior ou igual ao valor máximo que o sensor seja capaz de produzir. Isso é uma condição restritiva para o projeto deste sistema.  Dada a característica de instantaneidade da operação do circuito com M0 em saturação, é desejável operar nesse modo. No entanto, pode ser possível miniaturizá-lo se necessário, aceitando, em contrapartida, a dinâmica de primeira ordem apresentada em (37). Nesse caso, é possível delimitar o menor k em (35) e (37) aceitável e otimizar para esse valor.  Apresentados os objetivos acima, tem-se o previsível conflito entre a área utilizada e o desempenho do circuito.  IV. CONCLUSÕES E TRABALHOS FUTUROS  No presente trabalho, foi feita uma análise minuciosa do circuito de cancelamento de capacitância apresentado. Com isso, foram identificadas as condições limitantes de sua operação, os meios de melhorar seu funcionamento, os parâmetros a serem ajustados e os custos associados. A partir desse equacionamento, é possível então se desenvolver uma ferramenta computacional que permita otimizar cada um dos parâmetros de interesse, trabalho esse em desenvolvimento pelo grupo de pesquisa. Esse software proporcionará a exata dimensão do espaço de projeto disponível para o circuito, bem como os circuitos mais eficientes para determinadas restrições de área e desempenho.  Cabe ressaltar que, apesar de poder ser otimizado, o circuito ainda está sujeito às limitações de fabricação e dos sistemas externos de entrada e saída. Assim, mesmo com a otimização, ainda não deve ser descartada a possibilidade de construção de outros circuitos, conceitualmente distintos. Tudo isso faz parte de um projeto complexo e multidisciplinar que visa à integração de sensores e que se mostra de alta relevância para a FAB, na medida em que permeia áreas bélicas e de imageamento, permitindo ser aplicada em mísseis, câmeras infravermelhas e detectores de diferentes aplicações. "
}