{
    "id": 84,
    "titulo": "demonstrador de um sistema mage com a antena do p-95 e processamento em tablet",
    "autor": "rafael g. licursi de mello, , fernando r. de sousa, cynthia junqueira,  e adilson chinatto, ",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2017/st/ST_08_3.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 3,
    "resumo": "Um demonstrador de Sistema de Medidas de Apoio à Guerra Eletrônica (MAGE) baseado em Rádio Definido por Software (RDS) com processamento em tablet e aplicação da antena do MAGE da aeronave P-95 é apresentado. Experimentos apontaram que o sistema, quando confrontado com emissões características de sinais de radar, foi capaz de detectar pulsos e seus parâmetros com uma taxa de erro em torno de 0,05 % quando apenas um sinal era recebido ou quando um ambiente eletromagnético complexo era simulado. O sistema também foi capaz de detectar pulsos sobrepostos, além de identificar emissores simulados segundo dados pré- cadastrados. Os resultados deste trabalho sugerem que a capacidade de processamento dos tablets e a abordagem da tecnologia RDS já permitem, atualmente, que Sistemas MAGE operem embarcados nestes dispositivos portáteis e convenientes.",
    "texto": "I. INTRODUÇÃO Um Sistema de Medidas de Apoio à Guerra Eletrônica (MAGE) com tecnologia de Rádio Definido por Software (RDS) e processamento em tablet foi proposto em [1]. Tal concepção, baseada em Rádio Definido por Software (RDS), permite que um front-end de RF (radiofrequência) seja controlado através de interface USB e um processamento digital de sinais seja programado em dispositivos do tipo tablet. As características dos tablets são citadas em [2] por proporcionarem vantagens de portabilidade, furtividade, baixo custo e consumo de energia para o MAGE proposto. O caráter comercial dos componentes envolvidos em um sistema como este torna-o menos suscetível a embargos de outras nações, o que é conveniente para situações de resistência em guerras assimétricas, exceto pela exigência de antenas de banda ultralarga (UWB – ultra-wideband). A Fig. 1 ilustra seu emprego em um Teatro de Operações genérico. Este artigo apresenta a implementação de um demonstrador de Sistema MAGE na concepção supracitada com o emprego da antena UWB do MAGE da aeronave P-95. Também foram empregados um RDS modelo NooElec RTL-SDR™ [3] e um tablet Microsoft Surface Pro 4™ [4]. O processamento deinterleaving, responsável por detectar parâmetros básicos dos pulsos e, através deles, organizá-los, foi programado em Matlab® [5]. O algoritmo foi baseado na convolução de um pulso com as derivadas dos sinais recebidos, e não através de um histograma de amostras como ocorreu em [2], o que permitiu a detecção de pulsos sobrepostos, sendo esta uma contribuição deste trabalho. Experimentos mostraram que o demonstrador pôde, em um ambiente eletromagnético denso, detectar pulsos com taxa aproximada de erro de 0,05 % e indicar emissores coerentes cadastrados em uma Biblioteca de Missão (BIM). Muitos radares operam fora da faixa de operação do RTLSDR, qual seja de 24 a 1766 MHz; além disso, este RDS possui apenas um canal de recepção – e é impossível a medição do ângulo de chegada (AOA – angle of arrival) com apenas uma antena do P-95, que não é diretiva o suficiente e exige a aplicação de arranjos [6]; todavia, o objetivo deste estudo, inicialmente, foi de processar diversos sinais com características típicas de radar, isolados ou simultâneos, a partir de parâmetros como frequência da portadora (Fc – frequency of carrier), largura de pulso (PW – pulse width) e intervalo de repetição de pulsos (PRI – pulse repetition interval), de forma a provar que a capacidade de processamento dos tablets já permite a concepção de um MAGE embarcado; o objetivo final é implementar, no futuro, um front-end de RF com vários canais de recepção para medição do AOA e operação na faixa de frequências de 2 a 40 GHz. II. MATERIAIS E MÉTODOS A Fig. 2 demonstra a arquitetura idealizada de um Sistema MAGE genérico [6]. As características dos tablets possibilitam que eles desempenhem as funções de processador, banco de dados e tela de vídeo, podendo, inclusive, acionar funções especiais através de sua interface USB. A Fig. 3 ilustra como foi consolidada a arquitetura da Fig. 2 no demonstrador de MAGE. Após a recepção dos sinais pela antena do MAGE do P-95, o RTL-SDR efetua um tratamento inicial nos sinais recebidos, amostra-os e envia-os para o Surface Pro 4. O tablet realiza, em Matlab, o processamento deinterleaving, a comparação dos parâmetros extraídos com parâmetros pré- registrados na BIM e a programação da projeção dos dados para sua tela. A. Antena do MAGE do P-95 Para utilização da antena UWB do MAGE do P-95, recuperou-se, nas reservas da Força Aérea Brasileira, uma unidade outrora considerada inutilizável. A Fig. 4 mostra a adaptação e a soldagem de um conector SMA após o balun da antena para extração do sinal de RF. B. RDS Modelo NooElec RTL-SDR A versão do RTL-SDR utilizada foi a NESDR, baseada no sintonizador R820T2 e no demodulador RTL2832U. Como em receptores do tipo super-heteródino, ocorre um batimento dos sinais recebidos com o sinal de um oscilador controlado por tensão no R820T2, transladando-os para uma frequência intermediária (FI). Logo após, o RTL2832U digitaliza o sinal em FI com taxa de conversão analógicodigital, em operação estável, de 28,8 MHz e realiza uma demodulação complexa. Uma decimação de fator 12 converte a taxa de amostragem para 2,40 MHz, que proporciona uma faixa de passagem de -1,2 a +1,2 MHz. Os dados são enviados para o Surface Pro 4 através do USB 3.0 [7]. C. Tablet Microsoft Surface Pro 4 Este dispositivo está equipado com um processador Intel Core i7-6650U™ de 6a geração e 4 MB de memória cache, além de 16 GB de memória RAM e interface USB 3.0 [4]. D. Processamento Deinterleaving Este processamento consiste em discriminar pulsos e seus parâmetros, organizá-los e atribuí-los a diferentes emissores [8]. O sistema, entretanto, precisa lidar com a questão do que exatamente seria um pulso. A solução deste desafio começa com a aplicação de um limiar de amplitudes, que garante que apenas sinais que o excedam sejam processados, evitando que, por exemplo, oscilações devidas ao ruído térmico sejam levadas em consideração. O horário de início de cada pulso (TOA – time of arrival) pode ser identificado pelo horário no qual ocorre uma derivada positiva. O horário de término, pelo horário da primeira derivada negativa com módulo semelhante à derivada positiva inicial. Um limiar de derivadas garante que oscilações leves em cada pulso não sejam interpretadas como outros pulsos. Em função do tempo de subida e de descida do pulso, seu início ou término pode estar dividido em duas ou mais amostras; portanto, antes de todo esse processo, o vetor de derivadas é convoluído com um pulso para que resulte em um vetor de médias no qual as operações são efetuadas. Os procedimentos acima identificam, inclusive, pulsos sobrepostos, diferente do que ocorria em [2]. Como o RTL-SDR possui apenas um canal de recepção e o demonstrador do MAGE não é capaz de medir o AOA, a organização dos pulsos não ocorreu a partir desse parâmetro, e, sim, de uma varredura de Fc, seguida de PW (que seria o horário de término do pulso subtraído de seu TOA) e PRI (subtração do TOA de um pulso e o TOA do pulso anterior que tenha mesma Fc e PW). E. Geradores de Sinais de Radar Para emissão dos sinais, no experimento de validação, foram empregados um gerador de sinais R&S®SMA 100A da Rohde & Schwarz [9] e um RDS de modelo USRP® B200 da Ettus Research [10]. A operação básica do sistema frente a pulsos gerados em um dispositivo confiável foi verificada com o R&S®SMA 100A. Contudo, ele não pode emitir mais de um sinal ao mesmo tempo e para testar a recepção de um cenário eletromagnético mais complexo, o USRP foi empregado. Os sinais gerados pelo R&S®SMA 100A foram radiados por uma antena patch array em microfita, desenvolvida domesticamente, enquanto os gerados pelo USRP o foram por uma antena log de marca WA5VJB [11]. F. Montagens Na Montagem 1, o demonstrador de MAGE foi posicionado frente ao R&S®SMA 100A, como exibe a Fig. 5. A antena emissora e o R&S®SMA 100A estão à direita. A antena do P-95 está instalada no suporte à esquerda, enviando, através de um cabo coaxial, os sinais recebidos para o RTL-SDR, que se situa ao fundo conectado no tablet. A Montagem 2 apresentou uma disposição semelhante à da Montagem 1, porém com o USRP e a antena log emitindo no lugar do R&S®SMA 100A e da antena patch array, como demonstra a Fig. 6. A Fig. 7 deixa conexões entre a antena do MAGE do P-95, o RTL-SDR e o tablet Microsoft Surface Pro 4 explícitas na Montagem 2. G. Medições Para diminuir os efeitos das reflexões no recinto e a resposta não-linear dos componentes, sinais de baixa potência foram empregados. No R&S®SMA 100A, foi gerado um emissor de cada vez e o MAGE tinha que os receber e identificar com facilidade. Já no experimento com o USRP, o caso foi mais complexo: diversos sinais foram emitidos simultaneamente e o sistema necessitou agrupar pulsos com parâmetros semelhantes. O desafio, contudo, consiste no fato de o demonstrador possuir apenas um canal de recepção e não poder iniciar a discriminação de cada sinal através do AOA. Além disso, nesse segundo caso, o emissor, USRP, possui apenas um oscilador e os sinais emitidos simultaneamente estavam sempre na mesma Fc – outro parâmetro importante que não pôde ser empregado pelo processamento deinterleaving. Em resumo, o sistema receptor teve que discriminar sinais apenas pela PW e pelo PRI. III. RESULTADOS Na Montagem 1, para a configuração do emissor em Fc = 1,5 GHz, PW = 5 μs e PRI = 100 μs e taxa de amostragem de 2,8 MHz no MAGE (acima da faixa de operação estável do RTL-SDR), ocorreu detecção e organização de pulsos e parâmetros conforme Tabela I, ordenada pelo 1o TOA. Nela, Fc está em gigahertz, Amplitude em miliwatts, PW em microssegundos, PRI, 1o TOA e Último TOA em segundos; a coluna #Detec indica quantas vezes um pulso com características semelhantes foi detectado. A Tabela 1 mostra que o limiar de amplitudes foi superado quando a varredura de Fc passou por 1,5 GHz. O primeiro sinal listado apresenta PW = 5 μs e PRI = 100 μs, características coerentes com aquelas do sinal configurado no R&S SMA 100A. Ele foi detectado 72.345 vezes. Os outros sinais medidos, incoerentes com o que foi configurado no emissor, totalizaram 45 detecções, o que representa 0,06 % do total. As características do sinal configurado no R&S SMA 100A estavam descritas na BIM do demonstrador de MAGE como sendo de um emissor hipotético denominado Radar Fragata. O sistema identificou-o corretamente como ilustra a Fig. 8. Ela também mostra a Transformada Rápida de Fourier (FFT – Fast Fourier Transform) do sinal medido em determinado instante. É possível observar o primeiro nulo da função sinc em 200 kHz, o que é coerente com a PW configurada no gerador. Na Montagem 2, inicialmente foram programados dois sinais com sobreposição de seus pulsos. Ambos possuíam Fc = 1,2 GHz e PRI = 1 ms. Todavia, um deles apresentava PW = 100 μs e o outro PW = 20 μs. A Fig. 9 ilustra, no domínio do tempo, em banda-base, com amplitude em miliwatts e tempo em milissegundos, como esses pulsos sobrepostos foram recebidos no MAGE.A Tabela II, com parâmetros de mesmas unidades que os da Tabela I, sumariza como os pulsos sobrepostos, agora ordenados pelo #Detec, foram interpretados pelo demonstrador de MAGE. Os dez sinais detectados mais vezes são mostrados. O sinal detectado mais vezes (18.432 ocasiões) é coerente com o sinal configurado com PW = 100 μs. O segundo e o terceiro sinais detectados mais vezes são coerentes com o sinal configurado no USRP com PW = 20 μs (o segundo sinal apresenta um erro na acurácia da medição de PW de 3,5 % e o terceiro sinal de 9 %). Eles foram detectados 16.627 vezes no período da medição, o que significa que 1.805 pulsos sobrepostos não foram detectados (9,79 % do total). Ainda na Fig. 9, o pico de amplitude dos dois sinais sobrepostos corresponde a aproximadamente 0,25 mW; entretanto, como demonstrado pela Tabela II, a técnica de detecção de pulsos baseada em derivadas foi bem-sucedida em discriminar a amplitude correspondente a cada um dos pulsos separadamente (0,17 mW do pulso com PW = 100 μs e 0,8 mW do pulso com PW = 20 μs). Os demais pulsos totalizaram 3.881 detecções (contando não apenas os mostrados na Tabela II, mas todos os sinais registrados). Eles eram incoerentes com as emissões do USRP e representam 9,97 % do total. Posteriormente, na Montagem 2, foram emitidos diversos sinais pulsados simultaneamente, sem que nenhuma sobreposição de pulsos fosse imposta. Conforme os sinais eram configurados e emitidos pelo USRP, o demonstrador de MAGE varria Fc, detectando pulsos e identificando emissores caso sinais fossem coerentes com a BIM. A Tabela III, também ordenada pelo #Detec, sumariza a detecção para uma taxa de amostragem de 2,6 MHz na recepção, quando os seguintes sinais foram emitidos, todos com Fc = 800 MHz e PRI = 400 μs: PW = 3 μs, PW = 5 μs, PW = 10 μs e PW = 40 μs. O primeiro sinal da tabela é coerente com aquele de PW = 10 μs. O segundo, com o de PW = 40 μs. O quarto e o quinto sinais são coerentes com o sinal de PW = 5 μs (sendo que o quinto sinal apresenta 7,60 % de erro de acurácia na medição). O terceiro e o sexto sinais com o de PW = 3 μs (sendo que o terceiro apresenta erro de acurácia na medição de 10,33 % e o sexto de 2,67 %). A soma de #Detec da terceira e da sexta linhas superou o #Detec dos demais sinais – isso ocorreu devido a redundâncias intencionais na contagem dos pulsos considerando parâmetros de tolerância de comparação no algoritmo. Os demais pulsos medidos somam 13 detecções e representam 0,04 % do total. A identificação dos emissores segundo a BIM ocorreu de acordo com o esperado novamente. IV. DISCUSSÃO Na Montagem 1, o demonstrador de MAGE detectou as emissões do R&S SMA 100A em sua grande maioria com acurácia. O equipamento também identificou o sinal como sendo de um emissor pré-cadastrado em sua BIM. Os 0,06 % de sinais espúrios que apareceram podem ter sido originados, dentre outros, por:  distorção devido a não-linearidade dos componentes do sintonizador R820T2 do RTL-SDR;  baixa acurácia do conversor analógico-digital no demodulador RTL2832U do RTL-SDR;  reflexões no recinto; e  características de desempenho do algoritmo de detecção de pulsos baseado na convolução de um pulso com as derivadas dos sinais recebidos. Ao deparar-se com pulsos sobrepostos, o MAGE apresentou a capacidade de detectá-los, perdendo 9,79 % dos mesmos. Caso o algoritmo baseado em derivadas tenha contribuído de alguma forma para diminuir a acurácia na medição dos sinais pulsados, este resultado mostra que ocorreu uma boa relação entre a capacidade de detectar pulsos sobrepostos e o prejuízo da acurácia. Ao confrontar um ambiente eletromagnético um pouco mais complexo, simulado pelo USRP, o MAGE também conseguiu identificar os pulsos e seus diversos parâmetros, com apenas 0,04 % de sinais espúrios medidos, identificando os diversos emissores cadastrados na BIM quando sinais coerentes eram emitidos. Os resultados sugerem que a capacidade de processamento dos tablets e a abordagem de recepção e processamento de sinais proporcionada pela tecnologia RDS já permitem, nos dias de hoje, que Sistemas MAGE possam operar embarcados nestes dispositivos portáteis e convenientes. Em trabalhos futuros, para o equipamento se tornar operacional, os seguintes passos devem ser implementados:  aplicar um RDS com no mínimo dois canais de recepção para possibilitar a medição do AOA azimutal e fazer com que o processamento deinterleaving inicie a organização dos pulsos a partir desse parâmetro – para eliminação de ambiguidades, são necessários, no mínimo, três canais; e  aplicar um RDS com faixa de frequências condizente com a faixa dos radares de interesse – entretanto, nos dias atuais, não existem RDS capazes de operar em frequência de 40 GHz, sendo necessário o desenvolvimento de um front-end de RF adequado para estender a faixa de frequências de operação. V. CONCLUSÃO A proposta de [1] era desenvolver um Sistema MAGE com tecnologia RDS embarcado em dispositivos do tipo tablet. A partir daquele conceito, um demonstrador desse tipo de sistema foi implementado utilizando a antena do Sistema MAGE do P-95, o RDS modelo NooElec RTL-SDR e o tablet Microsoft Surface Pro 4. O algoritmo do processamento deinterleaving foi implementado em Matlab com base na convolução de um pulso com as derivadas dos sinais recebidos, o que conferiu ao equipamento a capacidade de detectar pulsos sobrepostos, diferente do que ocorria em [2]. Experimentos demonstraram que pulsos emitidos, primeiramente, por um gerador Rohde & Schwarz R&S SMA 100A e, posteriormente, por um RDS modelo USRP B200 foram recebidos, detectados e identificados pelo demonstrador de MAGE, com taxa de erro de 0,05 % aproximadamente. Ademais, emissores pré-cadastrados em uma BIM foram indicados quando as características dos sinais detectados foram coerentes. Por fim, foram estabelecidos os próximos passos necessários para tornar este demonstrador um equipamento operacional.   "
}