	{
		"id": 86,
		"titulo": "simulação da redução dos efeitos da dispersão cromática em enlaces ópticos pela indução do fenômeno não linear auto modulação de fase (spm)",
		"autor": "Rogerio Barbosa Marques, Joaquim José Barroso de Castro e José Edimar Barbosa Oliveira",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2017/st/ST_11_3.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 1,
		"resumo": "Os enlaces ópticos possibilitam a transmissão de sinais em frequências ópticas (THz) modulados por sinais elétricos de mais baixa frequência (GHz), com aplicação direta em sistemas radar. No entanto, a dispersão cromática é um fenômeno presente na fibra óptica que provoca o desvanecimento cíclico da potência do sinal detectado. Neste trabalho, foi demonstrado por meio de simulação que a indução do fenômeno não linear SPM (Self Phase Modulation) reduz os efeitos da dispersão cromática, pois o balanço entre esses dois fenômenos resulta na amplificação paramétrica das bandas laterais de modulação. Com o aumento da potência óptica da fonte laser para +10 dBm foi possível deslocar em 5 km os pontos de nulos da potência detectada.",
		"texto": " I. INTRODUÇÃO A Força Aérea Brasileira possui destacamentos de controle do espaço aéreo cujos equipamentos estão instalados remotamente, sendo que o fluxo de dados com os centros de controle deve ser confiável e com alta taxa de transmissão. Em áreas de Defesa, é de interesse a transmissão de sinais radar por enlaces de fibra óptica entre o centro de processamento e as antenas localizadas remotamente (Fig.1). Tal estratégia proporciona segurança técnica e operacional aos equipamentos, uma vez que a inabilitação, falha, desativação de alguma antena não comprometeria a operação de todo o sistema de defesa. Outra vantagem da rede distribuída de radar é obter informação do alvo de múltiplas perspectivas, tornando-se uma medida contra aeronave stealth e aumentando a cobertura radar e o ângulo de resolução [1]. O Laboratório de Guerra Eletrônica (LabGE) do ITA possui o gerador de ameaças radar Excalibur, que é um equipamento eletrônico programável para testes de simulação e geração de cenários de sinais radar de alta densidade dentro de uma banda de frequência de 0,5 a 18,0 GHz. Tal equipamento foi adquirido para apoiar a pesquisa e o ensino, bem como dar suporte às demandas de avaliações operacionais de sistemas de GE, testes e validações de bibliotecas de missão e receptores embarcados [3], sem deslocar o equipamento para campo. As demandas citadas podem ser atendidas com a técnica de radiofrequência (RF) em Fotônica, que é uma área do conhecimento aplicado, baseada na Fotônica, utilizada para processar, transmitir e gerar sinais de RF através de sistemas ópticos [4]. A fibra óptica possui características adequadas para conectar os componentes do sistema de RF em Fotônica. Possui largura de banda elevada, baixa imunidade a interferências eletromagnéticas e reduzida atenuação se comparada aos cabos coaxiais. Entretanto, à medida que o comprimento do enlace óptico aumenta, o efeito da dispersão cromática limita a transmissão pela fibra óptica porque distorce o pulso pelo espalhamento dispersivo [5]. A modulação da portadora óptica pelo sinal de RF resulta em bandas laterais no espectro de frequência. A fibra óptica é um meio dielétrico cujo índice de refração é função da frequência. Como o pulso óptico é formado por componentes espectrais, os comprimentos de onda propagam-se na fibra com diferentes velocidades. Esse atraso resulta no espalhamento do pulso que dificulta a recuperação da informação devido à modulação intersímbolo quando se trata de enlace óptico digital. Considerando um enlace óptico analógico, a dispersão cromática ocasiona o desvanecimento da potência do sinal de RF fundamental detectado. No final do enlace, um fotodetector quadrático efetua o batimento das componentes do pulso óptico, cujas fases passam por diferentes deslocamentos, para recuperar o sinal de RF. Se as fases estão opostas, haverá cancelamento da componente espectral. Existem vários trabalhos teóricos e experimentais com foco no desempenho da fibra, de modo a reduzir os efeitos da dispersão cromática, que é um fenômeno linear. No entanto, a fibra pode exibir comportamento não linear [6], pois o índice de refração varia com a intensidade do campo elétrico [7]. Uma das técnicas mais simples para reduzir o desvanecimento é aumentar a potência de transmissão e induzir efeitos não lineares para cancelar os lineares [8]. Neste trabalho foi demonstrado por meio de simulação que o aumento da potência óptica resulta em acréscimo nas distâncias onde ocorrem os efeitos de desvanecimento. Além desta Seção introdutória, o artigo possui mais quatro seções. Na Seção II é apresentado o esquema utilizado para representar o enlace óptico. Na Seção III são estabelecidos os fundamentos teóricos para formação de sólitons, ondas propagantes sem distorção, que surgem quando existe um balanço entre fenômenos lineares e não lineares. Decorrente da formação de sóliton, as bandas laterais resultantes da modulação do pulso óptico pelo sinal de RF serão amplificadas. Na Seção IV é demonstrado que este ganho paramétrico, chamado de instabilidade modulacional, reduz os efeitos da dispersão cromática, aumentando a distância do enlace. Por fim, a Seção V dedica-se aos comentários finais. II. REPRESENTAÇÃO ESQUEMÁTICA DO ENLACE ÓPTICO Na Fig. 2 tem-se a representação esquemática do enlace óptico analógico a fibra para estudo dos efeitos da dispersão cromática. O enlace consiste na modulação externa de intensidade da portadora óptica, usando um modulador Mach-Zehnder com dupla alimentação de RF (dual drive), e na detecção direta (IM/DD). A fibra óptica para transmissão do sinal é do tipo monomodo padrão (Standard Single Mode Fiber – SSMF). A configuração IM/DD foi escolhida porque permite a análise do sinal em função de diversas modulações apenas modificando-se parâmetros do modulador Mach-Zehnder [2], 𝜃1 = 𝜋 (DSB – Double Sideband) e 𝜃1 = 𝜋⁄2 (SSB – Single Sideband), mantendo-se 𝜃2 = 𝜋⁄2. Em uma fibra SSMF, as componentes espectrais do sinal óptico propagam-se com diferentes velocidades, modificando as fases das bandas laterais ópticas. Na recuperação do sinal de RF pelo fotodetector quadrático, as mudanças de fase nas bandas laterais alteram a fase resultante dos sinais de batimento. Este fenômeno é chamado de dispersão cromática e provoca desvanecimento do sinal de RF detectado ou alargamento dos bits transmitidos quando se emprega modulação digital. Considerando enlace óptico analógico na configuração DSB, a potência do sinal de RF fundamental varia ciclicamente e é dada por [9] onde 𝐷 é o parâmetro de dispersão, 𝐿 o comprimento da fibra, 𝜆𝑜 o comprimento de onda da portadora óptica, 𝑐 a velocidade da luz no vácuo e 𝑓𝑅𝐹 a frequência do sinal de RF que modula o laser. Com (1) é possível verificar os pontos de cancelamento da potência detectada em função do comprimento do enlace. A mesma análise pode ser feita para frequência de RF, mantendo-se fixo 𝐿. III. SÓLITON NA FIBRA ÓPTICA Inicialmente considera-se que o sinal da fonte laser é acoplado diretamente na fibra, sem modulação externa. O campo elétrico polarizado na direção 𝑥 e propagando-se na direção 𝑧 é dado por: onde 𝜔 𝑜 é a frequência angular da portadora óptica, 𝛽𝑜 a constante de propagação, 𝒙̂ o vetor unitário na direção 𝑥 e 𝐴(𝑧, 𝑡) a envoltória do pulso óptico. Considerando que a amplitude da envoltória do pulso óptico varia lentamente, a propagação da onda através da fibra óptica não linear e dispersiva pode ser descrita pela equação diferencial [4]: onde 𝛽2 é o coeficiente de dispersão de 1ª ordem, |𝐴|2 representa a potência óptica e 𝛾 o parâmetro não linear. O referencial de tempo foi modificado para um observador que se desloca com o pulso. Então, 𝑇 = 𝑡 − 𝑧⁄𝑣𝑔, onde 𝑣𝑔 é a velocidade de grupo. Em (3) foram desprezados os efeitos de absorção e atenuação, as não linearidades de ordem superior, a dispersão de ordem superior (𝛽𝑘, onde 𝑘 = 3,4, …), os espalhamentos estimulados Raman (SRS) e Brillouin (SBS). A expressão (3) descreve o comportamento do pulso propagando-se na direção 𝑧 em uma fibra que exibe dispersão de velocidade de grupo (Group Velocity Dispersion – GVD), dada pelo segundo termo (𝛽2), e auto modulação de fase (SPM), ou efeito Kerr, proporcional ao coeficiente 𝛾. A velocidade com que a energia do grupo se desloca é afetada pelo espalhamento decorrente das diferentes velocidades das componentes espectrais do pulso. Portanto, a GVD relaciona-se com a dispersão cromática e é um efeito linear. Por outro lado, o efeito SPM é não linear porque varia com o quadrado da intensidade óptica e resulta em uma compressão do pulso óptico. Nesse contexto, caso a fibra esteja operando no regime de dispersão anômala (𝛽2 < 0), o balanço entre os efeitos GVD e SPM cancela a distorção e o pulso se propaga com a forma inalterada. Nessa condição ocorre a formação do sóliton, que é um tipo de onda que propaga por longas distâncias sem distorção [10]. A condição para formação do sóliton é estabelecida pela solução de (3), que é um tipo de equação diferencial que pode ser resolvida pelo método do espalhamento inverso [5], introduzindo variáveis adimensionais, onde 𝑃 𝑜 é a potência óptica, 𝑇𝑜 a largura do pulso óptico incidente e 𝐿𝐷 = 𝑇𝑜2⁄|𝛽2| o comprimento a partir do qual o efeito da dispersão inicia. Substituindo (4) em (3), tem-se que: com 𝑠 = 𝑠𝑖𝑛𝑎𝑙(𝛽2) = ±1. O parâmetro 𝑁 é definido como: onde 𝐿𝑁𝐿 = 1⁄𝛾𝑃𝑜 e representa a distância na qual o efeito não linear SPM torna-se expressivo. A fibra monomodo padrão no comprimento de onda de 1550 nm opera no regime de dispersão anômala [10]. Logo, 𝛽2 < 0 . Substituindo 𝑠 = −1 em (5) e introduzindo a variável 𝑢 = 𝑁𝑈, tem-se que: cuja solução é dada por [11], A expressão (8) revela que, para 𝑁 = 1 (sóliton fundamental), um pulso dado por uma função secantehiperbólica, típica de um laser, com potência e largura de pulso obedecendo (6), permanece com a mesma forma ao se propagar na fibra. IV. GANHO PARAMÉTRICO Nesta Seção, considera-se que o sinal da fonte laser obedece (6) e trata-se de um sóliton fundamental (𝑁 = 1). Isto implica que a envoltória do pulso óptico, 𝐴(𝑧, 𝑇), permanece inalterada e é independente do tempo à medida que se propaga na fibra [11]. A solução estacionária de (3) é dada por, O sinal óptico cuja envoltória é dada por (9) é modulado em intensidade pelo modulador MZM com parâmetros ajustados para modulação do tipo DSB. Considerando o sinal de RF como uma pequena perturbação com amplitude dada por 𝑎(𝑧, 𝑇), pode-se esperar que uma distorção não linear da envoltória ocorra, uma vez que 𝜔𝑅𝐹 < 𝜔𝑜 [10]. Reescrevendo (9), tem-se que: Substituindo (10) em (3), obtém-se a equação diferencial para a perturbação [11]: A solução de (11) é obtida no domínio da frequência. A perturbação, ou modulação, pode ser representada na forma complexa [12], onde |𝑎0| ≪ |𝐴0|. Os termos 𝐾 e 𝜔𝑅𝐹 são, respectivamente, o número de onda e a frequência da perturbação. A transformada de Fourier de (11) resulta nas componentes acopladas 𝜔𝑅𝐹 e −𝜔𝑅𝐹. Essas equações têm solução não trivial somente quando 𝐾 e 𝜔𝑅𝐹 satisfazem a relação de dispersão [11]: A estabilidade do pulso óptico depende do regime de dispersão da fibra. No caso de dispersão anômala, 𝛽2 < 0, 𝑠 é igual a -1 e 𝐾 torna-se imaginário quando Nessa condição, a perturbação cresce exponencialmente com a distância 𝑧. Isto implica que um sinal de modulação com frequência angular 𝜔𝑅𝐹 pode ser amplificado durante a propagação [13]. Fisicamente este fenômeno é considerado como amplificação paramétrica das bandas laterais de modulação e é resultado da interação entre o efeito induzido SPM (não linear) e a dispersão cromática (GVD). Como o ganho é dependente da frequência de modulação, ele pode causar distorção no pulso óptico e é definido como instabilidade modulacional (modulation instability). Entretanto, o ganho pode ser considerado quase constante para sinais de banda-estreita típicos dos usados em enlaces ópticos [13],[14]. O ganho total em função da frequência é dado por [11],[15]: onde o fator 2 converte 𝑔(𝜔𝑅𝐹) para ganho de potência. A Fig. 3 mostra o ganho paramétrico em função da frequência de modulação (𝜔𝑅𝐹 = 2𝜋𝑓𝑅𝐹) para três valores de potência óptica: 0 dBm, +5 dBm e +10 dBm. Foram utilizados os seguintes parâmetros da fibra óptica: 𝛽2 = −20 ps²/km e 𝛾 = 2,5 W−1/km. Verifica-se que o sinal de RF de 10 GHz adquire um ganho paramétrico quando 𝑃𝑜 = +10 dBm. A Fig. 4 ilustra o comportamento da potência do sinal de RF, após conversão óptica-elétrica no fotodetector, em função do comprimento da fibra (𝐿). A frequência de RF foi mantida fixa em 10 GHz (frequência fundamental). Na curva contínua, o efeito SPM não foi incluído. Ela foi construída considerando (1), sendo que a potência na saída do modulador MZM, na configuração DSB, foi mantida em 0 dBm. O desvanecimento do sinal é decorrente da dispersão cromática e observa-se que há valores de 𝐿 para os quais não há potência de RF detectada, aproximadamente 38 km, 110 km e 185 km. Os pontos de nulos ocorrem por causa do deslocamento de fase das componentes espectrais ópticas que se propagam na fibra. As duas bandas laterais incidem no fotodetector com fases opostas, provocado o cancelamento da respectiva componente de RF após batimento. Os pontos marcados com estrelas na curva tracejada da Fig. 4 foram obtidos por meio de simulação com o software OptiSystem. Na simulação, a potência óptica lançada na fibra foi mantida em +10 dBm. A frequência de RF também permaneceu fixa em 10 GHz. Os parâmetros da fibra foram típicos de valores comerciais [16], 𝛽2 = −20 ps²/km e 𝛾 = 2,5 W−1/km. Utilizou-se como fonte óptica um laser contínuo (CW) que atende à necessidade de a envoltória ser independente do tempo em 𝑧 = 0, com 𝜆𝑜 = 1550 nm. Na Fig. 4 verifica-se que o aumento da potência óptica resultou no deslocamento dos pontos onde a potência de RF não foi detectada. Tais nulos ficam aproximadamente 5 km mais distantes. Tal aumento na distância de transmissão é decorrente do ganho paramétrico dado por (15). Mantendo-se a potência em +10 dBm, o efeito SPM é induzido na fibra óptica reduzindo a penalidade na potência de RF detectada pelo balanceamento entre GVD e não linearidade. Nessa condição, o sinal de RF é amplificado durante a propagação. A portadora óptica executa a função de bomba, resultando no ganho paramétrico das bandas laterais de modulação que cresce com o comprimento do enlace. V. CONCLUSÃO Neste trabalho foi demonstrado, por meio de simulação, que o efeito não linear SPM induzido pelo aumento da potência óptica pode ser usado para reduzir os efeitos da dispersão cromática. O balanço entre o efeito de compressão do SPM e o espalhamento provocado pela dispersão cromática resulta na instabilidade modulacional do pulso óptico. Com isso, ocorre um ganho paramétrico nas bandas laterais de modulação que leva a um acréscimo na distância de desvanecimento. Considerando uma rede distribuída de radares, com os resultados deste trabalho seria possível instalar as antenas remotas mais distantes dos centros de controle. "
	}
