	{
		"id": 87,
		"titulo": "análise de interferência entre sistemas de comunicações e radar operando na banda s",
		"autor": "adriana costa, claumir sarzeda e anderson oliveira",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2017/st/ST_03_3.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 1,
		"resumo": "A demanda crescente por serviços de comunicações sem fio presente em toda parte, gera a necessidade de nova alocação do espectro eletromagnético ou ao reprojeto dos atuais sistemas, de forma a gerenciar eficientemente a coexistência entre diversas tecnologias. Quanto mais congestionado for o espectro eletromagnético de uma região geográfica (sítio), mais este problema será evidenciado. Uma faixa do espectro (banda), onde esta questão é intensificada é a banda S (2-4 GHz) na qual vários sistemas radar (de superfície, vigilância aérea, meteorológico, controle de tráfego aéreo de curto alcance) e sistemas de comunicações sem fio (Wi-Fi, WLAN e telefonia móvel) operam. É apresentado uma simulação de um radar pulsado operando em 2.7 GHz e um sinal de comunicação móvel interferente em 2.655 GHz, localizado nas proximidades do radar transmissor realizando o bloqueio.",
		"texto": " I. INTRODUÇÃO O espectro eletromagnético que utilizamos como meio de comunicação encontra-se a cada dia sendo mais explorado devido a evolução da tecnologia. Com as descobertas científicas e o desenvolvimento tecnológico que marcaram o século XX e o início do XXI, usar o espectro eletromagnético passou a ser algo cotidiano na vida das pessoas. Ao sintonizarmos um rádio, ao acionarmos o controle remoto de um portão, ao assistirmos TV, ao usarmos um celular, ao conectarmos um computador à internet, ligarmos uma lâmpada incandescente, descongelarmos comida no micro-ondas ou quando vamos ao médico realizar um exame de raio-X, estamos utilizando o tal espectro eletromagnético [1]. O espectro eletromagnético é organizado de forma esquemática em diferentes faixas. Cada faixa é designada a um emprego específico, isto é, para cada serviço seja ele de TV, comunicações celulares, sistemas radar, etc é alocada uma determinada banda de frequência [2]. Tem se observado recentemente, um crescimento rápido na demanda de largura de banda espectral pelas operadoras de comunicações comerciais. A limitada largura de banda disponível para as comunicações comerciais tem se tornado um desafio, que irá obstar o crescimento do número de dispositivos móveis, entre outros, no futuro[3]. Em todo mundo, agências federais têm permitido o compartilhamento do espectro com usuários comerciais, por exemplo, a NTIA (National Telecommunications and Information Administraton) liberou o compartilhamento da banda de 3550MHz a 3650MHz, atualmente destinada ao uso de radares militares, com sistemas de comunicações já que esta banda é muito favorável para sistemas celular comerciais, como os do tipo LTE (Long Term Evolution) avançado [4]. Esse tipo de compartilhamento também ocorre em terras brasileiras. Contudo, aqui, esse compartilhamento dá-se entre as emissoras de TV e os serviços de internet 4G. A Interferência radar nos sistemas celulares, e vice-versa, é causa de preocupação tanto para os operadores comerciais quanto para os militares. Já que a realocação dos sistemas radar, originalmente operando nesta faixa, necessitaria de novas tecnologias e retrabalho significativo, que demandariam custos elevados, assim como, seria necessário que novos métodos de compartilhamento de espectro fossem empregados, exigindo esforço de desenvolvimento, não previsto, inicialmente [4]. Neste trabalho é retratado um cenário com base a Baía de Guanabara, na cidade do Rio de Janeiro. Nesta região podemos encontrar possíveis pontos de interferência entre radares de banda S, devido aos navios ali atracados, navios em trânsito, radares dos aeroportos Santos Dumont e Internacional Tom Jobim e sistemas de comunicação móvel LTE presentes na maior parte do litoral da baía de acordo com a Fig 1. É possível analisar pela Fig. 1 a quantidade de ERBs ao redor da Baía de Guanabara nas proximidades do Aeroporto Santos Dumont, Arsenal de Marinha do Rio de Janeiro, Barcas S/A transportes marítimos, Base Naval do Rio de Janeiro (Ilha de Mocanguê). Segundo a Associação Brasileira de Telecomunicações constam nessa imagem 4769 antenas de diversas operadoras [5]. Em janeiro de 2017 o quantitativo de ERBs aumentou em aproximadamente 2,39% passando para 4883 antenas no município do Rio de Janeiro. Para o estado do Rio de Janeiro constam 9737 estações rádio base, logo a quantidade de ERBs no município do Rio corresponde a 50% do total presentes no Estado. II. CONSIDERAÇÕES DO PROBLEMA O cenário analisado envolve um radar na banda S com características de navegação militar e sinais de comunicação móvel baseado no sinal de downlink LTE (Long Term Evolution). A banda S no espectro eletromagnético abrange uma faixa de 2 GHz a 4 GHz nessa banda encontramos também sistemas de comunicação móvel de tecnologia 2G, 3G e 4G. Nas proximidades da Baía de Guanabara assim como nesta, encontramos um grande fluxo de dados sendo transmitido, seja por navios, conexões navio-satélite, telefonia móvel etc, sendo neste caso, o emissor de maior potência, o radar de navegação militar. Essa grande demanda de fluxo de dados presente na baía de Guanabara pode vir a causar interferências tanto nos radares de banda S quanto no sistema de comunicação móvel LTE, havendo um interesse maior na verificação de possíveis interferências nos radares de navegação militar. Neste trabalho a nossa análise irá se restringir na verificação do efeito da interferência causada por um sinal de downlink LTE (proveniente de uma ERB da operadora TIM, localizada na Fortaleza de Santa Cruz, Niterói) sobre um radar embarcado em um navio, que se dirige ao interior da Baía de Guanabara. Inicialmente, este se encontra na entrada da baía de Guanabara. Assim, observa-se um grande número de torres de comunicações móveis nas proximidades (até 10 km). Se o operador deste radar está interessado em observar todo o contorno da baía (até o fundo desta em Magé, cerca de 17 km de distância, desta posição), conforme mostrado na Fig. 2, o radar deve estar trabalhando numa escala capaz de abranger convenientemente toda a Baía da Guanabara. Na Fig. 2(a) mostra a distância da ERB até o navio (649 m), já a Fig. 2(b) mostra o percurso ERB x Navio X Alvo (17377 m), assim a distância entre o navio e o alvo é de 16728 m. Para realizarmos esta análise é necessário o emprego de um ambiente de simulação capaz de trabalhar em nível de sistema eletrônico, pois este trabalho consiste na simulação do sinal de comunicações móveis (LTE); do sinal radar transmitido; do efeito do alvo desejado no eco radar recebido e do comportamento do receptor radar. Assim, foi escolhida ferramenta SystemVue da Keysight Technologies [6 e 7]. Desta forma, foi simulado o sinal LTE interferente; depois o sinal transmitido pelo radar; em seguida o eco de um alvo, hipoteticamente situado a aproximadamente 17 km do transmissor radar (sendo incluídas as perdas de propagação em espaço livre). Por fim, foi verificada a detecção do alvo por meio do processamento do receptor radar, sem a presença do sinal de comunicações interferentes e com a contribuição deste, em diferentes distâncias do receptor radar, para um sinal LTE em 2655 MHz. III. SISTEMA DE COMUNICAÇÃO ANALISADO O Sistema de comunicação analisado é o LTE, a qual a ANATEL destinou para o 4G, através da Resolução 544 de 11/08/2010, a faixa de freqüências de 2500 a 2690 MHz, anteriormente destinada aos serviços MMDS (Multichannel Multipoint Distribution Service). O 3GPP determinou as faixas de frequências que podem ser utilizadas para fornecimento do sistema LTE em todo o mundo. A Tabela 1 mostra as bandas de operação para o LTE regulamentadas pelo 3GPP [8]. Esse sistema de comunicação analisado tem por base o sinal OFDMA(Orthogonal frequency Modulation Acces) para transmissão, sinal este que é base da comunicação LTE, entretanto essa técnica tem sua camada física baseada no OFDM (Orthogonal frequency Modulation), tecnologia esta empregada no downlink do LTE. O esquema OFDM é largamente utilizado em sistemas de comunicação sem fio como no padrão IEEE 802.11, comunicações celulares (Wimax, e LTE). O LTE utiliza a técnica OFDM, devido ao longo tempo de duração do símbolo em combinação com o prefixo cíclico, que fornece assim um alto grau de robustez contra interferência de rádio frequência, alta eficiência espectral assim como essa técnica também permite que sejam transmitidos dados utilizando múltiplas portadoras estreitas simultaneamente dependendo da banda utilizada. O princípio de transmissão de qualquer sistema OFDMA é utilizar uma banda estreita para as subportadoras ortogonais entre si, nela temos um modulador do sinal, um conversor serial-paralelo e um bloco IFFT para criar o sinal, como podese observar na Fig. 3. Nesse estudo o interesse foi na análise do sinal de downlink, sinal transmitido ao usuário. IV. TIPO DE RADAR ANALISADO O Radar empregado neste trabalho é do tipo pulsado (radar de navegação ou de busca). Este estima a distância de um alvo (objeto) pela medição da diferença entre o instante de transmissão e o instante de recepção do sinal de eco. Enquanto a largura do pulso determina a resolução da distância do alvo, a frequência de repetição de pulso (PRF) determina o alcance máximo, onde os resultados da medição não são ambíguos. Se a frequência de repetição de pulsos (PRF) for muito grande, ou seja, se o tempo entre a transmissão de dois pulsos consecutivos for pequeno, então o sinal refletido em determinados alvos pode ser recebido após a transmissão do pulso seguinte, criando ambiguidades em distância. Neste trabalho o Radar analisado não está operando com técnicas de proteção eletrônica, o que aumentaria a probabilidade de detecção do alvo. V. CENÁRIO DE SIMULAÇÃO A Fig. 4 apresenta o diagrama em blocos do esquema de simulação do cenário proposto contendo um transmissor radar, onde o sinal radar a ser transmitido é gerado; um gerador de sinal LTE, no qual o sinal de comunicação móvel interferente é gerado; um bloco de ambiente, onde são levados em consideração os efeitos de propagação e secção reta radar do alvo e os sinais (radar e LTE) são combinados e por fim um bloco receptor radar responsável pela recepção e processamento dos sinais. A. SIMULAÇÃO TRANSMISSÃO DO SINAL LTE Para essa simulação foi considerada a banda 7 (E-UTRA) de downlink, cuja frequência varia de 2620 MHz a 2690 MHz [9]. Contudo, verificamos que a operadora TIM no Rio de Janeiro utiliza a frequência de 2655 MHZ, portanto a simulação foi realizada nesta frequência. As Fig. 5 e 6 apresentam o esquema de simulação do sinal LTE, no SystemVue. Os blocos utilizados nesse sistema fazem parte da biblioteca de Algoritmos e Comunicações. Nesse esquema da Fig. 6, estão presentes os canais físicos compartilhados de downlink, usado para transmissão de dados de transporte; os sinais físicos a qual destinam-se ao equipamento do usuário a descobrir a célula LTE e a sincronizar inicialmente; canais de controle, que carrega entre outros as informações de alocação de downlink, alocações de alocação de acesso ascendente para o terminal; multiplexador, modulador OFDM e modulador do espectro. A Tabela II ilustra os parâmetros físicos que podem ser utilizados para um sinal downlink OFDM [10]-[12]. Para essa simulação foram levadas em consideração as características do sinal de downlink do LTE, com largura de banda de 10 MHZ, conforme características ilustradas na Tabela II para essa frequência e de acordo com a Tabela III. O espectro do sinal LTE transmitido do domínio da frequência nesse esquemático é ilustrado na Fig. 7. B. SIMULAÇÃO DO TRANSMISSOR RADAR Na simulação do transmissor radar o sinal do pulso modulante é gerado por meio de gerador LFM (Linear Frequency Modulation). Este sinal modula uma FI em 60 MHz é amplificado, posteriormente passa por um conversor de subida para frequência final de transmissão de 2.7 GHz. Na Fig. 8 é apresentado o esquemático de simulação da cadeia transmissor radar. Utiliza-se um gerador de pulso radar, um bloco do transmissor RADAR_Tx, um pré-amplificador, um amplificador de potência e um bloco de ganho de antena transmissora. O bloco RADAR_Tx é composto de um subcircuito conforme ilustrado nas Fig. 9. Neste o bloco RADAR_DUC é responsável pela conversão digital do sinal de pulso modulante para a frequência de FI. Em seguida esse sinal é amplificado, convertido posteriormente para a frequência de transmissão, em seguida filtrado e por fim, amplificado. A Tabela IV apresenta os parâmetros principais utilizados nesta simulação. O espectro do sinal transmitido pelo radar é mostrado na Fig. 10. C. SIMULAÇÃO DO AMBIENTE ELETROMAGNÉTICO O Ambiente eletromagnético é apresentado na Fig. 11. O bloco RADAR_Target é responsável por incluir os efeitos da Secção Reta Radar (SRR) do alvo e a perda devido a propagação do sinal transmitido pelo radar no percurso do transmissor ao alvo e deste ao receptor . A perda de espaço livre do sinal LTE é contabilizada no bloco Perda_espaço_livre_sinal_LTE. O bloco somador é responsável por somar o sinal de eco radar com o sinal LTE interferente. D. SIMULAÇÃO DO RECEPTOR RADAR Na Fig. 12 é mostrado o esquemático de simulação do receptor radar contendo o bloco RADAR_Rx, um elemento de conversão do sinal complexo em suas componentes real e imaginária e um bloco de processamento onde é realizada a medida da distância do alvo. O bloco RADAR_Rx é composto de um subcircuito conforme apresentado na Fig. 13 . Neste o sinal é amplificado, convertido de volta para frequência de FI, mais uma vez amplificado e finalmente convertido digitalmente pelo bloco RADAR_DDC para um sinal de banda base. VI. RESULTADOS DA SIMULAÇÃO Na Fig. 14 é apresentada a envoltória do pulso radar transmitido e do pulso do eco recebido. Para que o eco fosse visualizado este foi intensificado por 1,1x1011. Pode-se observar o retardo entre o sinal transmitido e recebido. Na Fig. 15 é mostrada distância de detecção do alvo, sem a presença de sinal de comunicações LTE interferente. Observase que o valor foi bem próximo da posição real (16728 m), o desvio de alguns metros deve-se a não utilização de um método de detecção mais sofisticado. A Fig. 16 mostra a envoltória do sinal detectado com a presença de interferência proveniente de uma ERB a 649 m do receptor radar. Pode-se observar que o sinal do eco radar está encoberto pelo sinal interferente. Não sendo possível uma medida de distância adequada, como pode-se observar na Fig. 17. Foi realizado uma nova simulação, agora com o sinal de comunicações interferente sendo emitido a partir de uma distância de 10 Km do receptor radar. Na Fig. 18 é mostrado o sinal detectado. Observa-se que o eco do sinal radar pode ser percebido em meio a um sinal interferente bem fraco. Assim o receptor radar foi capaz de medir a distância do alvo correta. Na Fig. 19 é apresentada a distância detectada do alvo para o caso em que o transmissor do sinal de comunicação interferente se encontra a 10 km do receptor radar. Observa-se que a distância foi adequadamente medida. VII. OBSERVAÇÕES FINAIS Foi simulado um radar pulsado, de navegação, na frequência de 2.7 GHz e um sinal de comunicação móvel LTE na frequência de 2.655 GHz, interferente no radar. Pode-se observar que apesar de um intervalo de guarda de 45 MHz entre os dois sistemas, quando o sinal interferente é transmitido a uma distância próxima (649 m), o radar foi incapaz de medir a distância do alvo corretamente. Quando o sinal interferente foi transmitido a partir de uma distância de 10 km, não foram observados erros significativos na distância medida do alvo, pelo radar. Desta forma, fica evidenciada a possibilidade de interferência entre sistemas de comunicações móveis e radares operando na Banda S. Assim, é de fundamental importância este tipo de análise quando da implantação de novos serviços de comunicações nas proximidades de sistemas radar previamente operantes. Os Autores agradecem a disponibilidade do uso do software de simulação (SystemVue) ao GSOM/PUC-Rio e a Keysight Technologies Medição Brasil Ltd. "
	}
