	{
		"id": 88,
		"titulo": "estudo dos efeitos de dircm em mísseis infravermelhos de primeira geração",
		"autor": "caio augusto de melo silvestre, lester de abreu faria",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2017/st/ST_04_2.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 1,
		"resumo": "O crescente emprego de mísseis de ombro infravermelhos contra alvos aéreos demanda a utilização de contramedidas cada vez mais modernas e eficientes. Neste cenário, surge o Directed Infrared Countermeasure (DIRCM), cujo objetivo é interferir no guiamento do míssil por meio de pulsos de laser. Neste artigo, um seeker infravermelho do tipo rising sun é modelado e simulado, sendo os efeitos da emissão de um DIRCM no processamento do sinal avaliados. A influência de parâmetros de frequência de repetição de pulsos e intensidade do laser são evidenciados. Os resultados obtidos ressaltam a importância e a necessidade do desenvolvimento de ferramentas computacionais mais complexas, visando ao desenvolvimento da doutrina de emprego deste tipo de contramedida.",
		"texto": " Mísseis Infravermelhos, especialmente os do tipo MANPADS (Man-Portable Air-Defence System), vêm se proliferando cada vez mais ao redor do globo, sendo as principais armas utilizadas por grupos não-convencionais [1,2]. Como exemplo recente, podemos citar relatos da provável utilização de um SA-7 pelas Forças Armadas Revolucionarias da Colômbia (FARC). Tais equipamentos podem ser considerados antiquados se comparados aos equipamentos atualmente empregados pelas forças armadas formais e instituídas, porém, devido à sua proliferação ilegal e ao seu elevado poder de dano quando utilizados por grupos mal-intencionados, mostram-se ainda de grande importância. Assim, o estudo desses equipamentos e da eficiência das contramedidas existentes se mostra de elevado potencial estratégico e de elevada relevância. As gerações mais antigas de MANPADS utilizam seekers infravermelhos com sinais modulados por meio de retículos, o que os deixa relativamente suscetíveis e vulneráveis a diferentes formas de contramedidas eletrônicas. Destas, uma de elevada eficiência, e relativamente nova, é o sistema denominado DIRCM (Directed Infrared Countermeasure), baseado em laser. O princípio de funcionamento deste engloba os efeitos de despistamento, dazzling (cegamento ou saturação) ou dano permanente ao sensor [3]. Sistemas DIRCM já se encontram operacionais em diferentes Forças Aéreas ao redor do mundo tendo, no Brasil, como primeira aeronave a ser equipada com esse tipo de tecnologia, o KC-390. Este utilizará um equipamento do modelo J-MUSIC, da empresa Israelense ELBIT. De acordo com reportes encontrados na literatura aberta [4,5,6], simulações realizadas ao partir do modelamento de seekers reticulares vêm sendo altamente empregadas a fim de estudar as interferências nestes sensores e, desta forma, desenvolver doutrinas para potencializar o uso de tais sistemas. Por meio do desenvolvimento de modelos de seekers e, visando a atividades como as anteriormente citadas, o objetivo principal deste trabalho é apresentar a efetividade de um DIRCM quando utilizado contra um seeker reticulado, em função das características da modulação do sinal. Assim, será possível, prever a sensibilidade de tais sensores ao DIRCM, vislumbrando condições operacionais ótimas para o seu emprego, proporcionando desenvolvimento de doutrina a baixos custos. Além disso, o trabalho desenvolvido serve como base de dados para o delineamento de experimentos e de propostas para futuras avaliações operacionais. II. MÍSSIL INFRAVERMELHO COM SEEKER RETICULAR A Fig. 1 ilustra um típico diagrama de blocos de guiamento e navegação de um míssil infravermelho. O fator determinante para guiamento do míssil é a intensidade de radiação do alvo que chega ao seeker através da atmosfera. Tal radiação não é proveniente somente do alvo, mas ainda engloba o cenário em que o mesmo está inserido (background) e eventuais contramedidas. Desta forma, a detecção do míssil é uma atividade extremamente complexa, a qual deve ser compreendida em suas nuances antes de podermos atuar de maneira mais eficiente possível, no intuito de dificultar/evitar o seu sucesso. A. Spin-scan seeker e processamento do sinal A Fig. 2 ilustra um retículo spin-scan do tipo rising sun, o qual será modelado e simulado neste trabalho, servindo de estudo de caso. O retículo apresentado possui 12 setores, 6 transparentes e 6 opacos. Os transparentes permitem a transmissão da radiação infravermelha dos alvos (simulando uma transmitância de 100%), enquanto os setores opacos não permitem a transmissão (transmitância de 0%). Na parte cinza, a transmitância da radiação infravermelha é de 50%. O retículo gira a uma frequência de rotação constante, a qual, para este estudo, foi considerada como um valor de 100 Hz. A figura 3 apresenta o sinal gerado pelo retículo rising-sun, após modelamento no Software MatLab: Como forma de simplificação, e assumindo-se que o detector infravermelho seja ideal na faixa de radiação do alvo, desconsiderando-se a radiação proveniente do background, o sinal de saída do detector, , pode ser expresso da seguinte maneira: onde, é a radiação infravermelha do alvo incidente no retículo, é a radiação proveniente do jammer e é a função de modulação gerada pelo retículo, ilustrada na figura 3. Considera-se que o DIRCM gere pulsos de radiação com uma frequência de repetição e amplitude . Dessa forma, a radiação oriunda do DIRCM que chega ao receptor é modelada com a seguinte equação: onde, square representa um pulso de forma de onda quadrada. Para fins de modelamento, o processamento do sinal é, então representado conforme o diagrama de blocos da Fig. 4. Inicialmente o sinal é filtrado por um filtro passafaixa, centralizado na frequência da portadora. Esta é dada pela seguinte função, considerando-se o retículo rising-sun [7]: onde, é a frequência da portadora gerada pelo retículo, o número de pares de setores opacos e transparentes e a frequência de rotação do retículo. Após o primeiro filtro passa-faixa, o sinal passa pelo processo de detecção de envoltória, o qual é utilizado para se detectar a amplitude do sinal, podendo assim se estimar a distância radial do alvo em relação ao centro do retículo [4,5]. Posteriormente, o sinal passa por mais um filtro passafaixa centralizado na frequência de rotação do retículo e, por último, a fase do sinal é detectada, utilizando-se um filtro passa baixa e um sinal de referência senoidal. Para maiores detalhes do processo de detecção sugerem-se as referências [4, 5], não sendo tal processo detalhado no presente artigo por razões de espaço e essência do trabalho. III. SIMULAÇÃO E ANÁLISE DA EFICIÊNCIA DO JAMMING A fim de se implementar o processo de detecção do sinal e o processamento do mesmo, de acordo com o modelo geral explanado na subseção anterior, o diagrama de blocos da figura 4 foi implementado no software MatLab/Simulink, permitindo visualizar cada uma das etapas de detecção e do processamento do sinal. Tal implementação serve de base para inúmeras outras adaptações concernentes a elementos constituintes do cenário de detecção infravermelho, permitindo, à posteriori, inclusão de módulos como os de backgroud, propagação atmosférica, diferentes tipos de contramedidas, diferentes tipos de sensores, etc. O desenvolvimento e a implementação modular favorecem a compreensão e a evolução do protótipo de simulação, permitindo tantas quantas forem as evoluções do cenário. Seguindo esse raciocínio, o módulo base passou a ser integrado com um módulo DIRCM, estudo realizado e apresentado no presente trabalho, o qual permite verificar os efeitos de cada um dos parâmetros envolvidos no sistema de detecção e de interferência, bem como melhorar a operação do sistema DIRCM, favorecendo o desenvolvimento de doutrina. Conforme comentado anteriormente, a radiação proveniente do alvo radiante é focalizada sobre o retículo, cujas características intrínsecas modulam o sinal. Imediatamente atrás do retículo está posicionado um detector, o qual converte a radiação recebida em um sinal elétrico. O retículo modelado e implementado em MatLab é ilustrado na figura abaixo, a qual apresenta a sua metade inferior com a transmitância de 0,5 e seis pares de setores com transmitâncias de 1 e 0, alternadamente. Ainda, o mesmo possui um raio de 0,5 e uma rotação de 100 Hz. Na implementação em MatLab, o retículo foi modelado por uma matriz de 240x240 e os setores foram determinados por relações trigonométricas. A fim de simular o alvo, servindo de estudo de caso para os resultados aqui avaliados, sua posição inicial foi escolhida como (x,y) = (0,2, 0,2), relativos a ambos os eixos de posição, o que nos dá uma posição relativa em relação ao míssil de 45°. Uma vez gerado o sinal (saída do detector), conforme apresentado na Fig. 3, este é direcionado para o filtro passafaixa. Nesta implementação foi utilizado um filtro do tipo Butterworth de segunda ordem, com uma banda de 500 Hz e frequência central em 1200 Hz, com o objetivo de se filtrar o sinal da portadora. Após essa primeira filtragem, o sinal passa por um processo de detecção de envoltória do tipo square-law, o qual consiste em se elevar o sinal ao quadrado, passá-lo por um filtro passa-baixa e, por último, se extrair a sua raiz quadrada, a fim de se reverter o erro de distorção de escala causado por conta da quadratura do mesmo na fase anterior. Para maiores detalhamentos sobre o processo implementado e de seu desenvolvimento matemático, sugere-se [8]. Em seguida, o sinal passa pelo segundo filtro passa-faixa, desta feita com uma banda de passagem de 20 Hz e uma frequência central de 100Hz. Tais valores foram usados para se isolar o componente da frequência de rotação do retículo. Tal determinação visa a, posteriormente, poder determinar a fase do mesmo e, assim, se obter o azimute do alvo. Uma vez mais foi utilizado o filtro de butterworth, de segunda ordem. Por fim, aplica-se um detector de fase, o qual consiste da multiplicação do sinal por dois sinais senoidais de referência, com frequência de 100 Hz, mesma frequência do sinal processado, porém defasados em fase, buscando se determinar as componentes nos dois eixos de posição cartesianos. Tal procedimento é necessário uma vez que senos e cossenos possuem sinais contrários em cada um dos 4 quadrantes, viabilizando a detecção e identificação para qualquer posição relativa do alvo. No caso de se multiplicar somente por um sinal senoidal, teríamos uma ambigüidade no posicionamento do alvo e, consequentemente, no algoritmo de guiamento do míssil. Em seguida, o sinal passa por um filtro passa baixa, buscando se isolar a componente de baixa frequência, determinando a fase entre o sinal processado e os sinais senoidais de referência. Com isso, tem-se modelado todo o processo de detecção do sinal oriundo do alvo radiante, permitindo, então, a implementação e avaliação dos efeitos do DIRCM. A fim de se verificar tais efeitos na informação de posição angular do alvo, foram realizadas simulações com diferentes frequências de repetição de pulso ( ): 15Hz, 95Hz, 105Hz, 395Hz e 705Hz. Além disso, para cada freqüência, utilizaram-se três diferentes valores de J/S, 1, 3 e 10, a cada iteração, o qual correspondem a relação de densidade de potência radiada pelo DIRCM, ou Jammer (J), e a densidade de potência radiada pelo alvo ou Signal (S). Tal espectro de valores de entrada nos permite uma avaliação ampla da resposta do sensor quando interferido pelo DIRCM, apresentando resultados que possibilitam tirar juízo de valor sobre a sensibilidade do sensor e sobre a eficiência da contramedida. No nosso estudo de caso, o DIRCM só foi ativado em 0,5 segundos após o início da simulação, com o intuito de permitir que o míssil responda às radiações eletromagnéticas do alvo (acoplando) e somente depois seja interferido pelo DIRCM. Tal situação foi implementada uma vez que reproduz com considerável fidedignidade o que acontece em um cenário real. Conforme esclarecido anteriormente, o alvo se encontra na posição angular de 45°. As Fig. 6, 7, 8, 9 e 10 apresentam os resultados simulados para a variação de frequência de repetição de pulso e J/S: Os erros de posição angular acarretados pela atuação do DIRCM acabam por ludibriar o seeker do míssil, fazendo com que o mesmo envie informações errôneas para sistema de controle e guiamento do míssil, cuja trajetória é desviada. Portanto, pode-se afirmar que quanto maior o erro de fase, maior será o desvio de trajetória executado pelo míssil e, consequentemente, maior será a efetividade da contramedida. Analisando-se as Fig. 7 e 8, percebe-se um grande erro na posição angular induzido pelo DIRCM. Já na Fig. 10 não se percebe uma grande influência do DIRCM sobre a posição angular obtida. Já na Fig. 9, gerou-se um erro oscilatório de amplitude mediana em relação aos outros casos. De forma a prover uma análise quantitativa dos resultados, os dados obtidos nos testes foram sintetizados na tabela I, cujos valores são relativos ao intervalo de tempo de 0.5 a 1 segundo, estando apresentados em graus, com exceção da FRP e da relação J/S. Além disso, utilizou-se um valor de acurácia o qual é a diferença entre a posição angular real do alvo de 45° e a média dos valores fornecidos pelo modelo no intervalo de tempo citado anteriormente. Desta maneira, o resultado ideal para a acurácia seria de 0° e, quanto maior este parâmetro, mais efetiva terá sido a interferência induzida pelo DIRCM. Por meio dos dados fornecidos, percebe-se que a variação do desvio padrão é diretamente proporcional ao aumento da relação J/S, o que nos leva a crer que, quanto mais intenso for o sinal do Jammer, mais eficiente será o sistema de contramedidas. O dimensionamento dessa relação e a linearidade de tais efeitos são propostas de trabalhos futuros para implementação e análise. No que diz respeito ao jammer a 105 Hz, o erro de acurácia não foi levado em consideração para fins desse estudo, na medida em que apresentou um erro maior na relação de J/S igual a 3 do que na J/S de 10. Tal resultado ainda carece de estudos complementares e faz parte dos trabalhos futuros dessa pesquisa. Assumindo o valor de acurácia como a principal referência de efetividade da contramedida, infere-se que a FRP com maior efetividade é a de 95 Hz enquanto a menos efetiva é a de 705 Hz. Isso se dá pelo fato de que a modulação a 95 Hz se encontra praticamente casada com a rotação do retículo (100Hz) e, portanto, apresentando uma melhor eficiência. Caso a frequência do Jammer seja igual a frequência de rotação do retículo, presume-se a dependência do parâmetro de diferença de fase entre tais frequências, o qual será exposto em estudos futuros. De qualquer modo, o resultado obtido já nos sugere que, em sendo possível a identificação do míssil por nosso sistema de auto-defesa, a contra-medida pode ser ajustada de forma a atingir uma eficiência ótima e, portanto, aumentar a probabilidade de sobrevivência de nossos pilotos. Além disso, como ilustrado nas Figuras 7 e 8, percebe-se também uma grande variação da posição angular do alvo, o que pode ser visto por meio dos dados de desvio padrão da tabela I. Por algum motivo ainda não compreendido até o encerramento desse artigo, o DIRCM modulado a 105 Hz não deslocou a média do valor de 45° de maneira eficiente, carecendo de maiores estudos para fins de compreensão. Desta maneira, por meio dos gráficos apresentados e extraídos a partir do sistema modelado, é possível se perceber claramente os efeitos que a radiação emitida pelo DIRCM causa na determinação da posição angular do alvo pelo seeker rising-sun. Além disso, é notável a influência da frequência de repetição dos pulsos na efetividade do DIRCM. De forma geral, com o DIRCM pulsado a 95 Hz observou-se uma grande oscilação na fase obtida. Este efeito é observado quando a frequência de repetição de pulso é próxima da frequência de giro do retículo, como afirmado em [4]. Entretanto, apesar de termos atingido resultados bastante expressivos, as seguintes ressalvas devem ser feitas: i. Não foram considerados os efeitos de propagação do laser e nem da radiação emitida pelo alvo; ii. Assumiu-se o detector como sendo ideal, ou seja, a radiação que incide no mesmo é convertida perfeitamente em sinal elétrico; iii. Não foram modelados efeitos de interação entre a radiação do laser e o detector; iv. Considerou-se somente o posicionamento angular do alvo; e v. O valor da diferença de fase entre o sinal pulsado do DIRCM e a rotação do retículo é nulo. Tais efeitos são propostos de inclusão em desenvolvimentos e trabalhos futuros, a fim de se possuir uma ferramenta cada vez mais próxima do real. Assim, persegue-se uma metodologia e ferramentas que, cada vez mais, possibilitem desenvolver doutrina e prever efeitos encontrados em situações reais. Por fim, pode-se inferir que, a partir de simulações em softwares desenvolvidos especialmente para esse fim, é possível se prever os efeitos da interação e da efetividade de utilização do DIRCM contra seekers, permitindo o desenvolvimento de doutrina e a otimização do emprego aéreo e da de autodefesa. IV – CONCLUSÃO A crescente ameaça e desenvolvimento de misseis infravermelhos demanda o emprego de novas contramedidas e o desenvolvimento de novas doutrinas. Visando à análise dos efeitos de contramedidas infravermelhas, foi desenvolvido um software que permite a simulação do processamento do sinal de um seeker reticular do tipo rising sun, bem como a a avaliação do sinal elétrico em cada uma das fases de detecção. Tal simulador é parte de uma nova metodologia perseguida no âmbito das pesquisas operacionais na Força Aérea Brasileira, permitindo a inclusão de tantos módulos quantos forem necessários para tornar o cenário de avaliação mais próximo do real, validando procedimentos e desenvolvendo doutrinas de forma barata e rápida, sem a necessidade de aeronaves e mísseis em um primeiro momento. Foi isso que se implementou nesse trabalho, a fim de se prever os efeitos do DIRCM, com diferentes parâmetros de desempenho. Os resultados decorrentes desse estudo preliminar permitem inferir que, para jammers pulsados a 15 Hz, 95 Hz, 105Hz, 395Hz e 795 Hz, a efetividade dos mesmos está fortemente relacionada com a modulação do laser, ressaltando ser este um parâmetro crítico como aponta a literatura disponível."
	}
