{
    "id": 90,
    "titulo": "materiais dielétricos e magnéticos não lineares para melhor desempenho de linhas de transmissão não lineares na geração de rf",
    "autor": "elizete g. lopes rangel, josé o. rossi e joaquim j. barroso",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2017/st/ST_10_2.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Pesquisas têm demonstrado a aplicabilidade de Linhas de Transmissão Não Lineares (LTNLs) em sistemas de comunicação de alta velocidade e banda larga. A investigação do desempenho de LTNLs na geração de rádio frequência de alta potência indica o potencial para substituir dispositivos eletrônicos a vácuo por LTLNs, que são de baixo custo e compactos. Este trabalho apresenta o princípio de operação de LTNLs, um breve resumo sobre os resultados experimentais existentes na literatura e finaliza observando que existe uma premente demanda para o desenvolvimento de novos materiais dielétricos e magnéticos não lineares com características específicas que possibilitem o aprimoramento do desempenho das LTNLs permitindo o aumento da eficiência por meio da redução das perdas e a operação em alta frequência por meio do incremento da não linearidade em meios dielétricos e magnéticos com estabilidade térmica.",
    "texto": "I. INTRODUÇÃO Desde a década de 70 diversas pesquisas têm investigado o desempenho de LTNLs por meio de análises matemáticas, simulação computacional e experimentos práticos. Estas pesquisas têm demonstrado a aplicabilidade de LTNLs em sistemas de comunicação que utilizam técnicas de compressão dos tempos de subida e descida, deslocamento de fase, multiplicação da frequência, amostragem, emissão de sinais eletromagnéticos a fim de degradar ou inviabilizar a operação de equipamentos eletrônicos inimigos (contramedidas eletrônicas) em sistemas militares e também na geração de rádio frequência de alta potência, visando a obtenção de uma nova tecnologia que ofereça compactação e baixo custo, devido a utilização de componentes passivos e, além disso, ainda possibilite a substituição de dispositivos eletrônicos a vácuo, que requerem a utilização de sistemas de vácuo, e catodos termiônicos. II. TEORIA SOBRE LTNLS A geração de oscilações de rádio frequência em LTNLs ocorre devido a três tipos de efeitos não lineares: (i) a geração de sólitons (pulsos oscilatórios) num meio com não linearidade e a dispersão contrabalanceadas; (ii) movimento de precessão amortecido dos momentos dos dipolos magnéticos em materiais ferrimagnéticos polarizados com campo magnético externo; (iii) propagação de ondas de choque eletromagnéticas em linhas que apresentam dispersão anômala reforçada pela polarização magnética [1]. Na geração de sólitons, por meio de LTNLs discretas, compostas por seções de indutores e/ou capacitores não lineares, a dispersão é obtida por meio da configuração periódica dos elementos, enquanto que a não linearidade advém do uso de materiais dielétricos não lineares, que apresentam variação da permissividade elétrica em função da tensão ou de materiais magnéticos não lineares, que apresentam variação da permeabilidade magnética com a corrente. LTNLs podem ser classificadas como capacitivas, indutivas ou híbridas em função do elemento não linear utilizado. A Fig. 1 ilustra uma linha capacitiva. A propagação de ondas em uma LTLN discreta é descrita pela solução da equação diferencial parcial não linear de Korteweg de Vries (KdV) dada por (1), cuja solução é obtida pelo quadrado da secante hiperbólica (2) [3], onde x0 é a posição inicial (fase) e v a velocidade de propagação da onda. Esta equação mostra que as amplitudes das oscilações dependem da sua velocidade. O pulso de entrada retangular injetado na linha é submetido a efeitos de dispersão e não linearidade, subsequentemente modulado e decomposto em uma série de sólitons. As principais equações que descrevem a operação de uma linha discreta são onde v p refere-se a velocidade de fase da onda, L(I) representa o valor da indutância em função da corrente, C(V) o valor da capacitância em função tensão e fc a frequência de corte, também denominada frequência de Bragg, sendo Z0 a impedância característica da linha. LTNLs podem produzir a compressão do pulso de entrada ou a geração de RF, em uma LTNL capacitiva a redução do tempo de subida (T) [4] é descrita por onde tri e tro correspondem respectivamente aos tempos de subida dos pulsos na entrada e na saída da LTNL, respectivamente, e n ao número de seções da linha. Quando 𝑡𝑟𝑖 é maior que T ocorre a compressão do pulso de entrada. Por outro lado, quando 𝑡𝑟𝑖 < ∆𝑇, posto que o tempo de subida é limitado pela frequência de Bragg, o pulso que se propaga ao longo da linha é decomposto em um trem de oscilações, conforme ilustra a Fig. 1. LTNLs giromagnéticas que possuem geometria coaxial contínua consistem em um meio magnético de propagação formado por núcleos magnéticos à base de ferrita imersas num campo magnético axial externo uniforme, como mostra a Fig. 2. Nesta linha as oscilações são geradas pela não linearidade do material e a precessão dos momentos magnéticos, que é matematicamente descrita pela equação de Landau-LifshitzGilbert [5] onde o primeiro termo à direita representa o movimento de precessão do momento magnético em torno do campo magnético efetivo (Heff), que resulta da interação do campo magnético de polarização axial com o campo azimutal gerado pelo pulso incidente. O segundo termo à direita de (7) representa o amortecimento que provoca o alinhamento do momento magnético ao campo magnético efetivo; os termos γ e α correspondem à razão giromagnética e ao coeficiente de amortecimento, respectivamente. Um pulso de alta tensão aplicado na entrada da LTNL giromagnética gera um campo magnético na direção azimutal. Uma vez que este campo é forte o suficiente para saturar as ferritas, idealmente todos os domínios magnéticos estarão alinhados na mesma direção e o valor da permeabilidade relativa será rapidamente reduzido, tal pulso provoca um aumento da velocidade de fase do sinal que se propaga ao longo da linha [6], como: onde c é a velocidade da luz no vácuo e r e µr são a permissividade elétrica e a permeabilidade magnética do meio, respectivamente. O topo do pulso de entrada se propaga com velocidade maior provocando a redução do tempo de subida [6] que é dada por onde neste caso, L e Lsat são respectivamente a indutância inicial e a indutância de saturação por unidade de comprimento da linha e C a capacitância coaxial fixa por unidade de comprimento da linha giromagnética. Uma interessante terceira variante de LTNLs é obtida através de uma linha indutiva não linear com dispersão anômala, uma vez que a propagação das ondas de choque ocorre devido à combinação da dispersão anômala com efeito giromagnético da ferrita do indutor, onde a polarização magnética das ferritas intensifica as oscilações que se propagam ao longo da linha. Estas linhas podem ter geometria planar ou coaxial e são conhecidas como linhas síncronas por apresentarem um sincronismo entre a velocidade de fase da onda de RF e a velocidade da onda de choque (isto é, vp=vs), possibilitando o ajuste da frequência das oscilações por meio da velocidade de fase. O ajuste da velocidade de fase por ser obtido por meio da polarização magnética das ferritas. A Fig. 3 ilustra a configuração de uma LTNL síncrona planar, onde os capacitores cruzados (C*) produzem a dispersão anômala. A Fig. 4 ilustra a propagação das oscilações de RF produzidas ao longo da linha saturada, que foi projetada para apresentar velocidade de grupo (vg) da onda de RF menor que a sua velocidade de fase (vp). A fase da oscilação de RF produzida é constante em relação a onda de choque, isto é a onda de choque consiste na metade do primeiro ciclo de RF. A energia flui da onda de choque para as oscilações de RF que possui velocidade de grupo menor que a velocidade da onda de choque, o que explica porque o número de oscilações aumenta à medida que a onda de choque se propaga ao longo da linha. III. PESQUISAS SOBRE LTNLS IMPLEMENTADAS A PARTIR DE MATERIAIS DIELÉTRICOS NÃO LINEARES A literatura reporta o uso de dois tipos de materiais na implementação de LTNLs que utilizam materiais dielétricos não lineares: cerâmicas ferroelétricas e semicondutores. As cerâmicas dielétricas não lineares utilizadas na construção de LTNLs capacitivas consistem em capacitores cerâmicos disponíveis comercialmente ou de blocos cerâmicos confeccionados especialmente para a construção das linhas fabricados, utilizando-se materiais ferroelétricos. Diodos semicondutores que possuem capacitância variável em função da tensão reversa aplicada, denominados de varicaps ou varactores, também têm sido utilizados nas pesquisas com LTNLs. Estas LTNLs capacitivas são construídas com diversas geometrias como placas paralelas interconectadas com blocos cerâmicos de material ferroelétrico ou com placas planas de circuito impresso (PCI), onde são soldados diodos varactores e indutores, bem como linhas planares do tipo microstrip, onde são soldados varactores e linhas monolíticas construídas com a tecnologia Monolithic Microwave Integrated Circuit (MMIC), as quais também utilizam varactores como elementos não lineares. Linhas monolíticas possibilitam a geração de pulsos na faixa de GHz, porém conforme [8], atualmente estes valores de frequência de operação não podem ser superados devido à dificuldade de se implementar varactores com frequência de corte maior, os quais requerem a utilização de espaçamentos dimensionais impraticáveis [8]. A. Capacitores cerâmicos As cerâmicas ferroelétricas utilizadas na construção de LTNLs discretas comercialmente disponíveis consistem em capacitores cerâmicos, que apesar de não terem sido produzidos para apresentar comportamento não linear da capacitância mediante a aplicação da tensão, apresentam a não linearidade da capacitância não só em função da tensão aplicada, mas também em relação a temperatura. Como estes capacitores geralmente apresentam tensão de ruptura entre 3 e 5 kV, então a não linearidade da capacitância é obtida quando a excursão da tensão aplicada abrange grande parte da tensão de operação. Na construção de capacitores cerâmicos em que são utilizadas cerâmicas ferroelétricas à base de titanato de bário e estrôncio, a maior variação da linearidade é observada em capacitores construídos sem a adição de dopantes para o controle da estabilidade térmica. Experimentos com LTNL registram a obtenção da redução do tempo de subida do pulso de entrada utilizando capacitores cerâmicos. Em [9] é relatada a redução do tempo de subida de 340 ns para 50 ns com uma LTNL capacitiva de 15 seções, construídas com indutores de 1,5 H e capacitores cerâmicos de 1,24 nF/30 kV, que apresentaram uma redução da capacitância de 63 % com a aplicação de um pulso incidente de 25 kV. Por outro lado, com uma LTNL construída utilizando três capacitores cerâmicos em série de 2,2 nF com tensão de ruptura de 6 kV e indutores de 1,6 H [10], obtevese a redução do tempo de subida do pulso de entrada de 500 ns para 120 ns. Usando esta configuração em série de capacitores, foi possível aumentar a tensão de operação da linha, permitindo a aplicação de um pulso de entrada de 20 kV, que possibilitou a redução de 82 % no valor nominal da capacitãncia dos capacitores utilizados. B. Cerâmicas ferroelétricas A investigação sobre o desempenho de LTNL capacitivas fabricadas com materiais cerâmicos ferroelétricos produzidos para este fim é relatada em [11]. As cerâmicas foram produzidas com titanato de bário e estrôncio (Sr0.4 Ba0.6TiO3), na forma de blocos retangulares interconectados por placas metálicas paralelas, como ilustrado na Fig. 5. A partir desta configuração, foram geradas de oscilações da ordem de 10 MW em frequências em torno de 300 MHz, por meio da aplicação de pulso de entrada de 14 kV. Outra pesquisa com blocos cerâmicos fabricados a partir da mistura de titanato de bário (9 %) e titanato de estrôncio (91 %) relata a obtenção de oscilações de 60 MW de potência de pico na frequência de 200 MHz, com uma linha montada na configuração de placas paralelas operando na temperatura de 77 K [12]. Porém, em pesquisas com LTNLs na configuração de placas paralelas utilizando blocos cerâmicos fabricados com niobato de magnésio e chumbo e alimentados com pulsos de amplitudes entre 4 e 43 kV, não se observou a produção de oscilações de RF, concluindo-se que o insucesso foi devido às perdas por histerese deste material, que nas simulações do tipo Spice foram representadas por uma resistência em série com o capacitor [13]. No entanto, a redução do tempo de subida em aplicações de compressão de pulso também pode ser obtida utilizando uma configuração de placas paralelas, conforme relatado na literatura [14] para a obtenção de pulsos com tempo de subida de saída da ordem de 400 ps e amplitude de 10 kV usando blocos cerâmicos com composição a base de titanato e estrôncio, de acordo com a formulação Ba0,75Sr0,25Ti0,95Sr0,05O3 . Os materiais ferroelétricos utilizados nas pesquisas caracterizam-se por apresentar valores elevados de permeabilidade elétrica e uma transição de fase estrutural caracterizada por um máximo bem definido na permeabilidade elétrica em função da temperatura. Esse máximo está associado à temperatura de Curie (Tc) e define uma transição da fase ferroelétrica para a paraelétrica, que surge devido à distorção da estrutura cristalina (Fig. 6). Esta característica encontra aplicação na construção de LTNL, mas requer o controle dos diversos fatores que possibilitam efetivamente acessar a não linearidade dos materiais ferroelétricos. As perdas dielétricas estão relacionadas aos fenômenos de relaxamento dielétrico, no que se refere à frequência de resposta limite de momentos de dipolo elétricos ao campo elétrico alternado aplicado, o que provoca a dissipação de energia na forma de calor, reduzindo a eficiência de conversão do NLTL. C. Varactores em linhas planares O uso de diodos varactores como elemento não linear na construção de LTNLs capacitivas possibilitam a obtenção do comportamento não linear da capacitância quando os diodos são polarizados no modo reverso. A variação da capacitância se origina da variação dos portadores de carga na camada de depleção na região P-N, sendo onde C0 é a capacitância inicial sem polarização, V a tensão aplicada, Vj a tensão de junção e n corresponde ao coeficiente de inclinação, que varia em função da concentração de impurezas (dopagem) na junção P-N. Diodos varactores podem ser classificados em função da sua concentração de impurezas na junção P-N: (i) quando concentração de impurezas é distribuída de forma linear (n=1/3); (ii) com variação abrupta (n=2) e (iii) hiperabrupta (n>2). O coeficiente de inclinação é proporcional a razão de não linearidade (Cmax:Cmin), que para varactores do tipo hiperabrupto pode ser superior a 10:1. Além da relação da taxa de variação da capacitância em função da tensão reversa aplicada, outro importante parâmetro de um varactor é a sua frequência de corte definida [16] por onde Smax e Smin correspondem às elastâncias (inverso das capacitâncias) máximas e mínimas, respectivamente, e Rs representa a resistência parasita em série. A maior eficiência do varactor está relacionada a um baixo valor de Rs e a uma alta razão das elastâncias dada por Smax / Smin. Os resultados das pesquisas sobre LTNLs capacitivas que utilizam varactores como elementos não lineares relataram a obtenção de pulsos da ordem de 100 V com tempo de subida de 10 ns a partir de uma linha construída com indutores de 1 H e diodos que apresentam variação de capacitância entre 500 e 130 pF, quando submetidos a pulsos de tensão da ordem de 10 V [17]. Em [2] foi apresentada a análise do desempenho de uma LTNL capacitiva construída com diodos varactores (BB809) e indutores lineares de 2,7 µH, com geração de sinal de RF da ordem de 33 MHz. A propagação do sinal ao longo da linha é influenciada por diversos fatores: a) a variação da capacitância (77 %), b) perdas dependentes da frequência e c) características do sinal de entrada (amplitude, tempo de subida, frequência e ciclo de trabalho). D. Varactores e diodos Schottky em linhas monolíticas Desde os anos 90, diversas pesquisas têm relatado a construção de LTNL monolíticas, que consistem em estruturas planares compactas como: microlinhas (microstrip lines), coplanares guias de ondas (Coplanar Waveguide – CPW) e finlines. Estas linhas utilizam diodos tipo Schottky (diodo que também apresenta variação não linear da capacitância) ou varactores do tipo HBV (Heterostructure Barrier Varactor – diodo que polarizado reversamente apresenta variação da capacitância não linear e simétrica). Esses semicondutores possuem frequência de corte (THz) altíssima, porém apresentam tensão de ruptura menores que 10V, desta forma LTNLs construídas com esses varactores tipo HBV e diodos Shottky geram sinais de baixa potência. Os resultados experimentais da construção de uma LTNL utilizando uma estrutura coplanar com diodos Schottky de arseneto de gálio é apresentado em [18], como mostra a Fig. 7. Neste experimento, foram obtidos pulsos com tempos de descida de da ordem de 1,4 ps, o que permite a implementação de circuitos de amostragem na faixa de 300 GHz. A LTNL monolítica apresentada em [19] foi construída com varactores do tipo HBV de alta razão de variação de capacitância da ordem de 3,8 (26 fF /6,8 fF), soldados numa estrutura tipo finline, como ilustrado na Fig. 8. Esta linha operou como um multiplicador de frequência, produzindo sinais com 10 dBm de potência de pico em 130 GHz e com 7 % de eficiência. IV. PESQUISAS SOBRE LTNLS IMPLEMENTADAS A PARTIR DE MATERIAIS MAGNÉTICOS NÃO LINEARES As pesquisas sobre construção de LTNLs que utilizam materiais magnéticos como elementos não lineares reportam o uso de indutores construídos com enrolamentos em núcleos de ferrita, que possuem alta resistividade, baixa coercitividade e baixas perdas em alta frequência até 500 MHz. Ferritas são cerâmicas ferrimagnéticas fabricadas a partir de óxido de ferro, geralmente combinado com óxidos de zinco, níquel, manganês e cobalto, que exibem a propriedade não linear. Ferritas apresentam perdas relacionadas à frequência de relaxamento dos dipolos magnéticos. A geração de RF a partir de LTNL síncrona planar é relatada em [7], cuja linha foi construída com capacitores lineares plásticos e indutores não lineares (ferritas), mantidos na condição de saturação por meio da polarização. A sintonia das oscilações na faixa entre 200 MHz e 1 GHz foi obtida pela variação do nível de saturação dos indutores, onde as oscilações apresentaram potência de pico de 20 MW com taxa máxima de repetição de 1 kHz. Outra pesquisa com LTNL síncrona com geometria coaxial [20] relata a geração de RF com frequência sintonizável na faixa entre 0,9 GHz e 1,5 GHz com potência de pico da ordem de 100 MW. O excelente resultado obtido com uma LTNL giromagnética gerando pulsos com potência de pico entre 50 e 700 MW em frequências de 0,5 a 1,7 GHz para uma taxa de repetição de 100 Hz é relatado em [21]. V. CONCLUSÃO No processo de geração de RF e de redução dos tempos de subida, o desempenho de LTNLs está relacionado com as propriedades dielétricas e magnéticas dos materiais não lineares empregados, cujas características mais importantes são o comportamento não linear acentuado e as baixas perdas em alta frequência. LTNLs capacitivas construídas com materiais ferroelétricos à base de titanato de bário apresentaram geração de RF de até 300 MHz utilizando cerâmicas ferroelétricas produzidas à base de titanato de bário e estrôncio, enquanto que linhas que utilizaram capacitores cerâmicos comerciais com composição à base de titanato de bário produziram RF com até 80 MHz [2]. Observa-se que para gerar RF e provocar a redução do tempo de subida de saída pulsos LTNLs capacitivas necessitam ser alimentadas com alta tensão, para que a não linearidade dos capacitores cerâmicos seja obtida. As LTNLs capacitivas monolíticas e coplanares permitiram a operação das linhas na faixa de frequência de GHz, porém somente são adequadas para operação em baixa potência. A frequência de operação das linhas que utilizam materiais magnéticos é limitada pelas perdas de energia por relaxação dos momentos magnéticos. Materiais magnéticos também se caracterizam por apresentarem forte dependência de suas características magnéticas em função da temperatura, comportamento que limita o desempenho da LTNL. Portanto, este fato expõe a necessidade de pesquisas que investiguem o desenvolvimento de novos materiais magnéticos que além da não linearidade da permeabilidade magnética, também exibam a estabilidade térmica e baixas perdas em alta frequência. A análise dos resultados de pesquisas sobre LTNLs permite observar que, enquanto LTNLs capacitivas produziram RF com frequência máxima de 300 MHz, linhas giromagnéticas foram capazes de gerar sinais com até 1.7 GHz, devido à maior não linearidade da indutância baseada na ferrita quando comparada à não linearidade das cerâmicas ferroelétricas e diodos varactores, usados em LTNLs capacitivas. O estudo dos resultados obtidos nas pesquisas existentes sobre LTNLs identifica a demanda por novos materiais não lineares com características específicas que possibilitem: (i) o aumento da conversão de energia por meio da redução das perdas e (ii) a operação em alta frequência por meio do incremento da não linearidade em meios dielétricos e magnéticos com estabilidade térmica.   "
}