	{
		"id": 91,
		"titulo": "filtro de rf fotônico sintonizável por variação de temperatura em laser dfb",
		"autor": "felipe streitenberger ivo, rodrigo de faria baroni, olympio luchini coutinho",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2017/st/ST_11_2.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 2,
		"resumo": "Este artigo utiliza a técnica de conversão de modulação óptica de fase em intensidade associada a variação do comprimento de onda do laser DFB para implementar um filtro fotônico de radiofrequência (RF) do tipo passa faixa com largura de banda de 154 MHz sintonizável na faixa de frequência de 0,5 a 3,0 GHz, com potencialidade de ser aplicado para processamento fotônico de sinais de micro-ondas na área de Guerra Eletrônica (GE). A técnica de conversão de modulação óptica de fase em intensidade é realizada a partir de uma grade de Bragg especial, projetada com um vale de baixo coeficiente de reflexão óptico. Um modelo matemático é proposto a partir de uma fundamentação teórica. Resultados experimentais de demonstração de conceito e uma aplicação em Guerra Eletrônica são apresentados.",
		"texto": "I. INTRODUÇÃO Receptores de Guerra Eletrônica (GE) modernos devem ser capazes de detectar e classificar múltiplas ameaças radar em uma ampla faixa de frequência, geralmente de 0,5 a 40 GHz [1-2], de forma a prover principalmente a um sistema de alerta radar uma alta probabilidade de interceptação de sinais dentro dos cenários de combate de GE [1-2]. Nestes cenários, o receptor GE está sujeito a interceptar uma grande quantidade de sinais de RF, uma vez que os sistemas de rádio, radar e GE de forças amigas e inimigas irradiam em uma ampla faixa de frequência e operam praticamente de forma simultânea [2]. Neste sentido, a implementação de filtros de RF de banda estreita do tipo passa-faixa com elevada faixa de frequência de sintonia torna-se um fator crucial para prover ao receptor GE um melhor desempenho quanto a seletividade de sinais utilizados para processamento de sinais de GE. Filtros de RF sintonizáveis de micro-ondas implementados com tecnologia de eletrônica convencional são usualmente empregados para prover a capacidade de seletividade de sinais de RF em uma ampla faixa de frequência de operação ao receptor de GE, porém geralmente estão associados a um alto custo, uma arquitetura com grande complexidade e possuem algumas limitações técnicas, principalmente quanto a sintonia e a resposta em frequência [3]. Atualmente sistemas de RF em fotônica estão sendo desenvolvido para prover baixos custos, menor complexidade e superar limitações técnicas das arquiteturas implementadas através da eletrônica convencional [4-6]. RF em fotônica é uma área de pesquisa interdisciplinar que trata das interações entre sinais elétricos na faixa de frequência de micro-ondas com sinais ópticos com o objetivo de geração, transmissão e processamento de sinais de RF realizados, na maioria das vezes, no domínio óptico [7]. A tecnologia RF em fotônica apresenta diversas vantagens em relação a sistemas de transmissão de micro-ondas convencionais, podendo ser destacados as seguintes características: tamanho reduzido, baixo peso, ampla largura de banda, elevada imunidade a interferência eletromagnética (EMI), baixas perdas RF/RF e facilidade de manuseio [5]. Além destas características, a tecnologia RF em fotônica permite a transmissão remota de sinais de RF em uma ampla faixa de frequência de micro-ondas, permitindo ao sistema de RF obter longo alcance com baixo custo [7]. Adicionalmente, técnicas de processamento fotônico de sinais de micro-ondas podem ser implementadas aos sistemas de RF convencionais de forma a prover simplicidade e melhor desempenho [8-9]. Dentro deste contexto, a implementação de filtros de microondas fotônico com capacidade de realizar sintonia de frequência de RF em uma ampla faixa do espectro de microondas torna-se uma característica atrativa para o seu emprego em sistemas defesa, especificamente na área de receptores de Guerra Eletrônica – GE [10]. O filtro de micro-ondas fotônico (FMF) pode ser modelado como um subsistema fotônico com capacidade de desempenhar funções de processamento de sinais de RF. Este subsistema é geralmente denominado de processador óptico de sinais, sendo inserido dentro de um sistema de RF, geralmente no receptor, com o objetivo de realizar tarefas equivalentes a um filtro de micro-ondas convencional e possui algumas vantagens, principalmente quanto a sintonia e reconfigurabilidade [11]. Dentre as técnicas que permitem o filtro de micro-ondas fotônico desempenhar a sintonia de RF, destaca-se, quanto as características de simplicidade e desempenho, a utilizada na arquitetura de FMF implementada a partir da técnica de conversão óptica de fase em intensidade [12]. Nesta arquitetura, o sinal de RF com baixa amplitude modula em fase uma portadora óptica, a qual é proveniente de um único laser operando em regime contínuo. Uma modulação óptica de fase é então realizada gerando um espectro óptico composto basicamente pela portadora óptica e por duas bandas laterais. O sinal óptico modulado em fase é então acoplado a uma fibra óptica do tipo FBG, a qual atua como um filtro óptico eliminando uma das raias laterais da modulação óptica de fase, sendo suas características de desempenho transladadas para o filtro de RF. Assim, quando o filtro óptico atua, há a detecção no fotodetector do sinal de RF por meio da variação da intensidade do sinal óptico. Esta técnica é denominada de conversão de modulação óptica de fase em modulação óptica de intensidade [12]. A sintonia de RF de um filtro de micro-ondas fotônico que implementa a técnica de conversão de modulação de fase em amplitude pode ser realizada variando o comprimento de onda da fonte óptica [11], sendo neste artigo realizada a partir do controle de temperatura de um laser do tipo DFB [13]. A diferença de frequência entre o laser e o filtro óptico da grade FBG é equivalente a frequência de sintonia de RF do FMF. Desta forma, este artigo tem como objetivo apresentar um estudo teórico sobre o filtro de RF fotônico baseado na técnica de conversão de modulação óptica fase em amplitude com sintonia do laser DFB através da temperatura e apresentar uma caracterização experimental óptica da variação do comprimento de onda do laser DFB e da grade FBG com a temperatura. Além disso, este artigo tem o objetivo de demonstrar uma aplicação do filtro fotônico de RF sintonizado por temperatura em Guerra Eletrônica. Este artigo está organizado da seguinte forma: na seção II é apresentada uma fundamentação teórica sobre o princípio de funcionamento do filtro fotônico de RF sintonizável; na seção III são apresentados experimentos sobre a caracterização óptica do laser e da grade FBG; na seção IV é apresentado uma aplicação em Guerra Eletrônica do FMF sintonizável; e na seção V são tecidas as conclusões deste trabalho. II. PRINCÍPIO DE FUNCIONAMENTO DO FILTRO FOTÔNICO DE RF SINTONIZÁVEL O filtro de micro-ondas fotônico é implementado a partir da técnica de conversão de modulação de fase em intensidade óptica, conforme mostrado na arquitetura apresentada na fig. 1. Nesta arquitetura, uma portadora óptica (Eopt) proveniente de um laser operando com frequência óptica, é modulado em fase por um sinal na frequência de micro-ondas (VRF). Os sinais referentes ao campo elétrico da portadora laser e ao sinal modulante podem ser expressos como: onde é o campo elétrico óptico da saída do laser [V/m,  é a frequência angular óptica do laser [rad/s]; e onde é tensão de pico do sinal de RF [V], é a frequência angular do sinal de RF [rad/s] e é a fase inicial do sinal de RF [rad]. Na fig. 1, o sinal óptico do laser e o sinal de RF são os sinais equivalentes aos observados nos pontos A e B, respectivamente. A variação de fase do sinal óptico na saída do modulador pode ser expressa como: Este sinal corresponde ao sinal óptico do ponto C da fig. 01. Na equação (3), o termo corresponde ao índice de modulação de fase e é definido como: sendo este termo proporcional a tensão de pico (V) do sinal de RF aplicado na entrada do modulador e a tensão de meia onda do modulador de fase (Vπ). Considerando uma condição especial de operação do modulador, a qual é denominada de regime de operação de pequenos sinais, em que 1, a equação (4) pode ser matematicamente reescrita de forma simplificada em função das equações de Bessel. Desta forma o sinal de saída do modulador no regime de operação de pequenos sinais pode ser expresso por: onde , e  são as função de Bessel de primeira espécie e ordem 0 e 1, respectivamente. Este sinal de saída do modulador de fase é então acoplado a uma grade de Bragg em fibra óptica com fase deslocada (FBG) por meio de um circulador óptico,, ponto D da fig. 1. Esse tipo especial de grade de Bragg é caracterizado como um filtro óptico com um vale de baixa refletividade centrado dentro de uma faixa de operação com alta reflexão, sendo suas características de desempenho transladadas para o filtro de RF. O sinal óptico refletido pela FBG, ponto E da fig. 1, é expresso pela equação (6) e depende diretamente da resposta em frequência dos parâmetros de refletividade 3() e fase 4() da FBG. É importante observar que a FBG de fase deslocada é projetada para possuir um alto coeficiente de refletividade óptico, sendo praticamente constante para frequência de RF na região fora do vale. Como observado na fig. 1, o sinal refletido pela FBG é então acoplado na entrada de um fotodetector no ponto E, sendo o sinal de RF novamente recuperado na saída do filtro. A componente alternada (ac) do sinal de RF recuperado pode ser expressa por (7), sendo a potência de RF detectada equivalente a (8). Este sinal corresponde ao encontrado no ponto F do diagrama de blocos da figura 01. Expandindo a equação (8) em função de (6) tem-se finalmente (9), a qual representa a potência do sinal de RF na saída do filtro fotônico em função dos coeficientes de refletividade da FBG. A partir de (9), observa-se que a detecção do sinal de RF apenas será possível quando uma das bandas laterais do sinal óptico modulado em fase estiver sintonizado na frequência do vale da FBG, condição esta mostrada na fig.1. Caso contrário, a refletividade e o desvio de fase serão dados como (13) e (14) respectivamente e nenhuma potência de RF será detectada na saída do FMF. A sintonia do filtro fotônico de RF pode ser obtida a partir da variação do comprimento de onda do laser DFB correspondente a variação da respectiva frequência de oscilação do laser. Este efeito é causado pela variação do índice de refração do meio ativo da cavidade óptica laser através da variação de corrente ou pela alteração de temperatura do laser DFB. O comprimento de onda de oscilação do diodo laser pode ser expresso matematicamente por: onde H* é o comprimento de onda inicial [nm], J5 a variação do comprimento de onda pela corrente [nm/°A], ∆L é variação de corrente do laser [A], JM a variação do comprimento de onda pela temperatura [nm/°C] e J5M a variação do comprimento de onda pela temperatura e corrente [nm/°C.A]. Neste trabalho a corrente do laser DFB é mantida constante e a sintonia é realizada simplesmente através da temperatura. Nesta condição a equação (15) pode ser simplificada para: III. CARACTERIZAÇÃO ÓPTICA DA VARIAÇÃO DO COMPRIMENTO DE ONDA DO LASER E DA GRADE FBG COM A TEMPERATURA O arranjo experimental utilizado para demonstrar o conceito do filtro fotônico de RF implementado pela técnica de conversão de modulação óptica de fase em intensidade e sintonizável por temperatura em laser DFB é o apresentado no diagrama de blocos da fig. 2. Neste arranjo, o sinal de micro-ondas proveniente do FMF é aplicado na entrada de um amplificador de RF, o qual apresenta uma resposta em frequência de 0,5 a 18 GHz com um ganho típico de 42 dB. O sinal de RF da saída do amplificador é inserido na entrada do analisador de rede de micro-ondas, sendo a resposta em frequência e a sintonia do filtro fotônico de RF avaliado para a faixa de frequência de 0,5 a 3 GHz. Já a caracterização óptica é realizada a partir de um analisador de espectro óptico acoplado ou na saída do modulador óptico de fase (ponto C), ou na saída do circulador óptico (ponto E), sendo caracterizadas a variação do comprimento de onda do laser e a resposta óptica da grade, ambos em função da temperatura. O comprimento de onda do laser DFB e a caracterização óptica da grade FBG, ambas em função da variação da temperatura, são apresentados nas figuras 3 e 4. Em ambas as caracterizações ópticas nenhum sinal de RF foi acoplado na entrada do modulador óptico de fase, sendo a corrente do laser fixada em 43 mA e potência óptica mantida constante em -2,5 dBm no ponto C. Na fig. 4 podem ser observados a faixa de operação da FBG, correspondente a faixa de temperatura em que a amplitude do sinal refletido pela FBG cai metade da potência (3 dB), a temperatura referente ao vale de baixo coeficiente de refletividade da FBG. Além disso, a perda óptica de inserção da FBG pode ser observada. A caracterização experimental da largura de banda do filtro fotônico de RF e sua respectiva faixa de sintonia por temperatura são apresentados na Fig. 5, em um range de 0,5 a 3 GHz, para 4 frequências de micro-ondas distintas. IV. APLICAÇÃO EM GUERRA ELETRÔNICA DO FILTRO FOTÔNICO DE RF SINTONIZÁVEL POR TEMPERATURA A demonstração experimental em GE do filtro de RF fotônico por controle de temperatura será mostrada considerando a capacidade do filtro de RF selecionar um entre 2 sinais de frequência de micro-ondas acoplados na entrada do FMF, sendo a sintonia realizada a partir da variação de temperatura no laser DFB. Para demonstrar tal capacidade, são inseridos na entrada do FMF 2 sinais de micro-ondas normalizados para amplitude de 0 dBm, operando respectivamente nas frequências de 1,3 GHz e 2,1 GHz. Estes sinais são gerados por 2 fontes de micro-ondas independentes e são acoplados na entrada do modulador óptico de fase através de um combinador de RF. O sinal de RF na saída do FMF é então avaliado a partir de um analisador de espectro de RF para condição de sintonia do filtro fotônico de RF em 1,3 GHz e para 2,1 GHz. O diagrama de blocos do arranjo experimental utilizado para demonstrar a aplicação GE do filtro fotônico de RF sintonizável por temperatura é apresentado na Fig. 6 e os resultados são apresentados na Fig. 7 (sinais de RF de entrada), Fig. 8 (sinais de RF da saída do FMF na frequência de sintonia de 1,3 GHz) e Fig. 9 (sinais de RF da saída do FMF na frequência de sintonia de 2,1 GHz). V. CONCLUSÃO Este trabalho apresentou uma abordagem teórica e experimental sobre filtro fotônico de micro-ondas sintonizável por meio do controle de temperatura em laser DFB. Na parte teórica, um modelo matemático do filtro de RF considerando a conversão de modulação óptica de fase em amplitude a partir das características de refletividade de uma fibra com grade Bragg de fase deslocada, e a sintonia do laser DFB a partir da variação de temperatura foram revisados. Já na parte experimental, foram caracterizados: resposta óptica da variação do comprimento de onda do laser DFB e da grade FBG com a temperatura; a largura de banda e a sintonia de RF do filtro fotônico. Além disso, um experimento em Guerra Eletrônica de seleção de bandas de frequência de RF foi realizado a partir do controle de temperatura do filtro fotônico de micro-ondas. As medidas realizadas demonstram a capacidade e o potencial de emprego da tecnologia de RF em fotônica em ambientes de RF críticos, como os encontrados na área de Guerra Eletrônica."
	}
