{
    "id": 92,
    "titulo": "modelo para rastreio e estimação de alvos em trajetórias tridimensionais",
    "autor": "jair agner júnior, marcos dos santos e carlos francisco simões gomes",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2017/st/ST_04_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Acompanhar alvos é um processo complexo, o qual exige algoritmos de associação capazes de lidar com o uso de técnicas de filtragem lineares e nãolineares. Sabe-se que os modelos bidimensionais de sistemas de controle de tráfego aéreo, mostram-se insuficientes para o tratamento de manobras tridimensionais de alvos militares, devido as consideráveis variações de altitude. O trabalho abrange modelos de dinâmica de voo, que descrevem a evolução do estado de um alvo, tratado como objeto pontual em trajetórias tridimensionais, sendo abordando o problema da incerteza do seu movimento. Esse modelo tem aplicação em sistemas de navegação e vigilância civis e militares, permitindo o rastreamento de alvos em tempo real. Adotou-se como estimadores de estado o Filtro de Kalman Linear (FK) e o Filtro de Kalman Estendido (FKE) com integração através do filtro de sistemas híbridos Múltiplos Modelos Interagentes (IMM). Exemplos numéricos ilustram a aplicabilidade e desempenho do método proposto.",
    "texto": "I. Introdução A proposta deste trabalho é mostrar um modelo que teve como foco o rastreio de aeronaves militares de asa fixa, com deslocamento tridimensional, com informações de posição obtidas de um sensor radar, com a conversão dos dados desse emissor para coordenadas cartesianas, e a partir destas obter as informações de velocidades para compor o vetor de medidas. O problema de rastreamento de alvos manobrantes, é uma tarefa complexa, exigindo diversos estudos e análises variadas, não só de ordem conceitual, mas também de ordem prática. Diversos modelos tem sido desenvolvidos para aprimorarem as soluções existentes, como os descritos em [1], [2], [3] entre outros. O problema de rastreamento tem origem na teoria da estimação, cujo propósito é desenvolver estimadores, também denominados de filtros, os quais tenham a possibilidade de serem aplicados na prática em diversos problemas de engenharia tais como, estimação de órbita e altitude, navegação integrada, vigilância e determinação do posicionamento futuro de alvos por radar ou sonar, sistemas de potência, detecção de falhas, entre outros [4]. Neste contexto, a filtragem consiste em se estimar as variáveis de estado de um sistema estocástico linear ou não linear. Com a função de representar essas variáveis de estado de maneira aproximada, são desenvolvidos modelos para serem utilizados nas filtragens, permitindo que haja uma melhor estimação das posições futuras dos alvos. Entre os diversos modelos dinâmicos existentes, foram escolhidos dois para o desenvolvimento deste trabalho, o modelo CV (Velocidade Constante), implementado com o FK e o modelo CT (Giro Constante), implementado com o FKE. Estes modelos representam casos particulares do modelo de cinemática do movimento curvilíneo planar (CLM) com dinâmica de movimento bidimensional [5]. A escolha de mais de um modelo se deve à possibilidade de um alvo experimentar diferentes padrões de comportamento ao longo do tempo, e esses modelos foram selecionados porque podem representar de forma adequada os possíveis movimentos de um alvo manobrante, visto que, é preciso que tanto as técnicas de filtragem lineares como as não-lineares sejam implementadas. Para utilizar mais de um modelo em um problema de estimação de estados, deve-se fazer uso de uma técnica que permita a utilização de modelos em paralelo. A abordagem adotada para trabalhar com múltiplos modelos paralelamente foi o algoritmo IMM, proposto por [6]. II. Múltiplos Modelos Interagentes (IMM) A principal vantagem do IMM é estimar o estado de um sistema dinâmico e sua respectiva matriz de covariância através da soma ponderada das estimativas de N modelos de FK executados em paralelo. O IMM é uma ferramenta de estimação adaptativa de estados em sistemas híbridos, que segue os processos de uma cadeia de Markov, em que a cada iteração são calculados os fatores de ponderação para a combinação das estimativas de cada um dos modelos de filtro. Neste contexto, sistemas híbridos referem-se a necessidade de fazer uso tanto de técnicas de filtragem lineares como não-lineares. A implementação de tais técnicas se deve à possibilidade de um alvo experimentar diferentes padrões de comportamento ao longo do tempo, e o uso de um único FK se torna ineficiente para adaptar-se a essas variações do movimento. Dessa forma, fez-se uso do IMM para trabalar simultaneamente com o FK (utilizando o modelo CV) e com o FKE (utilizando o modelo CT) III. Modelos Matemáticos Muitas das técnicas de rastreamento de alvos são descritas através de modelos, que baseiam-se nos aspectos de comportamento e observações do alvo. O comportamento é normalmente representado na forma de um modelo dinâmico ou de movimento, também chamado de modelo de estados, descrevendo a evolução de diversas grandezas físicas como posição, velocidade etc. O aspecto que trata das observações do alvo é representado através de modelos de observação. Dessa forma, para tratar adequadamente o problema de rastreamento, iremos descrever os modelos matemáticos, levando em conta as equações, variáveis e parâmetros pertinentes. As Equações (1) e (2) definem o FK e o FKE, que são descritos de forma detalhada com aplicações em [4], [7] e [8]. Entretanto neste trabalho o filtro de Kalman soluciona o problema geral de buscar estimar o estado x ∈ R8 de um processo controlado em tempo discreto que é governado pela equação de diferença estocástica linear (1), com uma medição zk ∈ R5 (2) descritas por: A estimação de estados efetuada pela Equação (1) obedece as leis que governam o movimento da aeronave. Essas leis, assim como a abordagem adotada para o cálculo das medições efetuadas pela Equação (2), serão descritas mais adiante. As variáveis aleatórias wk e vk+1 representam o ruído de processo e ruído de medição, respectivamente. Elas são consideradas ruídos tipo branco (gaussiano), independentes, com distribuição de probabilidade contínua, normal, identicamente distribuídas, com média zero e covariância Q e R, respectivamente. Assim, p(w) ∼ N(0, Q) e p(v) ∼ N(0, R). A matriz F8×8 de transição de estados, na Equação (1), refere-se ao estado da amostra no intervalo de tempo anterior k, para o estado atual no tempo k + 1, na ausência de uma função de condução ou ruído do processo. A matriz G8×5 refere-se a entrada de controle opcional uk ∈ R5 para o estado xk+1. Nesta abordagem, a entrada de controle uk pode ser atribuída como o ruído da posição do sensor que faz a medição da posição do alvo. Dessa forma, o movimento do sensor tem influência sobre a posição do alvo. A matriz G8×5 controla os efeitos de uk, e como neste trabalho é considerado um observador estático, o termo Gkuk não é incorporado na equação do processo. A matriz B8×5 controla os efeitos de wk. A matriz H5×8, na Equação de medição (2), relaciona o estado à medida zk+1. Para o modelo de observações do alvo, utilizamos como referência medidas do sistema radar. Estas medidas, assumidas não tendenciosas, são representadas em forma de vetor zk = [rk θk φk]T , onde rk é a distância em metros do alvo ao observador, θk é o ângulo de azimute em graus medido desde o norte geográfico ao centro do alvo e φk é o ângulo de elevação em graus medido desde um referencial horizontal nulo (plano horizontal, no caso nível do mar) ao centro do alvo. Sabe-se que estas medidas são perturbadas por ruídos (ou erros), na distância (vd k), no ângulo de azimute (vkθ) e no ângulo de elevação (vφ k), os quais são assumidos independentes e estacionários com distribuição Gaussiana de média zero e variâncias constantes σd, σθ e σφ, respectivamente. Neste trabalho, o alvo foi tratado como objeto pontual (ou particular), descrito em três dimensões, com vetor posição representado por r(t) = [x(t) y(t) h(t)]T , em coordenadas cartesianas. Sendo assim, para o modelo dinâmico ou de movimento, foram utilizadas como variáveis de estado x, y (coordenadas horizontais), h (altitude), χ (ângulo de proa ou rumo), γ (ângulo de trajetória), v (vetor velocidade) e a (vetor aceleração). As equações (3), (4) e (5) são obtidas a partir da derivada das componentes de r(t), e descrevem a velocidade do alvo em função das coordenadas cartesianas relacionando a velocidade tangencial instantânea v(t), γ e χ. A diferenciação das equações (3), (4) e (5) resultam em equações diferenciais de segunda ordem, que rearranjadas podem ser reescritas respectivamente por (6), (7) e (8): Sabendo que χ˙(t) é a taxa de variação angular horizontal e γ˙(t) é a taxa de variação angular vertical de um alvo. Para esse modelo deve ser considerado que atuam sobre o alvo, a aceleração tangencial e a aceleração normal ou centrípeta. A aceleração tangencial atg (9) é tangencial ao movimento e provoca a variação do módulo da velocidade do corpo. A aceleração centrípeta acp é perpendicular ao movimento e modifica a direção da velocidade, possuindo uma componente horizontal acpχ (10) e outra vertical acpγ (11). A. Dedução dos Modelos CV e CT Baseado em [5], que descreve o modelo CLM de forma bidimensional, foram deduzidos os modelos CV e CT tridimensionais aqui apresentados. O alvo no modelo CV, que também é conhecido como modelo de Movimento Retilíneo Uniforme, se movimenta com velocidade constante e em linha reta. Dessa forma, vx(t), vy(t) e vh(t) são constantes, e atg, acpχ e acpγ são nulas. Consequentemente, ax(t), a y(t) e ah(t) são nulas. No modelo CT o alvo se movimenta com velocidade e taxa de giro constantes. Assim, vx(t), vy(t) e vh(t) são constantes. A atg, acpχ e acpγ, são dadas respectivamente por (12), (13) e (14). A partir das mesmas obtemos ax(t), a y(t) e ah(t), que são dadas respectivamente por (15), (16) e (17). Passemos a trabalhar com a Equação (1) em tempo contínuo e derivando a mesma em função do tempo, temos a seguinte equação vetorial de processo em tempo contínuo: Em (18), X(t) é o vetor de estados definido por (19) e X˙ (t) é definido por (20). A(t) é a matriz auxiliar de dedução da matriz de transição de estados F da Equação (1). Face a limitação de espaço, foi suprimido o (t)dos componentes dos vetores X(t) e X˙ (t): U é o ruído de processo em tempo contínuo, visto como uma perturbação na velocidade e na taxa de giro, definido por (21) para o Modelo CV e por (22) para o Modelo CT: w é o ruído em cada um dos eixos cartesianos (wx, wy e wh) e nas taxas de giro (wχ e wγ), sendo dado por: w = [wx wy wh wχ wγ]T . A matriz A, para o modelo CV é obtida substituindo (19), (20) e (21) em (18), sendo dada por (23), e para o modelo CT, substituindo (19), (20) e (22) em (18) sendo dada por (24): O processo de medição radar tem uma natureza de tempo discreto, sendo aqui representado por Tk. A discretização da equação vetorial do processo (18), com período de amostragem Tk é feita utilizando a expansão em séries de Taylor em segunda ordem, sendo dado por (25): Na qual Xk é o vetor de estados (19), X˙ k é a equação de (18) e Ak é a matriz de transição de estados, dada por (23) ou (24), na forma discreta, tendo como base o instante de tempo k. O intervalo de tempo entre medições sucessivas, originárias de um mesmo objeto, é definido como Tk = tk+1 − tk. O ˆ representa valor estimado, dessa forma Xˆk+1|k é o valor de X estimado no instante de tempo (k+ 1) com base no valor do instante anterior k. Assim, (18) de forma discreta passa a ser escrita como (26). X¨k na Equação (27) representa a derivada da Equação (26) em relação a k, para U constante. Substituindo as Equações (26) e (27) em (25) obtemos a Equação (28): Na Equação (28), I é a matriz identidade, e podese observar que pela mesma temos os valores de Fk e Wk para os modelos CV e CT. Assim, para o modelo CV, substituindo estes Ak de (23) e Uk de (21) em (28), passamos a ter a equação do processo (29): Para o modelo CT, substituindo as equações (22) e (24) na Equação (28), passamos a ter uma equação vetorial do processo do modelo CT. Entretanto, devido a componente Fk · Xk dessa equação ser uma função de transição de estados não linear (simbolizada por f(k, Xk)), utilizamos o processo de linearização descrito em [4], para tratar este problema da não linearidade intrínseco ao modelo de FKE. Aplicando o cálculo do Jacobiano na função vetorial f(k, Xk), obtemos a matriz Flk linearizada. Assim, a equação de processo linearizada para o modelo CT (Xˆk+1|k) é representada por (30), onde alguns de seus componentes seguem destacados devido limitação de espaço: a16 = b23 = −cos(χk)ωγk T2k2 ; a26 = −cos(χk)ωγkTk + sin(χk)ωχkωγk T2k2 ; a24 = −ωχkTk − cos(χk)sin ω(γ2χkk) T2k2 ; a36 = b43 = −sin(χk)ωγk T2k2 ; a44 = 1 − ωχ2k + ωγ2k T2k2 ; a46 = −sin(χk)ωγkTk − cos(χk)ωχkωγk T2k2 ; e a66 = 1 − ω2 γk T2k2 . Xˆk+1|k = Segundo [9], podemos assumir os ruídos wx, wy, wh wχ e w γ como independentes com média zero e variâncias σx2, σ2 y, σh2, σω2χ e σω2γ respectivamente. Para matriz de covari- ância dos ruídos associados ao estado (Qk), assumiremos σ2 x = σy2 = σh2 = σq2. Qk é obtido fazendo: Qk = E[Wk·WkT ]. B. Definição da Equação de Medida O sistema radar fornece o vetor de medidas zk em coordenadas polares. Foi realizada uma transformação não linear, de modo que passasse a ser descrito como zk = [xkz vxk z ykz vyk z hkz vz hk ωχk z ωγk z ]T , para relacionar este vetor com o vetor de estados do alvo xk (definido em coordenadas cartesianas) de cada um dos filtros. Para isso foram adotadas duas etapas: a primeira consiste em transformar a medida em coordenadas cartesianas antes da entrada no filtro. A segunda, devido à natureza não linear da transformação, há a necessidade de utilização das equações do FKE, para tratar a não linearidade. Por meio de uma função de transformação trigonomé- trica, as medidas de distância (rk), ângulo de azimute (θk) e ângulo de elevação (φk), obtidas em um sistema de coordenadas polares, são calculados os componentes de posição em coordenadas cartesianas (x, y e h) da seguinte forma: xz k = rk ·cos(θk)·cos(φk); yz k = rk ·sin(θk)·cos(φk); e hz k = rk · sin(φk). Para calcular os componentes de velocidade de zk, foi utilizado o cálculo simples da velocidade média, através dos dados de medida de posição atual zk e anterior zk−1, da seguinte forma: Os ângulos de azimute e elevação do alvo, em cada amostragem, são obtidos a partir da projeção destes vetores velocidades. Dessa forma a velocidade angular ωχk z pôde ser obtida a partir da diferença entre o ângulo de azimute atual e o anterior, divididos pelo tempo. Foi aplicado o mesmo procedimento para obtenção de ωγk z , a partir do ângulo de elevação. Seguindo o mesmo princípio, acelerações angulares, que foram utilizadas na matriz Hk+1, foram obtidas a partir da diferença entre a velocidade angular atual e a anterior, divididas pelo tempo entre as mesmas. A transformação não linear do vetor de medidas utilizada é dada por rk, θk e φk, definidos em (32): Assim, a função vetorial não linear que relaciona as variáveis de estado às medidas, denotada por fh(k+1, xk+1), é dada por (33): A matriz da covariância dos ruídos associados à medida (Rk+1) adotada é dada por (34):Devido a necessidade de linearização, foi calculada a matriz jacobiana da função fh(k+1, xˆk+1|k). A matriz resultante obtida foi denotada por Hk+1, sendo definida por (35), onde seus componentes a13 e a23 seguem destacados devido limitação de espaço: a13 = √x2+y2−(xxh 2+y2+h2); e Para inicialização dos modelos, foram consideradas as duas primeiras medidas, conforme apresentado em [4]. Um método de inicializar a matriz de covariância é defini-la como P0|0 = α2 · Qk, sendo o valor típico de α = 10. Qk representa a covariância dos erros associados ao processo. O ruído do processo para ambos os modelos é definido como ruído branco na aceleração, com a diferença que no modelo CT é adicionado ruído na parcela de giro. Desta forma, o desvio padrão do ruído de processo (σq) para o modelo CV foi definido como em [4], σq = α · amax, onde 0 < α ≤ 1 e amax é a aceleração máxima esperada. Normalmente para este modelo é selecionado um nível de ruído baixo. Foram definidos empiricamente α = 0.7 e amax = 5m/s2, com isso, σq = 3, 5m/s2. Geralmente no modelo CT o nível de ruído é maior que no modelo CV, visto que o nível de incerteza é maior no momento das manobras. Foram definidos empiricamente α = 0.8, amax = 125m/s2 para o CT. Assim, defini-se o desvio padrão do ruído do processo como: σq = 100m/s2, e os ruídos nas taxas de giro como σωχ = σωγ = 0.044rad/s2 para o modelo CT. Também definiu-se empiricamente os valores dos ruídos das taxas de aceleração angular como σω˙ χ = σω˙ γ = 5rad/s2. Os ruídos de medida dependem diretamente das características do sensor modelado. Nas trajetórias em que estes ruídos foram considerados, utilizou-se um desvio padrão na distância de σr = 75m, no ângulo de azimute de σθ = 0.0175 ◦ e no ângulo de elevação de σφ = 0.0175 ◦, como em [10]. Para a definição dos elementos da matriz de transição (Π) do algoritmo IMM, foi considerado o tempo de rotação da antena de 2 segundos, o tempo esperado de execução do CV de 200 segundos e o tempo esperado de execução do CT de 20 segundos, assim Π é dado por (36): IV. Testes e Resultados Para avaliar o modelo, foi realizar um comparativo com alguns resultados apresentados em [10] e [11]. Estes foram escolhidos para comparação com os resultados deste trabalho, por serem trabalhos relativamente recentes, apresentarem modelos tridimensionais com uma técnica inovadora para cálculo da velocidade angular e com testes descritos em um nível de detalhamento suficiente para permitir sua reprodução e comparação. As trajetórias comparadas com [10] são tipo zigue-zague, formadas por sete trechos, como na Figura 1 (a). O critério de desempenho adotado, foi baseado na verificação de erros RMS (erro médio quadrático) para diferentes tipos de trajetórias realizadas por um alvo, com evolução no tempo para o vetor de posições, sendo dado por (37): Onde k é o instante de tempo, i são os eixos cartesianos, resi k ∈ R são vetores cujos elementos são diferenças entre a posição real e a estimativa da posição de cada componente, e n é o número de dados da trajetória ou do trecho da trajetória. A partir dos n valores obtidos de RMSi k, calculou-se o RMS médio para cada componente de posição, dado por (38): Os critérios adotados por [10], também aqui utilizados, foram a média dos RMSi (38), e a norma de RMS (39): Para que a comparação fosse válida, foram adotados os mesmos parâmetros de ajustes citados em [10]. Sendo assim, T = 4s, σr2 = 752, σχ2 = 0, 01752 e σγ2 = 0, 01752, em que T é o período de amostragem, σr2 é a variância do alcance radar, σχ2 é a variância do ângulo de azimute e σ γ 2 é a variância do ângulo de elevação. Assim como em [10], considerou-se a estimativa inicial de estado sendo dada por xˆ0|0 = [−30000m 196, 16m/s − 30000m 154, 98m/s 600 0 0 0]. Para exemplificar a comparação realizada, foi selecionada apenas uma trajetória descrita em [10]. A mesma se dá em um plano com inclinação de +30 ◦ em relação ao plano xy. Comparando (a) e (b) da Figura 2, o modelo deste trabalho obteve um desempenho superior ao de [10], tanto para cada um dos sete trechos apresentados quanto para a trajetória como um todo. A outra forma utilizada para se avaliar este trabalho foi a comparação com dados reais. Dessa forma, foi realizado testes de comparação entre o modelo desenvolvido, utilizando as hipóteses adotadas para os ruídos descritas anteriormente, com sistema real utilizado em Navios da Marinha do Brasil (MB). Os dados reais da trajetória das aeronaves utilizados nos testes foram obtidos dos testes de validação de um navio da MB. Os testes de validação se destinavam a verificar o resultado de solução de tiro para o disparo de um projetil de canhão de 4,5 polegadas, ao acompanhar aeronaves de asa fixa. Utilizouse como referência para origem o sistema cartesiano (x, y, h). As trajetórias foram percorridas pelas aeronaves com uma velocidade em torno de 360km/h. As duas primeiras trajetórias foram percorrendo um trajeto com movimento vertical ascendente (ilustrada na Figura 1 (b)), e a terceira percorrendo um trajeto com movimento de alteração de rumo horizontal. A primeira possuía posição inicial (7647.43, -325.31, 315.83) e final (-699.03, -462.62, 1571.95). A segunda possuía posição inicial (-5466.93, - 3010.67, 285.87) e final (1797.83, -3026.43, 1552.44). A terceira possuía posição inicial (6376.27, -191.34, 313.88) e final (1118.47) -6900.68, 289.83). Para a primeira trajetó- ria, a comparação entre resultados mostrou uma melhora de 44,497% no desempenho do modelo proposto quando comparado aos dados obtidos nos testes de validação. Para a segunda mostrou uma melhoria de 43,919% e para a terceira uma melhoria de 36,153%). V. Conclusões Para modelar a Equação de processo (1) e a Equação de medida (2), os modelos estudados e desenvolvidos neste trabalho foram baseados no sistema de coordenadas cartesianas, onde há a necessidade de conversão do sistema de coordenadas esféricas, das observações do radar, para o cartesiano. Para tratar o rastreio dos alvos, sobretudo com a preocupação de mudança no seu perfil de deslocamento, foram escolhidos o modelo CV e o modelo CT. Com base nestes modelos bidimensionais, foram desenvolvidos, os modelos CV e CT tridimensionais. Analisando os resultados dos testes realizados com estes modelos, apresentados no item IV, foi possível verificar que tanto o CV como o CT tridimensionais, são capazes de reproduzir adequadamente todas as trajetórias testadas. O modelo CT deduzido é o mais interessante, pois ele lida com curvas que ocorrem em planos arbitrários do espaço, aumentando o número de trajetórias que podem ser executadas por um alvo. Esta trajetória está contida em um plano horizontal, isto é, um plano paralelo ao plano formado pelos eixos x e y, mas que é rotacionado no eixo z. As matrizes que compõe a equação de processo e de medida são descritas em função de variáveis cartesianas de posição e velocidade, além das velocidades angulares. Foi descrito como se obteve as informações das velocidades escalares de cada eixo cartesiano, para fazerem parte do vetor de observações zk. As velocidades foram deduzidas a partir das informações da medida atual e duas medidas anteriores. Os ângulos de azimute e elevação do alvo, em cada amostragem, foram obtidos a partir da projeção destes vetores velocidades. Assim, as velocidade angular ωχ pôde ser obtida a partir da diferença entre o ângulo de azimute atual e o anterior, divididos pelo tempo. Foi aplicado o mesmo procedimento para obtenção de ωγ, a partir do ângulo de elevação. Outra proposta desenvolvida envolve o modelo de observações, no qual incluímos duas informações deduzidas, as velocidades angulares do ângulo de azimute e de elevação na matriz Hk+1 da equação de medição, que relaciona o estado à medida. A abordagem proposta foi validada pelos resultados dos testes apresentados, e pode-se apontar como principal contribuição deste trabalho o desenvolvimento de uma nova abordagem para cálculo do modelo CT, através das coordenadas cartesianas de forma tridimensional.  "
}