	{
		"id": 93,
		"titulo": "geração de sinal arbitrário na faixa de rf empregando auto-heterodinagem óptica para aplicação em radar e guerra eletrônica",
		"autor": "rodrigo baroni, felipe s. ivo, olympio l. coutinho",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2017/st/ST_11_1.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 1,
		"resumo": "Sistemas radares com recursos de guerra eletrônica empregam, em geral, formas de onda com modulação intrapulso na transmissão, associada à compressão de pulso na recepção. Essa característica da forma de onda permite desassociar resolução em distância e alcance máximo. A geração fotônica de sinais arbitrários tem sido exaustivamente pesquisada devido às vantagens relativas à elevada frequência de operação e largura de banda instantânea. Neste artigo, é demonstrado resultado experimental recente da geração fotônica por meio da técnica de auto-heterodinagem óptica de sinal de RF com largura de banda instantânea de 1,35 GHz e compressão do pulso de 1800 vezes em relação à duração do pulso de RF gerado e valor de Produto Tempo-Largura de Banda superior a 3600.",
		"texto": " I. INTRODUÇÃO O desempenho dos sistemas radares é influenciado sobremaneira pela forma de onda empregada na transmissão. Essas formas de onda diferem em sua concepção e normalmente são responsáveis por caracterizar os diversos tipos de radares existentes. As técnicas de modulação intrapulso, que pode ser em frequência (chirp) ou com codificação de fase, associadas à compressão de pulso, são recursos de guerra eletrônica essenciais que combinam precisão na determinação da posição dos alvos ao mesmo tempo que aumentam a imunidade contra interferência inimiga [1]. Isso decorre do fato de que a modulação intrapulso, em conjunto com a compressão, permite a desassociação entre largura de banda (BW) e duração do pulso. Em síntese, a largura de banda está relacionada à resolução em distância enquanto a duração do pulso está associada ao alcance de detecção. O produto entre tempo de duração e largura de banda (TBWP) é uma importante figura de mérito em sistemas radares porque traduz a eficiência tanto do espalhamento da energia do pulso transmitido quanto da compressão do eco recebido. As primeiras publicações acerca dos conceitos de chirp e compressão de pulso datam do final da década de cinquenta e início da década de sessenta [2], [3], obviamente realizados por meio de dispositivos eletrônicos. Essas técnicas são amplamente utilizadas ainda nos dias atuais, pois permitem o projeto de um sistema radar com elevada largura de banda, baixa potência de pico na transmissão e pulso com longa duração temporal, contrariando a lógica de formação dos pulsos utilizados pelos radares convencionais [4]. Além das características relativas ao longo alcance de detecção e à alta resolução em distância citados, a modulação intrapulso e a compressão reduzem drasticamente a probabilidade de interceptação e de interferência (LPI – Low Probability of Intercept) [1][5]. A compressão de pulso é realizada na recepção por filtros casados que são tradicionalmente implementados por meio de dispositivos dispersivos, usando rede de transdutor interdigital em dispositivo de onda acústica superficial (Surface Acoustic Wave - SAW) [6] ou desempenhado digitalmente em sistemas mais modernos. Microwave photonic, que na literatura nacional tem sido traduzido por RF em fotônica [7], é uma área de pesquisa que tem sido amplamente investigada nos últimos anos [8], [9]. Esse evidente interesse é sustentado pelas vantagens propiciadas pelos dispositivos e sistemas fotônicos que se destacam, por exemplo, pela largura de banda instantânea, altas frequências de operação associadas a baixas perdas, imunidade à interferência eletromagnética, volume e peso reduzidos, quando comparados com seus equivalentes sistemas eletrônicos [10]. Essas características são preponderantes quando se trata de tecnologias embarcadas em aeronaves, navios e veículos espaciais, onde peso, volume e flexibilidade são fatores restritivos. Além disso, as tecnologias da próxima geração de receptores multifuncionais aplicados em sistemas de GE exigirão frequências de operação maiores que 18 GHz, larguras de banda instantâneas acima de 1 GHz, faixa dinâmica livre de espúrios (SFDR) superiores a 120 dB/Hz2/3 e sensibilidade inferior a – 90 dBm [11], sinalizando uma tendência cada vez maior do potencial emprego da fotônica nesse tipo de aplicação. No que tange às técnicas de geração fotônica de sinais, uma maneira usual de se produzir um sinal elétrico na faixa de RF, a partir de dispositivos fotônicos, é por meio de duas fontes ópticas, cuja heterodinagem dos sinais incidentes em um fotodetector produz na saída deste dispositivo um sinal elétrico com frequência que facilmente atinge a faixa de micro-ondas ou ondas milimétricas. A limitação dessa técnica decorre do ruído de fase gerado no processo heteródino de batimento dos sinais ópticos, cujo ruído é transferido para o sinal gerado. Para minimizar esse problema, algumas técnicas têm sido desenvolvidas, conforme será apresentada na Seção III. Quanto à geração de sinais arbitrários, entre outros métodos, emprega-se a modulação espacial de luz (Spatial Light Modulator – SLM) [12]. Essa técnica apresenta como principal vantagem o fato de possuir alto grau de controlabilidade e reconfigurabilidade em tempo real. Em contrapartida, apresenta como desvantagens baixa estabilidade, grande volume e valores de perda de acoplamento elevados [13], em virtude de a implementação desse sistema empregar óptica de espaço livre [14]. Por essa razão, algumas técnicas baseadas em elementos dispersivos com propagação em fibra óptica têm sido amplamente pesquisadas com o objetivo de suplantar as deficiências apresentadas na geração de sinais por SLM. Outro procedimento utilizado para gerar tanto sinais CW quanto arbitrários emprega a auto-heterodinagem óptica, a qual tem chamado cada vez mais a atenção devido às vantagens, à sua simplicidade e flexibilidade de implementação em relação aos métodos mencionados, além de ser aplicável em sistemas radares pulsados [15],[16],[17]. Neste artigo será abordada a técnica de autoheterodinagem, com apresentação de resultados experimentais obtidos em [17], relativos à geração fotônica de sinais arbitrários de RF para aplicação em radar e guerra eletrônica, abordados na Seção IV. II. CONTEXTUALIZAÇÃO DA RF EM FOTÔNICA A área de RF em fotônica pode ser contextualizada por suas técnicas e aplicações, conforme apresentado na Fig. 1. Em referência à Fig. 1, as técnicas de geração fotônicas de sinais são divididas em ondas contínuas [18] e formas de onda arbitrárias [13], sendo que estas têm grande aderência em sistemas radar com recursos de guerra eletrônica. As técnicas de processamento fotônico de sinais se subdividem em filtros fotônicos [19]; linhas de retardo, as quais são largamente empregadas em antenas phased array [10]; e conversores analógicos/digitais fotônicos, que têm chamado atenção em virtude da velocidade de conversão em comparação aos seus equivalentes eletrônicos [10], principalmente quando aplicados em receptores de radares baseados em rádio definidos por software, os quais requerem digitalização dos sinais recebidos em frequência da ordem de dezenas de giga-hertz [20]. Por fim, a transmissão fotônica de sinais é aplicada em redes de comunicações ópticas integradas a pontos de acesso wireless de banda larga e sistemas de comunicações UWBoF (banda ultra-larga sobre fibra) dentro de edificações [21]. De alguma forma, essas técnicas são implementadas nas aplicações mostradas na Fig. 1, a saber: comunicações [21], radar [22], sensores [23], guerra eletrônica [11] e instrumentação [24]. Observa-se na Fig. 2 o número crescente de publicações afetas à tecnologia fotônica. Esses números indicam o avanço na implementação de soluções e de projetos utilizando essa tecnologia. III. GERAÇÃO FOTÔNICA DE SINAIS DE RF A geração fotônica de sinais vem atraindo cada vez mais o interesse no cenário de pesquisa, em especial, devido às vantagens das tecnologias da RF em fotônica que possibilitam obter sinais elétricos estáveis e com elevadas frequências de operação [10]. A geração direta de sinais utilizando dispositivos eletrônicos, em geral, é limitada a algumas dezenas de giga-hertz, requerendo a implementação de circuitos elevadores de frequência para atingir valores mais altos [20]. Todavia, esse procedimento pode levar à degradação do desempenho global do sistema [22]. Por outro lado, a tecnologia fotônica apresenta a vantagem de gerar diretamente sinais com alta estabilidade, largura de banda instantânea e frequências de operação na ordem de dezenas a centenas de giga-hertz [10]. Existem duas abordagens amplamente difundidas para geração de sinais de RF com tecnologia fotônica, as quais utilizam a heterodinagem óptica e a auto-heterodinagem óptica. A heterodinagem é usualmente empregada para gerar sinais contínuos em frequências muito elevadas, alcançando até a faixa de ondas milimétricas [10]. Em contrapartida, o ruído de fase apresentado no sinal gerado é considerado uma limitação dessa técnica [10]. Uma maneira usual de gerar um sinal elétrico na faixa de radiofrequência com onda contínua é por meio da heterodinagem entre dois sinais ópticos emitidos por duas fontes ópticas distintas. O diagrama esquemático dessa técnica está apresentado na Fig. 3. As portadoras ópticas emitidas pelas fontes independentes são combinadas em um acoplador, onde ocorre o fenômeno da interferência. Em seguida, essas ondas incidem em um fotodetector que produz sinal elétrico na saída podendo alcançar a faixa de ondas milimétricas. A frequência do sinal elétrico resultante é igual à diferença de frequência entre os dois sinais ópticos batidos. Os campos elétricos provenientes das fontes ópticas radiantes podem ser representados por: onde 𝐸1e 𝐸2 são os termos de amplitude das duas ondas, 𝜔1 e 𝜔2 são as frequências angulares e 𝜑1(𝑡) e 𝜑2(𝑡) são os termos de fase, respectivamente. A corrente elétrica na saída do fotodetector, considerando apenas o termo de corrente alternada, é expressa por [10]: No entanto, esse tipo de estrutura tem como desvantagem o fato de as fontes ópticas serem independentes entre si. Com isso, as portadoras ópticas emitidas não apresentam correlação entre os termos de fase identificados em (2) por 𝜑1(𝑡) e 𝜑2(𝑡). O ruído de fase óptico é transferido para o sinal elétrico gerado, o que acarreta em baixa estabilidade desse sinal. Para minimizar esse ruído as seguintes abordagem têm sido amplamente investigadas: Optical Injection Locking, Optical Phase Lock Loop (OPLL), oscilador optoeletrônico (OEO) e multiplicação de frequência empregando modulação externa. Além das técnicas de geração de sinais contínuos na faixa de RF, uma linha de pesquisa que tem sido fortemente investigada é a geração fotônica de formas de ondas arbitrárias em micro-ondas. Isso se deve à grande aderência desse tipo de sinal em aplicações tais como radar, comunicações e sistemas de instrumentação. Em geral, a geração fotônica de formas de onda arbitrárias é dividida em quatro categorias [13]: Direct Space-to-Time Shaping, Microwave Waveform Generation Based on a Photonic Microwave Daley Line Filter, Temporal Pulse Shaping e Spectral-Shaping and Wavelenght-to-Time Mapping. Todas essas abordagens podem ser realizadas em espaço livre, em que usualmente é empregado um modulador espacial de luz (spatial light modulator – SLM). A utilização do SLM apresenta como principal vantagem o fato de esse modulador possuir alto grau de controlabilidade e reconfigurabilidade em tempo real. Em contrapartida, apresenta como desvantagens baixa estabilidade do sinal gerado, grande volume e valores elevados de perda por acoplamento [18], em virtude de a implementação desse sistema empregar óptica de espaço livre [14]. Por essa razão, algumas técnicas que utilizam elementos dispersivos com propagação em fibra óptica têm sido amplamente pesquisadas com o objetivo de suplantar as deficiências apresentadas na geração de sinais arbitrários por SLM. IV. GERAÇÃO ARBITRÁRIA DE SINAIS DE RF EMPREGANDO AUTO-HETERODINAGEM ÓPTICA O método de auto-heterodinagem óptica tem sido empregado na caracterização de dispositivos eletro-ópticos, como fotodetectores, medição de largura de linha [24] e tem despertado a atenção para a geração de sinais de micro-ondas devido a suas vantagens em relação a outras técnicas conhecidas [15], [25], [26]. Entre as vantagens observadas, cita-se o fato de esse método utilizar um interferômetro Mach-Zehnder em vez de moduladores externos, os quais requerem sinais estáveis de referência e de polarização. Além disso, utiliza apenas uma fonte laser, ao contrário das modulações que empregam arranjos com lasers mestreescravo. Outra vantagem é que o sinal de micro-ondas pode ser obtido utilizando um gerador de funções arbitrárias de baixa frequência. A auto-heterodinagem possibilita obter duas portadoras ópticas a partir de uma única fonte laser. Em função das características de modulação dessas portadoras ópticas, é possível gerar tanto sinais CW de RF quanto sinais arbitrários pulsados. Estes têm grande aderência em sistemas radares com recursos de guerra eletrônica em razão dessas formas de ondas apresentarem modulação de frequência intrapulso e elevado produto tempo-largura de banda (Time Bandwidth Product - TBWP) [16]. Essa técnica utiliza uma propriedade inerente dos diodos lasers que é a alteração da frequência de oscilação óptica em função da variação da corrente de injeção. Esse efeito é conhecido como parâmetro de chirp do laser e é causado em função da modificação do índice de refração da cavidade óptica quando há uma variação da densidade de portadores livres no meio ativo do laser, efeito esse conhecido como dispersão de plasma dos portadores [27]. A arquitetura básica de um sistema de geração de sinais de RF utilizando auto-heterodinagem óptica está representada graficamente na Fig. 4 O princípio de funcionamento dessa estrutura se baseia na modulação direta do diodo laser que, normalmente, é um Distributed Feedback - DFB. Para isso, é utilizado um gerador de funções arbitrárias (AWG) para produzir um sinal de tensão. Um amplificador de transcondutância (TCA) é empregado para converter esse sinal de tensão em sinal de corrente. A modulação em frequência é obtida por meio da variação da corrente de injeção no diodo laser. O sinal óptico modulado em frequência é acoplado a um interferômetro Mach-Zehnder (MZI) com desbalanceamento de comprimento de braço dada por Δ𝐿. O sinal óptico ao incidir no interferômetro é dividido igualmente entre os dois braços. O braço superior implementa um atraso no tempo Δ𝜏 dado por: onde 𝑛 é o índice de refração da fibra monomodo e 𝑐 é a velocidade da luz no vácuo. Os campos elétricos dos dois sinais ópticos com diferença de atraso são combinados na saída do MZI, cujo batimento das duas componentes ópticas em um fotodetector gera na saída deste dispositivo um sinal de micro-ondas. A frequência instantânea desse sinal elétrico é igual ao resultado da diferença das frequências instantâneas dos dois sinais ópticos incidentes na entrada do fotodetector. Matematicamente, a corrente de saída do fotodetector é dada por: onde ℜ é a responsividade do fotodetector, 𝑇(𝑓) é a transmitância do MZI e 𝐴(𝑡) é uma função de atenuação que tem por objetivo equalizar a potência óptica 𝑃𝐿(𝑡) emitida pelo laser, por consequência da função de modulação de corrente injetada na fonte de luz. A transmitância pode ser escrita como: A equação acima representa a transmitância do interferômetro Mach-Zehnder, a qual é definida pela razão entre a intensidade óptica transmitida e a intensidade óptica incidente no MZI. Observa-se que essa transmitância é uma função periódica definida pela frequência óptica acoplada ao interferômetro e pela diferença dos comprimentos dos braços do MZI, a qual determina o Free Spectral Range - FSR. Assim, mantendo-se constante o FSR e variando-se a frequência de oscilação do sinal óptico, seguindo um padrão desejado, pode-se gerar na saída desse MZI um sinal com intensidade variável. Nesse sentido, para se obter uma frequência óptica variável, explora-se o efeito do parâmetro chirp do laser mediante a modulação conveniente da corrente de injeção, conforme estabelecido abaixo: onde 𝑓0 é a frequência óptica quando o laser está polarizado com a corrente contínua de operação, 𝛼 é o parâmetro chirp do laser [Hz/A], dado como a variação da frequência pela taxa de variação de corrente de injeção, e 𝑖𝐿(𝑡) é a função de corrente de modulação do laser. As equações (5) e (6) estabelecem o princípio de funcionamento da abordagem de geração fotônica de sinais de RF empregando autoheterodinagem. Para se obter um sinal elétrico com frequência de RF linearmente variável com o tempo, emprega-se uma função de tensão de modulação do laser quadrática no AWG dada por [17]: onde β e γ são os coeficientes da equação de segundo grau. As expressões da frequência e fase instantâneas do sinal de RF gerado são dadas por [17]: onde gm representa o ganho de transcondutância na conversão do sinal de tensão para corrente de modulação 𝑖𝐿(𝑡) em (5) e δ é a taxa de chirp do sinal de RF gerado, o qual está multiplicado pelo tempo em (8), representando a variação instantânea da frequência. V. RESULTADOS EXPERIMENTAIS A configuração experimental montada em [17] para a geração do sinal arbitrário está representada esquematicamente na Fig. 5. A Fig. 6 apresenta o arranjo esquemático da Fig. 5 utilizado na demonstração experimental para geração fotônica de sinais arbitrários de RF empregando a técnica de auto-heterodinagem. A corrente de polarização foi definida para ter valor superior ao da corrente de limiar desse laser, considerando a temperatura de 25 °C ajustada no resfriador termoelétrico (TEC). Os valores instantâneos da corrente de modulação foram obtidos indiretamente a partir da tensão medida pelo DSO na saída do TCA. As formas de onda da tensão gerada no AWG e da corrente de modulação do laser estão mostradas na Fig. 7. Para se obter um pulso óptico com envoltória retangular foi implementado na saída do laser DFB um modulador Mach-Zehnder (MZM) para desempenhar a função de equalização da intensidade óptica. Nesse sentido, a função de tensão gerada no canal 2 do AWG foi aplicada na porta de bias no MZM, passando por um circuito eletrônico amplificador de tensão Ressalta-se que essa função de equalização foi inicialmente introduzida na equação (4) como uma função de atenuação 𝐴(𝑡). A Fig. 8 apresenta a curva da função de polarização instantânea do MZM utilizada para equalizar a intensidade do pulso por meio da eliminação das variações temporais na saída do laser durante toda a duração do pulso óptico. A Fig. 9 mostra a tensão medida na saída do fotodetector com amplitude retangular. Para a obtenção desse pulso de tensão foi mantido um dos braços do MZI desconectado. Com o braço do MZI reconectado, o sinal elétrico gerado foi medido por meio do osciloscópio digital (DSO) na saída do fotodetector. A responsividade deste dispositivo é de ℜ = 0,9 [A/W] e está conectado na porta do DSO, o qual tem resistência de entrada de 50 Ω. O sinal de RF com chirp gerado foi medido no DSO e está mostrado na Fig. 10. Para o fim de calcular a eficiência de compressão do pulso gerado, foi simulada uma forma de onda ideal com valores largura de banda BW e de duração do pulso 𝜏 iguais a 1,35 GHz e 2,67 μs, respectivamente, para possibilitar a comparação entre os sinais gerado e simulado. O espectro dos sinais real medido por meio do DSO/VSA, bem como o espectro do sinal linearmente modulado em frequência (LFM) simulado estão mostrados Fig. 11. Observa-se na Fig. 11 que o sinal gerado apresentou espalhamento da energia no espectro, bem como apresentou largura de banda condizente com o esperado, ou seja, 𝐵𝑊≈1.35 GHz. O produto em frequência do sinal gerado com a resposta em frequência do filtro, considerando este estar casado com sua forma de onda, está representado graficamente na Fig. 12. Verifica-se na Fig. 12 a elevada concentração de energia no lóbulo principal tanto para o pulso simulado quanto para o gerado. A saída do filtro casado representa, em última instância, a própria compressão do pulso recebido, o qual advém da forma de onda gerada que foi concebida para ter longa duração temporal e, com isso, melhorar o alcance de detecção. A compressão, por sua vez, encarregar-se-á de reduzir essa largura do pulso para valores extremamente reduzidos, bem como elevar a amplitude do sinal comprimido a valores elevados. Essas afirmações podem ser observadas Fig. 12b. Primeiramente, observa-se que a amplitude máxima do sinal na saída do filtro casado é maior que 100 vezes a amplitude do sinal gerado experimentalmente. Em segundo, observa-se no gráfico auxiliar da Fig. 12b que a maior parte da energia do sinal recebido está concentrada dentro do intervalo de 1,5 ns. Considerando que o pulso gerado tem duração de 2,67 μs, pode-se concluir que o sinal na saída do filtro casado foi reduzido no tempo em 1800 vezes. Por fim, o produto tempolargura de banda (TBWP) para o sinal gerado resultou em valor superior a 3600. VI. CONCLUSÃO Este trabalho demonstrou teórica e experimentalmente a geração fotônica de sinais empregando a técnica de autoheterodinagem óptica para aplicação em sistema radar e guerra eletrônica. Essa abordagem vem chamando cada vez mais a tenção em virtude da simplicidade e flexibilidade de implementação. Os resultados experimentais apresentaram pulso com duração de 2,67 μs, largura de banda de 1,35 GHz e compressão de pulso de 1800 vezes em relação ao pulso gerado. O valor de TBWP resultante foi superior a 3600, indicando a viabilidade de aplicação desse método em sistema radar."
	}
