{
    "id": 94,
    "titulo": "absorvedores de micro-ondas baseados em aditivos magnéticos com diferentes razões de aspecto",
    "autor": "simone s. pinto, newton a. s. gomes, mirabel c. rezende",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2016/st/ST_09_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Este trabalho tem como objetivo principal mostrar o comportamento de materiais absorvedores de radiação eletromagnética (MARE) baseados em aditivos magnéticos com diferentes razões de aspecto. Para isto, foram utilizados dois materiais, a ferrocarbonila, FeC, constituída de partículas esféricas e filamentos de aço carbono. Estes aditivos foram caracterizados quanto à sua morfologia e característica estrutural. Os resultados das análises de difração de raios X mostram que os dois aditivos apresentam a mesma estrutura cristalina; porém suas morfologias são bastante diferentes na escala micrométrica. A partir desses aditivos foram preparadas amostras de compósitos nas concentrações de 20% e 40% (m/m), utilizando uma matriz de resina epóxi. Os compósitos resultantes foram avaliados na faixa de frequências de 8,2 a 12,4 GHz. Os resultados de permissividade, permeabilidade e perdas por reflexão mostram que a mistura dos dois aditivos resultou em compósitos com melhores propriedades e com melhor desempenho como MARE. Valores de atenuação de até -13 dB, ~95% de absorção, foram obtidos. Observou-se, ainda, a influência da espessura das amostras no desempenho dos absorvedores processados.",
    "texto": " I. INTRODUÇÃO Como consequência dos avanços tecnológicos, o uso da radiação eletromagnética na faixa de frequências das microondas tem se tornado intenso nos últimos anos [1]. Isso se deve ao crescente uso de aparelhos celulares, antenas de rádio-transmissão, dispositivos eletroeletrônicos, sistemas de aeronaves, navios e veículos, entre outros. Assim, a interferência eletromagnética vem aumentando continuamente [2]. Uma das soluções para o controle de radiações interferentes é pelo uso de materiais absorvedores de radiação eletromagnética, os denominados MARE [3]. Em geral, os MARE podem ser processados pelo uso de diferentes matrizes poliméricas. Como exemplos, têm-se o poliisopreno, borracha de silicone, resinas fenólicas ou epóxi, entre outras, aditados com materiais que apresentam perdas, como ferritas, negro de fumo, polímeros condutores, alguns filamentos metálicos, entre outros [4]. Quando MARE são utilizados nos setores aeroespacial e de defesa, principalmente, esses necessitam atender, sempre que possível, aos seguintes requisitos: baixo peso, flexibilidade, espessura reduzida, resistência às intempéries, baixo custo e atuar em banda larga de frequências [1, 5, 6]. Basicamente, materiais absorvedores de micro-ondas são materiais compósitos obtidos pela dispersão de aditivos dielétricos e/ou magnéticos em uma matriz polimérica [7]. Dentre os aditivos magnéticos mais comumente usados no processamento de MARE estão as ferritas e a ferrocarbonila (FeC) [8]. Vários trabalhos da literatura vêm sendo realizados para investigar os efeitos da concentração dos aditivos (centros absorvedores) nas propriedades dos MARE [9, 10, 11]. Os aditivos magnéticos exibem propriedades elétricas e magnéticas, destacando-se a permissividade elétrica complexa relativa, , εr = ε/ε0, εr = ε’ – jε’’ e a permeabilidade magnética complexa relativa, μr = μ/μ0, μr = μ’ – jμ’’, respectivamente. Estas características estão entre as mais importantes dos materiais absorvedores e estão diretamente associadas à propriedade de atenuação da radiação incidente [6, 12, 13]. As partes reais μ’ e ε’ estão relacionadas com o armazenamento de energia e as partes imaginárias, μ’’ e ε’’ com as perdas. A impedância intrínseca do material é o valor ‘observado’ pela onda eletromagnética incidente na sua superfície. Essa característica define o desempenho do material, podendo classificá-lo como refletor ou absorvedor [12]. A impedância relativa é dada pela relação Zr = Z/Zo, sendo Zo a impedância no vácuo, onde Zo=377 ohm, de acordo com 1. O desempenho de MARE está também relacionado com a frequência da onda eletromagnética incidente e a espessura da amostra de MARE, de acordo com (1) e (2) [9, 12]. onde: r é a impedância relativa de entrada do material, t é a espessura da amostra, r é a permeabilidade magnética relativa, r a permissividade elétrica relativa do material e λ o comprimento da onda incidente no espaço livre. A condição de casamento de impedâncias, representando a perfeita absorção, é dada por Z → 1. A condição de casamento de impedâncias é determinada pela combinação dos parâmetros μ’, μ’’, ε’, ε’’, λ e t. RL refere-se à perda por reflexão (Return Loss – RL) [9]. Neste trabalho, são avaliadas amostras preparadas com dois aditivos magnéticos (FeC e filamentos de aço-carbono) com diferentes razões de aspecto e em diferentes concentrações e diferentes espessuras das amostras. Os aditivos foram caracterizados por difração de raios X (DRX), microscopia eletrônica de varredura (MEV), medidas dos parâmetros complexos ε e µ e de perdas por reflexão na faixa de frequências de 8,2 – 12,4 GHz (banda X). Estes aditivos foram embebidos em uma matriz de resina epóxi, nas proporções de 20 e 40% (m/m) de cada um dos aditivos, separadamente, e suas misturas (1:1) nas proporções de 20% e 40%, em massa. II. MATERIAS E MÉTODOS Materiais Os materiais usados neste estudo foram: filamentos magnéticos de aço-carbono, identificados como Ml-90, partículas de FeC, obtidas comercialmente da BASF, resina epóxi do tipo Epocast 50-A1 e endurecedor 9816/Q3, ambos da Huntsman, disponíveis comercialmente. Preparação dos MARE em resina epóxi As amostras foram processadas em uma matriz de resina epóxi pela adição de 20 e 40% (m/m) de FeC. Um segundo conjunto de amostras foi preparado nas mesmas concentrações pelo uso dos filamentos. E, um terceiro conjunto foi obtido pela mistura dos dois aditivos na proporção de 1:1, sendo utilizado 20% e 40% em massa dessa mistura na resina epóxi. A homogeneização das amostras foi por mistura mecânica dos componentes. Em seguida, as misturas foram transferidas para moldes de alumínio com as dimensões exatas do porta-amostra (23 mm x 10 mm x 9,0 mm) utilizado no trecho do guia de ondas, usado na caracterização eletromagnética. Caracterização Os aditivos magnéticos foram avaliadas quanto à sua estrutura cristalina utilizando um difratômetro de raios X da marca Philips, modelo PW 1830, com radiação monocromática de Cu-kα (λ=1, 542 Å). As amostras foram analisadas na forma de pó, sem nenhum tratamento especial. As análises de MEV foram conduzidas em um microscópio computadorizado da marca LEO, modelo 435 Vip. Para uma melhor visualização das morfologias, as amostras receberam a deposição de uma fina camada de ouro. As amostras desenvolvidas neste estudo foram caracterizadas, em triplicata, por meio de medidas eletromagnéticas, na faixa de frequências de 8,2 a 12,4 GHz, quanto à perdas por reflexão (RL), com placa metálica. Extração dos parâmetros permissividade elétrica e permeabilidade magnética foi realizada. Essas medidas foram conduzidas em guia de ondas retangular adaptado a um analisador de redes vetorial modelo 8510 C, marca HP. Os cálculos dos parâmetros complexos de ε e μ foram realizados com o auxílio do software 85071E, da Agilent Technologies, baseado no modelo de Nicolson-Ross [14]. III. RESULTADOS E DISCUSSÕES A Fig.1 apresenta os difratogramas de raios X das amostras de FeC e dos filamentos de aço-carbono. Esta técnica permite identificar as fases cristalinas presentes nos materiais, considerando que os resultados das avaliações eletromagnéticas estão relacionados com as características da estrutura cristalina dos aditivos. A Tabela I lista os picos de difração obtidos para as duas amostras magnéticas analisadas. A análise da Tabela I e da Fig. 1 mostra que ambos os aditivos magnéticos apresentam a mesma estrutura cristalina, com picos de difração semelhantes. Da literatura [10, 15] foram encontrados difratogramas semelhantes para a FeC, indicando que a amostra apresenta estrutura monofásica, composta por cerca de 97% de pó de ferro metálico [15, 16]. Apesar dos aditivos apresentarem estruturas cristalinas semelhantes, as imagens de MEV, a Fig. 2(a,b) mostra que os aditivos possuem formatos e tamanhos diferentes. A FeC, Fig. 2(a), apresenta formato esférico com tamanhos de partículas que variam de 1 a 7 μm, ao passo que o filamento apresenta o formato alongado e achatado, com comprimento médio de 150 μm e a menor seção com a dimensão de 10 µm e a maior seção com cerca de 25 µm. A determinação da morfologia dos aditivos é de grande importância. Na literatura já existem trabalhos correlacionando a morfologia dos aditivos com as características de interação do material com a onda eletromagnética incidente [15]. A Tabela II apresenta os dados de permissividade elétrica e permeabilidade magnética das amostras com os aditivos magnéticos em estudo, extraídos em 10 GHz, com amostras de 5 mm de espessura. A Tabela II mostra que a resina epóxi apresenta os menores valores de permissividade e permeabilidade. Já as amostras contendo FeC e filamentos mostram que a adição destes aditivos aumentou os componentes complexos da resina epóxi. Sendo que, este aumento foi mais significativo para a amostra contendo 40% de filamentos. Comparando-se as amostras contendo 20 e 40% em massa dos respectivos aditivos verifica-se que o incremento de massa favorece o aumento dos componentes complexos. A Tabela II mostra ainda que a adição conjunta dos dois aditivos em uma mesma amostra favorece ainda mais o aumento dos parâmetros complexos. Esse comportamento sugere que existe uma sinergia entre as diferentes formas dos dois aditivos. As Fig. 3 e 4 apresentam as curvas de permissividade e permeabilidade em função da frequência para as amostras obtidas pela mistura dos aditivos magnéticos, FeC e filamentos. A análise da Fig. 3 mostra que o parâmetro ε’ decresce com o aumento da frequência, ao passo que os demais parâmetros apresentam um ligeiro incremento com o aumento da frequência, principalmente os parâmetros μ’ e μ’’. Fenômeno semelhante é observado na Fig. 4. Porém, nesta figura, o parâmetro ε’’ apresenta um comportamento anômalo, com um decréscimo acentuado do início da banda X até 9,5 GHz, seguido de um aumento até cerca de 11 GHz, seguido de um novo decréscimo. De acordo com a literatura, os parâmetros μ’ e μ’’ apresentam aumentos próximos de 12 GHz, de maneira semelhante ao observado nas Fig. 3 e 4 deste estudo. Neste caso, considera-se que o absorvedor apresenta o máximo de perda magnética da onda incidente nessa frequência [16]. As Fig. 5, 6, 7 e 8 apresentam as medidas RL na faixa de frequências de 8,2 a 12,4 GHz, considerando as diferentes formulações e espessuras das amostras. Vale ressaltar que, a resina epóxi utilizada neste estudo apresentou-se transparente à radiação incidente na banda X. Este resultado indica que a resina usada apresenta baixas perdas dielétricas e magnéticas, sendo, portanto, adequada no estudo de avaliação dos aditivos propostos. As Figs. 5 e 6 apresentam as curvas de RL em função da frequência para as amostras com as concentrações de 20 e 40% dos dois aditivos individualmente, na espessura de 5 mm. A Fig. 5 mostra que as formulações com 20% dos dois aditivos não apresentam bom desempenho como MARE. Nestes casos, o RL máximo é menor que -2 dB. Já a Fig. 6 mostra que o aumento da concentração para 40% (m/m) melhorou o desempenho das amostras na atenuação da radiação incidente. Nesta figura observa-se uma ressonância de -14 dB, ~96% de atenuação da radiação incidente, para a amostra contendo 40% de filamentos. Já a amostra contendo FeC apresenta um máximo de RL de -8 dB, cerca de 84% de atenuação. Porém, neste caso, verifica-se que o absorvedor abrange uma maior faixa de frequências, atuando como absorvedor do tipo banda larga. As Figs. 7 e 8 apresentam os gráficos referentes ao MARE obtido pela adição simultânea dos dois aditivos magnéticos na mesma amostra. A comparação destas duas figuras, que representam as amostras contendo a mistura dos aditivos, com as Fig. 5 e 6, representativas das amostras contendo os aditivos separadamente, verifica-se que os perfis das curvas apresentam diferenças significativas. A Fig. 7 mostra que o MARE têm tendência de atuar em frequências acima de 12,4 GHz. Porém, dentro da faixa de frequência em estudo, o MARE apresenta um melhor desempenho em relação aos aditivos analisados separadamente (Fig. 5), com o máximo de atenuação de aproximadamente -5 dB, ~68% de atenuação. Observa-se ainda que, o aumento da espessura favoreceu o desempenho da amostra em atenuar a radiação incidente. A Fig. 8 mostra mais nitidamente a dependência do MARE com a frequência e a espessura. Neste caso, verificase que maiores espessuras atuam em frequências mais baixas. Tem-se que, a amostra com espessura de 7,5 mm apresenta um pico de ressonância em 8,8 GHz, ao passo que menores espessuras, linha verde, por exemplo, referente à amostra com 5 mm, apresenta sua ressonância em 12 GHz. Esta formulação mostra também a tendência de atuar em frequências acima de 12,4 GHz, para amostras menos espessas, como mostra a linha azul, referente à amostra com 4 mm. De acordo com Feng et al., 2006, as propriedades desejáveis para um MARE preveem atenuar valores < -10 dB [17]. Neste caso, verifica-se que a amostra contendo os filamentos na concentração de 40% e também a obtida pela mistura de 40% de cada um dos aditivos, atende a esta condição com valores de atenuação > 90%. IV. CONSIDERAÇÕES FINAIS Os resultados obtidos neste trabalho permitem concluir que as amostras em estudo apresentam estruturas cristalinas semelhantes, porém morfologias diferentes. A influência dos formatos dos aditivos no comportamento dos compósitos processados é evidenciada nas medidas dos parâmetros complexos da permissividade e da permeabilidade. Neste caso, tem-se que para uma mesma concentração, os aditivos filamentos apresentaram os maios valores dos parâmetros complexos em relação ao aditivo com formato de microesferas. Observa-se ainda que, a mistura dos dois aditivos contribuiu para o aumento dos parâmetros complexos. A análise de perdas por reflexão das amostras indica que a mistura dos aditivos resultou em absorvedores mais eficientes na atenuação da radiação incidente, em relação ao uso dos aditivos separadamente. Os resultados obtidos confirmam que o desempenho dos MARE é dependente da frequência e da espessura.  "
}