	{
		"id": 95,
		"titulo": "análise comparativa das técnicas de geração fotônica de sinais arbitrários para aplicação em radar",
		"autor": "rodrigo de faria baroni, joaquim j. barroso, josé edimar barbosa oliveira e olympio lucchini coutinho",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2016/st/ST_03_2.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 1,
		"resumo": "A geração fotônica de sinais para aplicação em sistema radar com recursos de guerra eletrônica tem sido amplamente pesquisada. Isso decorre das vantagens relativas aos valores elevados de largura de banda e frequência de operação quando comparados com sistemas eletrônicos convencionais. Uma análise efetiva do potencial dessa técnica fotônica para geração arbitrária de sinais requer uma avaliação do produto tempo-largura de banda gerado (TBWP), que constitui uma das principais figuras de mérito em sistemas radar com compressão de pulso. Considerando os altos valores de TBWP demandados nesse tipo de aplicação, que podem alcançar a faixa de centenas a milhares de unidades, este trabalho apresenta um estudo comparativo das técnicas fotônicas de geração arbitrária de sinais com os maiores valores de TBWP. Maior foco é dado à técnica de auto-heterodinagem óptica.",
		"texto": " I. INTRODUÇÃO A geração de sinais de radiofrequência (RF) por meio da tecnologia de RF em fotônica visando aplicação em sistemas de radar tem sido amplamente investigada, em virtude das vantagens de elevada largura de banda instantânea, alta frequência de operação, associadas a baixas perdas de propagação e imunidade à interferência eletromagnética, quando comparadas à geração utilizando eletrônica convencional [1]. Em geral, usando eletrônica convencional, a geração direta de sinais se limita a frequências da ordem de alguns GHz, requerendo estágios de elevação da frequência que podem degradar a performance global do sistema [2] [3]. A tecnologia fotônica, por sua vez, possibilita a geração direta de sinais com frequência de operação na ordem de dezenas a centena de giga-hertz, apresentando ainda elevada largura de banda [4]. Outro aspecto importante está relacionado com a capacidade de guerra eletrônica de modernos sistemas radares que empregam modulação intrapulso de fase ou frequência na transmissão, associada à compressão de pulso na recepção. Quando há modulação de frequência intrapulso, usa-se o termo chirp, originado do idioma inglês, que nesse artigo será mantido por conveniência. Essas características de modulação intrapulso e de compressão permitem o desenvolvimento de sistemas radar com baixa potência de pico na transmissão, pulsos com longa duração e elevada largura de banda. A combinação dessas características possibilita que o sistema radar tenha simultaneamente longo alcance e alta resolução em distância, além de reduzir drasticamente a probabilidade de interceptação e de interferência inimiga [5]. Nesse sentido, torna-se preponderante a análise da figura de mérito TBWP em sistemas radar com modulação intrapulso. Esse parâmetro traduz a eficiência do sistema em realizar o espalhamento de energia do pulso transmitido e a sua compressão na recepção. No que tange à geração fotônica de sinais de RF, diversas técnicas têm sido propostas para sinais de onda contínua (CW) e sinais arbitrários [4], [6]. Este artigo concentra atenção nas técnicas de geração fotônica de sinais arbitrários. As técnicas propostas em [6] empregam propagação em fibra e têm sido extensivamente investigadas com o objetivo de suplantar limitações de estabilidade e de perdas elevadas presentes outras configurações baseadas em modulação espacial de luz (SLM) que utilizam propagação em espaço livre. As principais técnicas de geração fotônica de sinais arbitrários são: Direct Space-to-Time Shaping (DST) [7], Microwave Waveform Generation Based on a Photonic Microwave Daley Line Filter [8], Temporal Pulse Shaping (TPS) [9] e Spectral-Shaping and Wavelenght-to-Time Mapping (SS-WTTM) [10]. Entre essas, destaca-se a última, SS-WTTM, pela flexibilidade de implementação, a qual é tema de discussão neste trabalho. Outra possibilidade de geração de sinais arbitrários é baseada no batimento heteródino de dois sinais ópticos distintos, sendo um deles modulado em frequência. A vantagem dessa técnica é a capacidade de gerar sinais com frequência de operação da ordem de dezenas de GHz e TBWP que podem alcançar valores na ordem de 105 [11]. Contudo, essa técnica utiliza duas fontes ópticas independentes e incoerentes e, por consequência, transferem o ruído de fase óptica para o sinal de RF gerado [4]. Outra técnica que permite tanto a geração de sinais CW quanto de sinais arbitrário com elevada estabilidade emprega oscilador optoeletrônico. Contudo, os valores de duração temporal do pulso e de TBWP resultantes desse método, ainda são muito baixos [12]. Recentemente, uma solução utilizando a técnica de autoheterodinagem foi apresentada para geração de pulso arbitrário com alto valor de TBWP, compatível com aplicação radar [13]. Essa técnica apresenta a vantagem de utilizar apenas um laser e um interferômetro Mach-Zehnder, incorporando flexibilidade e simplicidade para a geração de sinais com longa duração de pulso e elevada largura de banda[14]. Esse trabalho tem por objetivo apresentar as vantagens e limitações das principais técnicas fotônicas propostas, com foco na abordagem por auto-heterodinagem óptica. Este trabalho está divido em cinco seções. A sessão II aborda a geração fotônica baseada em elementos dispersivos, a seção III aborda a geração fotônica baseada em heterodinagem, a seção IV analisa a geração fotônica baseada em auto-heterodinagem óptica e a seção V apresenta a conclusão. II. GERAÇÃO FOTÔNICA BASEADA EM ELEMENTOS DISPERSIVOS A arquitetura básica de um SS-WTTM pode ser vista na Fig. 1. Um pulso ultra curso gerado pela fonte laser pulsada é aplicado a um filtro com a função de formatar o espectro óptico desejado. Esse pulso é enviado ao dispositivo dispersivo para que seja feita a conversão do domínio da frequência para o domínio no tempo pelo WTTM. Em seguida, o pulso incide no fotodetector onde o sinal óptico é convertido em sinal de RF. A abordagem apresentada nesse artigo é baseada nas características do pulso óptico ultracurto e do meio dispersivo em que esse pulso é submetido na propagação. A largura do pulso ultracurto é da ordem de picossegundos ou fentossegundos e, mais recentemente, largura de atossegundos [15], geralmente emitido por uma fonte óptica pulsada, como um mode-locked laser (MLL). O elemento dispersivo é utilizado para realizar duas funções: a função de spectral shaper (SS), onde o elemento é usado dentro do filtro espectral; e a função de wavelenght-to-time mapping (WTTM), onde é feita a propagação do pulso após a conformação espectral. O elemento dispersivo pode ser uma fibra monomodo, uma fibra compensadora de dispersão ou uma grade de Bragg linearmente variável (LCFBG) [6], [16]. A primeira função, o spectral shape, consiste em modificar o espectro do pulso ultracurto emitido pela fonte laser pulsada. Isso é obtido por meio da aplicação do pulso a um filtro óptico com faixa espectral livre (free spectral range - FSR) com variação crescente ou decrescente. Para variar o FSR, em geral, emprega-se um elemento dispersivo inserido dentro de um interferômetro de Fabry-Perot [6]. Duas abordagens principais são amplamente investigadas para a obtenção da função spectral shaper com FSR variável. Em um primeira abordagem, utiliza-se uma configuração que adota a construção de duas grades de Bragg linearmente variáveis, com diferentes taxas de chirp, superpostas na mesma fibra, com um pequeno deslocamento longitudinal entre as grades, conforme mostrado na figura abaixo. A expressão que representa a resposta espectral por essa estrutura pode ser escrita de [17] como: onde, 𝑛 é o índice de refração da fibra, 𝜆0 é o comprimento de onda inicial, e 𝐿(𝜆) é o comprimento equivalente da cavidade, o qual varia em função do comprimento de onda e pode ser expresso de [6] por:  onde, 𝐶1 e 𝐶2 são as taxas de chirp das duas LCFBGs, com 𝐶1 ≠ 𝐶2 e 𝑑 é o deslocamento longitudinal. Como pode ser visto em (1) o comprimento equivalente da cavidade é função do comprimento de onda, o que garante à FSR variação no seu valor, isto é, faixa espectral crescente ou decrescente de acordo com o comprimento de onda incidente na LCFBG. A segunda abordagem emprega um laço Sagnac com uma grade de Bragg linearmente variável centralizada no laço, conforme pode ser visto na Fig. 2. A funcionalidade dessa estrutura é idêntica a de um interferômetro Fabry-Perot, em que as reflexões das ondas ópticas com sentidos opostos de propagação, ao incidir em posições diferentes da LCFBG, resultam em um espectro com FSR variável [10]. Matematicamente, o laço Sagnac pode ser modelado como um filtro com duas linhas de retardo [10]. Essa arquitetura é diferente da anterior por permitir um pequeno ajuste da frequência central e da taxa de chirp, baseado na variação de um TDL (tunable delay line) acoplado do loop. Devido ao ponto de reflexão no interferômetro depender do comprimento de onda das duas ondas ópticas que percorrem sentidos opostos do laço faz com que, novamente, a FSR seja crescente ou decrescente, conforme apresentado na eq. (1). Todavia, 𝐿 agora é composto de duas parcelas: ∆𝐿0 que decorre do ajuste fino do TDL (que independe do comprimento de onda) e ∆𝐿(𝜆) que é a diferença de comprimento da cavidade introduzida pela LCFBG (dependente do comprimento de onda)A segunda função, o wavelenght-to-time mapping, realiza a conversão do domínio da frequência para o domínio do tempo de um pulso com espectro conformado pelo spectral shaper. Matematicamente, se um pulso 𝑔(𝑡) na entrada, com largura temporal ∆𝑡0, passar por um meio dispersivo 𝜙̈ (ps/nm.km), com dispersão cromática de primeira ordem, satisfazendo-se a condição de Fraunhofer |𝜙̈ ⁄∆𝑡02| ≫ 1, o pulso 𝑦(𝑡) na saída pode ser expresso de [18] por: Resolvendo-se a transformada de Fourier em (3), o sinal 𝑦(𝑡) na saída do meio dispersivo pode ser expresso por [6]: Observa-se em (4) que o sinal óptico na saída do meio dispersivo tem envoltória igual à transformada de Fourier do pulso de saída do filtro, 𝐺(𝜔), multiplicada por um termo de fase. O sinal de RF na saída do fotodetector é proporcional a envoltória do sinal óptico 𝑦(𝑡) [6]. Dessa forma, o termo de fase em (4) é eliminado na detecção pelo fotodetector e a forma de onda do sinal de RF no domínio do tempo apresenta a forma do próprio espectro óptico conformado no filtro. A frequência de RF gerada pela estrutura SS-WTTM empregando a primeira abordagem pode expressa de [6] por: em que χ (ps/nm) é a dispersão total da fibra monomodo utilizada para desempenhar a função WTTM. Como pode ser visto em (5) a frequência instantânea é linearmente dependente do tempo, o que representa um sinal elétrico com frequência instantânea variável. Assim, considerando as duas funções apresentadas, spectral shaper e wavelenght-to-time mapping, o maior esforço no desenvolvimento dessa arquitetura deve ser concentrado no projeto do filtro óptico (spectral shaper), cuja resposta em frequência tenha a mesma forma do pulso de RF desejado [6], pois o WTTM se encarregará de manter o mesmo perfil da envoltória no domínio temporal. A duração dos pulsos empregando essa arquitetura é realizada pelo alargamento temporal do pulso quando o mesmo atravessa o elemento dispersivo antes de incidir no fotodetector. A largura máxima à meia altura (FWHM) do pulso após passar pelo WTTM pode ser calculada por ∆𝜏 = 𝐵𝜆χ, onde 𝐵𝜆 é a largura espectral do pulso e χ (ps/nm) é a dispersão total do elemento dispersivo. Contudo, os valores atuais de duração dos pulsos obtidos por esse método são baixos, da ordem de nanossegundos. Os resultados publicados com maiores valores de TBWP que se tem conhecimento utilizando SS-WTTM foram: 37,5 em [17], o qual empregou a primeira estrutura apresentada, ou seja, duas LCFBGs superpostas. Em [10], um TBWP de 44,8 foi alcançado utilizando a segunda estrutura, laço Sagnac. Mais recentemente, um experimento utilizando o spectral shape baseado em duas LCFBGs construídas em um trecho de fibra e o WTTM realizado por um loop dispersivo resultou em um TBWP de 225, para uma largura de 9 GHz e duração de pulso de 25 ns [16]. Nesse experimento, a dispersão foi aumentada significativamente pela recursividade do pulso no laço. Outro trabalho utilizando um interferômetro com um pulse shaper no braço superior e um elemento dispersivo desempenhando o WTTM na saída desse interferômetro resultou em um pulso com largura de banda de 34,7 GHz e duração temporal de 15,75 ns, com TBWP de, aproximadamente, 589 [19]. Como pode ser observado desses resultados, as configurações que utilizam spectral shaper e wavelenght-totime mapping resultam em valores de TBWP ainda reduzidos. Isso deriva da duração limitada dos pulsos, em virtude da dispersão restrita disponível nos elementos dispersivos atuais. III. GERAÇÃO FOTÔNICA BASEADA EM HETERODINAGEM Uma maneira de se gerar um sinal arbitrário de RF provém da heterodinagem entre dois sinais ópticos emitidos por duas fontes lasers distintas, conforme pode ser visto na Fig. 4. As duas fontes lasers independentes e incoerentes emitem ondas ópticas para realizar a heterodinagem. Para que o sinal gerado seja modulado em frequência, é necessário que uma das fontes de luz tenha sua frequência óptica variável no tempo. Essas portadoras ópticas são então combinadas em um acoplador óptico e incidem em um fotodetector. O sinal elétrico na saída do detector possui frequência central igual à diferença entre os dois sinais ópticos batidos, além de um fator de fase quadrático que produz uma taxa de modulação da frequência angular do sinal de micro-ondas gerado. Considerando os campos ópticos emitidos por duas fontes lasers dados por: tem-se que 𝐸1 e 𝐸2 são os termos de amplitude, 𝜔1 e 𝜔2 são as frequências angulares, 𝜑1 e 𝜑2 são os termos de fase e α (rad/s2) é a taxa de modulação de frequência angular, dada por: onde ∆𝜔 é a excursão da frequência angular óptica em função da variação da corrente de injeção no laser modulado no intervalo τ. Considerando o meio de propagação óptica linear, o campo elétrico óptico na entrada do fotodetector é dado por: Considerando que apenas a diferença das frequências das portadoras ópticas estejam dentro da faixa de frequência de RF do fotodetector, a corrente na saída desse dispositivo é dada por: onde ℜ é a responsividade do fotodetector, P1 e P2 as potências ópticas acopladas ao fotodetector devido às fontes laseres 1 e 2, respectivamente. Como pode ser visto em (9), um sinal com elevada frequência de RF pode ser gerado, adotando-se convenientemente os valores das duas portadoras ópticas 𝜔1 e 𝜔2. Como exemplo, a diferença de 1 nm entre duas fontes ópticas produz um batimento de 125 GHz, em torno do comprimento de onda de 1550 nm, na saída de um fotodetector hipotético. Nesse contexto, o trabalho reportado em [11] apresentou resultado experimental utilizando heterodinagem óptica para geração e transmissão wireless. Por meio da modulação direta em uma das duas fontes laser empregadas, primeiro usando corrente com forma triangular e depois com forma senoidal, o experimento obteve sinais elétricos modulados linear e nãolinearmente em frequência. Esses sinais foram gerados em banda-W na faixa de 89 GHz a 103 GHz, com largura de banda de 14 GHz e duração de pulso de 50 𝜇𝑠. Isso resultou em TBWP extremamente alto e igual a 7 × 105. A duração de pulso nesse experimento foi obtida por meio da interrupção do sinal óptico modulado continuamente através de um sinal de controle com forma de onda quadrada, utilizada para ligar e desligar o transmissor de banda-W. A frequência de modulação da corrente do laser, tanto para a onda triangular como para a senoidal foi de 10 kHz, apenas o tempo de subida das funções de modulação foi considerado no chaveamento do transmissor, o que resultou na duração do pulso de 50 𝜇𝑠. A maior limitação dessa abordagem se refere ao fato de as fontes ópticas serem independentes uma da outra e, portanto, de não haver coerência entre as fases 𝜑1 e 𝜑2 em (9). Dessa forma, o ruído de fase gerado no domínio óptico é transferido para o sinal elétrico na saída do fotodetector. Isso é extremamente indesejável para sistemas radar com modulação intrapulso, a qual exige coerência nos pulsos recebidos. Na geração de sinais CW por heterodinagem, as técnicas optical injection lock e optical phase lock loop foram propostas, recentemente, para minimizar o problema de ruído de fase do sinal elétrico [4]. Todavia, não se tem conhecimento até o presente sobre a aplicação desses métodos na geração de sinais arbitrários utilizando heterodinagem. IV. GERAÇÃO FOTÔNICA BASEADA EM AUTO-HETERODINAGEM ÓPTICA O método de auto-heterodinagem óptica tem sido empregado na caracterização de dispositivos optoeletrônicos, , por exemplo, na caracterização da resposta em frequências de fotodetectores e na medição de largura de linha de laseres [20]. Além disso, tem despertado a atenção para a geração de sinais de micro-ondas devido a suas vantagens em relação a outras técnicas conhecidas [14], [21], [22]. Entre as vantagens observadas, cita-se o fato desse método utilizar um interferômetro Mach-Zehnder ao invés de moduladores externos, os quais requerem sinais de referência e de polarização estáveis. Além disso, utiliza apenas uma fonte laser, ao contrário das modulações que empregam arranjos com lasers mestre-escravo. Outrossim, o sinal de micro-ondas pode ser obtido a partir de um gerador de funções arbitrárias com baixa frequência. Por meio da auto-heterodinagem, é possível obter duas portadoras ópticas a partir de uma única fonte laser, as quais podem ser usadas para gerar um sinal CW de RF, bem como para gerar sinais arbitrários pulsados com modulação de frequência intrapulso e elevado produto tempolargura de banda, compatíveis com aplicação em sistemas radar [13]. Essa técnica utiliza uma propriedade inerente dos diodos lasers, que é a variação da frequência óptica em função da variação de corrente de injeção. Esse efeito é conhecido como parâmetro de chirp do laser e é causado em função da variação do índice de refração da cavidade óptica quando há uma variação de temperatura ou da densidade de portadores livres no meio ativo do laser, efeito esse conhecido como dispersão de plasma dos portadores [23]. A arquitetura básica de um sistema de geração de sinais de RF utilizando auto-heterodinagem óptica pode ser vista na Fig. 5.O princípio de funcionamento dessa estrutura se baseia na modulação direta do sinal óptico do laser, geralmente um laser DFB. O sinal elétrico de modulação da fonte laser, normalmente, é gerado como uma função de tensão por um AWG e convertido em corrente. A portadora óptica é modulada em frequência em função modulação de corrente de injeção de bombeamento do laser. O sinal óptico modulado é aplicado em um interferômetro Mach-Zehnder (MZI) com desbalanceamento de braços ∆𝐿, onde ∆𝐿 ≫ 𝜆. Na entrada do interferômetro, o sinal óptico é divido uniformemente entre os dois braços por meio de um acoplador óptico de 3dB, sendo que o braço superior propicia um atraso no tempo ∆𝜏 = 𝑛∆𝐿⁄𝑐, devido ao comprimento adicional igual à ∆𝐿. Na saída do interferômetro, os dois sinais ópticos são combinados por em um segundo acoplador, sendo um deles atrasado de ∆𝜏 em relação ao outro. Os sinais são então aplicados a um fotodetector de alta velocidade, produzindo um sinal de microondas na saída, resultante do batimento dos dois sinais ópticos provenientes do interferômetro MZI. A frequência instantânea do sinal elétrico gerado é igual à diferença entre as frequências ópticas dos dois sinais incidentes na entrada do fotodetector. Matematicamente, a corrente na saída do fotodetector pode ser escrita de [13] como: onde, ℜ é a responsividade do detector óptico, 𝑇(𝑓) é a função de transferência do interferômetro Mach-Zehnder e 𝑃𝐿 é a potência óptica que incide no fotodetector. A função de transferência do interferômetro é representada de por [13]: onde, ∆𝜙 é a diferença de fase dos sinais ópticos nos braços do MZI, a qual pode ser representada como: Em (12), 𝑓(𝑡) é frequência instantânea da fonte óptica e pode ser representada pela expressão: onde, 𝑓0 é a frequência inicial de oscilação do laser quando polarizado com corrente de injeção 𝐼𝑆𝐸𝑇, 𝛼 é o parâmetro chirp do laser, dado em (Hz/A), e 𝐼𝐿(𝑡) é a corrente de injeção. Esta corrente pode ser expressa como uma função quadrática em função do tempo, da seguinte forma: onde, 𝛽, dado em (A/s), e 𝛾, dado em (A/s2), são os coeficientes de primeira e de segunda ordem da função de modulação, respectivamente. Considerando o sistema causal, para haver interferência entre os sinais no segundo acoplador óptico do MZI, deve-se ter 𝑡 ≥ ∆𝜏. Substituindo (14) em (13) e reescrevendo (12), temos: Substituindo (15) em (10), a corrente da saída do fotodetector em função da fase instantânea pode ser expressa por: A partir do argumento do cosseno em (16), encontramos a frequência e a fase instantâneas do sinal de RF gerado, expressos por: Podemos observar em (17) que a frequência instantânea varia linearmente com o tempo, o que demonstra que o sinal de RF é linearmente modulado em frequência. Além disso, pode ser visto em (17) que, alterando o valor dos coeficientes 𝛽 e 𝛾 da corrente de modulação, pode-se modificar a frequência central e a taxa de chirp do sinal gerado. Outrossim, modificando-se 𝐼𝑆𝐸𝑇 em (18) pode-se alterar a fase do sinal. Conforme anunciado anteriormente, o experimento realizado [13] utilizou a técnica de auto-heterodinagem óptica e obteve pulso de RF com frequência linearmente variável, com duração de 1μs e largura de banda de 4,2 GHz. A duração do pulso de 1 μs nesse experimento foi obtida a partir do chaveamento de um modulador Mach-Zehnder (MZM) empregado para equalizar a amplitude do pulso óptico. Com isso, o TBWP obtido foi de 4200. Esse foi o maior valor alcançado utilizando apenas um diodo laser que se tem conhecimento. V. CONCLUSÃO As técnicas de geração fotônica de sinais arbitrários têm sido amplamente pesquisadas em virtude dos valores elevados de largura de banda e de frequência de operação, quando comparados com a geração convencional por meio de dispositivos eletrônicos. A análise das técnicas fotônicas de geração de sinais de RF aplicados em sistemas radar com recursos de guerra eletrônica exige a avaliação do produto tempo-largura de banda gerado (TBWP), a qual constitui uma das principais figuras de mérito, em especial quando a aplicação envolve sistemas radar com compressão de pulso. Nesse sentido, foi abordado neste trabalho as técnicas que empregam elemento dispersivo para conformação espectral do pulso óptico e para a conversão do domínio da frequência para o tempo. Essas técnicas ainda apresentam valores modestos de TBWP, devido aos valores limitados de dispersão dos elementos dispersivos disponíveis atualmente. A técnica de heterodinagem óptica, por sua vez, apresenta valores extremamente elevados de frequência e de TBWP, mas seu princípio de operação é prejudicado pela geração de ruído de fase na saída do fotodetector, o que tem levado pesquisadores a desenvolverem métodos alternativos. A técnica de auto heterodinagem, no entanto, tem chamado a atenção para a geração fotônica de sinais arbitrários, em virtude de sua flexibilidade e simplicidade de implementação, além de ter possibilitado alcançar valor prático de TBWP em torno de 4200, com largura de pulso de aproximadamente 1 us. Tais resultados despertam ainda mais interesse de pesquisa, em função da viabilidade de aplicação em sistemas radar."
	}
