	{
		"id": 96,
		"titulo": "desenvolvimento e implementação em hardware com componentes discretos de um processo de saída de controlador fuzzy tipo-2 intervalar",
		"autor": "rodrigo b. santos, gabriel a. f. souza, paloma m. s. rocha-rizol, lester a. faria",
		"url": "https://www.sige.ita.br/edicoes-anteriores/2016/st/ST_08_2.pdf",
		"tipo_documento": "Artigo de Simpósio",
		"rotulo": 2,
		"resumo": "O processo de redução de tipo e defuzificacão compõem o processo de saída de um controlador fuzzy tipo-2 intervalar. Devido à grande carga computacional necessária para esse processo de redução de tipo, muitas alternativas têm sido buscadas a fim de reduzir o tempo de processamento. O método de defuzificação direta Nie-Tan é apresentado na literatura como tendo o melhor custo benefício, pois alia simplicidade e elevada precisão. Este artigo apresenta a implementação, em hardware analógico com componentes discretos e em tecnologia CMOS, de um processo de saída de um controlador Fuzzy tipo-2 intervalar baseado no método de defuzificação direta Nie-Tan, aplicando técnicas de baixa tensão de alimentação. Os blocos que compõem o módulo de saída foram implementados com transistores disponíveis no CI CD4007UBE, permitindo validar a arquitetura proposta, a qual se mostra inédita na literatura. Tal implementação com transistores discretos deriva do fato de possibilitar a verificação do comportamento da mesma, antes de se prototipar em um circuito integrado, ação esta mais demorada e, sem dúvidas, que compromete maiores recursos financeiros. Ainda, a implementação discreta da topologia permite ratificar a sua simplicidade e funcionalidade mesmo em se tratando de componentes com altas margens de variação, como os componentes discretos utilizados nessa montagem.",
		"texto": " I. INTRODUÇÃO O controlador fuzzy tipo-2 intervalar é capaz de trabalhar com incertezas típicas de problemas complexos existentes na natureza, fato este impossível para controladores fuzzy tipo-1. Tais incertezas são descritas e modeladas por uma mancha de incerteza (footprint of uncertainty - FOU) [1]. Um exemplo típico de aplicação desses controladores fuzzy tipo-2, especificamente na área militar, é apresentado em [2], onde o controlador fuzzy é usado para identificar radares amigos e/ou inimigos. Nesse caso específico [2], o principal problema está nas incertezas envolvidas para uma correta identificação dos sinais, fato este de fácil solução por meio deste tipo de controlador. Conjuntos fuzzy tipo-2 intervalares de demandarem menor carga computacional quando com os conjuntos não intervalares. Na Fig.1, A  e  A representam as funções de pertinência inferior e superior, respectivamente. Um diagrama de blocos típico de um controlador fuzzy pode ser verificado na Fig.2, sendo composto essencialmente por 5 blocos: fuzificador, inferência, base de regras, e o módulo de saída, o qual é composto pelos blocos tipo-redutor e defuzificador. O fuzificador converte a entrada real (crisp) em valores pertencentes ao conjunto fuzzy tipo-2. O bloco de inferência processa as informações das entradas do controlador e fornece, em sua saída, um conjunto fuzzy tipo-2, resultante da aplicação da base de regras estabelecidas para o processo. O módulo de saída, composto por duas etapas, é responsável por fornecer, na saída do controlador, os valores crisp. Neste, o bloco tipo redutor realiza a redução de tipo, sendo o conjunto fuzzy tipo-2 transformado em um conjunto fuzzy tipo-1 equivalente. A partir daí, o bloco defuzificador é responsável por transformar o conjunto fuzzy em valores reais ou crisp. Neste contexto, o presente trabalho apresenta a implementação, em hardware analógico com componentes discretos, dos blocos que compõem o método de saída NieTan (NT) [3] do controlador fuzzy tipo-2. A opção por implementar o circuito com transistores discretos deriva do fato de possibilitar a verificação do comportamento do mesmo, antes de prototipá-lo como circuito integrado, ação esta mais demorada e, sem dúvidas, que compromete maiores recursos financeiros. Ainda, a implementação discreta da topologia permite ratificar a sua simplicidade e funcionalidade mesmo em se tratando de componentes com altas margens de variação, como os componentes discretos utilizados nessa montagem. Muitos métodos que implementam o processo de saída para controladores fuzzy tipo-2 têm sido propostos na possuem função de pertinência secundária uniforme, conforme apresentado na Fig.1, sendo preferíveis pelo fato literatura [4]. Em particular, uma implementação em hardware analógico, descrita em [5], foi realizada com sucesso para o método de saída Wu Mendel (WM). Porem, este apresenta complexidade muito superior ao método NT aqui proposto, acarretando maior consumo de potência, maior área utilizada e desempenho mais baixo, uma vez que possui um número de componentes e blocos mais elevado para a realização das operações necessárias. Assim sendo, o presente trabalho se mostra coerente e inovador, uma vez que não foi encontrado na lteratura uma implementação do método Nie-Tan em hardware analógico, o que possibilita, devido às particularidades do processo proposto em [3], obter um hardware mais compacto, com baixo consumo de potencia e melhor desempenho. Este artigo apresenta as seguintes seções: a seção II apresenta o módulo de saída NT, enquanto a seção III apresenta o diagrama de blocos e os circuitos propostos para a implementação do método. A seção IV apresenta e compara os resultados dos testes realizados em laboratório com aqueles obtidos em simulações e, finalmente, a seção V discorre sobre as conclusões e considerações finais a despeito do trabalho. II. METODO DE DEFUZIFICAÇÃO NIE-TAN Considere na Fig.3 um conjunto de funções de pertinências de saída de um controlador fuzzy tipo-2 intervalar onde os graus de ativação f e f são obtidos pelo processamento dos dados das entradas, realizados pelo bloco de inferência. Para o método NT [3], a operação de redução de tipo é obtida pelo cálculo da média entre as funções de pertinência superiores e inferiores, conforme (1), permitindo-se obter, para a o conjunto de funções da Fig.3, a função de pertinência tipo-1 apresentada na Fig.4. Aplicando-se o método de defuzificação da altura [6] à função de pertinência tipo-1 da Fig.4, obtém-se: onde considera-se que as funções de pertinências sejam equidistantes entre si [6], ou seja, y2=2y1 e y3=3y1. A generalização de (3) para um número N de funções de pertinência, localizadas em qualquer posição yi do universo de discurso Y, é o método de defuzificação proposto por Nie-Tan [3]. onde f e f representam os respectivos limites, superiores e inferiores da FOU. Nota-se, em (2), que o valor crisp é obtido diretamente dos valores dos graus de ativação das respectivas funções de pertinências tipo-2, sendo que o processo de tipo-redução fica implícito na aplicação do método. Métodos que apresentam essas características são frequentemente chamados de métodos de defuzificação direta [7]. III. IMPLEMENTAÇÃO MÉTODO NT A implementação do processo de saída Nie-Tan do controlador fuzzy tipo-2 para três funções de pertinência de saída é obtido por um circuito capaz de realizar a operação apresentada em (2). A Fig.5 apresenta o diagrama de blocos do circuito sugerido a partir da proposta de Nie-Tan [3], supondo que as funções de pertinência sejam equidistantes entre si [6]. É importante se ressaltar que, apesar de a ideia do processo de saída Nie-Tan ser conhecido e ter sido previamente proposto [3], o diagrama de blocos para a sua implementação por meio de um circuito analógico é uma proposta desta pesquisa, bem como os demais circuitos que serão explicados a seguir, de forma a implementar cada um dos blocos em pauta. As entradas representadas por f i e f i são valores de corrente que representam, respectivamente, as funções de pertinência inferiores e superiores fornecidas pelo circuito de inferência da Fig.2, ou seja, que consideramos aqui neste trabalho como inputs para o circuito em pauta, uma vez que estamos focando no processo de saída do controlador. A saída do circuito como um todo é o valor crisp obtido em função das entradas, de acordo com (3). Os componentes destacados de 1 a 4 que compõem o esquemático da Fig.5 são descritos a seguir: A- Circuito de soma (Bloco 1, da Fig.5): A Fig.6 apresenta a operação de soma em modo corrente. A vantagem de trabalhar com circuitos deste tipo está na possibilidade de obter a operação de soma pela aplicação da Lei de Kirchoff das correntes [6], o que torna o circuito bastante mais simples. B- Circuito escalonador (Bloco 2, da Fig.5): Neste trabalho, como o foco se remete à implementação discreta do circuito proposto, não é possível trabalhar com as razoes (W/L) dos transistores comerciais adquiridos, de forma a obter os ganhos necessários descrito na Fig.5. Assim, a alternativa adotada foi duplicar o número de transistores, colocando-os em paralelo e, desta forma duplicando o W, ou em série, duplicando o L, de acordo com o solicitado e apresentado na Fig.7. Para tanto, considere inicialmente o circuito da Fig.7a. A configuração adotada é um espelho de corrente cascode capaz de trabalhar com baixa tensão de alimentação [8]. O transistores M1 e M2 operam na região de saturação. A corrente Iref induzida em M1 gera uma tensao VGS dada por (4): onde . Como a porta de M1 está ligada à porta de M2, esta passa a conduzir uma corrente IDS: Substituindo (4) em (5) obtém-se:  De (6) obtém-se a razão de espelhamento dada por:  Os transistor M4 tem o objetivo de atenuar as variações de tensão VDS sobre M3 para que a impedância de saída do transistor não influencie no espelhamento da corrente. Para manter o circuito balanceado, portanto, é necessária a inserção de M1 [9]. Com base nas deduções anteriores podem-se obter as relações de correntes Iref e Iout. Uma vez que os valores de β de todos os transistores podem ser considerados iguais (por serem todos componentes discretos e comerciais de um mesmo lote), obtém-se: C-Circuito Multiplicador/Divisor (Bloco 4, da Fig.5) O circuito multiplicado/divisor é obtido pela combinação dos circuitos de média geométrica e quadrático divisor [10]. O circuito de média geométrica é composto de duas entradas, Ix e Iy, e de uma saída Img. A relação entre as entradas e saídas e dada por: Assim como o circuito de média geométrica, o circuito quadrático/divisor possui duas entradas e uma saída, que estão relacionadas por (12). A operação de multiplicação e divisão é obtida quando esses dois circuito são combinados de acordo com a Fig.8. De acordo com (11) e (12) tem-se: A Fig.9 apresenta o circuito de média geométrica proposto em [10]. As equações que descrevem a operação do transistor nas regiões de saturação e triodo são dadas, respectivamente, por (14) e (15). Considere a Fig.9, supondo que o valor de βA dos transistores M4A e M8A sejam muito maiores que os valores de β dos transistores M1 e M11. Os transistores M2 e M5 devem ser analisados como se fossem um único transistor de valor (W/2L). A associação série foi realizada a fim de diminuir os valores das correntes I1 e I2 e, desta forma, aumentar a faixa de operação das correntes de entradas I x e Iy [10]. Sendo assim, a associação de M2 e M5 será referida, neste artigo, como M2 5 nas deduções subsequentes. A operação do circuito baseia-se na alternância das regiões de operação do transistores M2 5 e M6 7, isto é, quando o valor da corrente Ix é maior que o valor da corrente I y, M2 5 opera na região de triodo enquanto M6 7 opera na região de saturação. Quando Ix é menor, o oposto ocorre. Supõe-se, inicialmente, que M2 5 opera na região de saturação. Neste caso: Aplicando a LKT aos transistores M2 5, M8A e M11, obtém-se: Aplicando-se (17) em (16) obtém-se então: Além disso, o fator (VGS2 5 VTH) pode ser escrito em termos da corrente Ix como: De (18) e (19) tem-se: Como o valor de β8A é muito maior que o valor de β11, chega-se à conclusão anteriormente citada, isto é, se Ix< Iy, o transistor M2 5 opera na região de saturação. Em contrapartida, supondo-se que Iy seja maior que Ix, M2 5 opera na região de triodo. Novamente aplicando LKT nos transistores M2 5, M8A e M11 obtém-se a seguinte equação: Como β8A é muito alto, e β1=β11=β e obtémse: ou seja Sabe-se, porém, que I1=Iy/2, pois neste caso os transistores M6 e M7 operam na região de saturação, formando portanto um espelho de corrente com M11. Sendo assim obtém-se finalmente: Procedimento análogo pode ser realizado considerando que Iy>Ix, levando a resultado semelhante a (24). D -Circuito quadrático/divisor O mesmo procedimento utilizado para o circuito de média geométrica pode ser aplicado ao circuito quadrático/divisor, como no lado direito da Fig.10. Neste caso, Img e Iw são as entradas do circuito. A equação obtida da análise é análoga à (15), com: IV. SIMULAÇÃO E RESULTADOS EXPERIMENTAIS A Fig.11 apresenta o resultado da simulação do circuito de média geométrica (Fig.9) e a Fig.12 apresenta o valor obtido experimentalmente usando transistores disponíveis no CI CD4007UBE. Conforme pode ser verificado, o valor da faixa de operação do circuito é de 0 a 24µA, obtido diretamente da simulação apresentada na Fig.11. Para o circuito experimental esta faixa fica entre 0 e 20µA, conforme explicitado na Fig.12. As diferenças existentes entre os valores simulados e os valores experimentais são devidas aos transistores reais (comerciais) apresentarem descasamentos (não serem exatamente iguais), o que não é levado em consideração nas simulações. Isolando-se Iout, tem-se: A Equação (26) apresenta o resultado da combinação dos circuito de média geométrica e quadrático divisor, de acordo com o esquemático da Fig.8. E - Circuito processo de saída Nie-Tan A Fig.10 apresenta a implementação do método NT com transistores MOS para o caso particular de 3 funções de pertinências de saída. Os valores de f i e f i são valores de correntes fornecidos pela saída do circuito de inferência [6], apresentado na Fig.1. O valor Iy é o valor das distâncias entre os centros de cada função de pertinência de saída. O valor Iout é o valor crisp obtido da aplicação do método NT de defuzificação. A Fig.13 apresenta, nos mesmos moldes do anteriormente realizado para o circuito de média geométrica, a simulação do circuito quadrático/divisor. A Fig.14, a qual apresenta os resultados tanto ideal quanto do circuito experimental discreto implementado, mostra que a faixa de operação do circuito situa-se entre Iw=17µA e 32µA para I mg=20µA, condições estas também observadas na simulação, apresentada na Fig.13. Para os circuitos escalonadores, apresentados na Fig.7a,b, obtiveram-se os resultados apresentados nas Fig.15 e 16, após serem implementados com componentes discretos. As curvas experimentais e simuladas da Fig.15 estão de acordo com (7), ou seja, a corrente de entrada Iref é igual a Iout pois apresentam β e VT idênticos. Para o circuito de ganho igual a 2, obtiveram-se as curvas experimentais e simuladas, Fig.16. Nota-se na Fig.15 que o valor simulado encontra-se muito próximo do valor teórico esperado, porém o valor obtido experimentalmente apresenta um desvio um pouco maior. Isso se deve ao fato de que a simulação considera que todos os transistores estão perfeitamente casados, o que não condiz com a situação real, uma vez que transistores de chips diferentes foram usados. O circuito para obter um ganho de corrente igual a 3 foi experimentado e apresentou valores análogos ao apresentados nas Fig.15 e Fig.16 V. CONCLUSÃO O trabalho de implementação em hardware de circuitos com elementos discretos se mostra bastante desafiador, uma vez que é impossível obter casamento perfeito entre transistores comerciais, não necessariamente de mesmo lote e sem um maior controle de qualidade. Apesar disso, foi possível implementar os blocos propostos por este pesquisador para fins de construir o circuito necessário para o funcionamento de um módulo de saída NT do controlador fuzzy tipo-2 intervalar. Tal implementação permitiu validar a arquitetura proposta, mostrando um correto funcionamento do mesmo e descortinando a possibilidade de resultados ainda melhores por meio de uma implementação em circuito integrado, no qual o controle de casamentos e a qualidade dos componentes implementados favorece o desempenho do módulo de saída NT. Certamente a implementação em circuito integrados CMOS garante ao projeto uma serie de vantagens, que estão associadas à liberdade de escolhas dos valores de W e L dos transistores. Com isso pode-se estender consideravelmente a faixa de operação do circuito, além de facilitar o projeto de circuitos programáveis."
	}
