{
    "id": 97,
    "titulo": "estudo para simulação da seção reta radar de aeronave cougar (hm-3/as 532 ue)",
    "autor": "ricardo e. g. da silva, newton a.s. gomes, mauro a.alves, luiza de c. folgueras,, mirabel c. cerqueira,",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2016/st/ST_09_2.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 1,
    "resumo": "Os materiais absorvedores de radiação eletromagnética são obtidos com base no processamento adequado de matrizes poliméricas dopadas com partículas específicas ao uso do absorvedor e pela utilização de estruturas híbridas em materiais compósitos. Estes materiais são utilizados no meio militar para evitar a detecção e rastreamento de alvos por ondas de radar, e na área civil, para minimizar a interferência no funcionamento de equipamentos elétricos eletrônicos por radiações espúrias. Nesse trabalho, são apresentados conceitos básicos e estudos experimentais relativos aos materiais absorvedores de radiação eletromagnética, juntamente com informações sobre os materiais primários empregados no seu processamento e as metodologias de caracterização baseadas nas técnicas de medidas de seção reta radar (RCS). Assim, foram identificados fatores que influenciam a RCS de um alvo através simulações e experimentos com uso de instrumental de medidas e geração de ondas eletromagnéticas em ambiente controlado de câmara semianecoica e software específico para este fim.",
    "texto": "I. INTRODUÇÃO Materiais absorvedores de radiação eletromagnética (MARE) são materiais que quando atingidos por uma onda eletromagnética, têm a estrutura molecular excitada e a energia incidente é convertida em calor. Esta atenuação da radiação ocorre por haver na formulação alguns compostos que promovem a absorção da energia dos campos eletromagnéticos [1]. As aplicações do radar não são restritas somente ao setor militar, tendendo a crescer continuamente, à medida que a indústria encontra novos usos para essa tecnologia, abrangendo desde o setor aeronáutico, automobilístico até o doméstico. Para dificultar a detecção de alvos pelo radar é necessária a redução da energia das ondas eletromagnéticas espalhadas pelo alvo, para isto é necessária a utilização de MARE ou então a utilização de superfícies com uma geometria que tenha a capacidade de direcionar as ondas refletidas pelo alvo em direções diferentes da direção da onda incidente no material [2]. O uso de tecnologias furtivas (stealth) de redução da RCS podem, por exemplo, fazer com que uma aeronave tenha a assinatura radar de um pequeno pássaro [3]. Quando os materiais absorvedores são aplicados em aeronaves, devem ser resistentes e menos rígidos, para que possam cobrir uma estrutura com geometrias curvas ou planas conforme a necessidade de cada elemento da plataforma. A utilização de materiais com propriedades eletromagnéticas em conjunto com materiais obtidos à base de fibras permite o processamento de materiais absorvedores estruturais de interesse aeronáutico. Os materiais absorvedores de radiação eletromagnética são atualmente utilizados em diversas aplicações e em faixas de frequências, que variam de 10 MHz a 100 GHz [4,5]. Como exemplo de material, o uso de compósitos multifuncionais do tipo multicamadas permite ser processado com diferentes materiais, com o objetivo de aumentar a sua resistência, flexibilidade e absorção de radiação eletromagnética. Correlacionar o processamento e as análises das propriedades desejadas no material absorvedor são fundamentais para o domínio da tecnologia furtiva. A utilização de materiais absorvedores com apenas uma camada (monocamada), geralmente oferece bom desempenho apenas em banda estreita da faixa de frequências de interesse, principalmente quando processado para fins industriais, pois se conhece a frequência que irá operar. Entretanto, na tecnologia furtiva, não se conhece a frequência exata de um radar que opera de forma oponente; neste caso é necessário um material que atenda de forma toda a faixa de frequências, isto é, banda larga [6,7]. Portanto, a montagem de estruturas em várias camadas (multicamadas) possibilita que frequências de uma faixa, sejam absorvidas, quando comparado com um absorvedor tipo monocamadas. II. EXPERIMENTAL Desenvolvimento do estudo O AS 532 UE ou HM-3 Cougar é um helicóptero bimotor, projetado para o transporte de passageiros, missões off-shore, salvamento e trabalho aéreo. Em sua versão militar (HM-3) é uma aeronave de manobra que realiza missões de transporte de tropa, carga externa, assalto aero móvel e incursões noturnas através de óculos de visão noturna, sendo capaz de transportar até 27 pessoas, entre passageiros e tripulação. O Cougar UE, utilizado pelo Exército Brasileiro, está apto para emprego em missões de combate, apoio ao combate e apoio logístico. Possui diversos equipamentos e acessórios opcionais, entre os quais: posto de pilotagem blindado e compatível com NVG (óculos de visão noturna), duas metralhadoras 7,62 mm laterais, ganchos de 4,5 ton, guincho de 272 kg, seis macas para Evacuação Aeromédica e cinco tanques de combustível suplementares que lhe conferem até 7,5 horas de autonomia. Essa aeronave, escolhida pelo seu largo emprego em operações militares no Brasil através da Aviação do Exército Brasileiro, possui uma geometria singular para uma aeronave de grande porte e materiais que a constitui (Figs. 1-4), o que pode influenciar na RCS da aeronave e sua detecção por radares. A estrutura da aeronave e suas principais partes são mostradas nas Figs. 1 e 4. O estudo descrito nesse artigo foi realizado em duas linhas. Na primeira etapa foi utilizado um modelo em escala reduzida do helicóptero feito com material plástico, similar ao da Fig. 5, recoberto com folhas finas de metal, visando avaliar o modelo, para posteriormente a este trabalho preliminar, cobrir com MARE para estudos das refletividades e variação da RCS em uma câmara semianecoica. Na segunda linha foi simulada a RCS e refletividade de um modelo CAD do helicóptero com um software de simulação de espalhamento eletromagnético. Com isso, podem-se realizar comparações e validações entre esses dois métodos para o cálculo da RCS e refletividade do helicóptero. Materiais Absorvedores de Radiação Eletromagnética Visando alimentar em trabalhos futuros a biblioteca de dados de materiais no software newFasant, um material absorvedor de radiação do tipo compósito multicamadas foi processado e avaliado quanto a refletividade eletromagnética na câmara anecoica, nas frequências 8 e 12 GHz, da banda X. Assim, uma formulação foi desenvolvida à base de negro de fumo (5.0% (m/m) da marca Cabot, nanotubos de carbono de parede múltipla (10.0% (m/m)) adquiridos da alemã Bayer e matriz à base de resina poliuretânica do tipo bicomponente, especificado comercialmente como 7700HS. Para processar os laminados de compósitos multifuncionais foram utilizados material pré-impregnado (prepreg) de fibra de vidro e fibra de carbono da Hexcel Composites, do tipo bidirecional com resina pré curada do tipo epóxi. Um véu não-tecido (0,3 mm) foi impregnado com a formulação e inserido no empilhamento de prepregs, formando as camadas (10 prepregs em fibra de vidro) e a estrutura foi finalizada com um prepreg em fibra de carbono, visando atuar como placa metálica. Como referência aos compósitos multifuncionais foi processado material compósito sem a inserção de MARE no processo, isto é, somente camadas de prepregs de fibra de vidro e fibra de carbono. A cura foi em autoclave a temperatura de 120 °C e os compósitos funcionais foram processados em placas de dimensões de 10cm x 10cm. Software de simulação eletromagnética O software newFasant é uma ferramenta de simulação eletromagnética eficiente e que se baseia em várias técnicas state-of-the-art computacionais eletromagnéticos (CEM), com atualizações do banco de dados e da biblioteca de materiais frequentes, que incluem a introdução de novas funcionalidades. Há uma série de módulos especialmente concebidos para resolver os problemas específicos que ampliam a solução de problemas pelo usuário. Este software foi escolhido por fornecer uma plataforma funcional para o estudo do RCS possuindo uma antena básica e um calculador de RCS. Para as simulações realizadas, foi utilizado o módulo de simulação do espalhamento de radiação eletromagnética através da aproximação da física óptica (PO) [8]. Modelo em CAD O modelo em CAD da aeronave Cougar HM-3 foi desenvolvido através do software Autodesk 3D Studio Max. O modelamento foi realizado em dimensão similar ao da aeronave modelo em tamanho real e também quanto ao aspecto geométrico; com o objetivo de obter grande fidelidade quanto aos resultados no uso do software de análise RCS. O modelo CAD utilizado nas simulações é mostrado nas Figs. 6-8. Câmara semianecoica Para avaliar a aeronave coberta com metal e também o material absorvedor foram realizadas medidas de refletividade na banda X em uma câmara semianecoica, Fig. 9. A câmara semianecoica utilizada tem como característica ser de baixa reflexão para incidência normal nas paredes de fundo e ainda, ter baixo espalhamento eletromagnético para ângulos obtusos nas paredes laterais, teto e piso da câmara. Para as medidas foi inserido no centro da câmara, um pedestal revestido com poliestireno extrudido, que é transparente às ondas do radar, e ainda, um suporte para apoiar o modelo. O modelo plástico coberto com filme metálico é mostrado na Fig. 10. As medidas da refletividade eletromagnética foram realizadas na banda X (de 8 a 12 GHz) do espectro eletromagnético. Antenas transmissoras e receptoras direcionadas para o alvo colocado sobre o pedestal foram conectadas em gerador de sinais de radiofrequência (modelo MXA – N9020A) e gerador de sinais (modelo E8257D), ambos da marca Agilent Technologies, visando iluminar o modelo. Foram utilizadas antenas da faixa de frequência de 8 a 18 GHz, mas as medidas de refletividades foram realizadas na banda X da faixa micro-ondas. III. RESULTADOS E DISCUSSÕES Avaliações do modelo HM-3 em câmara semianecoica Nas Tabelas I e II são apresentados os resultados obtidos quanto a avaliação de refletividade (em dBm) em câmara semianecoica, para o modelo reduzido Cougar HM-3. Podese observar que o recobrimento do modelo com película metálica promoveu maior espalhamento da radiação. Atenuação da refletividade da onda incidente de 98% e 75% na banda X. Este recobrimento apresenta tendência à ressonância em menores frequências (próximo de 8 GHz) e em 10,0 GHz, região do espectro da banda X que operam a maioria dos radares militares, apresenta –11 dB e reflexão de 92%. Simulação computacional da RCS Foi realizada simulação da RCS da aeronave em rotação no plano horizontal. A aeronave foi girada em 360° e valores de RCS a intervalos de 1°. A Fig. 11 mostra os ângulos de incidência das ondas de radar no modelo, por exemplo, 0° corresponde à incidência frontal, 90° à incidência lateral. Os resultados de simulações realizadas nas frequências de 8 e 12 GHz são mostrados nas Fig. 12 e 13. As simulações foram realizadas em todas as frequências da banda X e os resultados foram similares ao da frequência de 8GHz e 12 GHz. Podese observar que a intensidade dos picos das Fig. 12 e Fig. 13 mostram que a RCS da aeronave Cougar HM-3 possui valor elevado nas posições críticas da aeronave: frontal e laterais. Avaliações do MARE em câmara semianecoica As placas dos compósitos multifuncionais processados com MARE foram iluminadas pela radiação eletromagnética em câmara semianecoica nas frequências de 8 GHz e 12 GHz para obtenção de medidas de refletividade (Figs. 14 e 15). As avaliações dos materiais compósitos sem MARE são apresentadas nas Figs. 16 e 17. A 8 GHz (Fig. 14) o compósito multifuncional apresenta –55,27 dBm de reflexão da onda incidente e a 12 GHz (Fig. 15) o valor –70,05 dBm. O material compósito sem a inserção de MARE no processo, na frequência 8 GHz (Fig. 16) apresenta -55,34 dBm, e -58,22 dBm a 12 GHz (Fig. 17). Comparando os materiais, nota-se que houve redução de energia incidente em 11,83 dBm a 12 GHz. A câmara semianecoica permite avaliar o material em cenário mais perto do real, pois a avaliação é realizada em situação semi confinada com a minimização de reflexões e sinais espúrios. IV. CONCLUSÕES O cálculo de RCS via uso de software usando o método PO é mais simples e envolve recursos computacionais com menos tempos de processamento e pode ser realizado em máquinas menos complexas quanto ao hardware. Na simulação da aeronave Cougar, o RCS apresentou valores alto devido à complexidade do CAD que contém muitos elementos planos representando a superfície. As simulações obtidas neste estudo são coerentes com os resultados experimentais obtidos na câmara semianecoica. O modelo em escala reduzida apresentou altos valores de espalhamento da radiação, possivelmente corroborado pelo revestimento metálico não homogêneo na superfície do modelo. Os materiais compósitos multifuncionais processados a partir de véus (nãotecidos) de fibras de vidro apresentaram espessura reduzida adequada para uso como material estrutural de uso aeronáutico e redução na energia incidente no material. Este estudo promoveu capacitação de recurso humano em relação a utilização do software newFasant, visando futuras predições em diferentes plataformas militares."
}