{
    "id": 99,
    "titulo": "antena espiral logarítmica com lente dielétrica para banda-x",
    "autor": "marcos arend",
    "url": "https://www.sige.ita.br/edicoes-anteriores/2016/st/ST_02_1.pdf",
    "tipo_documento": "Artigo de Simpósio",
    "rotulo": 2,
    "resumo": "É apresentado o arranjo de uma antena espiral logarítmica carregada com lente dielétrica para operação em Banda-X com polarização circular. A proposta apresenta banda larga (8-12GHz), baixa seção reta radar e baixo custo quando comparado a antenas cornetas para a mesma aplicação.",
    "texto": " I. INTRODUÇÃO O crescente congestionamento do espectro eletromagnético atrelado ao surgimento de novas tecnologias em semicondutores vem renovando o interesse em lentes dielétricas para operação nas regiões sub-milimétricas e milimétricas [1]. Antenas para aplicações em micro-ondas, com polarização circular e alto ganho são tradicionalmente soluções em guias de onda (complexas e caras), como antenas cornetas ou parabólicas, acrescentadas das guias de onda para acoplamento e geração de polarização circular [2]. O arranjo proposto (Fig 3) permite alimentação direta por cabo coaxial do elemento irradiador (antena espiral logarítmica) sem necessidade de cavidades/ guias de onda. Sistemas de Guerra Eletrônica (GE) geralmente adotam antenas metálicas que as tornam detectáveis a sistemas de radares [3][4]. A proposta de uso de lentes dielétricas pode reduzir significantemente a onda eletromagnética refletida do radar, portanto diminuindo a probabilidade de ser detectado. A onda irradiada de uma antena tem seu diagrama de irradiação manipulado pelo controle de fase em seus elementos, e é muitas vezes usado para direcionar a radiação em uma direção desejada [5]. Dielétricos desempenham um papel importante neste processo. Um parâmetro importante de uma antena é a sua diretividade, que é a medida de seu controle sobre o fluxo de energia. Para aumentar a diretividade, o tamanho da antena tem de ser aumentada, e a influência dos dielétricos no seu desempenho muda consideravelmente. Refletores são normalmente feitos de bons condutores e assim, tem menor perda, e por causa da sua elevada resistência mecânica podem ser feitos mais leves. Mas refletores pecam por serem limitados quanto a sua versatilidade para focar as ondas eletromagnéticas [2]. Lentes, por outro lado, por causa da sua transparência, têm maior grau de liberdade, especificamente possuem duas superfícies refletoras e a respectiva constante dielétrica (permissividade) ou índice de refração. As lentes também não sofrem tanto em relação à abertura necessária. No entanto, as lentes têm desvantagens como maior volume e elevado peso. Em aplicações de antenas para micro-ondas, lentes possuem numerosas e diversas aplicações, mas na maioria dos casos, elas são grandes em tamanho, com respeito ao comprimento de onda. Assim, na física de geometria ótica tem a maior parte dos projetos de lente. Os dielétricos naturais têm índices de refração maiores do que a unidade em frequências de micro-ondas e para a colimação requerem superfícies convexas. Os dielétricos são geralmente dispersivos, resultando na variação do índice de refração com frequência, e têm larguras de banda operacionais mais estreitos. Em pequenas antenas os dielétricos são usados geralmente para melhorar a eficiência de radiação e a polarização, tais como guias de onda e cornetas (horns). As antenas de corneta e feeds reflectors são exemplos que incorporam dielétricos para melhorar o desempenho [6]. O uso de dielétricos também é utilizado para a miniaturização de antenas. Dielétricos de baixa perda com média e alta permissividade já estão disponíveis e são usados cada vez mais para reduzir o tamanho da antena. Um número de áreas importantes incluem guias de ondas, cornetas e microstrips. Ao carregar aberturas de guias de onda e cornetas com dielétricos, podemos obter excelente simetria de diagrama de irradiação e baixa polarização cruzada, que são características essenciais nos refletores e lentes. Finalmente, dielétricos podem ser usados para o aprimoramento do ganho, tais como em lentes. II. LENTES As lentes dielétricas colimam a onda eletromagnética atrasando a velocidade de fase da onda em seu centro Fig 1 (b) e as baseadas em estruturas metálicas (guias de onda) aumentando a velocidade de fase das ondas periféricas Fig 1 (a). Para projetarmos lentes é requerido determinar a geometria das duas faces, frontal e traseira, ou as coordenadas x1,y1, e x2,y2 dos pontos P1 e P2 (Fig 2). Existem quatro incógnitas para serem determinadas. A igualdade da fase nas frentes de onda exige que o comprimento elétrico entre os pontos focais e as frentes de fase serem independentes dos comprimentos dos caminhos. Isto proporciona uma equação. Duas outras equações podem ser obtidas a partir do feixe óptico nos pontos de interface da lente P1 e P2, isto é, o princípio de Fermat do caminho mínimo aplicado pela lei de Snell de refração nos pontos da superfície da lente. Uma relação adicional deve ser gerada a partir das propriedades requeridas da lente, para permitir uma solução única para o projeto da lente, como a definição da forma geométrica de uma das superfícies. Para impor a invariância do caminho ótico, o feixe central que passa pelos pontos A, B, e C é selecionado como referência e o seu comprimento a partir de S para C é comparado com a do feixe que passa pelos pontos P1, P2, e P3. Isto proporciona a equação (1) Onde em termos das coordenadas P1 e P2 cada comprimento é dado por: F e T são o comprimento focal da lente e a espessura axial e são, portanto constantes que definem a lente. Impondo o princípio de Fermat nos pontos P1 e P2 resulta na diferenciação do comprimento dos caminhos em (1) em termos de variáveis x1, y1 e x2, y2 e igualando a isto a zero. Assim definimos a declividade da superfície da lente em cada ponto P1 e P2. Em P1 obtemos (7) E no P2 fazendo diferenciação similar em termos de x obtemos (9) As equações (2),(8) e (9) são as três equações fundamentais requeridas para o projeto de lentes. As soluções resultam em definições em termos de coordenadas retangulares. Se transformarmos para coordenadas polares as equações (2),(8) e (9) podem ser obtidas em termos de r, θ e r, θ a coordenada polar de P1 e P2 diferenciando-se a equação (2) em termos de θ e θ resultam em (10) e (11)  Apresentando as relações entre coordenadas polares em (12), (13), (14) e (15). A equação (16) é deduzida a partir da lei de Snell. As equações (10), (11) e (16) são as equações utilizadas para a determinação das superfícies, nota-se que são 3 equações para 4 incógnitas. Para obtermos a solução devemos definir a forma de uma das superfícies, que pode ser plana ou esférica. III. O ARRANJO A Fig 3 apresenta o arranjo composto pela antena espiral logarítmica montada em cavidade (elemento A) e a lente dielétrica (elemento B). O projeto da antena espiral logarítmica [7] foi concebido originalmente através da ferramenta de software Antenna Magus [8] e otimizado através de simulação numérica utilizando o simulador CST Microwave Studio Suite 2015 [9] A abertura da lente (180mm apresentado na Fig 5) foi automaticamente definida pelo Antenna Magus em função do ganho desejado da lente (20dB). Idealmente o ganho da lente pode ser estimado pela relação da área da superfície S2 pela área da superfície da antena espiral plana. A distância focal foi ajustada interativamente para obter maior ganho com menor lóbulo lateral, a Fig 13 ilustra a dependência do ganho e dos lóbulos laterais em função da distância focal. Foi observado que diminuímos o nível de lóbulo lateral quanto mais afastamos a lente da antena, porém isto impacta em aumento cada vez maior da lente e também perda de ganho ao sair do tamanho focal da antena espiral. A distância focal de 134.4 mm foi escolhida por apresentar menor lóbulo lateral com um ganho ainda alto. Os parâmetros principais da lente; a abertura (diâmetro) e sua posição longitudinal (foco) foram otimizados para se obter o menor volume para um ganho médio de 20dBi @ 10GHz (ganho médio típico de antenas cornetas). Foi utilizado material tradicional para a lente, compósito de resina e PTFE (Teflon®), com constante dielétrica de 2.55 (mantido valor baixo a fim de minimizar reflexão e perdas) e tangente de perdas dielétricas de 0.0014 @ 10GHz. Para a proposta foram escolhidas lentes no formato esférico/ elíptico (primeira superfície esférica e a segunda superfície elíptica) (Fig 4) pois apresentam melhor eficiência em abertura quando comparado com superfícies hiperbólicas (que apresentam menor reflexão) [6]. Quando a primeira superfície é esférica, todas as ondas esféricas passam por ela sem serem afetadas. A segunda superfície colima o feixe. Aplicando-se a equação (10) para uma superfície esférica S1 a equação (11) irá definir a segunda superfície S2 como uma superfície elíptica (hiperbólica) definida por (17), onde R=F+T. As coordenadas da lente geradas pelo software Antenna Magus para a superfície S2 foram verificadas e obedeceram à relação dada (17). A Fig 5 mostra as dimensões finais obtidas para o arranjo, com a distância focal em 134.4 mm. As Fig 6 e Fig 7 mostram a diferença entre a onda eletromagnética não colimada e colimada pela lente, respectivamente. IV. RESULTADOS DAS SIMULAÇÕES Os diagramas de irradiação, níveis de ganho de diretividade e os níveis de atenuação dos lóbulos laterais foram obtidos por simulação numérica em estação Intel I7 núcleo quadruplo, utilizando o simulador CST Microwave Studio Suite 2015, solver no domínio tempo. Inicialmente fazendo uso da varredura de múltiplos parâmetros da ferramenta (sweper) e fazendo o ajuste final através do algoritmo particle swarm do CST. A Fig 8 mostra o diagrama de irradiação apenas da antena espiral logarítmica (sem a lente), observa-se um ganho de 6.82dB e lóbulo lateral máximo de -24.8dB. O acréscimo da lente dielétrica levou a um ganho de diretividade de 21dBi @ 10GHz e a lóbulo lateral máximo de -16dB (Fig 10), representando uma melhora em torno de +14dB para diretividade e uma perda de performance de nível de lóbulo lateral de quase 9dB, devido a reflexão causada pela lente. Podemos observar na Fig 12 a amplitude de campo elétrico, nota-se a presença de ondas estacionárias entre a antena espiral e a lente dielétrica. O parâmetro S11 do arranjo em função da frequência é mostrado na Fig 14. Observa-se um desempenho próximo ao plano em torno de -18dB para a banda. Quanto ao diagrama de irradiação, a variação de ganho de diretividade foi menor que 1dB e de atenuação de lóbulo lateral menor que 2dB para a banda (8-12GHz) (Fig 9 e Fig 11). V. COMPARANDO OS RESULTADOS Para comparação foi usado o projeto de uma corneta circular de tamanho otimizado para ganho médio 20dBi @ 10GHz [10]. Tendo diâmetro de 133m e comprimento de 185mm, na prática será ainda maior se considerarmos o adaptador cabo coaxial guia de onda, polarizador em guia de onda e conexões de guia de onda. Ao final os volumes dimensionais serão semelhantes, tendo o arranjo uma altura menor. Os parâmetros S11 da corneta circular de tamanho otimizado (Fig 15) foram obtidos pelo simulador para uma entrada por guia de onda (modo TE11), os altos valores em frequência abaixo de 10 GHz são devido ao comprimento otimizado de corneta, pode-se obter melhor desempenho com cornetas longas (não otimizadas em volume). O custo estimado do arranjo proposto é menor considerando o uso de materiais de baixo custo para fixação e posicionamento da lente (como espuma de coeficiente dielétrico baixo). Componentes em guias de onda são caros, a antena corneta circular proposta (com polarizador circular) e suas conexões, alcançam valores de mercado acima de U$1000,00, enquanto é estimado um valor menor que U$200,00 para o arranjo proposto. Um ponto importante do arranjo proposto é a banda larga de operação, observando-se o parâmetro S11 do arranjo (Fig 14) e seus diagramas de irradiação (Fig 9 a Fig 11), vemos que a antena pode operar extensivamente a banda x (8-12GHz). No entanto, vendo o parâmetro S11 da antena corneta circular (Fig 15), observa-se que a banda é limitada e não pode ser usada para cobrir toda banda. São esperadas perdas maiores no arranjo proposto quando comparado à corneta circular. O arranjo apresentou eficiência de radiação maior que - 1.8 dB para a banda, o conjunto corneta circular (adaptadores e polarizador) em geral apresentam perdas inferiores. Outra desvantagem do arranjo é o seu nível de lóbulo lateral mais elevado quando comparado à corneta circular (Fig 16. Diagrama de Irradiação E Corneta Circular @ 10GHzFig 16), quase 7 dB maior. A Tabela I mostra uma visão final das vantagens e desvantagens entre o arranjo proposto e a corneta circular. VI. CONCLUSÃO O arranjo proposto apresenta duas características principais positivas, o menor custo e a maior banda de operação. Um dos pontos fracos do arranjo proposto é o baixo nível de atenuação dos lóbulos laterais, tal característica é causada pela reflexão da onda na lente. Este efeito pode ser minimizado pelo uso de camadas na lente que comecem com constante dielétrica baixa (próximo a 1) e aumentando gradualmente, fazendo assim um casamento de impedância da onda propagada no ar com a onda manipulada pela lente, no entanto este artifício irá causar um aumento considerável no custo final do arranjo devido a complexidade do processo requerido. "
}